#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_NightClub

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_NightClub.A_NightClub_C
// 0x0030 (0x0370 - 0x0340)
class AA_NightClub_C final : public ASBZLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ASBZSoundEnvironment*                   AMB_EXT_Street_01_ExecuteUbergraph_A_NightClub_RefProperty; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAmbientSound*                       SBZAmbientSound_StreetSound_06_ExecuteUbergraph_A_NightClub_RefProperty; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAmbientSound*                       SBZAmbientSound_DistantSiren_ExecuteUbergraph_A_NightClub_RefProperty; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAkSplineEmitter_C*                     AkSplineEmitter_2_ExecuteUbergraph_A_NightClub_RefProperty; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAmbientSound*                       SBZAmbientSound_Megaphone_ExecuteUbergraph_A_NightClub_RefProperty; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_A_NightClub(int32 EntryPoint);
	void ActionPhaseStarted();
	void HeistStateChanged(EPD3HeistState OldHeistState, EPD3HeistState CurrentHeistState);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"A_NightClub_C">();
	}
	static class AA_NightClub_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_NightClub_C>();
	}
};
static_assert(alignof(AA_NightClub_C) == 0x000008, "Wrong alignment on AA_NightClub_C");
static_assert(sizeof(AA_NightClub_C) == 0x000370, "Wrong size on AA_NightClub_C");
static_assert(offsetof(AA_NightClub_C, UberGraphFrame) == 0x000340, "Member 'AA_NightClub_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AA_NightClub_C, AMB_EXT_Street_01_ExecuteUbergraph_A_NightClub_RefProperty) == 0x000348, "Member 'AA_NightClub_C::AMB_EXT_Street_01_ExecuteUbergraph_A_NightClub_RefProperty' has a wrong offset!");
static_assert(offsetof(AA_NightClub_C, SBZAmbientSound_StreetSound_06_ExecuteUbergraph_A_NightClub_RefProperty) == 0x000350, "Member 'AA_NightClub_C::SBZAmbientSound_StreetSound_06_ExecuteUbergraph_A_NightClub_RefProperty' has a wrong offset!");
static_assert(offsetof(AA_NightClub_C, SBZAmbientSound_DistantSiren_ExecuteUbergraph_A_NightClub_RefProperty) == 0x000358, "Member 'AA_NightClub_C::SBZAmbientSound_DistantSiren_ExecuteUbergraph_A_NightClub_RefProperty' has a wrong offset!");
static_assert(offsetof(AA_NightClub_C, AkSplineEmitter_2_ExecuteUbergraph_A_NightClub_RefProperty) == 0x000360, "Member 'AA_NightClub_C::AkSplineEmitter_2_ExecuteUbergraph_A_NightClub_RefProperty' has a wrong offset!");
static_assert(offsetof(AA_NightClub_C, SBZAmbientSound_Megaphone_ExecuteUbergraph_A_NightClub_RefProperty) == 0x000368, "Member 'AA_NightClub_C::SBZAmbientSound_Megaphone_ExecuteUbergraph_A_NightClub_RefProperty' has a wrong offset!");

}

