#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Delivery_Drone

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_Delivery_Drone.ABP_Delivery_Drone_C.ExecuteUbergraph_ABP_Delivery_Drone
// 0x0004 (0x0004 - 0x0000)
struct ABP_Delivery_Drone_C_ExecuteUbergraph_ABP_Delivery_Drone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_Delivery_Drone_C_ExecuteUbergraph_ABP_Delivery_Drone) == 0x000004, "Wrong alignment on ABP_Delivery_Drone_C_ExecuteUbergraph_ABP_Delivery_Drone");
static_assert(sizeof(ABP_Delivery_Drone_C_ExecuteUbergraph_ABP_Delivery_Drone) == 0x000004, "Wrong size on ABP_Delivery_Drone_C_ExecuteUbergraph_ABP_Delivery_Drone");
static_assert(offsetof(ABP_Delivery_Drone_C_ExecuteUbergraph_ABP_Delivery_Drone, EntryPoint) == 0x000000, "Member 'ABP_Delivery_Drone_C_ExecuteUbergraph_ABP_Delivery_Drone::EntryPoint' has a wrong offset!");

// Function ABP_Delivery_Drone.ABP_Delivery_Drone_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct ABP_Delivery_Drone_C_AnimGraph final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_Delivery_Drone_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_Delivery_Drone_C_AnimGraph");
static_assert(sizeof(ABP_Delivery_Drone_C_AnimGraph) == 0x000020, "Wrong size on ABP_Delivery_Drone_C_AnimGraph");
static_assert(offsetof(ABP_Delivery_Drone_C_AnimGraph, InPose) == 0x000000, "Member 'ABP_Delivery_Drone_C_AnimGraph::InPose' has a wrong offset!");
static_assert(offsetof(ABP_Delivery_Drone_C_AnimGraph, AnimGraph_0) == 0x000010, "Member 'ABP_Delivery_Drone_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

