#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_TPPlayerBase_Moneybag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_TPPlayerBase_Moneybag.ABP_TPPlayerBase_Moneybag_C
// 0x0F30 (0x11F0 - 0x02C0)
class UABP_TPPlayerBase_Moneybag_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0310(0x08B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0BC0(0x0030)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0BF0(0x01E8)(ContainsInstancedReference)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0DD8(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0E08(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0F40(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1078(0x0138)()
	class USkeletalMeshComponent*                 ParentSkeletalMeshComponent;                       // 0x11B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11B8[0x8];                                     // 0x11B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             StrapTransformOffset;                              // 0x11C0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_TPPlayerBase_Moneybag(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag_AnimGraphNode_ModifyBone_3E69C58743103825A6B13EB3F5948D6E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag_AnimGraphNode_ModifyBone_44BAAE3A4110178DD565DDAEA5F5850A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag_AnimGraphNode_ModifyBone_4ECBE8F8440B514D16F55FA0EB79E92E();
	void AttachmentComplete(class USkeletalMeshComponent* InParentSkeletalMeshComponent);
	void AdjustAttachment(int32 Index_0, int32 NewCount, const struct FTransform& NewStrapTransformOffset);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_TPPlayerBase_Moneybag_C">();
	}
	static class UABP_TPPlayerBase_Moneybag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_TPPlayerBase_Moneybag_C>();
	}
};
static_assert(alignof(UABP_TPPlayerBase_Moneybag_C) == 0x000010, "Wrong alignment on UABP_TPPlayerBase_Moneybag_C");
static_assert(sizeof(UABP_TPPlayerBase_Moneybag_C) == 0x0011F0, "Wrong size on UABP_TPPlayerBase_Moneybag_C");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_TPPlayerBase_Moneybag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UABP_TPPlayerBase_Moneybag_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, AnimGraphNode_RigidBody) == 0x000310, "Member 'UABP_TPPlayerBase_Moneybag_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, AnimGraphNode_ComponentToLocalSpace) == 0x000BC0, "Member 'UABP_TPPlayerBase_Moneybag_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, AnimGraphNode_CopyPoseFromMesh) == 0x000BF0, "Member 'UABP_TPPlayerBase_Moneybag_C::AnimGraphNode_CopyPoseFromMesh' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, AnimGraphNode_LocalToComponentSpace) == 0x000DD8, "Member 'UABP_TPPlayerBase_Moneybag_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, AnimGraphNode_ModifyBone_2) == 0x000E08, "Member 'UABP_TPPlayerBase_Moneybag_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, AnimGraphNode_ModifyBone_1) == 0x000F40, "Member 'UABP_TPPlayerBase_Moneybag_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, AnimGraphNode_ModifyBone) == 0x001078, "Member 'UABP_TPPlayerBase_Moneybag_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, ParentSkeletalMeshComponent) == 0x0011B0, "Member 'UABP_TPPlayerBase_Moneybag_C::ParentSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerBase_Moneybag_C, StrapTransformOffset) == 0x0011C0, "Member 'UABP_TPPlayerBase_Moneybag_C::StrapTransformOffset' has a wrong offset!");

}

