#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AIArmedLinkedAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_AIArmedLinkedAnimation.ABP_AIArmedLinkedAnimation_C
// 0x1A10 (0x1E00 - 0x03F0)
class UABP_AIArmedLinkedAnimation_C final : public USBZAIArmedCharacterLinkedAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x03F8(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0440(0x0130)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0570(0x0168)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x06D8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0710(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0748(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0780(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x07B8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x07F0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0828(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0860(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0898(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x08D0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0908(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0940(0x0038)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x0978(0x0068)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x09E0(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0AB0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0AF8(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0BC8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0C10(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0CE0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0D28(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0DF8(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x0E40(0x0068)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x0EA8(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x0F58(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x1008(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x10B8(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x1188(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x1258(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1328(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x13F8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1440(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x14F0(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x15C0(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1690(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x16D8(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1788(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1858(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1928(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x19F8(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1AC8(0x00B0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1B78(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1C28(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1C70(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1CB0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1CF8(0x00C0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1DB8(0x0048)()

public:
	void ExecuteUbergraph_ABP_AIArmedLinkedAnimation(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void FullBodyAction(const struct FPoseLink& InPose, struct FPoseLink* FullBodyAction_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_AIArmedLinkedAnimation_C">();
	}
	static class UABP_AIArmedLinkedAnimation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AIArmedLinkedAnimation_C>();
	}
};
static_assert(alignof(UABP_AIArmedLinkedAnimation_C) == 0x000010, "Wrong alignment on UABP_AIArmedLinkedAnimation_C");
static_assert(sizeof(UABP_AIArmedLinkedAnimation_C) == 0x001E00, "Wrong size on UABP_AIArmedLinkedAnimation_C");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, UberGraphFrame) == 0x0003F0, "Member 'UABP_AIArmedLinkedAnimation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_Root_1) == 0x0003F8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_LinkedInputPose) == 0x000440, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SaveCachedPose) == 0x000570, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_11) == 0x0006D8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_11' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_10) == 0x000710, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_10' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_9) == 0x000748, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_9' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_8) == 0x000780, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_7) == 0x0007B8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_6) == 0x0007F0, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_5) == 0x000828, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_4) == 0x000860, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_3) == 0x000898, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_2) == 0x0008D0, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult_1) == 0x000908, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_TransitionResult) == 0x000940, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_ModifyCurve_1) == 0x000978, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_ModifyCurve_1' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_13) == 0x0009E0, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_13' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_StateResult_7) == 0x000AB0, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_StateResult_7' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_12) == 0x000AF8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_12' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_StateResult_6) == 0x000BC8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_StateResult_6' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_11) == 0x000C10, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_11' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_StateResult_5) == 0x000CE0, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_StateResult_5' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_10) == 0x000D28, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_StateResult_4) == 0x000DF8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_StateResult_4' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_ModifyCurve) == 0x000E40, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_ModifyCurve' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_BlendListByBool_6) == 0x000EA8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_BlendListByBool_6' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_BlendListByBool_5) == 0x000F58, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_BlendListByBool_5' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_BlendListByBool_4) == 0x001008, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_BlendListByBool_4' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_9) == 0x0010B8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_8) == 0x001188, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_7) == 0x001258, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_6) == 0x001328, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_StateResult_3) == 0x0013F8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_BlendListByBool_3) == 0x001440, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_BlendListByBool_3' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_5) == 0x0014F0, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_4) == 0x0015C0, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_StateResult_2) == 0x001690, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_BlendListByBool_2) == 0x0016D8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_BlendListByBool_2' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_3) == 0x001788, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_2) == 0x001858, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer_1) == 0x001928, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_SequencePlayer) == 0x0019F8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_BlendListByBool_1) == 0x001AC8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_BlendListByBool) == 0x001B78, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_StateResult_1) == 0x001C28, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_UseCachedPose) == 0x001C70, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_StateResult) == 0x001CB0, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_StateMachine) == 0x001CF8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_AIArmedLinkedAnimation_C, AnimGraphNode_Root) == 0x001DB8, "Member 'UABP_AIArmedLinkedAnimation_C::AnimGraphNode_Root' has a wrong offset!");

}

