#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_HandCuffsAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_HandCuffsAnimation.ABP_HandCuffsAnimation_C
// 0x0180 (0x0450 - 0x02D0)
class UABP_HandCuffsAnimation_C final : public USBZEquippableAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0320(0x0060)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0380(0x00D0)()

public:
	void ExecuteUbergraph_ABP_HandCuffsAnimation(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_HandCuffsAnimation_C">();
	}
	static class UABP_HandCuffsAnimation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_HandCuffsAnimation_C>();
	}
};
static_assert(alignof(UABP_HandCuffsAnimation_C) == 0x000010, "Wrong alignment on UABP_HandCuffsAnimation_C");
static_assert(sizeof(UABP_HandCuffsAnimation_C) == 0x000450, "Wrong size on UABP_HandCuffsAnimation_C");
static_assert(offsetof(UABP_HandCuffsAnimation_C, UberGraphFrame) == 0x0002D0, "Member 'UABP_HandCuffsAnimation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_HandCuffsAnimation_C, AnimGraphNode_Root) == 0x0002D8, "Member 'UABP_HandCuffsAnimation_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_HandCuffsAnimation_C, AnimGraphNode_Slot) == 0x000320, "Member 'UABP_HandCuffsAnimation_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_HandCuffsAnimation_C, AnimGraphNode_SequencePlayer) == 0x000380, "Member 'UABP_HandCuffsAnimation_C::AnimGraphNode_SequencePlayer' has a wrong offset!");

}

