#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AIArmedLinkedAnimation

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_AIArmedLinkedAnimation.ABP_AIArmedLinkedAnimation_C.ExecuteUbergraph_ABP_AIArmedLinkedAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_AIArmedLinkedAnimation_C_ExecuteUbergraph_ABP_AIArmedLinkedAnimation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_AIArmedLinkedAnimation_C_ExecuteUbergraph_ABP_AIArmedLinkedAnimation) == 0x000004, "Wrong alignment on ABP_AIArmedLinkedAnimation_C_ExecuteUbergraph_ABP_AIArmedLinkedAnimation");
static_assert(sizeof(ABP_AIArmedLinkedAnimation_C_ExecuteUbergraph_ABP_AIArmedLinkedAnimation) == 0x000004, "Wrong size on ABP_AIArmedLinkedAnimation_C_ExecuteUbergraph_ABP_AIArmedLinkedAnimation");
static_assert(offsetof(ABP_AIArmedLinkedAnimation_C_ExecuteUbergraph_ABP_AIArmedLinkedAnimation, EntryPoint) == 0x000000, "Member 'ABP_AIArmedLinkedAnimation_C_ExecuteUbergraph_ABP_AIArmedLinkedAnimation::EntryPoint' has a wrong offset!");

// Function ABP_AIArmedLinkedAnimation.ABP_AIArmedLinkedAnimation_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_AIArmedLinkedAnimation_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_AIArmedLinkedAnimation_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_AIArmedLinkedAnimation_C_AnimGraph");
static_assert(sizeof(ABP_AIArmedLinkedAnimation_C_AnimGraph) == 0x000010, "Wrong size on ABP_AIArmedLinkedAnimation_C_AnimGraph");
static_assert(offsetof(ABP_AIArmedLinkedAnimation_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_AIArmedLinkedAnimation_C_AnimGraph::AnimGraph_0' has a wrong offset!");

// Function ABP_AIArmedLinkedAnimation.ABP_AIArmedLinkedAnimation_C.FullBodyAction
// 0x0020 (0x0020 - 0x0000)
struct ABP_AIArmedLinkedAnimation_C_FullBodyAction final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              FullBodyAction_0;                                  // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_AIArmedLinkedAnimation_C_FullBodyAction) == 0x000008, "Wrong alignment on ABP_AIArmedLinkedAnimation_C_FullBodyAction");
static_assert(sizeof(ABP_AIArmedLinkedAnimation_C_FullBodyAction) == 0x000020, "Wrong size on ABP_AIArmedLinkedAnimation_C_FullBodyAction");
static_assert(offsetof(ABP_AIArmedLinkedAnimation_C_FullBodyAction, InPose) == 0x000000, "Member 'ABP_AIArmedLinkedAnimation_C_FullBodyAction::InPose' has a wrong offset!");
static_assert(offsetof(ABP_AIArmedLinkedAnimation_C_FullBodyAction, FullBodyAction_0) == 0x000010, "Member 'ABP_AIArmedLinkedAnimation_C_FullBodyAction::FullBodyAction_0' has a wrong offset!");

}

