#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SentryGun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SentryGun.ABP_SentryGun_C
// 0x03A0 (0x06C0 - 0x0320)
class UABP_SentryGun_C final : public USBZSentryGunAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0328(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0370(0x0138)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x04A8(0x0138)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x05E0(0x0030)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0610(0x0060)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0670(0x0030)()
	float                                         YawMomemtum;                                       // 0x06A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PrevYaw;                                           // 0x06A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Rotating;                                          // 0x06A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A9[0x3];                                      // 0x06A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AddYaw;                                            // 0x06AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SinVal;                                            // 0x06B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_SentryGun(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_SentryGun_C">();
	}
	static class UABP_SentryGun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SentryGun_C>();
	}
};
static_assert(alignof(UABP_SentryGun_C) == 0x000010, "Wrong alignment on UABP_SentryGun_C");
static_assert(sizeof(UABP_SentryGun_C) == 0x0006C0, "Wrong size on UABP_SentryGun_C");
static_assert(offsetof(UABP_SentryGun_C, UberGraphFrame) == 0x000320, "Member 'UABP_SentryGun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, AnimGraphNode_Root) == 0x000328, "Member 'UABP_SentryGun_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, AnimGraphNode_ModifyBone_1) == 0x000370, "Member 'UABP_SentryGun_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, AnimGraphNode_ModifyBone) == 0x0004A8, "Member 'UABP_SentryGun_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, AnimGraphNode_ComponentToLocalSpace) == 0x0005E0, "Member 'UABP_SentryGun_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, AnimGraphNode_Slot) == 0x000610, "Member 'UABP_SentryGun_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, AnimGraphNode_LocalToComponentSpace) == 0x000670, "Member 'UABP_SentryGun_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, YawMomemtum) == 0x0006A0, "Member 'UABP_SentryGun_C::YawMomemtum' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, PrevYaw) == 0x0006A4, "Member 'UABP_SentryGun_C::PrevYaw' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, Rotating) == 0x0006A8, "Member 'UABP_SentryGun_C::Rotating' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, AddYaw) == 0x0006AC, "Member 'UABP_SentryGun_C::AddYaw' has a wrong offset!");
static_assert(offsetof(UABP_SentryGun_C, SinVal) == 0x0006B0, "Member 'UABP_SentryGun_C::SinVal' has a wrong offset!");

}

