#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Mask_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Mask_Base.ABP_Mask_Base_C
// 0x0930 (0x0BF0 - 0x02C0)
class UABP_Mask_Base_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody;                           // 0x0310(0x08B0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0BC0(0x0030)()

public:
	void ExecuteUbergraph_ABP_Mask_Base(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_Mask_Base_C">();
	}
	static class UABP_Mask_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Mask_Base_C>();
	}
};
static_assert(alignof(UABP_Mask_Base_C) == 0x000010, "Wrong alignment on UABP_Mask_Base_C");
static_assert(sizeof(UABP_Mask_Base_C) == 0x000BF0, "Wrong size on UABP_Mask_Base_C");
static_assert(offsetof(UABP_Mask_Base_C, UberGraphFrame) == 0x0002C0, "Member 'UABP_Mask_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_Mask_Base_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UABP_Mask_Base_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UABP_Mask_Base_C, AnimGraphNode_RigidBody) == 0x000310, "Member 'UABP_Mask_Base_C::AnimGraphNode_RigidBody' has a wrong offset!");
static_assert(offsetof(UABP_Mask_Base_C, AnimGraphNode_ComponentToLocalSpace) == 0x000BC0, "Member 'UABP_Mask_Base_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");

}

