#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_TPPlayerBase_Moneybag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_TPPlayerBase_Moneybag.ABP_TPPlayerBase_Moneybag_C.ExecuteUbergraph_ABP_TPPlayerBase_Moneybag
// 0x0028 (0x0028 - 0x0000)
struct ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag) == 0x000004, "Wrong alignment on ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag");
static_assert(sizeof(ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag) == 0x000028, "Wrong size on ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag");
static_assert(offsetof(ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag, EntryPoint) == 0x000000, "Member 'ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag, CallFunc_BreakTransform_Location) == 0x000004, "Member 'ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag, CallFunc_BreakTransform_Rotation) == 0x000010, "Member 'ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag, CallFunc_BreakTransform_Scale) == 0x00001C, "Member 'ABP_TPPlayerBase_Moneybag_C_ExecuteUbergraph_ABP_TPPlayerBase_Moneybag::CallFunc_BreakTransform_Scale' has a wrong offset!");

// Function ABP_TPPlayerBase_Moneybag.ABP_TPPlayerBase_Moneybag_C.AttachmentComplete
// 0x0008 (0x0008 - 0x0000)
struct ABP_TPPlayerBase_Moneybag_C_AttachmentComplete final
{
public:
	class USkeletalMeshComponent*                 InParentSkeletalMeshComponent;                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_TPPlayerBase_Moneybag_C_AttachmentComplete) == 0x000008, "Wrong alignment on ABP_TPPlayerBase_Moneybag_C_AttachmentComplete");
static_assert(sizeof(ABP_TPPlayerBase_Moneybag_C_AttachmentComplete) == 0x000008, "Wrong size on ABP_TPPlayerBase_Moneybag_C_AttachmentComplete");
static_assert(offsetof(ABP_TPPlayerBase_Moneybag_C_AttachmentComplete, InParentSkeletalMeshComponent) == 0x000000, "Member 'ABP_TPPlayerBase_Moneybag_C_AttachmentComplete::InParentSkeletalMeshComponent' has a wrong offset!");

// Function ABP_TPPlayerBase_Moneybag.ABP_TPPlayerBase_Moneybag_C.AdjustAttachment
// 0x0040 (0x0040 - 0x0000)
struct ABP_TPPlayerBase_Moneybag_C_AdjustAttachment final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NewStrapTransformOffset;                           // 0x0010(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ABP_TPPlayerBase_Moneybag_C_AdjustAttachment) == 0x000010, "Wrong alignment on ABP_TPPlayerBase_Moneybag_C_AdjustAttachment");
static_assert(sizeof(ABP_TPPlayerBase_Moneybag_C_AdjustAttachment) == 0x000040, "Wrong size on ABP_TPPlayerBase_Moneybag_C_AdjustAttachment");
static_assert(offsetof(ABP_TPPlayerBase_Moneybag_C_AdjustAttachment, Index_0) == 0x000000, "Member 'ABP_TPPlayerBase_Moneybag_C_AdjustAttachment::Index_0' has a wrong offset!");
static_assert(offsetof(ABP_TPPlayerBase_Moneybag_C_AdjustAttachment, NewCount) == 0x000004, "Member 'ABP_TPPlayerBase_Moneybag_C_AdjustAttachment::NewCount' has a wrong offset!");
static_assert(offsetof(ABP_TPPlayerBase_Moneybag_C_AdjustAttachment, NewStrapTransformOffset) == 0x000010, "Member 'ABP_TPPlayerBase_Moneybag_C_AdjustAttachment::NewStrapTransformOffset' has a wrong offset!");

// Function ABP_TPPlayerBase_Moneybag.ABP_TPPlayerBase_Moneybag_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_TPPlayerBase_Moneybag_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_TPPlayerBase_Moneybag_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_TPPlayerBase_Moneybag_C_AnimGraph");
static_assert(sizeof(ABP_TPPlayerBase_Moneybag_C_AnimGraph) == 0x000010, "Wrong size on ABP_TPPlayerBase_Moneybag_C_AnimGraph");
static_assert(offsetof(ABP_TPPlayerBase_Moneybag_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_TPPlayerBase_Moneybag_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

