#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PlayerMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_PlayerMenu.ABP_PlayerMenu_C.ExecuteUbergraph_ABP_PlayerMenu
// 0x007C (0x007C - 0x0000)
struct ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue;                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x000C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_1;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_2;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurveValue_ReturnValue_3;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_3;        // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu) == 0x000004, "Wrong alignment on ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu");
static_assert(sizeof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu) == 0x00007C, "Wrong size on ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, EntryPoint) == 0x000000, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_GetCurveValue_ReturnValue) == 0x000004, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_GetCurveValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_BreakTransform_Location) == 0x00000C, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_BreakTransform_Rotation) == 0x000018, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_BreakTransform_Scale) == 0x000024, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_BreakTransform_Location_1) == 0x000030, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_BreakTransform_Rotation_1) == 0x00003C, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_BreakTransform_Scale_1) == 0x000048, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_GetCurveValue_ReturnValue_1) == 0x000058, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_GetCurveValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_GetCurveValue_ReturnValue_2) == 0x00005C, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_GetCurveValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000060, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x000064, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000068, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00006C, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_GetCurveValue_ReturnValue_3) == 0x000070, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_GetCurveValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_Subtract_FloatFloat_ReturnValue_3) == 0x000074, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_Subtract_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000078, "Member 'ABP_PlayerMenu_C_ExecuteUbergraph_ABP_PlayerMenu::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");

// Function ABP_PlayerMenu.ABP_PlayerMenu_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PlayerMenu_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(ABP_PlayerMenu_C_AnimGraph) == 0x000008, "Wrong alignment on ABP_PlayerMenu_C_AnimGraph");
static_assert(sizeof(ABP_PlayerMenu_C_AnimGraph) == 0x000010, "Wrong size on ABP_PlayerMenu_C_AnimGraph");
static_assert(offsetof(ABP_PlayerMenu_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'ABP_PlayerMenu_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

