#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_TPPlayerLinkedBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_TPPlayerLinkedBase.ABP_TPPlayerLinkedBase_C
// 0x0BA0 (0x0F30 - 0x0390)
class UABP_TPPlayerLinkedBase_C final : public USBZPlayerLinkedAnimationTPP
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0398(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03E0(0x0130)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0510(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0548(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0580(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x05B8(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x05F0(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0628(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0660(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0698(0x0038)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x06D0(0x0038)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0708(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x07D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0820(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x08F0(0x0048)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace;            // 0x0938(0x01E8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0B20(0x00D0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0BF0(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0C38(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0C78(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0CC0(0x00C0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0D80(0x0168)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0EE8(0x0048)()

public:
	void ExecuteUbergraph_ABP_TPPlayerLinkedBase(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void FullBodyAction(const struct FPoseLink& InPose, struct FPoseLink* FullBodyAction_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ABP_TPPlayerLinkedBase_C">();
	}
	static class UABP_TPPlayerLinkedBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_TPPlayerLinkedBase_C>();
	}
};
static_assert(alignof(UABP_TPPlayerLinkedBase_C) == 0x000010, "Wrong alignment on UABP_TPPlayerLinkedBase_C");
static_assert(sizeof(UABP_TPPlayerLinkedBase_C) == 0x000F30, "Wrong size on UABP_TPPlayerLinkedBase_C");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, UberGraphFrame) == 0x000390, "Member 'UABP_TPPlayerLinkedBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_Root_1) == 0x000398, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_LinkedInputPose) == 0x0003E0, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_TransitionResult_8) == 0x000510, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_TransitionResult_8' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_TransitionResult_7) == 0x000548, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_TransitionResult_7' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_TransitionResult_6) == 0x000580, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_TransitionResult_6' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_TransitionResult_5) == 0x0005B8, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_TransitionResult_5' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_TransitionResult_4) == 0x0005F0, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_TransitionResult_3) == 0x000628, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_TransitionResult_2) == 0x000660, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_TransitionResult_1) == 0x000698, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_TransitionResult) == 0x0006D0, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_SequencePlayer_2) == 0x000708, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_StateResult_3) == 0x0007D8, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_StateResult_3' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_SequencePlayer_1) == 0x000820, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_StateResult_2) == 0x0008F0, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_RotationOffsetBlendSpace) == 0x000938, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_RotationOffsetBlendSpace' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_SequencePlayer) == 0x000B20, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_StateResult_1) == 0x000BF0, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_UseCachedPose) == 0x000C38, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_StateResult) == 0x000C78, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_StateMachine) == 0x000CC0, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_SaveCachedPose) == 0x000D80, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UABP_TPPlayerLinkedBase_C, AnimGraphNode_Root) == 0x000EE8, "Member 'UABP_TPPlayerLinkedBase_C::AnimGraphNode_Root' has a wrong offset!");

}

