#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccelByteUe4Sdk

#include "Basic.hpp"

#include "AccelByteUe4Sdk_structs.hpp"
#include "JsonUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AccelByteUe4Sdk.ABAchievement.ClaimGlobalAchievements
// 0x0038 (0x0038 - 0x0000)
struct ABAchievement_ClaimGlobalAchievements final
{
public:
	class FString                                 AchievementCode;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnSuccess;                                         // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABAchievement_ClaimGlobalAchievements) == 0x000008, "Wrong alignment on ABAchievement_ClaimGlobalAchievements");
static_assert(sizeof(ABAchievement_ClaimGlobalAchievements) == 0x000038, "Wrong size on ABAchievement_ClaimGlobalAchievements");
static_assert(offsetof(ABAchievement_ClaimGlobalAchievements, AchievementCode) == 0x000000, "Member 'ABAchievement_ClaimGlobalAchievements::AchievementCode' has a wrong offset!");
static_assert(offsetof(ABAchievement_ClaimGlobalAchievements, OnSuccess) == 0x000010, "Member 'ABAchievement_ClaimGlobalAchievements::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAchievement_ClaimGlobalAchievements, OnError) == 0x000024, "Member 'ABAchievement_ClaimGlobalAchievements::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAchievement.GetAchievement
// 0x0038 (0x0038 - 0x0000)
struct ABAchievement_GetAchievement final
{
public:
	class FString                                 AchievementCode;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAccelByteModelsMultiLanguageAchievement& Response)> OnSuccess;      // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABAchievement_GetAchievement) == 0x000008, "Wrong alignment on ABAchievement_GetAchievement");
static_assert(sizeof(ABAchievement_GetAchievement) == 0x000038, "Wrong size on ABAchievement_GetAchievement");
static_assert(offsetof(ABAchievement_GetAchievement, AchievementCode) == 0x000000, "Member 'ABAchievement_GetAchievement::AchievementCode' has a wrong offset!");
static_assert(offsetof(ABAchievement_GetAchievement, OnSuccess) == 0x000010, "Member 'ABAchievement_GetAchievement::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAchievement_GetAchievement, OnError) == 0x000024, "Member 'ABAchievement_GetAchievement::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAchievement.GetTags
// 0x0048 (0x0048 - 0x0000)
struct ABAchievement_GetTags final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteAchievementListSortBy               SortBy;                                            // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPaginatedPublicTag& Response)> OnSuccess;            // 0x0014(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0028(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x003C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0040(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ABAchievement_GetTags) == 0x000008, "Wrong alignment on ABAchievement_GetTags");
static_assert(sizeof(ABAchievement_GetTags) == 0x000048, "Wrong size on ABAchievement_GetTags");
static_assert(offsetof(ABAchievement_GetTags, Name_0) == 0x000000, "Member 'ABAchievement_GetTags::Name_0' has a wrong offset!");
static_assert(offsetof(ABAchievement_GetTags, SortBy) == 0x000010, "Member 'ABAchievement_GetTags::SortBy' has a wrong offset!");
static_assert(offsetof(ABAchievement_GetTags, OnSuccess) == 0x000014, "Member 'ABAchievement_GetTags::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAchievement_GetTags, OnError) == 0x000028, "Member 'ABAchievement_GetTags::OnError' has a wrong offset!");
static_assert(offsetof(ABAchievement_GetTags, Offset) == 0x00003C, "Member 'ABAchievement_GetTags::Offset' has a wrong offset!");
static_assert(offsetof(ABAchievement_GetTags, Limit) == 0x000040, "Member 'ABAchievement_GetTags::Limit' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAchievement.QueryAchievements
// 0x0060 (0x0060 - 0x0000)
struct ABAchievement_QueryAchievements final
{
public:
	class FString                                 Language;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteAchievementListSortBy               SortBy;                                            // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPaginatedPublicAchievement& Response)> OnSuccess;    // 0x0014(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0028(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x003C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0040(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TagQuery;                                          // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGlobal;                                           // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ABAchievement_QueryAchievements) == 0x000008, "Wrong alignment on ABAchievement_QueryAchievements");
static_assert(sizeof(ABAchievement_QueryAchievements) == 0x000060, "Wrong size on ABAchievement_QueryAchievements");
static_assert(offsetof(ABAchievement_QueryAchievements, Language) == 0x000000, "Member 'ABAchievement_QueryAchievements::Language' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryAchievements, SortBy) == 0x000010, "Member 'ABAchievement_QueryAchievements::SortBy' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryAchievements, OnSuccess) == 0x000014, "Member 'ABAchievement_QueryAchievements::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryAchievements, OnError) == 0x000028, "Member 'ABAchievement_QueryAchievements::OnError' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryAchievements, Offset) == 0x00003C, "Member 'ABAchievement_QueryAchievements::Offset' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryAchievements, Limit) == 0x000040, "Member 'ABAchievement_QueryAchievements::Limit' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryAchievements, TagQuery) == 0x000048, "Member 'ABAchievement_QueryAchievements::TagQuery' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryAchievements, bGlobal) == 0x000058, "Member 'ABAchievement_QueryAchievements::bGlobal' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAchievement.QueryGlobalAchievementContributors
// 0x0048 (0x0048 - 0x0000)
struct ABAchievement_QueryGlobalAchievementContributors final
{
public:
	class FString                                 AchievementCode;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteGlobalAchievementContributorsSortBy SortBy;                                            // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPaginatedGlobalAchievementContributors& Response)> OnSuccess; // 0x0014(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0028(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x003C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0040(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ABAchievement_QueryGlobalAchievementContributors) == 0x000008, "Wrong alignment on ABAchievement_QueryGlobalAchievementContributors");
static_assert(sizeof(ABAchievement_QueryGlobalAchievementContributors) == 0x000048, "Wrong size on ABAchievement_QueryGlobalAchievementContributors");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementContributors, AchievementCode) == 0x000000, "Member 'ABAchievement_QueryGlobalAchievementContributors::AchievementCode' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementContributors, SortBy) == 0x000010, "Member 'ABAchievement_QueryGlobalAchievementContributors::SortBy' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementContributors, OnSuccess) == 0x000014, "Member 'ABAchievement_QueryGlobalAchievementContributors::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementContributors, OnError) == 0x000028, "Member 'ABAchievement_QueryGlobalAchievementContributors::OnError' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementContributors, Offset) == 0x00003C, "Member 'ABAchievement_QueryGlobalAchievementContributors::Offset' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementContributors, Limit) == 0x000040, "Member 'ABAchievement_QueryGlobalAchievementContributors::Limit' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAchievement.QueryGlobalAchievements
// 0x0048 (0x0048 - 0x0000)
struct ABAchievement_QueryGlobalAchievements final
{
public:
	class FString                                 AchievementCode;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteGlobalAchievementStatus             AchievementStatus;                                 // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteGlobalAchievementListSortBy         SortBy;                                            // 0x0011(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPaginatedUserGlobalAchievement& Response)> OnSuccess; // 0x0014(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0028(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x003C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0040(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ABAchievement_QueryGlobalAchievements) == 0x000008, "Wrong alignment on ABAchievement_QueryGlobalAchievements");
static_assert(sizeof(ABAchievement_QueryGlobalAchievements) == 0x000048, "Wrong size on ABAchievement_QueryGlobalAchievements");
static_assert(offsetof(ABAchievement_QueryGlobalAchievements, AchievementCode) == 0x000000, "Member 'ABAchievement_QueryGlobalAchievements::AchievementCode' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievements, AchievementStatus) == 0x000010, "Member 'ABAchievement_QueryGlobalAchievements::AchievementStatus' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievements, SortBy) == 0x000011, "Member 'ABAchievement_QueryGlobalAchievements::SortBy' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievements, OnSuccess) == 0x000014, "Member 'ABAchievement_QueryGlobalAchievements::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievements, OnError) == 0x000028, "Member 'ABAchievement_QueryGlobalAchievements::OnError' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievements, Offset) == 0x00003C, "Member 'ABAchievement_QueryGlobalAchievements::Offset' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievements, Limit) == 0x000040, "Member 'ABAchievement_QueryGlobalAchievements::Limit' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAchievement.QueryGlobalAchievementUserContributed
// 0x0048 (0x0048 - 0x0000)
struct ABAchievement_QueryGlobalAchievementUserContributed final
{
public:
	class FString                                 AchievementCode;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteGlobalAchievementContributorsSortBy SortBy;                                            // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPaginatedGlobalAchievementUserContributed& Response)> OnSuccess; // 0x0014(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0028(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x003C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0040(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ABAchievement_QueryGlobalAchievementUserContributed) == 0x000008, "Wrong alignment on ABAchievement_QueryGlobalAchievementUserContributed");
static_assert(sizeof(ABAchievement_QueryGlobalAchievementUserContributed) == 0x000048, "Wrong size on ABAchievement_QueryGlobalAchievementUserContributed");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementUserContributed, AchievementCode) == 0x000000, "Member 'ABAchievement_QueryGlobalAchievementUserContributed::AchievementCode' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementUserContributed, SortBy) == 0x000010, "Member 'ABAchievement_QueryGlobalAchievementUserContributed::SortBy' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementUserContributed, OnSuccess) == 0x000014, "Member 'ABAchievement_QueryGlobalAchievementUserContributed::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementUserContributed, OnError) == 0x000028, "Member 'ABAchievement_QueryGlobalAchievementUserContributed::OnError' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementUserContributed, Offset) == 0x00003C, "Member 'ABAchievement_QueryGlobalAchievementUserContributed::Offset' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryGlobalAchievementUserContributed, Limit) == 0x000040, "Member 'ABAchievement_QueryGlobalAchievementUserContributed::Limit' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAchievement.QueryUserAchievements
// 0x0048 (0x0048 - 0x0000)
struct ABAchievement_QueryUserAchievements final
{
public:
	EAccelByteAchievementListSortBy               SortBy;                                            // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FAccelByteModelsPaginatedUserAchievement& Response)> OnSuccess;      // 0x0004(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0018(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x002C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x0030(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PreferUnlocked;                                    // 0x0034(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 TagQuery;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABAchievement_QueryUserAchievements) == 0x000008, "Wrong alignment on ABAchievement_QueryUserAchievements");
static_assert(sizeof(ABAchievement_QueryUserAchievements) == 0x000048, "Wrong size on ABAchievement_QueryUserAchievements");
static_assert(offsetof(ABAchievement_QueryUserAchievements, SortBy) == 0x000000, "Member 'ABAchievement_QueryUserAchievements::SortBy' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryUserAchievements, OnSuccess) == 0x000004, "Member 'ABAchievement_QueryUserAchievements::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryUserAchievements, OnError) == 0x000018, "Member 'ABAchievement_QueryUserAchievements::OnError' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryUserAchievements, Offset) == 0x00002C, "Member 'ABAchievement_QueryUserAchievements::Offset' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryUserAchievements, Limit) == 0x000030, "Member 'ABAchievement_QueryUserAchievements::Limit' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryUserAchievements, PreferUnlocked) == 0x000034, "Member 'ABAchievement_QueryUserAchievements::PreferUnlocked' has a wrong offset!");
static_assert(offsetof(ABAchievement_QueryUserAchievements, TagQuery) == 0x000038, "Member 'ABAchievement_QueryUserAchievements::TagQuery' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAchievement.UnlockAchievement
// 0x0038 (0x0038 - 0x0000)
struct ABAchievement_UnlockAchievement final
{
public:
	class FString                                 AchievementCode;                                   // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnSuccess;                                         // 0x0010(0x0014)(ConstParm, Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABAchievement_UnlockAchievement) == 0x000008, "Wrong alignment on ABAchievement_UnlockAchievement");
static_assert(sizeof(ABAchievement_UnlockAchievement) == 0x000038, "Wrong size on ABAchievement_UnlockAchievement");
static_assert(offsetof(ABAchievement_UnlockAchievement, AchievementCode) == 0x000000, "Member 'ABAchievement_UnlockAchievement::AchievementCode' has a wrong offset!");
static_assert(offsetof(ABAchievement_UnlockAchievement, OnSuccess) == 0x000010, "Member 'ABAchievement_UnlockAchievement::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAchievement_UnlockAchievement, OnError) == 0x000024, "Member 'ABAchievement_UnlockAchievement::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAgreement.AcceptPolicyVersion
// 0x0038 (0x0038 - 0x0000)
struct ABAgreement_AcceptPolicyVersion final
{
public:
	class FString                                 LocalizedPolicyVersionId;                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void()>                             OnSuccess;                                         // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABAgreement_AcceptPolicyVersion) == 0x000008, "Wrong alignment on ABAgreement_AcceptPolicyVersion");
static_assert(sizeof(ABAgreement_AcceptPolicyVersion) == 0x000038, "Wrong size on ABAgreement_AcceptPolicyVersion");
static_assert(offsetof(ABAgreement_AcceptPolicyVersion, LocalizedPolicyVersionId) == 0x000000, "Member 'ABAgreement_AcceptPolicyVersion::LocalizedPolicyVersionId' has a wrong offset!");
static_assert(offsetof(ABAgreement_AcceptPolicyVersion, OnSuccess) == 0x000010, "Member 'ABAgreement_AcceptPolicyVersion::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAgreement_AcceptPolicyVersion, OnError) == 0x000024, "Member 'ABAgreement_AcceptPolicyVersion::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAgreement.BulkAcceptPolicyVersions
// 0x0038 (0x0038 - 0x0000)
struct ABAgreement_BulkAcceptPolicyVersions final
{
public:
	struct FArrayModelsAcceptAgreementRequest     AgreementRequests;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAccelByteModelsAcceptAgreementResponse& Response)> OnSuccess;       // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABAgreement_BulkAcceptPolicyVersions) == 0x000008, "Wrong alignment on ABAgreement_BulkAcceptPolicyVersions");
static_assert(sizeof(ABAgreement_BulkAcceptPolicyVersions) == 0x000038, "Wrong size on ABAgreement_BulkAcceptPolicyVersions");
static_assert(offsetof(ABAgreement_BulkAcceptPolicyVersions, AgreementRequests) == 0x000000, "Member 'ABAgreement_BulkAcceptPolicyVersions::AgreementRequests' has a wrong offset!");
static_assert(offsetof(ABAgreement_BulkAcceptPolicyVersions, OnSuccess) == 0x000010, "Member 'ABAgreement_BulkAcceptPolicyVersions::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAgreement_BulkAcceptPolicyVersions, OnError) == 0x000024, "Member 'ABAgreement_BulkAcceptPolicyVersions::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAgreement.GetLegalDocument
// 0x0038 (0x0038 - 0x0000)
struct ABAgreement_GetLegalDocument final
{
public:
	class FString                                 Url;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const class FString& Response)> OnSuccess;                                        // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABAgreement_GetLegalDocument) == 0x000008, "Wrong alignment on ABAgreement_GetLegalDocument");
static_assert(sizeof(ABAgreement_GetLegalDocument) == 0x000038, "Wrong size on ABAgreement_GetLegalDocument");
static_assert(offsetof(ABAgreement_GetLegalDocument, Url) == 0x000000, "Member 'ABAgreement_GetLegalDocument::Url' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalDocument, OnSuccess) == 0x000010, "Member 'ABAgreement_GetLegalDocument::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalDocument, OnError) == 0x000024, "Member 'ABAgreement_GetLegalDocument::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAgreement.GetLegalPolicies
// 0x002C (0x002C - 0x0000)
struct ABAgreement_GetLegalPolicies final
{
public:
	EAccelByteAgreementPolicyType                 AgreementPolicyType;                               // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DefaultOnEmpty;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FArrayModelsPublicPolicyResponse& Response)> OnSuccess;              // 0x0004(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0018(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABAgreement_GetLegalPolicies) == 0x000004, "Wrong alignment on ABAgreement_GetLegalPolicies");
static_assert(sizeof(ABAgreement_GetLegalPolicies) == 0x00002C, "Wrong size on ABAgreement_GetLegalPolicies");
static_assert(offsetof(ABAgreement_GetLegalPolicies, AgreementPolicyType) == 0x000000, "Member 'ABAgreement_GetLegalPolicies::AgreementPolicyType' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPolicies, DefaultOnEmpty) == 0x000001, "Member 'ABAgreement_GetLegalPolicies::DefaultOnEmpty' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPolicies, OnSuccess) == 0x000004, "Member 'ABAgreement_GetLegalPolicies::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPolicies, OnError) == 0x000018, "Member 'ABAgreement_GetLegalPolicies::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAgreement.GetLegalPoliciesByCountry
// 0x0040 (0x0040 - 0x0000)
struct ABAgreement_GetLegalPoliciesByCountry final
{
public:
	class FString                                 CountryCode;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteAgreementPolicyType                 AgreementPolicyType;                               // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DefaultOnEmpty;                                    // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FArrayModelsPublicPolicyResponse& Response)> OnSuccess;              // 0x0014(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0028(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ABAgreement_GetLegalPoliciesByCountry) == 0x000008, "Wrong alignment on ABAgreement_GetLegalPoliciesByCountry");
static_assert(sizeof(ABAgreement_GetLegalPoliciesByCountry) == 0x000040, "Wrong size on ABAgreement_GetLegalPoliciesByCountry");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountry, CountryCode) == 0x000000, "Member 'ABAgreement_GetLegalPoliciesByCountry::CountryCode' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountry, AgreementPolicyType) == 0x000010, "Member 'ABAgreement_GetLegalPoliciesByCountry::AgreementPolicyType' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountry, DefaultOnEmpty) == 0x000011, "Member 'ABAgreement_GetLegalPoliciesByCountry::DefaultOnEmpty' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountry, OnSuccess) == 0x000014, "Member 'ABAgreement_GetLegalPoliciesByCountry::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountry, OnError) == 0x000028, "Member 'ABAgreement_GetLegalPoliciesByCountry::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAgreement.GetLegalPoliciesByCountryAndTags
// 0x0058 (0x0058 - 0x0000)
struct ABAgreement_GetLegalPoliciesByCountryAndTags final
{
public:
	class FString                                 CountryCode;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteAgreementPolicyType                 AgreementPolicyType;                               // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Tags;                                              // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          DefaultOnEmpty;                                    // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FArrayModelsPublicPolicyResponse& Response)> OnSuccess;              // 0x002C(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0040(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ABAgreement_GetLegalPoliciesByCountryAndTags) == 0x000008, "Wrong alignment on ABAgreement_GetLegalPoliciesByCountryAndTags");
static_assert(sizeof(ABAgreement_GetLegalPoliciesByCountryAndTags) == 0x000058, "Wrong size on ABAgreement_GetLegalPoliciesByCountryAndTags");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountryAndTags, CountryCode) == 0x000000, "Member 'ABAgreement_GetLegalPoliciesByCountryAndTags::CountryCode' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountryAndTags, AgreementPolicyType) == 0x000010, "Member 'ABAgreement_GetLegalPoliciesByCountryAndTags::AgreementPolicyType' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountryAndTags, Tags) == 0x000018, "Member 'ABAgreement_GetLegalPoliciesByCountryAndTags::Tags' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountryAndTags, DefaultOnEmpty) == 0x000028, "Member 'ABAgreement_GetLegalPoliciesByCountryAndTags::DefaultOnEmpty' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountryAndTags, OnSuccess) == 0x00002C, "Member 'ABAgreement_GetLegalPoliciesByCountryAndTags::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByCountryAndTags, OnError) == 0x000040, "Member 'ABAgreement_GetLegalPoliciesByCountryAndTags::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAgreement.GetLegalPoliciesByNamespace
// 0x0040 (0x0040 - 0x0000)
struct ABAgreement_GetLegalPoliciesByNamespace final
{
public:
	class FString                                 Namesapce;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteAgreementPolicyType                 AgreementPolicyType;                               // 0x0010(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DefaultOnEmpty;                                    // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FArrayModelsPublicPolicyResponse& Response)> OnSuccess;              // 0x0014(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0028(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ABAgreement_GetLegalPoliciesByNamespace) == 0x000008, "Wrong alignment on ABAgreement_GetLegalPoliciesByNamespace");
static_assert(sizeof(ABAgreement_GetLegalPoliciesByNamespace) == 0x000040, "Wrong size on ABAgreement_GetLegalPoliciesByNamespace");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByNamespace, Namesapce) == 0x000000, "Member 'ABAgreement_GetLegalPoliciesByNamespace::Namesapce' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByNamespace, AgreementPolicyType) == 0x000010, "Member 'ABAgreement_GetLegalPoliciesByNamespace::AgreementPolicyType' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByNamespace, DefaultOnEmpty) == 0x000011, "Member 'ABAgreement_GetLegalPoliciesByNamespace::DefaultOnEmpty' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByNamespace, OnSuccess) == 0x000014, "Member 'ABAgreement_GetLegalPoliciesByNamespace::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByNamespace, OnError) == 0x000028, "Member 'ABAgreement_GetLegalPoliciesByNamespace::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAgreement.GetLegalPoliciesByTags
// 0x0048 (0x0048 - 0x0000)
struct ABAgreement_GetLegalPoliciesByTags final
{
public:
	EAccelByteAgreementPolicyType                 AgreementPolicyType;                               // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         tags;                                              // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          DefaultOnEmpty;                                    // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FArrayModelsPublicPolicyResponse& Response)> OnSuccess;              // 0x001C(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0030(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ABAgreement_GetLegalPoliciesByTags) == 0x000008, "Wrong alignment on ABAgreement_GetLegalPoliciesByTags");
static_assert(sizeof(ABAgreement_GetLegalPoliciesByTags) == 0x000048, "Wrong size on ABAgreement_GetLegalPoliciesByTags");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByTags, AgreementPolicyType) == 0x000000, "Member 'ABAgreement_GetLegalPoliciesByTags::AgreementPolicyType' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByTags, tags) == 0x000008, "Member 'ABAgreement_GetLegalPoliciesByTags::tags' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByTags, DefaultOnEmpty) == 0x000018, "Member 'ABAgreement_GetLegalPoliciesByTags::DefaultOnEmpty' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByTags, OnSuccess) == 0x00001C, "Member 'ABAgreement_GetLegalPoliciesByTags::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAgreement_GetLegalPoliciesByTags, OnError) == 0x000030, "Member 'ABAgreement_GetLegalPoliciesByTags::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABAgreement.QueryLegalEligibilities
// 0x0038 (0x0038 - 0x0000)
struct ABAgreement_QueryLegalEligibilities final
{
public:
	class FString                                 Namespace;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FArrayModelsRetrieveUserEligibilitiesResponse& Response)> OnSuccess; // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABAgreement_QueryLegalEligibilities) == 0x000008, "Wrong alignment on ABAgreement_QueryLegalEligibilities");
static_assert(sizeof(ABAgreement_QueryLegalEligibilities) == 0x000038, "Wrong size on ABAgreement_QueryLegalEligibilities");
static_assert(offsetof(ABAgreement_QueryLegalEligibilities, Namespace) == 0x000000, "Member 'ABAgreement_QueryLegalEligibilities::Namespace' has a wrong offset!");
static_assert(offsetof(ABAgreement_QueryLegalEligibilities, OnSuccess) == 0x000010, "Member 'ABAgreement_QueryLegalEligibilities::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABAgreement_QueryLegalEligibilities, OnError) == 0x000024, "Member 'ABAgreement_QueryLegalEligibilities::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABBinaryCloudSave.BulkGetCurrentUserBinaryRecords
// 0x0038 (0x0038 - 0x0000)
struct ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords final
{
public:
	TArray<class FString>                         Keys;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAccelByteModelsListUserBinaryRecords& Response)> OnSuccess;         // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords) == 0x000008, "Wrong alignment on ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords");
static_assert(sizeof(ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords) == 0x000038, "Wrong size on ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords");
static_assert(offsetof(ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords, Keys) == 0x000000, "Member 'ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords::Keys' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords, OnSuccess) == 0x000010, "Member 'ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords, OnError) == 0x000024, "Member 'ABBinaryCloudSave_BulkGetCurrentUserBinaryRecords::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABBinaryCloudSave.BulkGetGameBinaryRecords
// 0x0038 (0x0038 - 0x0000)
struct ABBinaryCloudSave_BulkGetGameBinaryRecords final
{
public:
	TArray<class FString>                         Keys;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAccelByteModelsListGameBinaryRecords& Response)> OnSuccess;         // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABBinaryCloudSave_BulkGetGameBinaryRecords) == 0x000008, "Wrong alignment on ABBinaryCloudSave_BulkGetGameBinaryRecords");
static_assert(sizeof(ABBinaryCloudSave_BulkGetGameBinaryRecords) == 0x000038, "Wrong size on ABBinaryCloudSave_BulkGetGameBinaryRecords");
static_assert(offsetof(ABBinaryCloudSave_BulkGetGameBinaryRecords, Keys) == 0x000000, "Member 'ABBinaryCloudSave_BulkGetGameBinaryRecords::Keys' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetGameBinaryRecords, OnSuccess) == 0x000010, "Member 'ABBinaryCloudSave_BulkGetGameBinaryRecords::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetGameBinaryRecords, OnError) == 0x000024, "Member 'ABBinaryCloudSave_BulkGetGameBinaryRecords::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABBinaryCloudSave.BulkGetPublicUserBinaryRecordsByKeys
// 0x0048 (0x0048 - 0x0000)
struct ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys final
{
public:
	TArray<class FString>                         Keys;                                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAccelByteModelsListUserBinaryRecords& Response)> OnSuccess;         // 0x0020(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0034(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys) == 0x000008, "Wrong alignment on ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys");
static_assert(sizeof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys) == 0x000048, "Wrong size on ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys");
static_assert(offsetof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys, Keys) == 0x000000, "Member 'ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys::Keys' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys, UserId) == 0x000010, "Member 'ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys::UserId' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys, OnSuccess) == 0x000020, "Member 'ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys, OnError) == 0x000034, "Member 'ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByKeys::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABBinaryCloudSave.BulkGetPublicUserBinaryRecordsByUserIds
// 0x0048 (0x0048 - 0x0000)
struct ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         UserIds;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAccelByteModelsListUserBinaryRecords& Response)> OnSuccess;         // 0x0020(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0034(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds) == 0x000008, "Wrong alignment on ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds");
static_assert(sizeof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds) == 0x000048, "Wrong size on ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds");
static_assert(offsetof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds, Key) == 0x000000, "Member 'ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds::Key' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds, UserIds) == 0x000010, "Member 'ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds::UserIds' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds, OnSuccess) == 0x000020, "Member 'ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds, OnError) == 0x000034, "Member 'ABBinaryCloudSave_BulkGetPublicUserBinaryRecordsByUserIds::OnError' has a wrong offset!");

// Function AccelByteUe4Sdk.ABBinaryCloudSave.BulkQueryCurrentUserBinaryRecords
// 0x0040 (0x0040 - 0x0000)
struct ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords final
{
public:
	class FString                                 Query;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAccelByteModelsPaginatedUserBinaryRecords& Response)> OnSuccess;    // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0038(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x003C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords) == 0x000008, "Wrong alignment on ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords");
static_assert(sizeof(ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords) == 0x000040, "Wrong size on ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords, Query) == 0x000000, "Member 'ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords::Query' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords, OnSuccess) == 0x000010, "Member 'ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords, OnError) == 0x000024, "Member 'ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords::OnError' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords, Offset) == 0x000038, "Member 'ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords::Offset' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords, Limit) == 0x00003C, "Member 'ABBinaryCloudSave_BulkQueryCurrentUserBinaryRecords::Limit' has a wrong offset!");

// Function AccelByteUe4Sdk.ABBinaryCloudSave.BulkQueryGameBinaryRecords
// 0x0040 (0x0040 - 0x0000)
struct ABBinaryCloudSave_BulkQueryGameBinaryRecords final
{
public:
	class FString                                 Query;                                             // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAccelByteModelsPaginatedGameBinaryRecords& Response)> OnSuccess;    // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0038(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x003C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABBinaryCloudSave_BulkQueryGameBinaryRecords) == 0x000008, "Wrong alignment on ABBinaryCloudSave_BulkQueryGameBinaryRecords");
static_assert(sizeof(ABBinaryCloudSave_BulkQueryGameBinaryRecords) == 0x000040, "Wrong size on ABBinaryCloudSave_BulkQueryGameBinaryRecords");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryGameBinaryRecords, Query) == 0x000000, "Member 'ABBinaryCloudSave_BulkQueryGameBinaryRecords::Query' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryGameBinaryRecords, OnSuccess) == 0x000010, "Member 'ABBinaryCloudSave_BulkQueryGameBinaryRecords::OnSuccess' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryGameBinaryRecords, OnError) == 0x000024, "Member 'ABBinaryCloudSave_BulkQueryGameBinaryRecords::OnError' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryGameBinaryRecords, Offset) == 0x000038, "Member 'ABBinaryCloudSave_BulkQueryGameBinaryRecords::Offset' has a wrong offset!");
static_assert(offsetof(ABBinaryCloudSave_BulkQueryGameBinaryRecords, Limit) == 0x00003C, "Member 'ABBinaryCloudSave_BulkQueryGameBinaryRecords::Limit' has a wrong offset!");

// Function AccelByteUe4Sdk.ABBinaryCloudSave.BulkQueryPublicUserBinaryRecords
// 0x0040 (0x0040 - 0x0000)
struct ABBinaryCloudSave_BulkQueryPublicUserBinaryRecords final
{
public:
	class FString                                 UserId;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FAccelByteModelsPaginatedUserBinaryRecords& Response)> OnSuccess;    // 0x0010(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TDelegate<void(int32 ErrorCode, const class FString& ErrorMessage)> OnError;                     // 0x0024(0x0014)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         Offset;                                            // 0x0038(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Limit;                                             // 0x003C(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ABBinaryCloudSave_BulkQueryPublicUserBinaryRecords) == 0x000008, "Wrong alignment on ABBinaryCloudSave_BulkQueryPublicUserBinaryRecords");
