#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccelByteCustomization

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AccelByteCustomization.AccelByteCustomizationSettings
// 0x0010 (0x0040 - 0x0030)
class UAccelByteCustomizationSettings final : public UObject
{
public:
	class FString                                 ChallengeServerUrl;                                // 0x0030(0x0010)(Edit, ZeroConstructor, Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccelByteCustomizationSettings">();
	}
	static class UAccelByteCustomizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccelByteCustomizationSettings>();
	}
};
static_assert(alignof(UAccelByteCustomizationSettings) == 0x000008, "Wrong alignment on UAccelByteCustomizationSettings");
static_assert(sizeof(UAccelByteCustomizationSettings) == 0x000040, "Wrong size on UAccelByteCustomizationSettings");
static_assert(offsetof(UAccelByteCustomizationSettings, ChallengeServerUrl) == 0x000030, "Member 'UAccelByteCustomizationSettings::ChallengeServerUrl' has a wrong offset!");

// Class AccelByteCustomization.AccelByteBlueprintsCustomizationSettings
// 0x0000 (0x0030 - 0x0030)
class UAccelByteBlueprintsCustomizationSettings final : public UBlueprintFunctionLibrary
{
public:
	static class FString GetChallengeServerUrl();
	static void SetChallengeServerUrl(const class FString& ChallengeServerUrl);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"AccelByteBlueprintsCustomizationSettings">();
	}
	static class UAccelByteBlueprintsCustomizationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAccelByteBlueprintsCustomizationSettings>();
	}
};
static_assert(alignof(UAccelByteBlueprintsCustomizationSettings) == 0x000008, "Wrong alignment on UAccelByteBlueprintsCustomizationSettings");
static_assert(sizeof(UAccelByteBlueprintsCustomizationSettings) == 0x000030, "Wrong size on UAccelByteBlueprintsCustomizationSettings");

}

