#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccelByteUe4Sdk

#include "Basic.hpp"

#include "JsonUtilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum AccelByteUe4Sdk.ConvertAchievementStatus
// NumValues: 0x0004
enum class EConvertAchievementStatus : uint8
{
	NONE                                     = 0,
	IN_PROGRESS                              = 1,
	UNLOCKED                                 = 2,
	ConvertAchievementStatus_MAX             = 3,
};

// Enum AccelByteUe4Sdk.ESetByMetadataRecord
// NumValues: 0x0004
enum class ESetByMetadataRecord : uint8
{
	NONE                                     = 0,
	SERVER                                   = 1,
	CLIENT                                   = 2,
	ESetByMetadataRecord_MAX                 = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteLootBoxRewardType
// NumValues: 0x0004
enum class EAccelByteLootBoxRewardType : uint8
{
	PROBABILITY_GROUP                        = 0,
	REWARD_GROUP                             = 1,
	REWARD                                   = 2,
	EAccelByteLootBoxRewardType_MAX          = 3,
};

// Enum AccelByteUe4Sdk.EAccelBytePredicateType
// NumValues: 0x0004
enum class EAccelBytePredicateType : uint8
{
	EntitlementPredicate                     = 0,
	SeasonPassPredicate                      = 1,
	SeasonTierPredicate                      = 2,
	EAccelBytePredicateType_MAX              = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteCycle
// NumValues: 0x0007
enum class EAccelByteCycle : uint8
{
	DAILY                                    = 0,
	WEEKLY                                   = 1,
	MONTHLY                                  = 2,
	QUARTERLY                                = 3,
	YEARLY                                   = 4,
	ANNUALLY                                 = 5,
	EAccelByteCycle_MAX                      = 6,
};

// Enum AccelByteUe4Sdk.EAccelByteItemCurrencyType
// NumValues: 0x0004
enum class EAccelByteItemCurrencyType : uint8
{
	NONE                                     = 0,
	REAL                                     = 1,
	VIRTUAL                                  = 2,
	EAccelByteItemCurrencyType_MAX           = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteItemType
// NumValues: 0x000D
enum class EAccelByteItemType : uint8
{
	NONE                                     = 0,
	APP                                      = 1,
	COINS                                    = 2,
	INGAMEITEM                               = 3,
	BUNDLE                                   = 4,
	CODE                                     = 5,
	SUBSCRIPTION                             = 6,
	SEASON                                   = 7,
	MEDIA                                    = 8,
	OPTIONBOX                                = 9,
	EXTENSION                                = 10,
	LOOTBOX                                  = 11,
	EAccelByteItemType_MAX                   = 12,
};

// Enum AccelByteUe4Sdk.EAccelByteItemStatus
// NumValues: 0x0004
enum class EAccelByteItemStatus : uint8
{
	NONE                                     = 0,
	ACTIVE                                   = 1,
	INACTIVE                                 = 2,
	EAccelByteItemStatus_MAX                 = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementType
// NumValues: 0x0004
enum class EAccelByteEntitlementType : uint8
{
	NONE                                     = 0,
	DURABLE                                  = 1,
	CONSUMABLE                               = 2,
	EAccelByteEntitlementType_MAX            = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonType
// NumValues: 0x0003
enum class EAccelByteSeasonType : uint8
{
	PASS                                     = 0,
	TIER                                     = 1,
	EAccelByteSeasonType_MAX                 = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteCurrencyType
// NumValues: 0x0004
enum class EAccelByteCurrencyType : uint8
{
	NONE                                     = 0,
	REAL                                     = 1,
	VIRTUAL                                  = 2,
	EAccelByteCurrencyType_MAX               = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteAppType
// NumValues: 0x0006
enum class EAccelByteAppType : uint8
{
	NONE                                     = 0,
	GAME                                     = 1,
	SOFTWARE                                 = 2,
	DLC                                      = 3,
	DEMO                                     = 4,
	EAccelByteAppType_MAX                    = 5,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementSource
// NumValues: 0x000B
enum class EAccelByteEntitlementSource : uint8
{
	NONE                                     = 0,
	PURCHASE                                 = 1,
	IAP                                      = 2,
	PROMOTION                                = 3,
	ACHIEVEMENT                              = 4,
	REFERRAL_BONUS                           = 5,
	REDEEM_CODE                              = 6,
	REWARD                                   = 7,
	GIFT                                     = 8,
	OTHER                                    = 9,
	EAccelByteEntitlementSource_MAX          = 10,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementStatus
// NumValues: 0x0006
enum class EAccelByteEntitlementStatus : uint8
{
	NONE                                     = 0,
	ACTIVE                                   = 1,
	INACTIVE                                 = 2,
	CONSUMED                                 = 3,
	REVOKED                                  = 4,
	EAccelByteEntitlementStatus_MAX          = 5,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementClass
// NumValues: 0x0009
enum class EAccelByteEntitlementClass : uint8
{
	NONE                                     = 0,
	APP                                      = 1,
	ENTITLEMENT                              = 2,
	CODE                                     = 3,
	SUBSCRIPTION                             = 4,
	MEDIA                                    = 5,
	OPTIONBOX                                = 6,
	LOOTBOX                                  = 7,
	EAccelByteEntitlementClass_MAX           = 8,
};

// Enum AccelByteUe4Sdk.ERelationshipStatusCode
// NumValues: 0x0005
enum class ERelationshipStatusCode : uint8
{
	Friend                                   = 3,
	Incoming                                 = 2,
	Outgoing                                 = 1,
	NotFriend                                = 0,
	ERelationshipStatusCode_MAX              = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteSubscriptionSummarySubscribedBy
// NumValues: 0x0004
enum class EAccelByteSubscriptionSummarySubscribedBy : uint8
{
	NONE                                     = 0,
	USER                                     = 1,
	PLATFORM                                 = 2,
	EAccelByteSubscriptionSummarySubscribedBy_MAX = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteSubscriptionSummaryStatus
// NumValues: 0x0006
enum class EAccelByteSubscriptionSummaryStatus : uint8
{
	NONE                                     = 0,
	INIT                                     = 1,
	ACTIVE                                   = 2,
	CANCELLED                                = 3,
	EXPIRED                                  = 4,
	EAccelByteSubscriptionSummaryStatus_MAX  = 5,
};

// Enum AccelByteUe4Sdk.EAccelByteGroupType
// NumValues: 0x0005
enum class EAccelByteGroupType : uint8
{
	NONE                                     = 0,
	OPEN                                     = 1,
	PUBLIC                                   = 2,
	PRIVATE                                  = 3,
	EAccelByteGroupType_MAX                  = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteRuleCriteria
// NumValues: 0x0004
enum class EAccelByteRuleCriteria : uint8
{
	MINIMUM                                  = 0,
	MAXIMUM                                  = 1,
	EQUAL                                    = 2,
	EAccelByteRuleCriteria_MAX               = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteAllowedAction
// NumValues: 0x0008
enum class EAccelByteAllowedAction : uint8
{
	None                                     = 0,
	createGroup                              = 1,
	joinGroup                                = 2,
	inviteUser                               = 3,
	kickUser                                 = 4,
	leaveGroup                               = 5,
	responseJoinRequest                      = 6,
	EAccelByteAllowedAction_MAX              = 7,
};

// Enum AccelByteUe4Sdk.EAccelByteGroupRequestType
// NumValues: 0x0005
enum class EAccelByteGroupRequestType : uint8
{
	NONE                                     = 0,
	INVITE                                   = 1,
	JOIN                                     = 2,
	JOINED                                   = 3,
	EAccelByteGroupRequestType_MAX           = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteMatchmakingStatus
// NumValues: 0x0008
enum class EAccelByteMatchmakingStatus : uint8
{
	Unknown                                  = 0,
	Start                                    = 1,
	Timeout                                  = 2,
	Cancel                                   = 3,
	Done                                     = 4,
	Unavailable                              = 5,
	Rejected                                 = 6,
	EAccelByteMatchmakingStatus_MAX          = 7,
};

// Enum AccelByteUe4Sdk.EAccelByteOrderStatus
// NumValues: 0x000D
enum class EAccelByteOrderStatus : uint8
{
	NONE                                     = 0,
	INIT                                     = 1,
	CHARGED                                  = 2,
	CHARGEBACK                               = 3,
	CHARGEBACK_REVERSED                      = 4,
	FULFILLED                                = 5,
	FULFILL_FAILED                           = 6,
	REFUNDING                                = 7,
	REFUNDED                                 = 8,
	REFUND_FAILED                            = 9,
	CLOSED                                   = 10,
	DELETED                                  = 11,
	EAccelByteOrderStatus_MAX                = 12,
};

// Enum AccelByteUe4Sdk.EAccelBytePaymentProvider
// NumValues: 0x000A
enum class EAccelBytePaymentProvider : uint8
{
	NONE                                     = 0,
	WALLET                                   = 1,
	XSOLLA                                   = 2,
	ADYEN                                    = 3,
	STRIPE                                   = 4,
	CHECKOUT                                 = 5,
	ALIPAY                                   = 6,
	WXPAY                                    = 7,
	PAYPAL                                   = 8,
	EAccelBytePaymentProvider_MAX            = 9,
};

// Enum AccelByteUe4Sdk.EAvailability
// NumValues: 0x0006
enum class EAvailability : uint8
{
	Offline                                  = 0,
	Online                                   = 1,
	Busy                                     = 2,
	Invisible                                = 3,
	Away                                     = 4,
	EAvailability_MAX                        = 5,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonPassRewardType
// NumValues: 0x0002
enum class EAccelByteSeasonPassRewardType : uint8
{
	ITEM                                     = 0,
	EAccelByteSeasonPassRewardType_MAX       = 1,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonPassStatus
// NumValues: 0x0004
enum class EAccelByteSeasonPassStatus : uint8
{
	DRAFT                                    = 0,
	PUBLISHED                                = 1,
	RETIRED                                  = 2,
	EAccelByteSeasonPassStatus_MAX           = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteMatchmakingSessionStatus
// NumValues: 0x0009
enum class EAccelByteMatchmakingSessionStatus : uint8
{
	None                                     = 0,
	Matched                                  = 1,
	Done                                     = 2,
	Cancel                                   = 3,
	Timeout                                  = 4,
	SessionInQueue                           = 5,
	SessionFull                              = 6,
	SessionTimeout                           = 7,
	EAccelByteMatchmakingSessionStatus_MAX   = 8,
};

// Enum AccelByteUe4Sdk.EAccelByteAchievementListSortBy
// NumValues: 0x000B
enum class EAccelByteAchievementListSortBy : uint8
{
	NONE                                     = 0,
	LISTORDER                                = 1,
	LISTORDER_ASC                            = 2,
	LISTORDER_DESC                           = 3,
	CREATED_AT                               = 4,
	CREATED_AT_ASC                           = 5,
	CREATED_AT_DESC                          = 6,
	UPDATED_AT                               = 7,
	UPDATED_AT_ASC                           = 8,
	UPDATED_AT_DESC                          = 9,
	EAccelByteAchievementListSortBy_MAX      = 10,
};

// Enum AccelByteUe4Sdk.EAccelByteGlobalAchievementContributorsSortBy
// NumValues: 0x0005
enum class EAccelByteGlobalAchievementContributorsSortBy : uint8
{
	NONE                                     = 0,
	CONTRIBUTED_VALUE                        = 1,
	CONTRIBUTED_VALUE_ASC                    = 2,
	CONTRIBUTED_VALUE_DESC                   = 3,
	EAccelByteGlobalAchievementContributorsSortBy_MAX = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteGlobalAchievementListSortBy
// NumValues: 0x0008
enum class EAccelByteGlobalAchievementListSortBy : uint8
{
	NONE                                     = 0,
	ACHIEVED_AT                              = 1,
	ACHIEVED_AT_ASC                          = 2,
	ACHIEVED_AT_DESC                         = 3,
	CREATED_AT                               = 4,
	CREATED_AT_ASC                           = 5,
	CREATED_AT_DESC                          = 6,
	EAccelByteGlobalAchievementListSortBy_MAX = 7,
};

// Enum AccelByteUe4Sdk.EAccelByteGlobalAchievementStatus
// NumValues: 0x0004
enum class EAccelByteGlobalAchievementStatus : uint8
{
	NONE                                     = 0,
	IN_PROGRESS                              = 1,
	UNLOCKED                                 = 2,
	EAccelByteGlobalAchievementStatus_MAX    = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteItemListSortBy
// NumValues: 0x000D
enum class EAccelByteItemListSortBy : uint8
{
	NONE                                     = 0,
	NAME                                     = 1,
	NAME_DESC                                = 2,
	CREATEDAT                                = 3,
	CREATEDAT_ASC                            = 4,
	CREATEDAT_DESC                           = 5,
	UPDATEDAT                                = 6,
	UPDATEDAT_ASC                            = 7,
	UPDATEDAT_DESC                           = 8,
	DISPLAYORDER                             = 9,
	DISPLAYORDER_ASC                         = 10,
	DISPLAYORDER_DESC                        = 11,
	EAccelByteItemListSortBy_MAX             = 12,
};

// Enum AccelByteUe4Sdk.EAccelByteRewardListSortBy
// NumValues: 0x0008
enum class EAccelByteRewardListSortBy : uint8
{
	NONE                                     = 0,
	NAMESPACE                                = 1,
	NAMESPACE_ASC                            = 2,
	NAMESPACE_DESC                           = 3,
	REWARDCODE                               = 4,
	REWARDCODE_ASC                           = 5,
	REWARDCODE_DESC                          = 6,
	EAccelByteRewardListSortBy_MAX           = 7,
};

// Enum AccelByteUe4Sdk.EAccelByteFileType
// NumValues: 0x0009
enum class EAccelByteFileType : uint8
{
	JPEG                                     = 0,
	JPG                                      = 1,
	PNG                                      = 2,
	BMP                                      = 3,
	GIF                                      = 4,
	MP3                                      = 5,
	BIN                                      = 6,
	WEBP                                     = 7,
	EAccelByteFileType_MAX                   = 8,
};

// Enum AccelByteUe4Sdk.UEnumServerType
// NumValues: 0x0004
enum class EUEnumServerType : uint8
{
	NONE                                     = 0,
	CLOUDSERVER                              = 1,
	LOCALSERVER                              = 2,
	UEnumServerType_MAX                      = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteAgreementPolicyType
// NumValues: 0x0004
enum class EAccelByteAgreementPolicyType : uint8
{
	EMPTY                                    = 0,
	LEGAL_DOCUMENT_TYPE                      = 1,
	MARKETING_PREFERENCE_TYPE                = 2,
	EAccelByteAgreementPolicyType_MAX        = 3,
};

// Enum AccelByteUe4Sdk.EHttpCacheType
// NumValues: 0x0004
enum class EHttpCacheType : uint8
{
	UNKNOWN                                  = 0,
	STORAGE                                  = 1,
	MEMORY                                   = 2,
	EHttpCacheType_MAX                       = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteOptionalBool
// NumValues: 0x0004
enum class EAccelByteOptionalBool : uint8
{
	NONE                                     = 0,
	OPT_YES                                  = 1,
	OPT_NO                                   = 2,
	EAccelByteOptionalBool_MAX               = 3,
};

// Enum AccelByteUe4Sdk.ETopicType
// NumValues: 0x0004
enum class ETopicType : uint8
{
	Unknown                                  = 0,
	PERSONAL                                 = 1,
	GROUP                                    = 2,
	ETopicType_MAX                           = 3,
};

// Enum AccelByteUe4Sdk.EAccelBytePlatformRewardOrigin
// NumValues: 0x000D
enum class EAccelBytePlatformRewardOrigin : uint8
{
	NONE                                     = 0,
	Playstation                              = 1,
	Xbox                                     = 2,
	Steam                                    = 3,
	Epic                                     = 4,
	IOS                                      = 5,
	GooglePlay                               = 6,
	Twitch                                   = 7,
	Nintendo                                 = 8,
	Oculus                                   = 9,
	System                                   = 10,
	Other                                    = 11,
	EAccelBytePlatformRewardOrigin_MAX       = 12,
};

// Enum AccelByteUe4Sdk.EAccelBytePlatformRewardSource
// NumValues: 0x0012
enum class EAccelBytePlatformRewardSource : uint8
{
	NONE                                     = 0,
	PURCHASE                                 = 1,
	IAP                                      = 2,
	PROMOTION                                = 3,
	ACHIEVEMENT                              = 4,
	REFERRAL_BONUS                           = 5,
	REDEEM_CODE                              = 6,
	REWARD                                   = 7,
	GIFT                                     = 8,
	DLC                                      = 9,
	OTHER                                    = 10,
	SELL_BACK                                = 11,
	CONSUME_ENTITLEMENT                      = 12,
	ORDER_REVOCATION                         = 13,
	DLC_REVOCATION                           = 14,
	PAYMENT                                  = 15,
	EXPIRATION                               = 16,
	EAccelBytePlatformRewardSource_MAX       = 17,
};

// Enum AccelByteUe4Sdk.EAccelBytePlatformRewardType
// NumValues: 0x0004
enum class EAccelBytePlatformRewardType : uint8
{
	NONE                                     = 0,
	ITEM                                     = 1,
	CURRENCY                                 = 2,
	EAccelBytePlatformRewardType_MAX         = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementIAPOrderStatus
// NumValues: 0x0005
enum class EAccelByteEntitlementIAPOrderStatus : uint8
{
	NONE                                     = 0,
	VERIFIED                                 = 1,
	FULFILLED                                = 2,
	FAILED                                   = 3,
	EAccelByteEntitlementIAPOrderStatus_MAX  = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteEntitlementItemIdentityType
// NumValues: 0x0004
enum class EAccelByteEntitlementItemIdentityType : uint8
{
	NONE                                     = 0,
	ITEM_ID                                  = 1,
	ITEM_SKU                                 = 2,
	EAccelByteEntitlementItemIdentityType_MAX = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteWalletTable
// NumValues: 0x000B
enum class EAccelByteWalletTable : uint8
{
	Playstation                              = 0,
	Xbox                                     = 1,
	Steam                                    = 2,
	Epic                                     = 3,
	IOS                                      = 4,
	GooglePlay                               = 5,
	Twitch                                   = 6,
	System                                   = 7,
	Nintendo                                 = 8,
	Other                                    = 9,
	EAccelByteWalletTable_MAX                = 10,
};

// Enum AccelByteUe4Sdk.EAccelByteWalletAction
// NumValues: 0x0005
enum class EAccelByteWalletAction : uint8
{
	NONE                                     = 0,
	CREDIT                                   = 1,
	PAYMENT                                  = 2,
	DEBIT                                    = 3,
	EAccelByteWalletAction_MAX               = 4,
};

// Enum AccelByteUe4Sdk.EAccelBytePlatformSync
// NumValues: 0x0006
enum class EAccelBytePlatformSync : uint8
{
	STEAM                                    = 0,
	XBOX_LIVE                                = 1,
	PLAYSTATION                              = 2,
	EPIC_GAMES                               = 3,
	OTHER                                    = 4,
	EAccelBytePlatformSync_MAX               = 5,
};

// Enum AccelByteUe4Sdk.EAccelByteSubscriptionCycle
// NumValues: 0x0005
enum class EAccelByteSubscriptionCycle : uint8
{
	WEEKLY                                   = 0,
	MONTHLY                                  = 1,
	QUARTERLY                                = 2,
	YEARLY                                   = 3,
	EAccelByteSubscriptionCycle_MAX          = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteCreditUserWalletSource
// NumValues: 0x0009
enum class EAccelByteCreditUserWalletSource : uint8
{
	PURCHASE                                 = 0,
	IAP                                      = 1,
	PROMOTION                                = 2,
	ACHIEVEMENT                              = 3,
	REFERRAL_BONUS                           = 4,
	REDEEM_CODE                              = 5,
	REFUND                                   = 6,
	OTHER                                    = 7,
	EAccelByteCreditUserWalletSource_MAX     = 8,
};

// Enum AccelByteUe4Sdk.EAccelByteItemSource
// NumValues: 0x0012
enum class EAccelByteItemSource : uint8
{
	NONE                                     = 0,
	PURCHASE                                 = 1,
	IAP                                      = 2,
	PROMOTION                                = 3,
	ACHIEVEMENT                              = 4,
	REFERRAL_BONUS                           = 5,
	REDEEM_CODE                              = 6,
	REWARD                                   = 7,
	GIFT                                     = 8,
	DLC                                      = 9,
	SELL_BACK                                = 10,
	CONSUME_ENTITLEMENT                      = 11,
	ORDER_REVOCATION                         = 12,
	PAYMENT                                  = 13,
	EXPIRATION                               = 14,
	IAP_CHARGEBACK_REVERSED                  = 15,
	OTHER                                    = 16,
	EAccelByteItemSource_MAX                 = 17,
};

// Enum AccelByteUe4Sdk.ESettingsEnvironment
// NumValues: 0x0008
enum class ESettingsEnvironment : uint8
{
	Development                              = 0,
	Certification                            = 1,
	Production                               = 2,
	Sandbox                                  = 3,
	Integration                              = 4,
	QA                                       = 5,
	Default                                  = 6,
	ESettingsEnvironment_MAX                 = 7,
};

// Enum AccelByteUe4Sdk.EAccelByteGameStandardEventName
// NumValues: 0x000A
enum class EAccelByteGameStandardEventName : uint8
{
	resource_Sourced                         = 0,
	resource_Sinked                          = 1,
	resource_Upgraded                        = 2,
	resource_Actioned                        = 3,
	quest_Started                            = 4,
	quest_Ended                              = 5,
	player_Leveled                           = 6,
	player_Dead                              = 7,
	reward_Collected                         = 8,
	EAccelByteGameStandardEventName_MAX      = 9,
};

// Enum AccelByteUe4Sdk.EBanReason
// NumValues: 0x000E
enum class EBanReason : uint8
{
	EMPTY                                    = 0,
	VIOLENCE                                 = 1,
	HARASSMENT                               = 2,
	HATEFUL_CONDUCT                          = 3,
	OFFENSIVE_USERNAME                       = 4,
	IMPERSONATION                            = 5,
	MALICIOUS_CONTENT                        = 6,
	SEXUALLY_SUGGESTIVE                      = 7,
	SEXUAL_VIOLENCE                          = 8,
	EXTREME_VIOLENCE                         = 9,
	UNDERAGE_USER                            = 10,
	CHEATING                                 = 11,
	TOS_VIOLATION                            = 12,
	EBanReason_MAX                           = 13,
};

// Enum AccelByteUe4Sdk.EAccelBytePaginationType
// NumValues: 0x0004
enum class EAccelBytePaginationType : uint8
{
	FIRST                                    = 0,
	NEXT                                     = 1,
	PREVIOUS                                 = 2,
	EAccelBytePaginationType_MAX             = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteGroupListSortBy
// NumValues: 0x0003
enum class EAccelByteGroupListSortBy : uint8
{
	ASCENDING                                = 0,
	DESCENDING                               = 1,
	EAccelByteGroupListSortBy_MAX            = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteLeaderboardTimeFrame
// NumValues: 0x0006
enum class EAccelByteLeaderboardTimeFrame : uint8
{
	ALL_TIME                                 = 0,
	CURRENT_SEASON                           = 1,
	CURRENT_MONTH                            = 2,
	CURRENT_WEEK                             = 3,
	TODAY                                    = 4,
	EAccelByteLeaderboardTimeFrame_MAX       = 5,
};

// Enum AccelByteUe4Sdk.EV2SessionNotifTopic
// NumValues: 0x0012
enum class EV2SessionNotifTopic : uint8
{
	Invalid                                  = 0,
	OnPartyInvited                           = 1,
	OnPartyMembersChanged                    = 2,
	OnPartyJoined                            = 3,
	OnPartyRejected                          = 4,
	OnPartyKicked                            = 5,
	OnSessionInvited                         = 6,
	OnSessionJoined                          = 7,
	OnSessionMembersChanged                  = 8,
	OnSessionKicked                          = 9,
	OnSessionRejected                        = 10,
	OnDSStatusChanged                        = 11,
	OnPartyUpdated                           = 12,
	OnGameSessionUpdated                     = 13,
	OnSessionStorageChanged                  = 14,
	OnSessionEnded                           = 15,
	OnSessionNativePlatformSynced            = 16,
	EV2SessionNotifTopic_MAX                 = 17,
};

// Enum AccelByteUe4Sdk.EV2MatchmakingNotifTopic
// NumValues: 0x0006
enum class EV2MatchmakingNotifTopic : uint8
{
	Invalid                                  = 0,
	OnMatchFound                             = 1,
	OnMatchmakingStarted                     = 2,
	OnMatchmakingTicketExpired               = 3,
	OnMatchmakingTicketCanceled              = 4,
	EV2MatchmakingNotifTopic_MAX             = 5,
};

// Enum AccelByteUe4Sdk.EAccelBytePredefinedEventName
// NumValues: 0x00B4
enum class EAccelBytePredefinedEventName : uint8
{
	SDK_Initialized                          = 0,
	Login_Succeeded                          = 1,
	Login_Failed                             = 2,
	UserAgreement_Accepted                   = 3,
	UserAgreement_NotAccepted                = 4,
	UserProfile_Created                      = 5,
	UserProfile_Updated                      = 6,
	UserProfile_Deleted                      = 7,
	GameProfile_Created                      = 8,
	GameProfile_Updated                      = 9,
	GameProfile_Deleted                      = 10,
	UserStatItem_Created                     = 11,
	UserStatItem_Updated                     = 12,
	UserStatItem_Deleted                     = 13,
	UserStatItem_Reset                       = 14,
	UserStatItem_GetItemsByCodes             = 15,
	UserStatItem_GetSameItemsFromUsers       = 16,
	UserStatItem_GetItems                    = 17,
	GlobalStatItem_GetItemByCode             = 18,
	StatCycleItem_GetItemList                = 19,
	StatCycleItem_GetConfigByCycleId         = 20,
	StatCycleItem_GetListCycle               = 21,
	StatCycleItem_GetCycleItems              = 22,
	PlayerRecord_Created                     = 23,
	PlayerRecord_Updated                     = 24,
	PlayerRecord_Deleted                     = 25,
	PlayerRecord_GetRecords                  = 26,
	PublicPlayerRecord_GetSameRecordsFromUsers = 27,
	PublicPlayerRecord_GetRecord             = 28,
	PublicPlayerRecord_Updated               = 29,
	PublicPlayerRecord_GetOtherUserKeys      = 30,
	PublicPlayerRecord_GetOtherUserRecords   = 31,
	GameRecord_Created                       = 32,
	GameRecord_GetRecord                     = 33,
	GameRecord_Updated                       = 34,
	GameRecord_Deleted                       = 35,
	GameRecord_GetRecords                    = 36,
	PlayerBinaryRecord_Created               = 37,
	PlayerBinaryRecord_GetRecord             = 38,
	PlayerBinaryRecord_GetRecords            = 39,
	PlayerBinaryRecord_GetSameRecordsFromUsers = 40,
	PlayerBinaryRecord_GetRecordsByQuery     = 41,
	PlayerBinaryRecord_GetAll                = 42,
	PlayerBinaryRecord_Updated               = 43,
	PlayerBinaryRecord_Deleted               = 44,
	GameBinaryRecord_GetRecord               = 45,
	GameBinaryRecord_GetRecords              = 46,
	GameBinaryRecord_GetRecordsByQuery       = 47,
	Store_Opened                             = 48,
	Store_Closed                             = 49,
	ItemInspect_Opened                       = 50,
	ItemInspect_Closed                       = 51,
	Currency_Updated                         = 52,
	Entitlement_Granted                      = 53,
	Entitlement_Revoked                      = 54,
	CampaignCode_Redeemed                    = 55,
	Item_Fulfilled                           = 56,
	Item_Rewarded                            = 57,
	PaymentConfig_Updated                    = 58,
	Payment_Succeeded                        = 59,
	Payment_Failed                           = 60,
	Subscription_Started                     = 61,
	Subscription_Cancelled                   = 62,
	Wallet_Credited                          = 63,
	Wallet_Debited                           = 64,
	Lobby_Connected                          = 65,
	Lobby_Disconnected                       = 66,
	MPV1_Matchmaking_Started                 = 67,
	MPV1_Matchmaking_MatchNotif_Received     = 68,
	MPV1_Matchmaking_ReadyConsent            = 69,
	MPV1_Matchmaking_RejectMatch             = 70,
	MPV1_Matchmaking_Canceled                = 71,
	MPV1_Party_Joined                        = 72,
	MPV1_Party_Leave                         = 73,
	MPV1_Party_Invite                        = 74,
	MPV1_Party_Kick                          = 75,
	MPV2_GameSession_Created                 = 76,
	MPV2_GameSession_Invited                 = 77,
	MPV2_GameSession_Joined                  = 78,
	MPV2_GameSession_Left                    = 79,
	MPV2_GameSession_LeaderPromoted          = 80,
	MPV2_PartySession_Created                = 81,
	MPV2_PartySession_Invited                = 82,
	MPV2_PartySession_Joined                 = 83,
	MPV2_PartySession_Left                   = 84,
	MPV2_PartySession_Kicked                 = 85,
	MPV2_PartySession_LeaderPromoted         = 86,
	MPV2_Matchmaking_Requested               = 87,
	MPV2_Matchmaking_Started                 = 88,
	MPV2_Matchmaking_Canceled                = 89,
	DS_DSHub_Connected                       = 90,
	DS_DSHub_Disconnected                    = 91,
	DS_Registered                            = 92,
	DS_Unregistered                          = 93,
	DS_Claimed                               = 94,
	DS_MemberChangedNotif_Received           = 95,
	DS_GameClient_Joined                     = 96,
	DS_GameClient_Left                       = 97,
	DS_BackfillProposal_Received             = 98,
	DS_BackfillProposal_Accepted             = 99,
	DS_BackfillProposal_Rejected             = 100,
	FriendRequest_Sent                       = 101,
	FriendRequest_Cancelled                  = 102,
	FriendRequest_Accepted                   = 103,
	FriendRequest_Rejected                   = 104,
	Friend_Unfriended                        = 105,
	User_Blocked                             = 106,
	User_Unblocked                           = 107,
	UserPresence_StatusUpdated               = 108,
	User_Banned                              = 109,
	User_Unbanned                            = 110,
	ChatV2_Connected                         = 111,
	ChatV2_Disconnected                      = 112,
	ChatV2_PersonalTopic_Created             = 113,
	ChatV2_GroupTopic_Created                = 114,
	ChatV2_Topic_Joined                      = 115,
	ChatV2_Topic_Quit                        = 116,
	ChatV2_Topic_UserAdded                   = 117,
	ChatV2_Topic_UserRemoved                 = 118,
	ChatV2_Topic_Updated                     = 119,
	ChatV2_Topic_Deleted                     = 120,
	ChatV2_UserBlocked                       = 121,
	ChatV2_UserUnblocked                     = 122,
	ChatV2_GroupChat_ModeratorMutedUser      = 123,
	ChatV2_GroupChat_ModeratorUnmutedUser    = 124,
	ChatV2_GroupChat_ModeratorBannedUser     = 125,
	ChatV2_GroupChat_ModeratorUnbannedUser   = 126,
	ChatV2_GroupChat_ModeratorDeletedGroupChat = 127,
	Group_Created                            = 128,
	Group_Updated                            = 129,
	Group_CustomAttributesUpdated            = 130,
	Group_CustomRuleUpdated                  = 131,
	Group_PredefinedRuleUpdated              = 132,
	Group_PredefinedRuleDeleted              = 133,
	Group_GetInformation                     = 134,
	Group_Find                               = 135,
	Group_FindByIds                          = 136,
	Group_Joined                             = 137,
	Group_Deleted                            = 138,
	Group_Left                               = 139,
	Group_UserInvited                        = 140,
	Group_InvitationAccepted                 = 141,
	Group_InvitationRejected                 = 142,
	Group_InvitationCanceled                 = 143,
	Group_GetInvitationList                  = 144,
	Group_JoinRequestAccepted                = 145,
	Group_JoinRequestRejected                = 146,
	Group_JoinRequestCanceled                = 147,
	Group_GetJoinRequest                     = 148,
	Group_MemberKicked                       = 149,
	Group_MemberRoleUpdated                  = 150,
	Group_MemberRoleDeleted                  = 151,
	Group_GetGroupMember                     = 152,
	Achievement_Unlocked                     = 153,
	Achievement_GetAll                       = 154,
	Achievement_GetSpecific                  = 155,
	Achievement_GetUserAchievements          = 156,
	GlobalAchievement_Get                    = 157,
	GlobalAchievement_GetContributors        = 158,
	GlobalAchievement_GetContributed         = 159,
	GlobalAchievement_Claimed                = 160,
	Achievement_GetTags                      = 161,
	Leaderboard_GetRankings                  = 162,
	Leaderboard_GetUserRanking               = 163,
	Leaderboard_GetLeaderboards              = 164,
	Leaderboard_GetRankingByCycleId          = 165,
	Leaderboard_GetUsersRankings             = 166,
	SeasonPass_RewardClaimed                 = 167,
	SeasonPass_BulkRewardClaimed             = 168,
	SeasonPass_GetCurrentSeason              = 169,
	SeasonPass_GetUserSpecificSeasonData     = 170,
	SeasonPass_GetUserCurrentSeasonData      = 171,
	Reward_GetRewardByCode                   = 172,
	Reward_GetRewardById                     = 173,
	Reward_GetAllReward                      = 174,
	UGCChannel_Created                       = 175,
	UGCChannel_Updated                       = 176,
	UGCContent_Added                         = 177,
	UGCContent_Deleted                       = 178,
	EAccelBytePredefinedEventName_MAX        = 179,
};

// Enum AccelByteUe4Sdk.EAccelByteGameState
// NumValues: 0x0004
enum class EAccelByteGameState : uint8
{
	OUT_OF_GAMEPLAY                          = 0,
	IN_GAMEPLAY                              = 1,
	STORE                                    = 2,
	EAccelByteGameState_MAX                  = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteReportingCategory
// NumValues: 0x0005
enum class EAccelByteReportingCategory : uint8
{
	UGC                                      = 0,
	USER                                     = 1,
	CHAT                                     = 2,
	EXTENSION                                = 3,
	EAccelByteReportingCategory_MAX          = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonPassSource
// NumValues: 0x0003
enum class EAccelByteSeasonPassSource : uint8
{
	SWEAT                                    = 0,
	PAID_FOR                                 = 1,
	EAccelByteSeasonPassSource_MAX           = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteSeasonPassStrategyMethod
// NumValues: 0x0003
enum class EAccelByteSeasonPassStrategyMethod : uint8
{
	NONE                                     = 0,
	CURRENCY                                 = 1,
	EAccelByteSeasonPassStrategyMethod_MAX   = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteSessionType
// NumValues: 0x0004
enum class EAccelByteSessionType : uint8
{
	NONE                                     = 0,
	p2p                                      = 1,
	dedicated                                = 2,
	EAccelByteSessionType_MAX                = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteV2SessionPlatform
// NumValues: 0x0007
enum class EAccelByteV2SessionPlatform : uint8
{
	Unknown                                  = 0,
	Steam                                    = 1,
	EOS                                      = 2,
	Xbox                                     = 3,
	PS4                                      = 4,
	PS5                                      = 5,
	EAccelByteV2SessionPlatform_MAX          = 6,
};

// Enum AccelByteUe4Sdk.EAccelByteV2SessionType
// NumValues: 0x0004
enum class EAccelByteV2SessionType : uint8
{
	Unknown                                  = 0,
	GameSession                              = 1,
	PartySession                             = 2,
	EAccelByteV2SessionType_MAX              = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteV2SessionQueryComparisonOp
// NumValues: 0x0009
enum class EAccelByteV2SessionQueryComparisonOp : uint8
{
	EQUAL                                    = 0,
	NOT_EQUAL                                = 1,
	GREATER_THAN                             = 2,
	GREATER_THAN_EQUAL                       = 3,
	LESS_THAN                                = 4,
	LESS_THAN_EQUAL                          = 5,
	CONTAINS                                 = 6,
	NOT_CONTAINS                             = 7,
	EAccelByteV2SessionQueryComparisonOp_MAX = 8,
};

// Enum AccelByteUe4Sdk.EAccelByteV2SessionConfigurationServerType
// NumValues: 0x0005
enum class EAccelByteV2SessionConfigurationServerType : uint8
{
	EMPTY                                    = 0,
	NONE                                     = 1,
	DS                                       = 2,
	P2P                                      = 3,
	EAccelByteV2SessionConfigurationServerType_MAX = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteV2GameSessionDsStatus
// NumValues: 0x0009
enum class EAccelByteV2GameSessionDsStatus : uint8
{
	EMPTY                                    = 0,
	NEED_TO_REQUEST                          = 1,
	REQUESTED                                = 2,
	PREPARING                                = 3,
	AVAILABLE                                = 4,
	FAILED_TO_REQUEST                        = 5,
	ENDED                                    = 6,
	UNKNOWN                                  = 7,
	EAccelByteV2GameSessionDsStatus_MAX      = 8,
};

// Enum AccelByteUe4Sdk.EAccelByteV2SessionMemberStatus
// NumValues: 0x000C
enum class EAccelByteV2SessionMemberStatus : uint8
{
	EMPTY                                    = 0,
	INVITED                                  = 1,
	JOINED                                   = 2,
	CONNECTED                                = 3,
	LEFT                                     = 4,
	DROPPED                                  = 5,
	REJECTED                                 = 6,
	KICKED                                   = 7,
	TIMEOUT                                  = 8,
	DISCONNECTED                             = 9,
	TERMINATED                               = 10,
	EAccelByteV2SessionMemberStatus_MAX      = 11,
};

// Enum AccelByteUe4Sdk.EAccelByteV2SessionJoinability
// NumValues: 0x0005
enum class EAccelByteV2SessionJoinability : uint8
{
	EMPTY                                    = 0,
	CLOSED                                   = 1,
	INVITE_ONLY                              = 2,
	OPEN                                     = 3,
	EAccelByteV2SessionJoinability_MAX       = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteStatisticSortBy
// NumValues: 0x000B
enum class EAccelByteStatisticSortBy : uint8
{
	NONE                                     = 0,
	STAT_CODE                                = 1,
	STAT_CODE_ASC                            = 2,
	STAT_CODE_DESC                           = 3,
	CREATED_AT                               = 4,
	CREATED_AT_ASC                           = 5,
	CREATED_AT_DESC                          = 6,
	UPDATED_AT                               = 7,
	UPDATED_AT_ASC                           = 8,
	UPDATED_AT_DESC                          = 9,
	EAccelByteStatisticSortBy_MAX            = 10,
};

// Enum AccelByteUe4Sdk.EAccelByteStatisticUpdateStrategy
// NumValues: 0x0004
enum class EAccelByteStatisticUpdateStrategy : uint8
{
	OVERRIDE                                 = 0,
	INCREMENT                                = 1,
	MAX                                      = 2,
	MIN                                      = 3,
};

// Enum AccelByteUe4Sdk.EAccelByteStatisticStatus
// NumValues: 0x0003
enum class EAccelByteStatisticStatus : uint8
{
	INIT                                     = 0,
	TIED                                     = 1,
	EAccelByteStatisticStatus_MAX            = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteStatisticSetBy
// NumValues: 0x0003
enum class EAccelByteStatisticSetBy : uint8
{
	CLIENT                                   = 0,
	SERVER                                   = 1,
	EAccelByteStatisticSetBy_MAX             = 2,
};

// Enum AccelByteUe4Sdk.EP2PConnectionType
// NumValues: 0x0006
enum class EP2PConnectionType : uint8
{
	None                                     = 0,
	Host                                     = 1,
	Srflx                                    = 2,
	Prflx                                    = 3,
	Relay                                    = 4,
	EP2PConnectionType_MAX                   = 5,
};

// Enum AccelByteUe4Sdk.EAccelByteUGCContentUtilitiesSortByV2
// NumValues: 0x0005
enum class EAccelByteUGCContentUtilitiesSortByV2 : uint8
{
	NONE                                     = 0,
	CREATED_TIME                             = 1,
	CREATED_TIME_ASC                         = 2,
	CREATED_TIME_DESC                        = 3,
	EAccelByteUGCContentUtilitiesSortByV2_MAX = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteUGCContentSortByV2
// NumValues: 0x000D
enum class EAccelByteUGCContentSortByV2 : uint8
{
	NAME                                     = 0,
	NAME_ASC                                 = 1,
	NAME_DESC                                = 2,
	DOWNLOAD                                 = 3,
	DOWNLOAD_ASC                             = 4,
	DOWNLOAD_DESC                            = 5,
	LIKE                                     = 6,
	LIKE_ASC                                 = 7,
	LIKE_DESC                                = 8,
	CREATED_TIME                             = 9,
	CREATED_TIME_ASC                         = 10,
	CREATED_TIME_DESC                        = 11,
	EAccelByteUGCContentSortByV2_MAX         = 12,
};

// Enum AccelByteUe4Sdk.EAccelByteUgcOrderBy
// NumValues: 0x0003
enum class EAccelByteUgcOrderBy : uint8
{
	ASC                                      = 0,
	DESC                                     = 1,
	EAccelByteUgcOrderBy_MAX                 = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteLikedContentSortBy
// NumValues: 0x0005
enum class EAccelByteLikedContentSortBy : uint8
{
	NAME                                     = 0,
	DOWNLOAD                                 = 1,
	LIKE                                     = 2,
	DATE                                     = 3,
	EAccelByteLikedContentSortBy_MAX         = 4,
};

// Enum AccelByteUe4Sdk.EAccelByteUgcSortBy
// NumValues: 0x0006
enum class EAccelByteUgcSortBy : uint8
{
	NAME                                     = 0,
	DOWNLOAD                                 = 1,
	LIKE                                     = 2,
	DATE                                     = 3,
	UPDATED_TIME                             = 4,
	EAccelByteUgcSortBy_MAX                  = 5,
};

// Enum AccelByteUe4Sdk.EVerificationContext
// NumValues: 0x0004
enum class EVerificationContext : uint8
{
	UserAccountRegistration                  = 0,
	UpdateEmailAddress                       = 1,
	upgradeHeadlessAccount                   = 2,
	EVerificationContext_MAX                 = 3,
};

// Enum AccelByteUe4Sdk.EBanType
// NumValues: 0x000A
enum class EBanType : uint8
{
	EMPTY                                    = 0,
	LOGIN                                    = 1,
	CHAT_SEND                                = 2,
	CHAT_ALL                                 = 3,
	ORDER_AND_PAYMENT                        = 4,
	STATISTIC                                = 5,
	LEADERBOARD                              = 6,
	MATCHMAKING                              = 7,
	UGC_CREATE_UPDATE                        = 8,
	EBanType_MAX                             = 9,
};

// Enum AccelByteUe4Sdk.EAccelByteSearchType
// NumValues: 0x0004
enum class EAccelByteSearchType : uint8
{
	ALL                                      = 0,
	DISPLAYNAME                              = 1,
	USERNAME                                 = 2,
	EAccelByteSearchType_MAX                 = 3,
};

// Enum AccelByteUe4Sdk.EAccelBytePlatformType
// NumValues: 0x0017
enum class EAccelBytePlatformType : uint8
{
	Steam                                    = 0,
	PS4                                      = 1,
	PS4CrossGen                              = 2,
	PS5                                      = 3,
	Live                                     = 4,
	Google                                   = 5,
	Apple                                    = 6,
	Facebook                                 = 7,
	Android                                  = 8,
	iOS                                      = 9,
	Device                                   = 10,
	Twitch                                   = 11,
	Oculus                                   = 12,
	Twitter                                  = 13,
	EpicGames                                = 14,
	AwsCognito                               = 15,
	Discord                                  = 16,
	Nintendo                                 = 17,
	SnapChat                                 = 18,
	EAOrigin                                 = 19,
	PS4Web                                   = 20,
	Unset                                    = 255,
	EAccelBytePlatformType_MAX               = 256,
};

// Enum AccelByteUe4Sdk.EAccelByteLoginAuthFactorType
// NumValues: 0x0003
enum class EAccelByteLoginAuthFactorType : uint8
{
	Authenticator                            = 0,
	BackupCode                               = 1,
	EAccelByteLoginAuthFactorType_MAX        = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteUploadCategory
// NumValues: 0x0003
enum class EAccelByteUploadCategory : uint8
{
	DEFAULT                                  = 0,
	REPORTING                                = 1,
	EAccelByteUploadCategory_MAX             = 2,
};

// Enum AccelByteUe4Sdk.EAccelByteDevModeDeviceIdMethod
// NumValues: 0x0006
enum class EAccelByteDevModeDeviceIdMethod : uint8
{
	UNSPECIFIED                              = 0,
	COMMANDLINE                              = 1,
	PICK_RANDOM                              = 2,
	RANDOMIZE                                = 3,
	PERSISTENT                               = 4,
	EAccelByteDevModeDeviceIdMethod_MAX      = 5,
};

// ScriptStruct AccelByteUe4Sdk.BannedBy
// 0x0020 (0x0020 - 0x0000)
struct FBannedBy final
{
public:
	class FString                                 DisplayName;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBannedBy) == 0x000008, "Wrong alignment on FBannedBy");
static_assert(sizeof(FBannedBy) == 0x000020, "Wrong size on FBannedBy");
static_assert(offsetof(FBannedBy, DisplayName) == 0x000000, "Member 'FBannedBy::DisplayName' has a wrong offset!");
static_assert(offsetof(FBannedBy, UserId) == 0x000010, "Member 'FBannedBy::UserId' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.BanUserResponse
// 0x00B0 (0x00B0 - 0x0000)
struct FBanUserResponse final
{
public:
	class FString                                 Ban;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 BanId;                                             // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBannedBy                              BannedBy;                                          // 0x0020(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 Comment;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CreatedAt;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DisableDate;                                       // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Enabled;                                           // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EndDate;                                           // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Namespace;                                         // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBanReason                                    Reason;                                            // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 UserId;                                            // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FBanUserResponse) == 0x000008, "Wrong alignment on FBanUserResponse");
static_assert(sizeof(FBanUserResponse) == 0x0000B0, "Wrong size on FBanUserResponse");
static_assert(offsetof(FBanUserResponse, Ban) == 0x000000, "Member 'FBanUserResponse::Ban' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, BanId) == 0x000010, "Member 'FBanUserResponse::BanId' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, BannedBy) == 0x000020, "Member 'FBanUserResponse::BannedBy' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, Comment) == 0x000040, "Member 'FBanUserResponse::Comment' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, CreatedAt) == 0x000050, "Member 'FBanUserResponse::CreatedAt' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, DisableDate) == 0x000060, "Member 'FBanUserResponse::DisableDate' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, Enabled) == 0x000070, "Member 'FBanUserResponse::Enabled' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, EndDate) == 0x000078, "Member 'FBanUserResponse::EndDate' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, Namespace) == 0x000088, "Member 'FBanUserResponse::Namespace' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, Reason) == 0x000098, "Member 'FBanUserResponse::Reason' has a wrong offset!");
static_assert(offsetof(FBanUserResponse, UserId) == 0x0000A0, "Member 'FBanUserResponse::UserId' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsPaging
// 0x0040 (0x0040 - 0x0000)
struct FAccelByteModelsPaging final
{
public:
	class FString                                 First;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Last;                                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Next;                                              // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Previous;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAccelByteModelsPaging) == 0x000008, "Wrong alignment on FAccelByteModelsPaging");
static_assert(sizeof(FAccelByteModelsPaging) == 0x000040, "Wrong size on FAccelByteModelsPaging");
static_assert(offsetof(FAccelByteModelsPaging, First) == 0x000000, "Member 'FAccelByteModelsPaging::First' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPaging, Last) == 0x000010, "Member 'FAccelByteModelsPaging::Last' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPaging, Next) == 0x000020, "Member 'FAccelByteModelsPaging::Next' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsPaging, Previous) == 0x000030, "Member 'FAccelByteModelsPaging::Previous' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.GetUserBansResponse
// 0x0050 (0x0050 - 0x0000)
struct FGetUserBansResponse final
{
public:
	TArray<struct FBanUserResponse>               Data;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAccelByteModelsPaging                 Paging;                                            // 0x0010(0x0040)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FGetUserBansResponse) == 0x000008, "Wrong alignment on FGetUserBansResponse");
static_assert(sizeof(FGetUserBansResponse) == 0x000050, "Wrong size on FGetUserBansResponse");
static_assert(offsetof(FGetUserBansResponse, Data) == 0x000000, "Member 'FGetUserBansResponse::Data' has a wrong offset!");
static_assert(offsetof(FGetUserBansResponse, Paging) == 0x000010, "Member 'FGetUserBansResponse::Paging' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsItemLootBoxItem
// 0x0048 (0x0048 - 0x0000)
struct FAccelByteModelsItemLootBoxItem final
{
public:
	class FString                                 ItemId;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemSku;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ItemType;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Duration;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              EndDate;                                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Count;                                             // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FAccelByteModelsItemLootBoxItem) == 0x000008, "Wrong alignment on FAccelByteModelsItemLootBoxItem");
static_assert(sizeof(FAccelByteModelsItemLootBoxItem) == 0x000048, "Wrong size on FAccelByteModelsItemLootBoxItem");
static_assert(offsetof(FAccelByteModelsItemLootBoxItem, ItemId) == 0x000000, "Member 'FAccelByteModelsItemLootBoxItem::ItemId' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsItemLootBoxItem, ItemSku) == 0x000010, "Member 'FAccelByteModelsItemLootBoxItem::ItemSku' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsItemLootBoxItem, ItemType) == 0x000020, "Member 'FAccelByteModelsItemLootBoxItem::ItemType' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsItemLootBoxItem, Duration) == 0x000030, "Member 'FAccelByteModelsItemLootBoxItem::Duration' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsItemLootBoxItem, EndDate) == 0x000038, "Member 'FAccelByteModelsItemLootBoxItem::EndDate' has a wrong offset!");
static_assert(offsetof(FAccelByteModelsItemLootBoxItem, Count) == 0x000040, "Member 'FAccelByteModelsItemLootBoxItem::Count' has a wrong offset!");

// ScriptStruct AccelByteUe4Sdk.AccelByteModelsItemReward
// 0x0030 (0x0030 - 0x0000)
struct FAccelByteModelsItemReward final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAccelByteLootBoxRewardType                   Type;                                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
