#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AccelByteCustomization

#include "Basic.hpp"


namespace SDK::Params
{

// Function AccelByteCustomization.AccelByteBlueprintsCustomizationSettings.GetChallengeServerUrl
// 0x0010 (0x0010 - 0x0000)
struct AccelByteBlueprintsCustomizationSettings_GetChallengeServerUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteBlueprintsCustomizationSettings_GetChallengeServerUrl) == 0x000008, "Wrong alignment on AccelByteBlueprintsCustomizationSettings_GetChallengeServerUrl");
static_assert(sizeof(AccelByteBlueprintsCustomizationSettings_GetChallengeServerUrl) == 0x000010, "Wrong size on AccelByteBlueprintsCustomizationSettings_GetChallengeServerUrl");
static_assert(offsetof(AccelByteBlueprintsCustomizationSettings_GetChallengeServerUrl, ReturnValue) == 0x000000, "Member 'AccelByteBlueprintsCustomizationSettings_GetChallengeServerUrl::ReturnValue' has a wrong offset!");

// Function AccelByteCustomization.AccelByteBlueprintsCustomizationSettings.SetChallengeServerUrl
// 0x0010 (0x0010 - 0x0000)
struct AccelByteBlueprintsCustomizationSettings_SetChallengeServerUrl final
{
public:
	class FString                                 ChallengeServerUrl;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AccelByteBlueprintsCustomizationSettings_SetChallengeServerUrl) == 0x000008, "Wrong alignment on AccelByteBlueprintsCustomizationSettings_SetChallengeServerUrl");
static_assert(sizeof(AccelByteBlueprintsCustomizationSettings_SetChallengeServerUrl) == 0x000010, "Wrong size on AccelByteBlueprintsCustomizationSettings_SetChallengeServerUrl");
static_assert(offsetof(AccelByteBlueprintsCustomizationSettings_SetChallengeServerUrl, ChallengeServerUrl) == 0x000000, "Member 'AccelByteBlueprintsCustomizationSettings_SetChallengeServerUrl::ChallengeServerUrl' has a wrong offset!");

}

