#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BlueprintFX_Functions

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BlueprintFX_Functions.BlueprintFX_Functions_C.VFX Prop Dest Surface Glass
// 0x0040 (0x0040 - 0x0000)
struct BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass final
{
public:
	class UStaticMeshComponent*                   StaticMeshComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleSizeMultiplier;                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParticleCount;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass) == 0x000008, "Wrong alignment on BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass");
static_assert(sizeof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass) == 0x000040, "Wrong size on BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass, StaticMeshComponent) == 0x000000, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass::StaticMeshComponent' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass, ParticleSizeMultiplier) == 0x000008, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass::ParticleSizeMultiplier' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass, ParticleCount) == 0x00000C, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass::ParticleCount' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass, Color) == 0x000010, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass::Color' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass, __WorldContext) == 0x000020, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000028, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass, CallFunc_IsDedicatedServer_ReturnValue) == 0x000034, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000038, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BlueprintFX_Functions.BlueprintFX_Functions_C.VFX Prop Cosmetic Destruction
// 0x00E8 (0x00E8 - 0x0000)
struct BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnProbability;                                  // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ObjectReference;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseObjectLocation;                                 // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ObjectLocationOffset;                              // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ObjectRotationOffset;                              // 0x0028(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Random_Area_Multiplier;                            // 0x0034(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         Niagara_FX;                                        // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0048(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RandomUnitVector_ReturnValue;             // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Select_Default;                             // 0x009C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorFloat_ReturnValue;         // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction) == 0x000008, "Wrong alignment on BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction");
static_assert(sizeof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction) == 0x0000E8, "Wrong size on BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, HitLocation) == 0x000000, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::HitLocation' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, SpawnProbability) == 0x00000C, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::SpawnProbability' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, ObjectReference) == 0x000010, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::ObjectReference' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, UseObjectLocation) == 0x000018, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::UseObjectLocation' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, ObjectLocationOffset) == 0x00001C, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::ObjectLocationOffset' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, ObjectRotationOffset) == 0x000028, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::ObjectRotationOffset' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, Random_Area_Multiplier) == 0x000034, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::Random_Area_Multiplier' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, Niagara_FX) == 0x000040, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::Niagara_FX' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, __WorldContext) == 0x000048, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, Temp_bool_Variable) == 0x000050, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000054, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_ComposeRotators_ReturnValue) == 0x000060, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00006C, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_RandomUnitVector_ReturnValue) == 0x000078, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_RandomUnitVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_Add_VectorVector_ReturnValue) == 0x000084, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000090, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, K2Node_Select_Default) == 0x00009C, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_Subtract_VectorFloat_ReturnValue) == 0x0000A8, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_Subtract_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_RandomFloat_ReturnValue) == 0x0000B4, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_Normal_ReturnValue) == 0x0000B8, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000C4, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000C8, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0000D4, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000E0, "Member 'BlueprintFX_Functions_C_VFX_Prop_Cosmetic_Destruction::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BlueprintFX_Functions.BlueprintFX_Functions_C.VFX Prop Dest Surface Glass Loc
// 0x0048 (0x0048 - 0x0000)
struct BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ParticleSizeMultiplier;                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ParticleCount;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0014(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      ParticleSystem;                                    // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc) == 0x000008, "Wrong alignment on BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc");
static_assert(sizeof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc) == 0x000048, "Wrong size on BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc, Location) == 0x000000, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc::Location' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc, ParticleSizeMultiplier) == 0x00000C, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc::ParticleSizeMultiplier' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc, ParticleCount) == 0x000010, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc::ParticleCount' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc, Color) == 0x000014, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc::Color' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc, __WorldContext) == 0x000028, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc::__WorldContext' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc, ParticleSystem) == 0x000030, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc::ParticleSystem' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc, CallFunc_IsDedicatedServer_ReturnValue) == 0x000038, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000040, "Member 'BlueprintFX_Functions_C_VFX_Prop_Dest_Surface_Glass_Loc::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

}

