#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ArmorRepairKit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ArmorRepairKit.BP_ArmorRepairKit_C
// 0x0040 (0x0580 - 0x0540)
class ABP_ArmorRepairKit_C final : public ASBZArmorRepairKit
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0540(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZShoutTargetComponent*               SBZShoutTarget;                                    // 0x0548(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ArmorRepairKitMesh_4;                           // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ArmorRepairKitMesh_3;                           // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ArmorRepairKitMesh_2;                           // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ArmorRepairKitMesh_1;                           // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ArmorRepairKitMesh;                             // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ArmorRepairKit(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnChargesChanged(float ChargesChangeTo, bool bDoCosmetics);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ArmorRepairKit_C">();
	}
	static class ABP_ArmorRepairKit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ArmorRepairKit_C>();
	}
};
static_assert(alignof(ABP_ArmorRepairKit_C) == 0x000010, "Wrong alignment on ABP_ArmorRepairKit_C");
static_assert(sizeof(ABP_ArmorRepairKit_C) == 0x000580, "Wrong size on ABP_ArmorRepairKit_C");
static_assert(offsetof(ABP_ArmorRepairKit_C, UberGraphFrame) == 0x000540, "Member 'ABP_ArmorRepairKit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ArmorRepairKit_C, SBZShoutTarget) == 0x000548, "Member 'ABP_ArmorRepairKit_C::SBZShoutTarget' has a wrong offset!");
static_assert(offsetof(ABP_ArmorRepairKit_C, SM_ArmorRepairKitMesh_4) == 0x000550, "Member 'ABP_ArmorRepairKit_C::SM_ArmorRepairKitMesh_4' has a wrong offset!");
static_assert(offsetof(ABP_ArmorRepairKit_C, SM_ArmorRepairKitMesh_3) == 0x000558, "Member 'ABP_ArmorRepairKit_C::SM_ArmorRepairKitMesh_3' has a wrong offset!");
static_assert(offsetof(ABP_ArmorRepairKit_C, SM_ArmorRepairKitMesh_2) == 0x000560, "Member 'ABP_ArmorRepairKit_C::SM_ArmorRepairKitMesh_2' has a wrong offset!");
static_assert(offsetof(ABP_ArmorRepairKit_C, SM_ArmorRepairKitMesh_1) == 0x000568, "Member 'ABP_ArmorRepairKit_C::SM_ArmorRepairKitMesh_1' has a wrong offset!");
static_assert(offsetof(ABP_ArmorRepairKit_C, SM_ArmorRepairKitMesh) == 0x000570, "Member 'ABP_ArmorRepairKit_C::SM_ArmorRepairKitMesh' has a wrong offset!");

}

