#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseMovingInteractable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseMovingInteractable.BP_BaseMovingInteractable_C
// 0x0048 (0x0310 - 0x02C8)
class ABP_BaseMovingInteractable_C : public ASBZStaticInteractionBinaryState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         MoveTimeLine_MoveDelta_27983FB14A284A0D7A681685AF58BF1E; // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            MoveTimeLine__Direction_27983FB14A284A0D7A681685AF58BF1E; // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     MoveTimeLine;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MoveEndPosition;                                   // 0x02F8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                IniitialPosition;                                  // 0x0304(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BaseMovingInteractable(int32 EntryPoint);
	void BP_OnStateChanged(bool bNewState, bool bDoCosmentics);
	void MoveTimeLine__UpdateFunc();
	void MoveTimeLine__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BaseMovingInteractable_C">();
	}
	static class ABP_BaseMovingInteractable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseMovingInteractable_C>();
	}
};
static_assert(alignof(ABP_BaseMovingInteractable_C) == 0x000008, "Wrong alignment on ABP_BaseMovingInteractable_C");
static_assert(sizeof(ABP_BaseMovingInteractable_C) == 0x000310, "Wrong size on ABP_BaseMovingInteractable_C");
static_assert(offsetof(ABP_BaseMovingInteractable_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_BaseMovingInteractable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BaseMovingInteractable_C, SBZOutline) == 0x0002D0, "Member 'ABP_BaseMovingInteractable_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_BaseMovingInteractable_C, StaticMesh) == 0x0002D8, "Member 'ABP_BaseMovingInteractable_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_BaseMovingInteractable_C, DefaultSceneRoot) == 0x0002E0, "Member 'ABP_BaseMovingInteractable_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BaseMovingInteractable_C, MoveTimeLine_MoveDelta_27983FB14A284A0D7A681685AF58BF1E) == 0x0002E8, "Member 'ABP_BaseMovingInteractable_C::MoveTimeLine_MoveDelta_27983FB14A284A0D7A681685AF58BF1E' has a wrong offset!");
static_assert(offsetof(ABP_BaseMovingInteractable_C, MoveTimeLine__Direction_27983FB14A284A0D7A681685AF58BF1E) == 0x0002EC, "Member 'ABP_BaseMovingInteractable_C::MoveTimeLine__Direction_27983FB14A284A0D7A681685AF58BF1E' has a wrong offset!");
static_assert(offsetof(ABP_BaseMovingInteractable_C, MoveTimeLine) == 0x0002F0, "Member 'ABP_BaseMovingInteractable_C::MoveTimeLine' has a wrong offset!");
static_assert(offsetof(ABP_BaseMovingInteractable_C, MoveEndPosition) == 0x0002F8, "Member 'ABP_BaseMovingInteractable_C::MoveEndPosition' has a wrong offset!");
static_assert(offsetof(ABP_BaseMovingInteractable_C, IniitialPosition) == 0x000304, "Member 'ABP_BaseMovingInteractable_C::IniitialPosition' has a wrong offset!");

}

