#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseBagSecured

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BaseBagSecured.BP_BaseBagSecured_C.ExecuteUbergraph_BP_BaseBagSecured
// 0x0030 (0x0030 - 0x0000)
struct BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured) == 0x000008, "Wrong alignment on BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured");
static_assert(sizeof(BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured) == 0x000030, "Wrong size on BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured");
static_assert(offsetof(BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured, EntryPoint) == 0x000000, "Member 'BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000004, "Member 'BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured, K2Node_Event_bDoCosmetics) == 0x000010, "Member 'BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000014, "Member 'BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured, CallFunc_PostEventAtLocation_ReturnValue) == 0x000020, "Member 'BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000028, "Member 'BP_BaseBagSecured_C_ExecuteUbergraph_BP_BaseBagSecured::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_BaseBagSecured.BP_BaseBagSecured_C.OnPlaced
// 0x0001 (0x0001 - 0x0000)
struct BP_BaseBagSecured_C_OnPlaced final
{
public:
	bool                                          bDoCosmetics;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseBagSecured_C_OnPlaced) == 0x000001, "Wrong alignment on BP_BaseBagSecured_C_OnPlaced");
static_assert(sizeof(BP_BaseBagSecured_C_OnPlaced) == 0x000001, "Wrong size on BP_BaseBagSecured_C_OnPlaced");
static_assert(offsetof(BP_BaseBagSecured_C_OnPlaced, bDoCosmetics) == 0x000000, "Member 'BP_BaseBagSecured_C_OnPlaced::bDoCosmetics' has a wrong offset!");

}

