#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BackItemMethBagPure

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BackItemMethBagPure.BP_BackItemMethBagPure_C
// 0x0018 (0x0318 - 0x0300)
class ABP_BackItemMethBagPure_C final : public ASBZCarriedBag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ASBZCharacter*                          Interactor;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        InterComp;                                         // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BackItemMethBagPure(int32 EntryPoint);
	void BP_AttachmentComplete(class USkeletalMeshComponent* ParentSkeletalMeshComponent);
	void BP_AdjustAttachment(int32 Index_0, int32 NewCount, const struct FTransform& NewStrapTransformOffset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BackItemMethBagPure_C">();
	}
	static class ABP_BackItemMethBagPure_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BackItemMethBagPure_C>();
	}
};
static_assert(alignof(ABP_BackItemMethBagPure_C) == 0x000008, "Wrong alignment on ABP_BackItemMethBagPure_C");
static_assert(sizeof(ABP_BackItemMethBagPure_C) == 0x000318, "Wrong size on ABP_BackItemMethBagPure_C");
static_assert(offsetof(ABP_BackItemMethBagPure_C, UberGraphFrame) == 0x000300, "Member 'ABP_BackItemMethBagPure_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BackItemMethBagPure_C, Interactor) == 0x000308, "Member 'ABP_BackItemMethBagPure_C::Interactor' has a wrong offset!");
static_assert(offsetof(ABP_BackItemMethBagPure_C, InterComp) == 0x000310, "Member 'ABP_BackItemMethBagPure_C::InterComp' has a wrong offset!");

}

