#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BackItemBagBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_BackItemBagBase.BP_BackItemBagBase_C.ExecuteUbergraph_BP_BackItemBagBase
// 0x0080 (0x0080 - 0x0000)
struct BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_Event_ParentSkeletalMeshComponent;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_NewCount;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_Event_NewStrapTransformOffset;              // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_TPPlayerBase_Moneybag_C*           K2Node_DynamicCast_AsABP_TPPlayer_Base_Moneybag;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_TPPlayerBase_Moneybag_C*           K2Node_DynamicCast_AsABP_TPPlayer_Base_Moneybag_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase) == 0x000010, "Wrong alignment on BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase");
static_assert(sizeof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase) == 0x000080, "Wrong size on BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, EntryPoint) == 0x000000, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, K2Node_Event_ParentSkeletalMeshComponent) == 0x000008, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::K2Node_Event_ParentSkeletalMeshComponent' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, K2Node_Event_Index) == 0x000010, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, K2Node_Event_NewCount) == 0x000014, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::K2Node_Event_NewCount' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, K2Node_Event_NewStrapTransformOffset) == 0x000020, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::K2Node_Event_NewStrapTransformOffset' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, CallFunc_GetAnimInstance_ReturnValue) == 0x000050, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, K2Node_DynamicCast_AsABP_TPPlayer_Base_Moneybag) == 0x000058, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::K2Node_DynamicCast_AsABP_TPPlayer_Base_Moneybag' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, K2Node_DynamicCast_AsABP_TPPlayer_Base_Moneybag_1) == 0x000068, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::K2Node_DynamicCast_AsABP_TPPlayer_Base_Moneybag_1' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'BP_BackItemBagBase_C_ExecuteUbergraph_BP_BackItemBagBase::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_BackItemBagBase.BP_BackItemBagBase_C.BP_AttachmentComplete
// 0x0008 (0x0008 - 0x0000)
struct BP_BackItemBagBase_C_BP_AttachmentComplete final
{
public:
	class USkeletalMeshComponent*                 ParentSkeletalMeshComponent;                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BackItemBagBase_C_BP_AttachmentComplete) == 0x000008, "Wrong alignment on BP_BackItemBagBase_C_BP_AttachmentComplete");
static_assert(sizeof(BP_BackItemBagBase_C_BP_AttachmentComplete) == 0x000008, "Wrong size on BP_BackItemBagBase_C_BP_AttachmentComplete");
static_assert(offsetof(BP_BackItemBagBase_C_BP_AttachmentComplete, ParentSkeletalMeshComponent) == 0x000000, "Member 'BP_BackItemBagBase_C_BP_AttachmentComplete::ParentSkeletalMeshComponent' has a wrong offset!");

// Function BP_BackItemBagBase.BP_BackItemBagBase_C.BP_AdjustAttachment
// 0x0040 (0x0040 - 0x0000)
struct BP_BackItemBagBase_C_BP_AdjustAttachment final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NewCount;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NewStrapTransformOffset;                           // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BackItemBagBase_C_BP_AdjustAttachment) == 0x000010, "Wrong alignment on BP_BackItemBagBase_C_BP_AdjustAttachment");
static_assert(sizeof(BP_BackItemBagBase_C_BP_AdjustAttachment) == 0x000040, "Wrong size on BP_BackItemBagBase_C_BP_AdjustAttachment");
static_assert(offsetof(BP_BackItemBagBase_C_BP_AdjustAttachment, Index_0) == 0x000000, "Member 'BP_BackItemBagBase_C_BP_AdjustAttachment::Index_0' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_BP_AdjustAttachment, NewCount) == 0x000004, "Member 'BP_BackItemBagBase_C_BP_AdjustAttachment::NewCount' has a wrong offset!");
static_assert(offsetof(BP_BackItemBagBase_C_BP_AdjustAttachment, NewStrapTransformOffset) == 0x000010, "Member 'BP_BackItemBagBase_C_BP_AdjustAttachment::NewStrapTransformOffset' has a wrong offset!");

}

