#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BreachingEquipmentFuelTank

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BreachingEquipmentFuelTank.BP_BreachingEquipmentFuelTank_C
// 0x0058 (0x0330 - 0x02D8)
class ABP_BreachingEquipmentFuelTank_C final : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAIObjectiveComponent*               SBZAIObjective;                                    // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              Interactable;                                      // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor)> OnAckCompleteInteraction; // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              onPickedUp;                                        // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_BreachingEquipmentFuelTank(int32 EntryPoint);
	void BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void OnStateChanged(bool bStateToChangeTo, bool bDoCosmetics);
	void BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BreachingEquipmentFuelTank_C">();
	}
	static class ABP_BreachingEquipmentFuelTank_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BreachingEquipmentFuelTank_C>();
	}
};
static_assert(alignof(ABP_BreachingEquipmentFuelTank_C) == 0x000008, "Wrong alignment on ABP_BreachingEquipmentFuelTank_C");
static_assert(sizeof(ABP_BreachingEquipmentFuelTank_C) == 0x000330, "Wrong size on ABP_BreachingEquipmentFuelTank_C");
static_assert(offsetof(ABP_BreachingEquipmentFuelTank_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_BreachingEquipmentFuelTank_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BreachingEquipmentFuelTank_C, SBZOutline) == 0x0002E0, "Member 'ABP_BreachingEquipmentFuelTank_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_BreachingEquipmentFuelTank_C, Ak) == 0x0002E8, "Member 'ABP_BreachingEquipmentFuelTank_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_BreachingEquipmentFuelTank_C, SBZAIObjective) == 0x0002F0, "Member 'ABP_BreachingEquipmentFuelTank_C::SBZAIObjective' has a wrong offset!");
static_assert(offsetof(ABP_BreachingEquipmentFuelTank_C, Interactable) == 0x0002F8, "Member 'ABP_BreachingEquipmentFuelTank_C::Interactable' has a wrong offset!");
static_assert(offsetof(ABP_BreachingEquipmentFuelTank_C, Mesh) == 0x000300, "Member 'ABP_BreachingEquipmentFuelTank_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_BreachingEquipmentFuelTank_C, DefaultSceneRoot) == 0x000308, "Member 'ABP_BreachingEquipmentFuelTank_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_BreachingEquipmentFuelTank_C, OnAckCompleteInteraction) == 0x000310, "Member 'ABP_BreachingEquipmentFuelTank_C::OnAckCompleteInteraction' has a wrong offset!");
static_assert(offsetof(ABP_BreachingEquipmentFuelTank_C, onPickedUp) == 0x000320, "Member 'ABP_BreachingEquipmentFuelTank_C::onPickedUp' has a wrong offset!");

}

