#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BreachingEquipmentFuelTank

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_BreachingEquipmentFuelTank.BP_BreachingEquipmentFuelTank_C.ExecuteUbergraph_BP_BreachingEquipmentFuelTank
// 0x0058 (0x0058 - 0x0000)
struct BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0004(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable_1;         // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor_1;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0030(0x0010)(ConstParm, ReferenceParm)
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank) == 0x000008, "Wrong alignment on BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank");
static_assert(sizeof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank) == 0x000058, "Wrong size on BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, EntryPoint) == 0x000000, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, Temp_delegate_Variable) == 0x000004, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, K2Node_ComponentBoundEvent_Interactable_1) == 0x000018, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, K2Node_ComponentBoundEvent_Interactor_1) == 0x000020, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::K2Node_ComponentBoundEvent_Interactor_1' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1) == 0x000028, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, K2Node_Event_bStateToChangeTo) == 0x000029, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, K2Node_Event_bDoCosmetics) == 0x00002A, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, Temp_struct_Variable) == 0x000030, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, K2Node_ComponentBoundEvent_Interactable) == 0x000040, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, K2Node_ComponentBoundEvent_Interactor) == 0x000048, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000050, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank, CallFunc_PostEvent_ReturnValue) == 0x000054, "Member 'BP_BreachingEquipmentFuelTank_C_ExecuteUbergraph_BP_BreachingEquipmentFuelTank::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function BP_BreachingEquipmentFuelTank.BP_BreachingEquipmentFuelTank_C.BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_BreachingEquipmentFuelTank_C_BndEvt__BP_BreachingEquipmentFuelTank_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_BreachingEquipmentFuelTank.BP_BreachingEquipmentFuelTank_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_BreachingEquipmentFuelTank_C_OnStateChanged final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreachingEquipmentFuelTank_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_BreachingEquipmentFuelTank_C_OnStateChanged");
static_assert(sizeof(BP_BreachingEquipmentFuelTank_C_OnStateChanged) == 0x000002, "Wrong size on BP_BreachingEquipmentFuelTank_C_OnStateChanged");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_OnStateChanged, bStateToChangeTo) == 0x000000, "Member 'BP_BreachingEquipmentFuelTank_C_OnStateChanged::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_OnStateChanged, bDoCosmetics) == 0x000001, "Member 'BP_BreachingEquipmentFuelTank_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

// Function BP_BreachingEquipmentFuelTank.BP_BreachingEquipmentFuelTank_C.BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_BreachingEquipmentFuelTank_C_BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

}

