#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseMovingInteractable

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_BaseMovingInteractable.BP_BaseMovingInteractable_C.ExecuteUbergraph_BP_BaseMovingInteractable
// 0x00C4 (0x00C4 - 0x0000)
struct BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewState;                            // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmentics;                        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default;                             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0030(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable) == 0x000004, "Wrong alignment on BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable");
static_assert(sizeof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable) == 0x0000C4, "Wrong size on BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, EntryPoint) == 0x000000, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, Temp_bool_Variable) == 0x000004, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, Temp_float_Variable) == 0x000008, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, K2Node_Event_bNewState) == 0x00000C, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::K2Node_Event_bNewState' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, K2Node_Event_bDoCosmentics) == 0x00000D, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::K2Node_Event_bDoCosmentics' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, CallFunc_GetTimelineLength_ReturnValue) == 0x000010, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, K2Node_Select_Default) == 0x000014, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, CallFunc_Add_VectorVector_ReturnValue) == 0x000018, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, CallFunc_VLerp_ReturnValue) == 0x000024, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000030, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0000C0, "Member 'BP_BaseMovingInteractable_C_ExecuteUbergraph_BP_BaseMovingInteractable::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_BaseMovingInteractable.BP_BaseMovingInteractable_C.BP_OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_BaseMovingInteractable_C_BP_OnStateChanged final
{
public:
	bool                                          bNewState;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmentics;                                     // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseMovingInteractable_C_BP_OnStateChanged) == 0x000001, "Wrong alignment on BP_BaseMovingInteractable_C_BP_OnStateChanged");
static_assert(sizeof(BP_BaseMovingInteractable_C_BP_OnStateChanged) == 0x000002, "Wrong size on BP_BaseMovingInteractable_C_BP_OnStateChanged");
static_assert(offsetof(BP_BaseMovingInteractable_C_BP_OnStateChanged, bNewState) == 0x000000, "Member 'BP_BaseMovingInteractable_C_BP_OnStateChanged::bNewState' has a wrong offset!");
static_assert(offsetof(BP_BaseMovingInteractable_C_BP_OnStateChanged, bDoCosmentics) == 0x000001, "Member 'BP_BaseMovingInteractable_C_BP_OnStateChanged::bDoCosmentics' has a wrong offset!");

// Function BP_BaseMovingInteractable.BP_BaseMovingInteractable_C.UserConstructionScript
// 0x000C (0x000C - 0x0000)
struct BP_BaseMovingInteractable_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BaseMovingInteractable_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_BaseMovingInteractable_C_UserConstructionScript");
static_assert(sizeof(BP_BaseMovingInteractable_C_UserConstructionScript) == 0x00000C, "Wrong size on BP_BaseMovingInteractable_C_UserConstructionScript");
static_assert(offsetof(BP_BaseMovingInteractable_C_UserConstructionScript, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000000, "Member 'BP_BaseMovingInteractable_C_UserConstructionScript::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");

}

