#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseSabotagePoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BaseSabotagePoint.BP_BaseSabotagePoint_C
// 0x0048 (0x03A0 - 0x0358)
class ABP_BaseSabotagePoint_C : public ASBZSabotagePoint
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              initial_SBZInteractable;                           // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAIObjectiveComponent*               SBZAIObjective;                                    // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              onSabotageCompleteInteraction;                     // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          isInteractableFromStart;                           // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              onInteraction;                                     // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_BaseSabotagePoint(int32 EntryPoint);
	void BndEvt__BP_BaseSabotagePoint_initial_SBZInteractable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BndEvt__BP_BaseSabotagePoint_InteractableComponent_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void UserConstructionScript();
	void setInitialInteraction(bool enabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BaseSabotagePoint_C">();
	}
	static class ABP_BaseSabotagePoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BaseSabotagePoint_C>();
	}
};
static_assert(alignof(ABP_BaseSabotagePoint_C) == 0x000008, "Wrong alignment on ABP_BaseSabotagePoint_C");
static_assert(sizeof(ABP_BaseSabotagePoint_C) == 0x0003A0, "Wrong size on ABP_BaseSabotagePoint_C");
static_assert(offsetof(ABP_BaseSabotagePoint_C, UberGraphFrame) == 0x000358, "Member 'ABP_BaseSabotagePoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BaseSabotagePoint_C, SBZOutline) == 0x000360, "Member 'ABP_BaseSabotagePoint_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_BaseSabotagePoint_C, initial_SBZInteractable) == 0x000368, "Member 'ABP_BaseSabotagePoint_C::initial_SBZInteractable' has a wrong offset!");
static_assert(offsetof(ABP_BaseSabotagePoint_C, SBZAIObjective) == 0x000370, "Member 'ABP_BaseSabotagePoint_C::SBZAIObjective' has a wrong offset!");
static_assert(offsetof(ABP_BaseSabotagePoint_C, onSabotageCompleteInteraction) == 0x000378, "Member 'ABP_BaseSabotagePoint_C::onSabotageCompleteInteraction' has a wrong offset!");
static_assert(offsetof(ABP_BaseSabotagePoint_C, isInteractableFromStart) == 0x000388, "Member 'ABP_BaseSabotagePoint_C::isInteractableFromStart' has a wrong offset!");
static_assert(offsetof(ABP_BaseSabotagePoint_C, onInteraction) == 0x000390, "Member 'ABP_BaseSabotagePoint_C::onInteraction' has a wrong offset!");

}

