#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BaseValuableBag

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BaseValuableBag.BP_BaseValuableBag_C.ExecuteUbergraph_BP_BaseValuableBag
// 0x0008 (0x0008 - 0x0000)
struct BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsAttached;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag) == 0x000004, "Wrong alignment on BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag");
static_assert(sizeof(BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag) == 0x000008, "Wrong size on BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag");
static_assert(offsetof(BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag, EntryPoint) == 0x000000, "Member 'BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag, K2Node_Event_bIsAttached) == 0x000004, "Member 'BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag::K2Node_Event_bIsAttached' has a wrong offset!");
static_assert(offsetof(BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'BP_BaseValuableBag_C_ExecuteUbergraph_BP_BaseValuableBag::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_BaseValuableBag.BP_BaseValuableBag_C.BP_OnZiplineAttachmentChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_BaseValuableBag_C_BP_OnZiplineAttachmentChanged final
{
public:
	bool                                          bIsAttached;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BaseValuableBag_C_BP_OnZiplineAttachmentChanged) == 0x000001, "Wrong alignment on BP_BaseValuableBag_C_BP_OnZiplineAttachmentChanged");
static_assert(sizeof(BP_BaseValuableBag_C_BP_OnZiplineAttachmentChanged) == 0x000001, "Wrong size on BP_BaseValuableBag_C_BP_OnZiplineAttachmentChanged");
static_assert(offsetof(BP_BaseValuableBag_C_BP_OnZiplineAttachmentChanged, bIsAttached) == 0x000000, "Member 'BP_BaseValuableBag_C_BP_OnZiplineAttachmentChanged::bIsAttached' has a wrong offset!");

}

