#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Binder_01_SmallDestruction

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Binder_01_SmallDestruction.BP_Binder_01_SmallDestruction_C.ExecuteUbergraph_BP_Binder_01_SmallDestruction
// 0x0070 (0x0070 - 0x0000)
struct BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x0028(0x0030)(ConstParm, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction) == 0x000008, "Wrong alignment on BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction");
static_assert(sizeof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction) == 0x000070, "Wrong size on BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, EntryPoint) == 0x000000, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, CallFunc_IsDedicatedServer_ReturnValue) == 0x000010, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, CallFunc_BreakVector_X) == 0x000014, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, CallFunc_BreakVector_Y) == 0x000018, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, CallFunc_BreakVector_Z) == 0x00001C, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, K2Node_ComponentBoundEvent_Type) == 0x000024, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, K2Node_ComponentBoundEvent_HitContext) == 0x000028, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000068, "Member 'BP_Binder_01_SmallDestruction_C_ExecuteUbergraph_BP_Binder_01_SmallDestruction::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");

// Function BP_Binder_01_SmallDestruction.BP_Binder_01_SmallDestruction_C.BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct BP_Binder_01_SmallDestruction_C_BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_Binder_01_SmallDestruction_C_BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on BP_Binder_01_SmallDestruction_C_BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(BP_Binder_01_SmallDestruction_C_BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on BP_Binder_01_SmallDestruction_C_BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'BP_Binder_01_SmallDestruction_C_BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(BP_Binder_01_SmallDestruction_C_BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'BP_Binder_01_SmallDestruction_C_BndEvt__BP_Binder_01_SmallDestruction_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

}

