#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BagPlaceholder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BagPlaceholder.BP_BagPlaceholder_C
// 0x0018 (0x02F0 - 0x02D8)
class ABP_BagPlaceholder_C final : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_BagPlaceholder(int32 EntryPoint);
	void OnStateChanged(bool bStateToChangeTo, bool bDoCosmetics);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BagPlaceholder_C">();
	}
	static class ABP_BagPlaceholder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BagPlaceholder_C>();
	}
};
static_assert(alignof(ABP_BagPlaceholder_C) == 0x000008, "Wrong alignment on ABP_BagPlaceholder_C");
static_assert(sizeof(ABP_BagPlaceholder_C) == 0x0002F0, "Wrong size on ABP_BagPlaceholder_C");
static_assert(offsetof(ABP_BagPlaceholder_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_BagPlaceholder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BagPlaceholder_C, Cube) == 0x0002E0, "Member 'ABP_BagPlaceholder_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_BagPlaceholder_C, DefaultSceneRoot) == 0x0002E8, "Member 'ABP_BagPlaceholder_C::DefaultSceneRoot' has a wrong offset!");

}

