#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CoffeeMachine_01_SCR

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CoffeeMachine_01_SCR.BP_CoffeeMachine_01_SCR_C.ExecuteUbergraph_BP_CoffeeMachine_01_SCR
// 0x00C8 (0x00C8 - 0x0000)
struct BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0040(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x005C(0x0030)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR) == 0x000008, "Wrong alignment on BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR");
static_assert(sizeof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR) == 0x0000C8, "Wrong size on BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, EntryPoint) == 0x000000, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, Temp_struct_Variable) == 0x000008, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, Temp_delegate_Variable) == 0x000018, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, Temp_struct_Variable_1) == 0x000030, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, Temp_delegate_Variable_1) == 0x000040, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, CallFunc_PostAkEvent_ReturnValue) == 0x000054, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, K2Node_ComponentBoundEvent_Type) == 0x000058, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, K2Node_ComponentBoundEvent_HitContext) == 0x00005C, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, CallFunc_IsDedicatedServer_ReturnValue) == 0x00008C, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000090, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, CallFunc_BreakRotator_Roll) == 0x00009C, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, CallFunc_BreakRotator_Pitch) == 0x0000A0, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, CallFunc_BreakRotator_Yaw) == 0x0000A4, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, CallFunc_MakeRotator_ReturnValue) == 0x0000A8, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000B8, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR, CallFunc_PostEvent_ReturnValue) == 0x0000C0, "Member 'BP_CoffeeMachine_01_SCR_C_ExecuteUbergraph_BP_CoffeeMachine_01_SCR::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function BP_CoffeeMachine_01_SCR.BP_CoffeeMachine_01_SCR_C.BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct BP_CoffeeMachine_01_SCR_C_BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_CoffeeMachine_01_SCR_C_BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on BP_CoffeeMachine_01_SCR_C_BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(BP_CoffeeMachine_01_SCR_C_BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on BP_CoffeeMachine_01_SCR_C_BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'BP_CoffeeMachine_01_SCR_C_BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(BP_CoffeeMachine_01_SCR_C_BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'BP_CoffeeMachine_01_SCR_C_BndEvt__BP_CoffeeMachine_01_SCR_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

}

