#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Carried_Smartphone_OwnerNC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Carried_Smartphone_OwnerNC.BP_Carried_Smartphone_OwnerNC_C
// 0x0038 (0x0318 - 0x02E0)
class ABP_Carried_Smartphone_OwnerNC_C final : public ASBZCarriedStaticInteractionActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline_1;                                      // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZSensorComponent*                    SBZSensor;                                         // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAIObjectiveComponent*               SBZAIObjective;                                    // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Carried_Smartphone_OwnerNC(int32 EntryPoint);
	void BndEvt__BP_Carried_Smartphone_OwnerNC_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	class USBZOutlineComponent* GetSensorOutlineComponent();
	class USBZSensorComponent* GetSensorComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Carried_Smartphone_OwnerNC_C">();
	}
	static class ABP_Carried_Smartphone_OwnerNC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Carried_Smartphone_OwnerNC_C>();
	}
};
static_assert(alignof(ABP_Carried_Smartphone_OwnerNC_C) == 0x000008, "Wrong alignment on ABP_Carried_Smartphone_OwnerNC_C");
static_assert(sizeof(ABP_Carried_Smartphone_OwnerNC_C) == 0x000318, "Wrong size on ABP_Carried_Smartphone_OwnerNC_C");
static_assert(offsetof(ABP_Carried_Smartphone_OwnerNC_C, UberGraphFrame) == 0x0002E0, "Member 'ABP_Carried_Smartphone_OwnerNC_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Carried_Smartphone_OwnerNC_C, Box) == 0x0002E8, "Member 'ABP_Carried_Smartphone_OwnerNC_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Carried_Smartphone_OwnerNC_C, SBZOutline_1) == 0x0002F0, "Member 'ABP_Carried_Smartphone_OwnerNC_C::SBZOutline_1' has a wrong offset!");
static_assert(offsetof(ABP_Carried_Smartphone_OwnerNC_C, SBZSensor) == 0x0002F8, "Member 'ABP_Carried_Smartphone_OwnerNC_C::SBZSensor' has a wrong offset!");
static_assert(offsetof(ABP_Carried_Smartphone_OwnerNC_C, SBZAIObjective) == 0x000300, "Member 'ABP_Carried_Smartphone_OwnerNC_C::SBZAIObjective' has a wrong offset!");
static_assert(offsetof(ABP_Carried_Smartphone_OwnerNC_C, SBZOutline) == 0x000308, "Member 'ABP_Carried_Smartphone_OwnerNC_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_Carried_Smartphone_OwnerNC_C, StaticMesh) == 0x000310, "Member 'ABP_Carried_Smartphone_OwnerNC_C::StaticMesh' has a wrong offset!");

}

