#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CashRegister_01_Monitor_SmallDestruction

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CashRegister_01_Monitor_SmallDestruction.BP_CashRegister_01_Monitor_SmallDestruction_C.ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction
// 0x00A0 (0x00A0 - 0x0000)
struct BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0044(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x006C(0x0030)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction) == 0x000010, "Wrong alignment on BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction");
static_assert(sizeof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction) == 0x0000A0, "Wrong size on BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, EntryPoint) == 0x000000, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, CallFunc_GetTransform_ReturnValue) == 0x000010, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, CallFunc_IsDedicatedServer_ReturnValue) == 0x000040, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, CallFunc_TransformLocation_ReturnValue) == 0x000044, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::CallFunc_TransformLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000050, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000058, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, K2Node_SwitchInteger_CmpSuccess) == 0x00005C, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, CallFunc_GetComponentByClass_ReturnValue) == 0x000060, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, K2Node_ComponentBoundEvent_Type) == 0x000068, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, K2Node_ComponentBoundEvent_HitContext) == 0x00006C, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x00009C, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function BP_CashRegister_01_Monitor_SmallDestruction.BP_CashRegister_01_Monitor_SmallDestruction_C.BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct BP_CashRegister_01_Monitor_SmallDestruction_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_CashRegister_01_Monitor_SmallDestruction_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on BP_CashRegister_01_Monitor_SmallDestruction_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(BP_CashRegister_01_Monitor_SmallDestruction_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on BP_CashRegister_01_Monitor_SmallDestruction_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(BP_CashRegister_01_Monitor_SmallDestruction_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'BP_CashRegister_01_Monitor_SmallDestruction_C_BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

}

