#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CashRegister_01_Monitor_SmallDestruction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CashRegister_01_Monitor_SmallDestruction.BP_CashRegister_01_Monitor_SmallDestruction_C
// 0x0018 (0x02F0 - 0x02D8)
class ABP_CashRegister_01_Monitor_SmallDestruction_C final : public ASBZSmallCosmeticDestruction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction_1;                          // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         DAmage_Taken;                                      // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          is_destructable;                                   // 0x02EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_CashRegister_01_Monitor_SmallDestruction(int32 EntryPoint);
	void BndEvt__BP_CashRegister_01_Monitor_SmallDestruction_SBZCosmeticDestruction_1_K2Node_ComponentBoundEvent_5_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CashRegister_01_Monitor_SmallDestruction_C">();
	}
	static class ABP_CashRegister_01_Monitor_SmallDestruction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CashRegister_01_Monitor_SmallDestruction_C>();
	}
};
static_assert(alignof(ABP_CashRegister_01_Monitor_SmallDestruction_C) == 0x000008, "Wrong alignment on ABP_CashRegister_01_Monitor_SmallDestruction_C");
static_assert(sizeof(ABP_CashRegister_01_Monitor_SmallDestruction_C) == 0x0002F0, "Wrong size on ABP_CashRegister_01_Monitor_SmallDestruction_C");
static_assert(offsetof(ABP_CashRegister_01_Monitor_SmallDestruction_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_CashRegister_01_Monitor_SmallDestruction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CashRegister_01_Monitor_SmallDestruction_C, SBZCosmeticDestruction_1) == 0x0002E0, "Member 'ABP_CashRegister_01_Monitor_SmallDestruction_C::SBZCosmeticDestruction_1' has a wrong offset!");
static_assert(offsetof(ABP_CashRegister_01_Monitor_SmallDestruction_C, DAmage_Taken) == 0x0002E8, "Member 'ABP_CashRegister_01_Monitor_SmallDestruction_C::DAmage_Taken' has a wrong offset!");
static_assert(offsetof(ABP_CashRegister_01_Monitor_SmallDestruction_C, is_destructable) == 0x0002EC, "Member 'ABP_CashRegister_01_Monitor_SmallDestruction_C::is_destructable' has a wrong offset!");

}

