#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CarriedRedKeycard

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_CarriedRedKeycard.BP_CarriedRedKeycard_C.UserConstructionScript
// 0x0001 (0x0001 - 0x0000)
struct BP_CarriedRedKeycard_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CarriedRedKeycard_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_CarriedRedKeycard_C_UserConstructionScript");
static_assert(sizeof(BP_CarriedRedKeycard_C_UserConstructionScript) == 0x000001, "Wrong size on BP_CarriedRedKeycard_C_UserConstructionScript");
static_assert(offsetof(BP_CarriedRedKeycard_C_UserConstructionScript, CallFunc_IsDedicatedServer_ReturnValue) == 0x000000, "Member 'BP_CarriedRedKeycard_C_UserConstructionScript::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_CarriedRedKeycard.BP_CarriedRedKeycard_C.GetSensorOutlineComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_CarriedRedKeycard_C_GetSensorOutlineComponent final
{
public:
	class USBZOutlineComponent*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarriedRedKeycard_C_GetSensorOutlineComponent) == 0x000008, "Wrong alignment on BP_CarriedRedKeycard_C_GetSensorOutlineComponent");
static_assert(sizeof(BP_CarriedRedKeycard_C_GetSensorOutlineComponent) == 0x000008, "Wrong size on BP_CarriedRedKeycard_C_GetSensorOutlineComponent");
static_assert(offsetof(BP_CarriedRedKeycard_C_GetSensorOutlineComponent, ReturnValue) == 0x000000, "Member 'BP_CarriedRedKeycard_C_GetSensorOutlineComponent::ReturnValue' has a wrong offset!");

// Function BP_CarriedRedKeycard.BP_CarriedRedKeycard_C.GetSensorComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_CarriedRedKeycard_C_GetSensorComponent final
{
public:
	class USBZSensorComponent*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CarriedRedKeycard_C_GetSensorComponent) == 0x000008, "Wrong alignment on BP_CarriedRedKeycard_C_GetSensorComponent");
static_assert(sizeof(BP_CarriedRedKeycard_C_GetSensorComponent) == 0x000008, "Wrong size on BP_CarriedRedKeycard_C_GetSensorComponent");
static_assert(offsetof(BP_CarriedRedKeycard_C_GetSensorComponent, ReturnValue) == 0x000000, "Member 'BP_CarriedRedKeycard_C_GetSensorComponent::ReturnValue' has a wrong offset!");

}

