#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Charm_Base

#include "Basic.hpp"

#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Charm_Base.BP_Charm_Base_C
// 0x0018 (0x02D0 - 0x02B8)
class ABP_Charm_Base_C : public ASBZWeaponCharm
{
public:
	class UStaticMeshComponent*                   CharmMesh;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Charm_Base;                                     // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Charm_Base_C">();
	}
	static class ABP_Charm_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Charm_Base_C>();
	}
};
static_assert(alignof(ABP_Charm_Base_C) == 0x000008, "Wrong alignment on ABP_Charm_Base_C");
static_assert(sizeof(ABP_Charm_Base_C) == 0x0002D0, "Wrong size on ABP_Charm_Base_C");
static_assert(offsetof(ABP_Charm_Base_C, CharmMesh) == 0x0002B8, "Member 'ABP_Charm_Base_C::CharmMesh' has a wrong offset!");
static_assert(offsetof(ABP_Charm_Base_C, SK_Charm_Base) == 0x0002C0, "Member 'ABP_Charm_Base_C::SK_Charm_Base' has a wrong offset!");
static_assert(offsetof(ABP_Charm_Base_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABP_Charm_Base_C::DefaultSceneRoot' has a wrong offset!");

}

