#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ConnectedCableBox

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_ConnectedCableBox.BP_ConnectedCableBox_C.ExecuteUbergraph_BP_ConnectedCableBox
// 0x01F8 (0x01F8 - 0x0000)
struct BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoCosmetics_1;                       // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_ModelNumberText;                      // 0x0048(0x0018)(ConstParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimelineLength_ReturnValue;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bReset;                               // 0x006D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E[0x2];                                       // 0x006E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimelineLength_ReturnValue_1;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasSuccess;                          // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0084(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0114(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetInitialized_ReturnValue;     // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CableBox_C*                        K2Node_DynamicCast_AsWBP_Cable_Box;                // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetInitialized_ReturnValue_1;   // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_CableBox_C*                        K2Node_DynamicCast_AsWBP_Cable_Box_1;              // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x01D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D3[0x5];                                      // 0x01D3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASBZPlayerCharacter*>            CallFunc_GetAllSBZPlayerCharacters_ReturnValue;    // 0x01D8(0x0010)(ReferenceParm)
	class ASBZPlayerCharacter*                    CallFunc_Array_Get_Item;                           // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox) == 0x000008, "Wrong alignment on BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox");
static_assert(sizeof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox) == 0x0001F8, "Wrong size on BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, EntryPoint) == 0x000000, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, Temp_struct_Variable) == 0x000008, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, Temp_delegate_Variable) == 0x000018, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, Temp_int_Variable) == 0x00002C, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, Temp_int_Variable_1) == 0x000030, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, Temp_int_Variable_2) == 0x000034, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, Temp_int_Variable_3) == 0x000038, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, Temp_int_Variable_4) == 0x00003C, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, Temp_int_Array_Index_Variable) == 0x000040, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_Event_bDoCosmetics_1) == 0x000044, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_Event_bDoCosmetics_1' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_Event_ModelNumberText) == 0x000048, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_Event_ModelNumberText' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_PostAkEvent_ReturnValue) == 0x000060, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_GetTimelineLength_ReturnValue) == 0x000064, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_GetTimelineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_Event_Index) == 0x000068, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_Event_Index' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_Event_bDoCosmetics) == 0x00006C, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_Event_bReset) == 0x00006D, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_Event_bReset' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_GetTimelineLength_ReturnValue_1) == 0x000070, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_GetTimelineLength_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_Select_Default) == 0x000074, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_Event_bWasSuccess) == 0x000078, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_Event_bWasSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, Temp_int_Loop_Counter_Variable) == 0x00007C, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000084, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000114, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_GetUserWidgetInitialized_ReturnValue) == 0x0001A8, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_GetUserWidgetInitialized_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_DynamicCast_AsWBP_Cable_Box) == 0x0001B0, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_DynamicCast_AsWBP_Cable_Box' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_DynamicCast_bSuccess) == 0x0001B8, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_GetUserWidgetInitialized_ReturnValue_1) == 0x0001C0, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_GetUserWidgetInitialized_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_DynamicCast_AsWBP_Cable_Box_1) == 0x0001C8, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_DynamicCast_AsWBP_Cable_Box_1' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, K2Node_DynamicCast_bSuccess_1) == 0x0001D0, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_IsDedicatedServer_ReturnValue) == 0x0001D1, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0001D2, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_GetAllSBZPlayerCharacters_ReturnValue) == 0x0001D8, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_GetAllSBZPlayerCharacters_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_Array_Length_ReturnValue) == 0x0001F0, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox, CallFunc_Less_IntInt_ReturnValue) == 0x0001F4, "Member 'BP_ConnectedCableBox_C_ExecuteUbergraph_BP_ConnectedCableBox::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_ConnectedCableBox.BP_ConnectedCableBox_C.BP_OnComplete
// 0x0001 (0x0001 - 0x0000)
struct BP_ConnectedCableBox_C_BP_OnComplete final
{
public:
	bool                                          bWasSuccess;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ConnectedCableBox_C_BP_OnComplete) == 0x000001, "Wrong alignment on BP_ConnectedCableBox_C_BP_OnComplete");
static_assert(sizeof(BP_ConnectedCableBox_C_BP_OnComplete) == 0x000001, "Wrong size on BP_ConnectedCableBox_C_BP_OnComplete");
static_assert(offsetof(BP_ConnectedCableBox_C_BP_OnComplete, bWasSuccess) == 0x000000, "Member 'BP_ConnectedCableBox_C_BP_OnComplete::bWasSuccess' has a wrong offset!");

// Function BP_ConnectedCableBox.BP_ConnectedCableBox_C.BP_FlipSwitch
// 0x0008 (0x0008 - 0x0000)
struct BP_ConnectedCableBox_C_BP_FlipSwitch final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoCosmetics;                                      // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bReset;                                            // 0x0005(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ConnectedCableBox_C_BP_FlipSwitch) == 0x000004, "Wrong alignment on BP_ConnectedCableBox_C_BP_FlipSwitch");
static_assert(sizeof(BP_ConnectedCableBox_C_BP_FlipSwitch) == 0x000008, "Wrong size on BP_ConnectedCableBox_C_BP_FlipSwitch");
static_assert(offsetof(BP_ConnectedCableBox_C_BP_FlipSwitch, Index_0) == 0x000000, "Member 'BP_ConnectedCableBox_C_BP_FlipSwitch::Index_0' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_BP_FlipSwitch, bDoCosmetics) == 0x000004, "Member 'BP_ConnectedCableBox_C_BP_FlipSwitch::bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_BP_FlipSwitch, bReset) == 0x000005, "Member 'BP_ConnectedCableBox_C_BP_FlipSwitch::bReset' has a wrong offset!");

// Function BP_ConnectedCableBox.BP_ConnectedCableBox_C.BP_UpdateModelNumber
// 0x0018 (0x0018 - 0x0000)
struct BP_ConnectedCableBox_C_BP_UpdateModelNumber final
{
public:
	class FText                                   ModelNumberText;                                   // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_ConnectedCableBox_C_BP_UpdateModelNumber) == 0x000008, "Wrong alignment on BP_ConnectedCableBox_C_BP_UpdateModelNumber");
static_assert(sizeof(BP_ConnectedCableBox_C_BP_UpdateModelNumber) == 0x000018, "Wrong size on BP_ConnectedCableBox_C_BP_UpdateModelNumber");
static_assert(offsetof(BP_ConnectedCableBox_C_BP_UpdateModelNumber, ModelNumberText) == 0x000000, "Member 'BP_ConnectedCableBox_C_BP_UpdateModelNumber::ModelNumberText' has a wrong offset!");

// Function BP_ConnectedCableBox.BP_ConnectedCableBox_C.BP_OpenDoor
// 0x0001 (0x0001 - 0x0000)
struct BP_ConnectedCableBox_C_BP_OpenDoor final
{
public:
	bool                                          bDoCosmetics;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ConnectedCableBox_C_BP_OpenDoor) == 0x000001, "Wrong alignment on BP_ConnectedCableBox_C_BP_OpenDoor");
static_assert(sizeof(BP_ConnectedCableBox_C_BP_OpenDoor) == 0x000001, "Wrong size on BP_ConnectedCableBox_C_BP_OpenDoor");
static_assert(offsetof(BP_ConnectedCableBox_C_BP_OpenDoor, bDoCosmetics) == 0x000000, "Member 'BP_ConnectedCableBox_C_BP_OpenDoor::bDoCosmetics' has a wrong offset!");

// Function BP_ConnectedCableBox.BP_ConnectedCableBox_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_ConnectedCableBox_C_UserConstructionScript final
{
public:
	float                                         Temp_float_Variable;                               // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ConnectedCableBox_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ConnectedCableBox_C_UserConstructionScript");
static_assert(sizeof(BP_ConnectedCableBox_C_UserConstructionScript) == 0x000020, "Wrong size on BP_ConnectedCableBox_C_UserConstructionScript");
static_assert(offsetof(BP_ConnectedCableBox_C_UserConstructionScript, Temp_float_Variable) == 0x000000, "Member 'BP_ConnectedCableBox_C_UserConstructionScript::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_ConnectedCableBox_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_UserConstructionScript, Temp_float_Variable_1) == 0x000010, "Member 'BP_ConnectedCableBox_C_UserConstructionScript::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_UserConstructionScript, Temp_bool_Variable) == 0x000014, "Member 'BP_ConnectedCableBox_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_ConnectedCableBox_C_UserConstructionScript, K2Node_Select_Default) == 0x000018, "Member 'BP_ConnectedCableBox_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

}

