#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CosmeticCigaret

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CosmeticCigaret.BP_CosmeticCigaret_C
// 0x0018 (0x02E0 - 0x02C8)
class ABP_CosmeticCigaret_C final : public ASBZCosmeticProp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Emissive_Tip;                                      // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CosmeticCigaret(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CosmeticCigaret_C">();
	}
	static class ABP_CosmeticCigaret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CosmeticCigaret_C>();
	}
};
static_assert(alignof(ABP_CosmeticCigaret_C) == 0x000008, "Wrong alignment on ABP_CosmeticCigaret_C");
static_assert(sizeof(ABP_CosmeticCigaret_C) == 0x0002E0, "Wrong size on ABP_CosmeticCigaret_C");
static_assert(offsetof(ABP_CosmeticCigaret_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_CosmeticCigaret_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CosmeticCigaret_C, Emissive_Tip) == 0x0002D0, "Member 'ABP_CosmeticCigaret_C::Emissive_Tip' has a wrong offset!");
static_assert(offsetof(ABP_CosmeticCigaret_C, StaticMesh) == 0x0002D8, "Member 'ABP_CosmeticCigaret_C::StaticMesh' has a wrong offset!");

}

