#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CleanedServerBagWorldItem

#include "Basic.hpp"

#include "BP_BaseValuableBag_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CleanedServerBagWorldItem.BP_CleanedServerBagWorldItem_C
// 0x0018 (0x03B8 - 0x03A0)
class ABP_CleanedServerBagWorldItem_C final : public ABP_BaseValuableBag_C
{
public:
	class USBZOutlineComponent*                   SBZOutline_0;                                      // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_0;                                      // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         MarkerID_0;                                        // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CleanedServerBagWorldItem_C">();
	}
	static class ABP_CleanedServerBagWorldItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CleanedServerBagWorldItem_C>();
	}
};
static_assert(alignof(ABP_CleanedServerBagWorldItem_C) == 0x000008, "Wrong alignment on ABP_CleanedServerBagWorldItem_C");
static_assert(sizeof(ABP_CleanedServerBagWorldItem_C) == 0x0003B8, "Wrong size on ABP_CleanedServerBagWorldItem_C");
static_assert(offsetof(ABP_CleanedServerBagWorldItem_C, SBZOutline_0) == 0x0003A0, "Member 'ABP_CleanedServerBagWorldItem_C::SBZOutline_0' has a wrong offset!");
static_assert(offsetof(ABP_CleanedServerBagWorldItem_C, StaticMesh_0) == 0x0003A8, "Member 'ABP_CleanedServerBagWorldItem_C::StaticMesh_0' has a wrong offset!");
static_assert(offsetof(ABP_CleanedServerBagWorldItem_C, MarkerID_0) == 0x0003B0, "Member 'ABP_CleanedServerBagWorldItem_C::MarkerID_0' has a wrong offset!");

}

