#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CactusPot_01_C

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CactusPot_01_C.BP_CactusPot_01_C_C
// 0x0018 (0x02C0 - 0x02A8)
class ABP_CactusPot_01_C_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CactusPot_01_C(int32 EntryPoint);
	void BndEvt__BP_CactusPot_01_C_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CactusPot_01_C_C">();
	}
	static class ABP_CactusPot_01_C_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CactusPot_01_C_C>();
	}
};
static_assert(alignof(ABP_CactusPot_01_C_C) == 0x000008, "Wrong alignment on ABP_CactusPot_01_C_C");
static_assert(sizeof(ABP_CactusPot_01_C_C) == 0x0002C0, "Wrong size on ABP_CactusPot_01_C_C");
static_assert(offsetof(ABP_CactusPot_01_C_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_CactusPot_01_C_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_CactusPot_01_C_C, SBZCosmeticDestruction) == 0x0002B0, "Member 'ABP_CactusPot_01_C_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ABP_CactusPot_01_C_C, StaticMesh) == 0x0002B8, "Member 'ABP_CactusPot_01_C_C::StaticMesh' has a wrong offset!");

}

