#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Club_Spotlights

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Club_Spotlights.BP_Club_Spotlights_C.ExecuteUbergraph_BP_Club_Spotlights
// 0x0160 (0x0160 - 0x0000)
struct BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue_1;         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_VSize_ReturnValue;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Cos_ReturnValue;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sin_ReturnValue_1;                        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_LinearColorLerp_ReturnValue;              // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0098(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_BreakVector_X;                            // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0xC];                                      // 0x0134(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights) == 0x000010, "Wrong alignment on BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights");
static_assert(sizeof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights) == 0x000160, "Wrong size on BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, EntryPoint) == 0x000000, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000014, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000020, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_GetRealTimeSeconds_ReturnValue_1) == 0x000028, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_GetRealTimeSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00002C, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_IsDedicatedServer_ReturnValue) == 0x000038, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_VSize_ReturnValue) == 0x00003C, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Add_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Sin_ReturnValue) == 0x000044, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Sin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Cos_ReturnValue) == 0x000048, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Cos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00004C, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000050, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Sin_ReturnValue_1) == 0x000054, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Sin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000058, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x00005C, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x000060, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_MakeRotator_ReturnValue) == 0x000064, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_LinearColorLerp_ReturnValue) == 0x000070, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_LinearColorLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_ComposeRotators_ReturnValue) == 0x000080, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x00008C, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000098, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_BreakVector_X) == 0x000128, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_BreakVector_Y) == 0x00012C, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_BreakVector_Z) == 0x000130, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, K2Node_MakeStruct_Vector4) == 0x000140, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::K2Node_MakeStruct_Vector4' has a wrong offset!");
static_assert(offsetof(BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000150, "Member 'BP_Club_Spotlights_C_ExecuteUbergraph_BP_Club_Spotlights::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function BP_Club_Spotlights.BP_Club_Spotlights_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Club_Spotlights_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Club_Spotlights_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Club_Spotlights_C_ReceiveTick");
static_assert(sizeof(BP_Club_Spotlights_C_ReceiveTick) == 0x000004, "Wrong size on BP_Club_Spotlights_C_ReceiveTick");
static_assert(offsetof(BP_Club_Spotlights_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Club_Spotlights_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

