#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CosmeticPocketDrill

#include "Basic.hpp"

#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CosmeticPocketDrill.BP_CosmeticPocketDrill_C
// 0x0038 (0x0300 - 0x02C8)
class ABP_CosmeticPocketDrill_C final : public ASBZCosmeticProp
{
public:
	class UWidgetComponent*                       Widget;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PocketDrill_Display;                               // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PocketDrill_Motor;                                 // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PocketDrill_Base;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PocketDrill_Handle;                                // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PocketDrill_Bit;                                   // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PocketDrill_Head;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CosmeticPocketDrill_C">();
	}
	static class ABP_CosmeticPocketDrill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CosmeticPocketDrill_C>();
	}
};
static_assert(alignof(ABP_CosmeticPocketDrill_C) == 0x000008, "Wrong alignment on ABP_CosmeticPocketDrill_C");
static_assert(sizeof(ABP_CosmeticPocketDrill_C) == 0x000300, "Wrong size on ABP_CosmeticPocketDrill_C");
static_assert(offsetof(ABP_CosmeticPocketDrill_C, Widget) == 0x0002C8, "Member 'ABP_CosmeticPocketDrill_C::Widget' has a wrong offset!");
static_assert(offsetof(ABP_CosmeticPocketDrill_C, PocketDrill_Display) == 0x0002D0, "Member 'ABP_CosmeticPocketDrill_C::PocketDrill_Display' has a wrong offset!");
static_assert(offsetof(ABP_CosmeticPocketDrill_C, PocketDrill_Motor) == 0x0002D8, "Member 'ABP_CosmeticPocketDrill_C::PocketDrill_Motor' has a wrong offset!");
static_assert(offsetof(ABP_CosmeticPocketDrill_C, PocketDrill_Base) == 0x0002E0, "Member 'ABP_CosmeticPocketDrill_C::PocketDrill_Base' has a wrong offset!");
static_assert(offsetof(ABP_CosmeticPocketDrill_C, PocketDrill_Handle) == 0x0002E8, "Member 'ABP_CosmeticPocketDrill_C::PocketDrill_Handle' has a wrong offset!");
static_assert(offsetof(ABP_CosmeticPocketDrill_C, PocketDrill_Bit) == 0x0002F0, "Member 'ABP_CosmeticPocketDrill_C::PocketDrill_Bit' has a wrong offset!");
static_assert(offsetof(ABP_CosmeticPocketDrill_C, PocketDrill_Head) == 0x0002F8, "Member 'ABP_CosmeticPocketDrill_C::PocketDrill_Head' has a wrong offset!");

}

