#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DeliveryDrone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeliveryDrone.BP_DeliveryDrone_C
// 0x0020 (0x0620 - 0x0600)
class ABP_DeliveryDrone_C final : public ASBZAIDeliveryDrone
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0600(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponentBudgeted*         SkeletalMeshComponentBudgeted;                     // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         MarkerID;                                          // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DeliveryDrone(int32 EntryPoint);
	void BP_OnBagDropped();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeliveryDrone_C">();
	}
	static class ABP_DeliveryDrone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeliveryDrone_C>();
	}
};
static_assert(alignof(ABP_DeliveryDrone_C) == 0x000010, "Wrong alignment on ABP_DeliveryDrone_C");
static_assert(sizeof(ABP_DeliveryDrone_C) == 0x000620, "Wrong size on ABP_DeliveryDrone_C");
static_assert(offsetof(ABP_DeliveryDrone_C, UberGraphFrame) == 0x000600, "Member 'ABP_DeliveryDrone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryDrone_C, SkeletalMeshComponentBudgeted) == 0x000608, "Member 'ABP_DeliveryDrone_C::SkeletalMeshComponentBudgeted' has a wrong offset!");
static_assert(offsetof(ABP_DeliveryDrone_C, MarkerID) == 0x000610, "Member 'ABP_DeliveryDrone_C::MarkerID' has a wrong offset!");

}

