#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DigitalKeyReader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DigitalKeyReader.BP_DigitalKeyReader_C
// 0x0028 (0x0340 - 0x0318)
class ABP_DigitalKeyReader_C final : public ASBZKeycardReader
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Interacted_1stTime;                                // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnDigitalKeyReaderComplete;                        // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_DigitalKeyReader(int32 EntryPoint);
	void BndEvt__BP_DigitalKeyReader_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BP_OnStateChanged(ESBZModuleActorState NewState, bool bDoCosmetics);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DigitalKeyReader_C">();
	}
	static class ABP_DigitalKeyReader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DigitalKeyReader_C>();
	}
};
static_assert(alignof(ABP_DigitalKeyReader_C) == 0x000008, "Wrong alignment on ABP_DigitalKeyReader_C");
static_assert(sizeof(ABP_DigitalKeyReader_C) == 0x000340, "Wrong size on ABP_DigitalKeyReader_C");
static_assert(offsetof(ABP_DigitalKeyReader_C, UberGraphFrame) == 0x000318, "Member 'ABP_DigitalKeyReader_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_DigitalKeyReader_C, Mesh) == 0x000320, "Member 'ABP_DigitalKeyReader_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_DigitalKeyReader_C, Interacted_1stTime) == 0x000328, "Member 'ABP_DigitalKeyReader_C::Interacted_1stTime' has a wrong offset!");
static_assert(offsetof(ABP_DigitalKeyReader_C, OnDigitalKeyReaderComplete) == 0x000330, "Member 'ABP_DigitalKeyReader_C::OnDigitalKeyReaderComplete' has a wrong offset!");

}

