#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamagePopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DamagePopup.BP_DamagePopup_C
// 0x0020 (0x02E8 - 0x02C8)
class ABP_DamagePopup_C final : public AModActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DamagePopup_C;                   // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ASBZPlayerCharacter*                    As_SBZPlayer_Character;                            // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         In_Range_A;                                        // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         In_Range_B;                                        // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InEditorTesting;                                   // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DamagePopup(int32 EntryPoint);
	void CustomEvent_0();
	void OnDestroyed_Event_0(class AActor* DestroyedActor);
	void OnTakenDamage_Event_0(const struct FSBZDamageEvent& DamageEventData);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DamagePopup_C">();
	}
	static class ABP_DamagePopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DamagePopup_C>();
	}
};
static_assert(alignof(ABP_DamagePopup_C) == 0x000008, "Wrong alignment on ABP_DamagePopup_C");
static_assert(sizeof(ABP_DamagePopup_C) == 0x0002E8, "Wrong size on ABP_DamagePopup_C");
static_assert(offsetof(ABP_DamagePopup_C, UberGraphFrame_BP_DamagePopup_C) == 0x0002C8, "Member 'ABP_DamagePopup_C::UberGraphFrame_BP_DamagePopup_C' has a wrong offset!");
static_assert(offsetof(ABP_DamagePopup_C, As_SBZPlayer_Character) == 0x0002D0, "Member 'ABP_DamagePopup_C::As_SBZPlayer_Character' has a wrong offset!");
static_assert(offsetof(ABP_DamagePopup_C, In_Range_A) == 0x0002D8, "Member 'ABP_DamagePopup_C::In_Range_A' has a wrong offset!");
static_assert(offsetof(ABP_DamagePopup_C, In_Range_B) == 0x0002DC, "Member 'ABP_DamagePopup_C::In_Range_B' has a wrong offset!");
static_assert(offsetof(ABP_DamagePopup_C, InEditorTesting) == 0x0002E0, "Member 'ABP_DamagePopup_C::InEditorTesting' has a wrong offset!");

}

