#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamagePopup

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DamagePopup.BP_DamagePopup_C.ExecuteUbergraph_BP_DamagePopup
// 0x0230 (0x0230 - 0x0000)
struct BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FSBZDamageEvent& DamageEventData)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	class ASBZPlayerCharacter*                    Temp_wildcard_Variable;                            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerCharacter*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AActor* DestroyedActor)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_1;  // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZDamageEvent                        K2Node_CustomEvent_DamageEventData;                // 0x0060(0x00C0)(ConstParm)
	class USBZGameEventBroker*                    CallFunc_GetGameEventBroker_ReturnValue;           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0150(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FloatingText_Damage_C*              CallFunc_FinishSpawningActor_ReturnValue;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x01B0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_MapRangeClamped_ReturnValue_1;            // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue;                   // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FloatingText_Damage_C*              CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RandomBool_ReturnValue_1;                 // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_RandomBool_ReturnValue_2;                 // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerCharacter*                    K2Node_DynamicCast_AsSBZPlayer_Character;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup) == 0x000010, "Wrong alignment on BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup");
static_assert(sizeof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup) == 0x000230, "Wrong size on BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, EntryPoint) == 0x000000, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, Temp_wildcard_Variable) == 0x000018, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_GetActorOfClass_ReturnValue) == 0x000020, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000050, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x000058, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_IsPackagedForDistribution_ReturnValue_1) == 0x000059, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_IsPackagedForDistribution_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, K2Node_CustomEvent_DamageEventData) == 0x000060, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_GetGameEventBroker_ReturnValue) == 0x000120, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_GetGameEventBroker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000128, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_FTrunc_ReturnValue) == 0x00012C, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_GetDistanceTo_ReturnValue) == 0x000130, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000134, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000140, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_Add_VectorVector_ReturnValue) == 0x000144, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_MakeTransform_ReturnValue) == 0x000150, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_MapRangeClamped_ReturnValue) == 0x000188, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_FinishSpawningActor_ReturnValue) == 0x000190, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, K2Node_CustomEvent_DestroyedActor) == 0x000198, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001A0, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_RandomFloatInRange_ReturnValue) == 0x0001AC, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_MakeTransform_ReturnValue_1) == 0x0001B0, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_MapRangeClamped_ReturnValue_1) == 0x0001E0, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_MapRangeClamped_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0001E8, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_RandomBool_ReturnValue) == 0x0001F0, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_RandomBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0001F8, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_RandomBool_ReturnValue_1) == 0x000200, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_RandomBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_RandomBool_ReturnValue_2) == 0x000201, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_RandomBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000204, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x000208, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, CallFunc_IsValid_ReturnValue) == 0x000210, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, K2Node_DynamicCast_AsSBZPlayer_Character) == 0x000218, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::K2Node_DynamicCast_AsSBZPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup, K2Node_DynamicCast_bSuccess) == 0x000220, "Member 'BP_DamagePopup_C_ExecuteUbergraph_BP_DamagePopup::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_DamagePopup.BP_DamagePopup_C.OnDestroyed_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_DamagePopup_C_OnDestroyed_Event_0 final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DamagePopup_C_OnDestroyed_Event_0) == 0x000008, "Wrong alignment on BP_DamagePopup_C_OnDestroyed_Event_0");
static_assert(sizeof(BP_DamagePopup_C_OnDestroyed_Event_0) == 0x000008, "Wrong size on BP_DamagePopup_C_OnDestroyed_Event_0");
static_assert(offsetof(BP_DamagePopup_C_OnDestroyed_Event_0, DestroyedActor) == 0x000000, "Member 'BP_DamagePopup_C_OnDestroyed_Event_0::DestroyedActor' has a wrong offset!");

// Function BP_DamagePopup.BP_DamagePopup_C.OnTakenDamage_Event_0
// 0x00C0 (0x00C0 - 0x0000)
struct BP_DamagePopup_C_OnTakenDamage_Event_0 final
{
public:
	struct FSBZDamageEvent                        DamageEventData;                                   // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_DamagePopup_C_OnTakenDamage_Event_0) == 0x000008, "Wrong alignment on BP_DamagePopup_C_OnTakenDamage_Event_0");
static_assert(sizeof(BP_DamagePopup_C_OnTakenDamage_Event_0) == 0x0000C0, "Wrong size on BP_DamagePopup_C_OnTakenDamage_Event_0");
static_assert(offsetof(BP_DamagePopup_C_OnTakenDamage_Event_0, DamageEventData) == 0x000000, "Member 'BP_DamagePopup_C_OnTakenDamage_Event_0::DamageEventData' has a wrong offset!");

}

