#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DroneSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_DroneSpawner.BP_DroneSpawner_C.ExecuteUbergraph_BP_DroneSpawner
// 0x0090 (0x0090 - 0x0000)
struct BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	class APawn*                                  K2Node_CustomEvent_SpawnedPawn;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_CustomEvent_Spawnedloot;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_LinearColor_Red_ReturnValue;              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_DynamicCast_AsAIController;                 // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPathFollowingComponent*                CallFunc_GetPathFollowingComponent_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZDronePathFollowingComponent*        K2Node_DynamicCast_AsSBZDrone_Path_Following_Component; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_LinearColor_Green_ReturnValue;            // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasValidNavigationAt_ReturnValue;         // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner) == 0x000008, "Wrong alignment on BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner");
static_assert(sizeof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner) == 0x000090, "Wrong size on BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, EntryPoint) == 0x000000, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, K2Node_CustomEvent_SpawnedPawn) == 0x000018, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::K2Node_CustomEvent_SpawnedPawn' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, K2Node_CustomEvent_Spawnedloot) == 0x000020, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::K2Node_CustomEvent_Spawnedloot' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, CallFunc_GetController_ReturnValue) == 0x000028, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, CallFunc_LinearColor_Red_ReturnValue) == 0x000030, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::CallFunc_LinearColor_Red_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, K2Node_DynamicCast_AsAIController) == 0x000040, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::K2Node_DynamicCast_AsAIController' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, CallFunc_GetPathFollowingComponent_ReturnValue) == 0x000050, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::CallFunc_GetPathFollowingComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, K2Node_DynamicCast_AsSBZDrone_Path_Following_Component) == 0x000058, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::K2Node_DynamicCast_AsSBZDrone_Path_Following_Component' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, CallFunc_LinearColor_Green_ReturnValue) == 0x000064, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::CallFunc_LinearColor_Green_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000074, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, CallFunc_Subtract_IntInt_ReturnValue) == 0x000078, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x00007C, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner, CallFunc_HasValidNavigationAt_ReturnValue) == 0x000088, "Member 'BP_DroneSpawner_C_ExecuteUbergraph_BP_DroneSpawner::CallFunc_HasValidNavigationAt_ReturnValue' has a wrong offset!");

// Function BP_DroneSpawner.BP_DroneSpawner_C.SpawnedPawnDelegate_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_DroneSpawner_C_SpawnedPawnDelegate_Event_0 final
{
public:
	class APawn*                                  SpawnedPawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      Spawnedloot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_DroneSpawner_C_SpawnedPawnDelegate_Event_0) == 0x000008, "Wrong alignment on BP_DroneSpawner_C_SpawnedPawnDelegate_Event_0");
static_assert(sizeof(BP_DroneSpawner_C_SpawnedPawnDelegate_Event_0) == 0x000010, "Wrong size on BP_DroneSpawner_C_SpawnedPawnDelegate_Event_0");
static_assert(offsetof(BP_DroneSpawner_C_SpawnedPawnDelegate_Event_0, SpawnedPawn) == 0x000000, "Member 'BP_DroneSpawner_C_SpawnedPawnDelegate_Event_0::SpawnedPawn' has a wrong offset!");
static_assert(offsetof(BP_DroneSpawner_C_SpawnedPawnDelegate_Event_0, Spawnedloot) == 0x000008, "Member 'BP_DroneSpawner_C_SpawnedPawnDelegate_Event_0::Spawnedloot' has a wrong offset!");

}

