#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireExtinguisher_01_Gas

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FireExtinguisher_01_Gas.BP_FireExtinguisher_01_Gas_C
// 0x0018 (0x04B8 - 0x04A0)
class ABP_FireExtinguisher_01_Gas_C final : public ASBZExplosiveTrap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Locator;                                           // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FireExtinguisher_01_Gas(int32 EntryPoint);
	void BP_OnExplosion(bool bDoCosmetics);
	void BndEvt__BP_TestExplosiveFuelTank_NiagaraComponent_K2Node_ComponentBoundEvent_0_ActorComponentActivatedSignature__DelegateSignature(class UActorComponent* Component, bool bReset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FireExtinguisher_01_Gas_C">();
	}
	static class ABP_FireExtinguisher_01_Gas_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FireExtinguisher_01_Gas_C>();
	}
};
static_assert(alignof(ABP_FireExtinguisher_01_Gas_C) == 0x000008, "Wrong alignment on ABP_FireExtinguisher_01_Gas_C");
static_assert(sizeof(ABP_FireExtinguisher_01_Gas_C) == 0x0004B8, "Wrong size on ABP_FireExtinguisher_01_Gas_C");
static_assert(offsetof(ABP_FireExtinguisher_01_Gas_C, UberGraphFrame) == 0x0004A0, "Member 'ABP_FireExtinguisher_01_Gas_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FireExtinguisher_01_Gas_C, Locator) == 0x0004A8, "Member 'ABP_FireExtinguisher_01_Gas_C::Locator' has a wrong offset!");
static_assert(offsetof(ABP_FireExtinguisher_01_Gas_C, StaticMesh) == 0x0004B0, "Member 'ABP_FireExtinguisher_01_Gas_C::StaticMesh' has a wrong offset!");

}

