#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireExtinguisher_Foam

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FireExtinguisher_Foam.BP_FireExtinguisher_Foam_C
// 0x0018 (0x0560 - 0x0548)
class ABP_FireExtinguisher_Foam_C final : public ASBZExplosiveTrapGas
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0548(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0550(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SmokeSightModifier;                                // 0x0558(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_FireExtinguisher_Foam(int32 EntryPoint);
	void BP_OnExplosion(bool bDoCosmetics);

	float GetSightModifier(const struct FVector& Start, const struct FVector& End) const;
	bool CanAffectStealth() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FireExtinguisher_Foam_C">();
	}
	static class ABP_FireExtinguisher_Foam_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FireExtinguisher_Foam_C>();
	}
};
static_assert(alignof(ABP_FireExtinguisher_Foam_C) == 0x000008, "Wrong alignment on ABP_FireExtinguisher_Foam_C");
static_assert(sizeof(ABP_FireExtinguisher_Foam_C) == 0x000560, "Wrong size on ABP_FireExtinguisher_Foam_C");
static_assert(offsetof(ABP_FireExtinguisher_Foam_C, UberGraphFrame) == 0x000548, "Member 'ABP_FireExtinguisher_Foam_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FireExtinguisher_Foam_C, StaticMesh) == 0x000550, "Member 'ABP_FireExtinguisher_Foam_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_FireExtinguisher_Foam_C, SmokeSightModifier) == 0x000558, "Member 'ABP_FireExtinguisher_Foam_C::SmokeSightModifier' has a wrong offset!");

}

