#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FileCabinet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FileCabinet.BP_FileCabinet_C
// 0x0240 (0x04E8 - 0x02A8)
class ABP_FileCabinet_C final : public ASBZStaticReplicatedActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZAIObjectiveComponent_FileCabinet*   SBZAIObjectiveComponent_FileCabinet;               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable_4;                                 // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_4;                                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FileCabinet_02_64_Test_Drawer_5;                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_7;                                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_6;                                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_5;                                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_3;                                           // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_2;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene_1;                                           // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CabinettBody;                                      // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FileCabinet_02_64_Test_Drawer_2;                   // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FileCabinet_02_64_Test_Drawer_1;                   // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FileCabinet_02_64_Test_Drawer_3;                   // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FileCabinet_02_64_Test_Drawer_7;                   // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FileCabinet_02_64_Test_Drawer_8;                   // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FileCabinet_02_64_Test_Drawer_6;                   // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   FileCabinet_02_64_Test_Drawer_4;                   // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable_7;                                 // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable_6;                                 // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable_5;                                 // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable_3;                                 // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable_2;                                 // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable_1;                                 // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable;                                   // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SecondMove_NewTrack_3_F61A967944A8D02865F0C2A0DC501175; // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            SecondMove__Direction_F61A967944A8D02865F0C2A0DC501175; // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     SecondMove;                                        // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Move_NewTrack_3_97F0DFE94ECF5D765BEF6C908AC0E127;  // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Move__Direction_97F0DFE94ECF5D765BEF6C908AC0E127;  // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Move;                                              // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseInteractableComponent*          CurrentInteractable;                               // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Drawer;                                            // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class USBZBaseInteractableComponent*, class UStaticMeshComponent*> StaticmeshRef;           // 0x03B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UStaticMeshComponent*, int32>      Map;                                               // 0x0408(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         RandomSpawnLoc;                                    // 0x0458(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45C[0x4];                                      // 0x045C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UStaticMeshComponent*>           DrawerArray;                                       // 0x0460(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ASBZInteractionActor*                   As_Interaction_Actor;                              // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              PickedUpRedCard;                                   // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UStaticMeshComponent*                   SecondDrawer;                                      // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RandomSeed;                                        // 0x0490(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USceneComponent*, struct FTransform> SpawnComponentTransformMap;                      // 0x0498(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_FileCabinet(int32 EntryPoint);
	void OnActorSpawned(class AActor* SpawnedActor, class USceneComponent* AttachParent);
	void On_Focus(const class USBZBaseInteractableComponent* InteractableComponent, bool bInNewState);
	void OnAckCompleteInteraction_Event_0(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void ReceiveBeginPlay();
	void SecondMove__UpdateFunc();
	void SecondMove__FinishedFunc();
	void Move__UpdateFunc();
	void Move__FinishedFunc();
	void UserConstructionScript();
	void SetLocations(float New_Relative_Location_X, class USceneComponent* Target, class UStaticMeshComponent** Drawer_0);
	void SetFocus(const class USBZBaseInteractableComponent*& Key, bool Condition);
	void SpawnItemInContainer(class UClass* WhatShould_Spawn, class ABP_RoomSpawnController_C* RoomControllerRef, class AActor** SpawnedActor);
	void PopulateSpawnInformationMap(TMap<class USceneComponent*, struct FTransform>* InOutSpawnDataMap);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_FileCabinet_C">();
	}
	static class ABP_FileCabinet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_FileCabinet_C>();
	}
};
static_assert(alignof(ABP_FileCabinet_C) == 0x000008, "Wrong alignment on ABP_FileCabinet_C");
static_assert(sizeof(ABP_FileCabinet_C) == 0x0004E8, "Wrong size on ABP_FileCabinet_C");
static_assert(offsetof(ABP_FileCabinet_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_FileCabinet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZAIObjectiveComponent_FileCabinet) == 0x0002B0, "Member 'ABP_FileCabinet_C::SBZAIObjectiveComponent_FileCabinet' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZOutline) == 0x0002B8, "Member 'ABP_FileCabinet_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZInteractable_4) == 0x0002C0, "Member 'ABP_FileCabinet_C::SBZInteractable_4' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Scene_4) == 0x0002C8, "Member 'ABP_FileCabinet_C::Scene_4' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, FileCabinet_02_64_Test_Drawer_5) == 0x0002D0, "Member 'ABP_FileCabinet_C::FileCabinet_02_64_Test_Drawer_5' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Scene_7) == 0x0002D8, "Member 'ABP_FileCabinet_C::Scene_7' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Scene_6) == 0x0002E0, "Member 'ABP_FileCabinet_C::Scene_6' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Scene_5) == 0x0002E8, "Member 'ABP_FileCabinet_C::Scene_5' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Scene_3) == 0x0002F0, "Member 'ABP_FileCabinet_C::Scene_3' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Scene_2) == 0x0002F8, "Member 'ABP_FileCabinet_C::Scene_2' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Scene_1) == 0x000300, "Member 'ABP_FileCabinet_C::Scene_1' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Scene) == 0x000308, "Member 'ABP_FileCabinet_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, CabinettBody) == 0x000310, "Member 'ABP_FileCabinet_C::CabinettBody' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, FileCabinet_02_64_Test_Drawer_2) == 0x000318, "Member 'ABP_FileCabinet_C::FileCabinet_02_64_Test_Drawer_2' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, FileCabinet_02_64_Test_Drawer_1) == 0x000320, "Member 'ABP_FileCabinet_C::FileCabinet_02_64_Test_Drawer_1' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, FileCabinet_02_64_Test_Drawer_3) == 0x000328, "Member 'ABP_FileCabinet_C::FileCabinet_02_64_Test_Drawer_3' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, FileCabinet_02_64_Test_Drawer_7) == 0x000330, "Member 'ABP_FileCabinet_C::FileCabinet_02_64_Test_Drawer_7' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, FileCabinet_02_64_Test_Drawer_8) == 0x000338, "Member 'ABP_FileCabinet_C::FileCabinet_02_64_Test_Drawer_8' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, FileCabinet_02_64_Test_Drawer_6) == 0x000340, "Member 'ABP_FileCabinet_C::FileCabinet_02_64_Test_Drawer_6' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, FileCabinet_02_64_Test_Drawer_4) == 0x000348, "Member 'ABP_FileCabinet_C::FileCabinet_02_64_Test_Drawer_4' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZInteractable_7) == 0x000350, "Member 'ABP_FileCabinet_C::SBZInteractable_7' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZInteractable_6) == 0x000358, "Member 'ABP_FileCabinet_C::SBZInteractable_6' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZInteractable_5) == 0x000360, "Member 'ABP_FileCabinet_C::SBZInteractable_5' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZInteractable_3) == 0x000368, "Member 'ABP_FileCabinet_C::SBZInteractable_3' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZInteractable_2) == 0x000370, "Member 'ABP_FileCabinet_C::SBZInteractable_2' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZInteractable_1) == 0x000378, "Member 'ABP_FileCabinet_C::SBZInteractable_1' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SBZInteractable) == 0x000380, "Member 'ABP_FileCabinet_C::SBZInteractable' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SecondMove_NewTrack_3_F61A967944A8D02865F0C2A0DC501175) == 0x000388, "Member 'ABP_FileCabinet_C::SecondMove_NewTrack_3_F61A967944A8D02865F0C2A0DC501175' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SecondMove__Direction_F61A967944A8D02865F0C2A0DC501175) == 0x00038C, "Member 'ABP_FileCabinet_C::SecondMove__Direction_F61A967944A8D02865F0C2A0DC501175' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SecondMove) == 0x000390, "Member 'ABP_FileCabinet_C::SecondMove' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Move_NewTrack_3_97F0DFE94ECF5D765BEF6C908AC0E127) == 0x000398, "Member 'ABP_FileCabinet_C::Move_NewTrack_3_97F0DFE94ECF5D765BEF6C908AC0E127' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Move__Direction_97F0DFE94ECF5D765BEF6C908AC0E127) == 0x00039C, "Member 'ABP_FileCabinet_C::Move__Direction_97F0DFE94ECF5D765BEF6C908AC0E127' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Move) == 0x0003A0, "Member 'ABP_FileCabinet_C::Move' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, CurrentInteractable) == 0x0003A8, "Member 'ABP_FileCabinet_C::CurrentInteractable' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Drawer) == 0x0003B0, "Member 'ABP_FileCabinet_C::Drawer' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, StaticmeshRef) == 0x0003B8, "Member 'ABP_FileCabinet_C::StaticmeshRef' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, Map) == 0x000408, "Member 'ABP_FileCabinet_C::Map' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, RandomSpawnLoc) == 0x000458, "Member 'ABP_FileCabinet_C::RandomSpawnLoc' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, DrawerArray) == 0x000460, "Member 'ABP_FileCabinet_C::DrawerArray' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, As_Interaction_Actor) == 0x000470, "Member 'ABP_FileCabinet_C::As_Interaction_Actor' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, PickedUpRedCard) == 0x000478, "Member 'ABP_FileCabinet_C::PickedUpRedCard' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SecondDrawer) == 0x000488, "Member 'ABP_FileCabinet_C::SecondDrawer' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, RandomSeed) == 0x000490, "Member 'ABP_FileCabinet_C::RandomSeed' has a wrong offset!");
static_assert(offsetof(ABP_FileCabinet_C, SpawnComponentTransformMap) == 0x000498, "Member 'ABP_FileCabinet_C::SpawnComponentTransformMap' has a wrong offset!");

}

