#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FloatingText_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FloatingText_Base.BP_FloatingText_Base_C.ExecuteUbergraph_BP_FloatingText_Base
// 0x0060 (0x0060 - 0x0000)
struct BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetDisplayScale_UserSpecifiedScale;       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReachedPointOfMaxWidgetScale__Yes_;       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateDistanceBasedWidgetScaleModifier_WidgetScaleModifier; // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_DamageText_Base_C*                  K2Node_DynamicCast_AsUI_Damage_Text_Base;          // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base) == 0x000008, "Wrong alignment on BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base");
static_assert(sizeof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base) == 0x000060, "Wrong size on BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, EntryPoint) == 0x000000, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_GetDisplayScale_UserSpecifiedScale) == 0x000018, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_GetDisplayScale_UserSpecifiedScale' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_ReachedPointOfMaxWidgetScale__Yes_) == 0x000028, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_ReachedPointOfMaxWidgetScale__Yes_' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00002C, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000030, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_CalculateDistanceBasedWidgetScaleModifier_WidgetScaleModifier) == 0x000034, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_CalculateDistanceBasedWidgetScaleModifier_WidgetScaleModifier' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_SelectFloat_ReturnValue) == 0x000038, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00003C, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_FClamp_ReturnValue) == 0x000040, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000048, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, K2Node_DynamicCast_AsUI_Damage_Text_Base) == 0x000050, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::K2Node_DynamicCast_AsUI_Damage_Text_Base' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'BP_FloatingText_Base_C_ExecuteUbergraph_BP_FloatingText_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_FloatingText_Base.BP_FloatingText_Base_C.ReachedPointOfMaxWidgetScale?
// 0x0001 (0x0001 - 0x0000)
struct BP_FloatingText_Base_C_ReachedPointOfMaxWidgetScale_ final
{
public:
	bool                                          Yes_;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FloatingText_Base_C_ReachedPointOfMaxWidgetScale_) == 0x000001, "Wrong alignment on BP_FloatingText_Base_C_ReachedPointOfMaxWidgetScale_");
static_assert(sizeof(BP_FloatingText_Base_C_ReachedPointOfMaxWidgetScale_) == 0x000001, "Wrong size on BP_FloatingText_Base_C_ReachedPointOfMaxWidgetScale_");
static_assert(offsetof(BP_FloatingText_Base_C_ReachedPointOfMaxWidgetScale_, Yes_) == 0x000000, "Member 'BP_FloatingText_Base_C_ReachedPointOfMaxWidgetScale_::Yes_' has a wrong offset!");

// Function BP_FloatingText_Base.BP_FloatingText_Base_C.CalculateDistanceBasedWidgetScaleModifier
// 0x0020 (0x0020 - 0x0000)
struct BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier final
{
public:
	float                                         WidgetScaleModifier;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier) == 0x000008, "Wrong alignment on BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier");
static_assert(sizeof(BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier) == 0x000020, "Wrong size on BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier");
static_assert(offsetof(BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier, WidgetScaleModifier) == 0x000000, "Member 'BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier::WidgetScaleModifier' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier, CallFunc_GetDistanceTo_ReturnValue) == 0x000010, "Member 'BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier, CallFunc_FMax_ReturnValue) == 0x00001C, "Member 'BP_FloatingText_Base_C_CalculateDistanceBasedWidgetScaleModifier::CallFunc_FMax_ReturnValue' has a wrong offset!");

}

