#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FireExtinguisher_Foam

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_FireExtinguisher_Foam.BP_FireExtinguisher_Foam_C.ExecuteUbergraph_BP_FireExtinguisher_Foam
// 0x0008 (0x0008 - 0x0000)
struct BP_FireExtinguisher_Foam_C_ExecuteUbergraph_BP_FireExtinguisher_Foam final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FireExtinguisher_Foam_C_ExecuteUbergraph_BP_FireExtinguisher_Foam) == 0x000004, "Wrong alignment on BP_FireExtinguisher_Foam_C_ExecuteUbergraph_BP_FireExtinguisher_Foam");
static_assert(sizeof(BP_FireExtinguisher_Foam_C_ExecuteUbergraph_BP_FireExtinguisher_Foam) == 0x000008, "Wrong size on BP_FireExtinguisher_Foam_C_ExecuteUbergraph_BP_FireExtinguisher_Foam");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_ExecuteUbergraph_BP_FireExtinguisher_Foam, EntryPoint) == 0x000000, "Member 'BP_FireExtinguisher_Foam_C_ExecuteUbergraph_BP_FireExtinguisher_Foam::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_ExecuteUbergraph_BP_FireExtinguisher_Foam, K2Node_Event_bDoCosmetics) == 0x000004, "Member 'BP_FireExtinguisher_Foam_C_ExecuteUbergraph_BP_FireExtinguisher_Foam::K2Node_Event_bDoCosmetics' has a wrong offset!");

// Function BP_FireExtinguisher_Foam.BP_FireExtinguisher_Foam_C.BP_OnExplosion
// 0x0001 (0x0001 - 0x0000)
struct BP_FireExtinguisher_Foam_C_BP_OnExplosion final
{
public:
	bool                                          bDoCosmetics;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FireExtinguisher_Foam_C_BP_OnExplosion) == 0x000001, "Wrong alignment on BP_FireExtinguisher_Foam_C_BP_OnExplosion");
static_assert(sizeof(BP_FireExtinguisher_Foam_C_BP_OnExplosion) == 0x000001, "Wrong size on BP_FireExtinguisher_Foam_C_BP_OnExplosion");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_BP_OnExplosion, bDoCosmetics) == 0x000000, "Member 'BP_FireExtinguisher_Foam_C_BP_OnExplosion::bDoCosmetics' has a wrong offset!");

// Function BP_FireExtinguisher_Foam.BP_FireExtinguisher_Foam_C.GetSightModifier
// 0x002C (0x002C - 0x0000)
struct BP_FireExtinguisher_Foam_C_GetSightModifier final
{
public:
	struct FVector                                Start;                                             // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                End;                                               // 0x000C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSegmentOverlapping_ReturnValue;         // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FireExtinguisher_Foam_C_GetSightModifier) == 0x000004, "Wrong alignment on BP_FireExtinguisher_Foam_C_GetSightModifier");
static_assert(sizeof(BP_FireExtinguisher_Foam_C_GetSightModifier) == 0x00002C, "Wrong size on BP_FireExtinguisher_Foam_C_GetSightModifier");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_GetSightModifier, Start) == 0x000000, "Member 'BP_FireExtinguisher_Foam_C_GetSightModifier::Start' has a wrong offset!");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_GetSightModifier, End) == 0x00000C, "Member 'BP_FireExtinguisher_Foam_C_GetSightModifier::End' has a wrong offset!");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_GetSightModifier, ReturnValue) == 0x000018, "Member 'BP_FireExtinguisher_Foam_C_GetSightModifier::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_GetSightModifier, Temp_bool_Variable) == 0x00001C, "Member 'BP_FireExtinguisher_Foam_C_GetSightModifier::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_GetSightModifier, Temp_float_Variable) == 0x000020, "Member 'BP_FireExtinguisher_Foam_C_GetSightModifier::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_GetSightModifier, CallFunc_IsSegmentOverlapping_ReturnValue) == 0x000024, "Member 'BP_FireExtinguisher_Foam_C_GetSightModifier::CallFunc_IsSegmentOverlapping_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_GetSightModifier, K2Node_Select_Default) == 0x000028, "Member 'BP_FireExtinguisher_Foam_C_GetSightModifier::K2Node_Select_Default' has a wrong offset!");

// Function BP_FireExtinguisher_Foam.BP_FireExtinguisher_Foam_C.CanAffectStealth
// 0x0001 (0x0001 - 0x0000)
struct BP_FireExtinguisher_Foam_C_CanAffectStealth final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FireExtinguisher_Foam_C_CanAffectStealth) == 0x000001, "Wrong alignment on BP_FireExtinguisher_Foam_C_CanAffectStealth");
static_assert(sizeof(BP_FireExtinguisher_Foam_C_CanAffectStealth) == 0x000001, "Wrong size on BP_FireExtinguisher_Foam_C_CanAffectStealth");
static_assert(offsetof(BP_FireExtinguisher_Foam_C_CanAffectStealth, ReturnValue) == 0x000000, "Member 'BP_FireExtinguisher_Foam_C_CanAffectStealth::ReturnValue' has a wrong offset!");

}

