#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HeistGameState

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HeistGameState.BP_HeistGameState_C.ExecuteUbergraph_BP_HeistGameState
// 0x0008 (0x0008 - 0x0000)
struct BP_HeistGameState_C_ExecuteUbergraph_BP_HeistGameState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsHidden;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HeistGameState_C_ExecuteUbergraph_BP_HeistGameState) == 0x000004, "Wrong alignment on BP_HeistGameState_C_ExecuteUbergraph_BP_HeistGameState");
static_assert(sizeof(BP_HeistGameState_C_ExecuteUbergraph_BP_HeistGameState) == 0x000008, "Wrong size on BP_HeistGameState_C_ExecuteUbergraph_BP_HeistGameState");
static_assert(offsetof(BP_HeistGameState_C_ExecuteUbergraph_BP_HeistGameState, EntryPoint) == 0x000000, "Member 'BP_HeistGameState_C_ExecuteUbergraph_BP_HeistGameState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HeistGameState_C_ExecuteUbergraph_BP_HeistGameState, K2Node_Event_bIsHidden) == 0x000004, "Member 'BP_HeistGameState_C_ExecuteUbergraph_BP_HeistGameState::K2Node_Event_bIsHidden' has a wrong offset!");

// Function BP_HeistGameState.BP_HeistGameState_C.BP_OnHideAllOutlinesChanged
// 0x0001 (0x0001 - 0x0000)
struct BP_HeistGameState_C_BP_OnHideAllOutlinesChanged final
{
public:
	bool                                          bIsHidden;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HeistGameState_C_BP_OnHideAllOutlinesChanged) == 0x000001, "Wrong alignment on BP_HeistGameState_C_BP_OnHideAllOutlinesChanged");
static_assert(sizeof(BP_HeistGameState_C_BP_OnHideAllOutlinesChanged) == 0x000001, "Wrong size on BP_HeistGameState_C_BP_OnHideAllOutlinesChanged");
static_assert(offsetof(BP_HeistGameState_C_BP_OnHideAllOutlinesChanged, bIsHidden) == 0x000000, "Member 'BP_HeistGameState_C_BP_OnHideAllOutlinesChanged::bIsHidden' has a wrong offset!");

}

