#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableUnBreachableDoubleDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Door_opening_setup_structs.hpp"
#include "doorStateSimple_structs.hpp"
#include "BP_interactableDoor_Base_classes.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractableUnBreachableDoubleDoor.BP_InteractableUnBreachableDoubleDoor_C
// 0x00D0 (0x06C8 - 0x05F8)
class ABP_InteractableUnBreachableDoubleDoor_C : public ABP_interactableDoor_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_InteractableUnBreachableDoubleDoor_C; // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Hinge3;                                            // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Hinge1;                                            // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Breach_B;                                          // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Breach_A;                                          // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Reinforcement_B;                                   // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Reinforcement_A;                                   // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handle_02;                                         // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handle_01;                                         // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZDoorBoxComponent*                   SBZSlideSprintCollisionBoxBackwardB;               // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZDoorBoxComponent*                   SBZSlideSprintCollisionBoxForwardB;                // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZDoorBoxComponent*                   SBZSlideSprintCollisionBoxBackwardA;               // 0x0650(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZDoorBoxComponent*                   SBZSlideSprintCollisionBoxForwardA;                // 0x0658(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticDoorMesh_B;                                  // 0x0660(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticDoorMesh_A;                                  // 0x0668(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Hinge4;                                            // 0x0670(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Hinge2;                                            // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorBoxB;                                          // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorBoxA;                                          // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticFrameMesh;                                   // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BreachedMesh_A;                                    // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BreachedMesh_B;                                    // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BreachVFX;                                         // 0x06A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BreachedReinforcementMesh_B;                       // 0x06B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BreachedReinforcementMesh_A;                       // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDoor_opening_setup                           openingDirection;                                  // 0x06C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor(int32 EntryPoint);
	void onOpenAnimStarted();
	void onOpenAnimUpdateTick(ESBZGateState oldState, ESBZGateState newState, float alpha);
	void onDoorBreached(ESBZGateState oldState, ESBZGateState newState);
	void initToValidPosition(ESBZGateState oldState);
	void setBreachedMeshVisibility(bool breached);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractableUnBreachableDoubleDoor_C">();
	}
	static class ABP_InteractableUnBreachableDoubleDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractableUnBreachableDoubleDoor_C>();
	}
};
static_assert(alignof(ABP_InteractableUnBreachableDoubleDoor_C) == 0x000008, "Wrong alignment on ABP_InteractableUnBreachableDoubleDoor_C");
static_assert(sizeof(ABP_InteractableUnBreachableDoubleDoor_C) == 0x0006C8, "Wrong size on ABP_InteractableUnBreachableDoubleDoor_C");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, UberGraphFrame_BP_InteractableUnBreachableDoubleDoor_C) == 0x0005F8, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::UberGraphFrame_BP_InteractableUnBreachableDoubleDoor_C' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Hinge3) == 0x000600, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Hinge3' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Hinge1) == 0x000608, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Hinge1' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Breach_B) == 0x000610, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Breach_B' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Breach_A) == 0x000618, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Breach_A' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Reinforcement_B) == 0x000620, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Reinforcement_B' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Reinforcement_A) == 0x000628, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Reinforcement_A' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Handle_02) == 0x000630, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Handle_02' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Handle_01) == 0x000638, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Handle_01' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, SBZSlideSprintCollisionBoxBackwardB) == 0x000640, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::SBZSlideSprintCollisionBoxBackwardB' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, SBZSlideSprintCollisionBoxForwardB) == 0x000648, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::SBZSlideSprintCollisionBoxForwardB' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, SBZSlideSprintCollisionBoxBackwardA) == 0x000650, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::SBZSlideSprintCollisionBoxBackwardA' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, SBZSlideSprintCollisionBoxForwardA) == 0x000658, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::SBZSlideSprintCollisionBoxForwardA' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, StaticDoorMesh_B) == 0x000660, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::StaticDoorMesh_B' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, StaticDoorMesh_A) == 0x000668, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::StaticDoorMesh_A' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Hinge4) == 0x000670, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Hinge4' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, Hinge2) == 0x000678, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::Hinge2' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, DoorBoxB) == 0x000680, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::DoorBoxB' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, DoorBoxA) == 0x000688, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::DoorBoxA' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, StaticFrameMesh) == 0x000690, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::StaticFrameMesh' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, BreachedMesh_A) == 0x000698, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::BreachedMesh_A' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, BreachedMesh_B) == 0x0006A0, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::BreachedMesh_B' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, BreachVFX) == 0x0006A8, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::BreachVFX' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, BreachedReinforcementMesh_B) == 0x0006B0, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::BreachedReinforcementMesh_B' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, BreachedReinforcementMesh_A) == 0x0006B8, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::BreachedReinforcementMesh_A' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableDoubleDoor_C, openingDirection) == 0x0006C0, "Member 'ABP_InteractableUnBreachableDoubleDoor_C::openingDirection' has a wrong offset!");

}

