#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableGold

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_InteractableGold.BP_InteractableGold_C.ExecuteUbergraph_BP_InteractableGold
// 0x000C (0x000C - 0x0000)
struct BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold) == 0x000004, "Wrong alignment on BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold");
static_assert(sizeof(BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold) == 0x00000C, "Wrong size on BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold");
static_assert(offsetof(BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold, EntryPoint) == 0x000000, "Member 'BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold, K2Node_Event_bDoCosmetics) == 0x000004, "Member 'BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000008, "Member 'BP_InteractableGold_C_ExecuteUbergraph_BP_InteractableGold::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");

// Function BP_InteractableGold.BP_InteractableGold_C.BP_OnChangedToSecondaryType
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractableGold_C_BP_OnChangedToSecondaryType final
{
public:
	bool                                          bDoCosmetics;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractableGold_C_BP_OnChangedToSecondaryType) == 0x000001, "Wrong alignment on BP_InteractableGold_C_BP_OnChangedToSecondaryType");
static_assert(sizeof(BP_InteractableGold_C_BP_OnChangedToSecondaryType) == 0x000001, "Wrong size on BP_InteractableGold_C_BP_OnChangedToSecondaryType");
static_assert(offsetof(BP_InteractableGold_C_BP_OnChangedToSecondaryType, bDoCosmetics) == 0x000000, "Member 'BP_InteractableGold_C_BP_OnChangedToSecondaryType::bDoCosmetics' has a wrong offset!");

}

