#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableDegradableTech

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractableDegradableTech.BP_InteractableDegradableTech_C.ExecuteUbergraph_BP_InteractableDegradableTech
// 0x00B0 (0x00B0 - 0x0000)
struct BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable_1;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor_1;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech) == 0x000008, "Wrong alignment on BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech");
static_assert(sizeof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech) == 0x0000B0, "Wrong size on BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, EntryPoint) == 0x000000, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000004, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_BreakRotator_Roll) == 0x000010, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_BreakRotator_Pitch) == 0x000014, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_BreakRotator_Yaw) == 0x000018, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00001C, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_MakeRotator_ReturnValue) == 0x000024, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, K2Node_Event_bDoCosmetics) == 0x000030, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, K2Node_ComponentBoundEvent_Interactable_1) == 0x000038, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, K2Node_ComponentBoundEvent_Interactor_1) == 0x000040, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::K2Node_ComponentBoundEvent_Interactor_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1) == 0x000048, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000058, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_BreakRotator_Roll_1) == 0x000064, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_BreakRotator_Pitch_1) == 0x000068, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_BreakRotator_Yaw_1) == 0x00006C, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, K2Node_ComponentBoundEvent_Interactable) == 0x000070, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, K2Node_ComponentBoundEvent_Interactor) == 0x000078, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000080, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000084, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000088, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_MakeRotator_ReturnValue_1) == 0x000094, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x0000A0, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x0000A8, "Member 'BP_InteractableDegradableTech_C_ExecuteUbergraph_BP_InteractableDegradableTech::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");

// Function BP_InteractableDegradableTech.BP_InteractableDegradableTech_C.BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_InteractableDegradableTech.BP_InteractableDegradableTech_C.BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_InteractableDegradableTech_C_BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_InteractableDegradableTech.BP_InteractableDegradableTech_C.BP_OnChangedToSecondaryType
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractableDegradableTech_C_BP_OnChangedToSecondaryType final
{
public:
	bool                                          bDoCosmetics;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractableDegradableTech_C_BP_OnChangedToSecondaryType) == 0x000001, "Wrong alignment on BP_InteractableDegradableTech_C_BP_OnChangedToSecondaryType");
static_assert(sizeof(BP_InteractableDegradableTech_C_BP_OnChangedToSecondaryType) == 0x000001, "Wrong size on BP_InteractableDegradableTech_C_BP_OnChangedToSecondaryType");
static_assert(offsetof(BP_InteractableDegradableTech_C_BP_OnChangedToSecondaryType, bDoCosmetics) == 0x000000, "Member 'BP_InteractableDegradableTech_C_BP_OnChangedToSecondaryType::bDoCosmetics' has a wrong offset!");

}

