#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_interactableDoor_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "doorStateSimple_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_interactableDoor_Base.BP_interactableDoor_Base_C
// 0x0020 (0x05F8 - 0x05D8)
class ABP_interactableDoor_Base_C : public ASBZInteractableDoor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         open_Yaw_05B0D0D14204C5C077442AB2D2A9ED63;         // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            open__Direction_05B0D0D14204C5C077442AB2D2A9ED63;  // 0x05E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E5[0x3];                                      // 0x05E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     open;                                              // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          phaseThroughPlayersWhenMoving;                     // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_interactableDoor_Base(int32 EntryPoint);
	void onOpenAnimFinished();
	void onOpenAnimStarted();
	void setBreachedMeshVisibility(bool breached);
	void initToValidPosition(ESBZGateState oldState);
	void onOpenAnimUpdateTick(ESBZGateState oldState, ESBZGateState newState, float alpha);
	void onDoorBreached(ESBZGateState oldState, ESBZGateState newState);
	void OnStateChanged(ESBZGateState OldState, ESBZGateState NewState, bool bIsInitialStateChange);
	void open__UpdateFunc();
	void open__FinishedFunc();
	void getDoorSimpleState(ESBZGateState state, EdoorStateSimple* simpleState);
	void canDoorAnimate(ESBZGateState oldState, ESBZGateState newState, bool* canAnimate);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_interactableDoor_Base_C">();
	}
	static class ABP_interactableDoor_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_interactableDoor_Base_C>();
	}
};
static_assert(alignof(ABP_interactableDoor_Base_C) == 0x000008, "Wrong alignment on ABP_interactableDoor_Base_C");
static_assert(sizeof(ABP_interactableDoor_Base_C) == 0x0005F8, "Wrong size on ABP_interactableDoor_Base_C");
static_assert(offsetof(ABP_interactableDoor_Base_C, UberGraphFrame) == 0x0005D8, "Member 'ABP_interactableDoor_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_interactableDoor_Base_C, open_Yaw_05B0D0D14204C5C077442AB2D2A9ED63) == 0x0005E0, "Member 'ABP_interactableDoor_Base_C::open_Yaw_05B0D0D14204C5C077442AB2D2A9ED63' has a wrong offset!");
static_assert(offsetof(ABP_interactableDoor_Base_C, open__Direction_05B0D0D14204C5C077442AB2D2A9ED63) == 0x0005E4, "Member 'ABP_interactableDoor_Base_C::open__Direction_05B0D0D14204C5C077442AB2D2A9ED63' has a wrong offset!");
static_assert(offsetof(ABP_interactableDoor_Base_C, open) == 0x0005E8, "Member 'ABP_interactableDoor_Base_C::open' has a wrong offset!");
static_assert(offsetof(ABP_interactableDoor_Base_C, phaseThroughPlayersWhenMoving) == 0x0005F0, "Member 'ABP_interactableDoor_Base_C::phaseThroughPlayersWhenMoving' has a wrong offset!");

}

