#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableBreachableDoubleDoor

#include "Basic.hpp"

#include "BP_InteractableUnBreachableDoubleDoor_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractableBreachableDoubleDoor.BP_InteractableBreachableDoubleDoor_C
// 0x0020 (0x06E8 - 0x06C8)
class ABP_InteractableBreachableDoubleDoor_C : public ABP_InteractableUnBreachableDoubleDoor_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_InteractableBreachableDoubleDoor_C; // 0x06C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BreachBox_A;                                       // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BreachBox_B;                                       // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZPropDamageComponent*                SBZPropDamage;                                     // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InteractableBreachableDoubleDoor(int32 EntryPoint);
	void setBreachedMeshVisibility(bool breached);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractableBreachableDoubleDoor_C">();
	}
	static class ABP_InteractableBreachableDoubleDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractableBreachableDoubleDoor_C>();
	}
};
static_assert(alignof(ABP_InteractableBreachableDoubleDoor_C) == 0x000008, "Wrong alignment on ABP_InteractableBreachableDoubleDoor_C");
static_assert(sizeof(ABP_InteractableBreachableDoubleDoor_C) == 0x0006E8, "Wrong size on ABP_InteractableBreachableDoubleDoor_C");
static_assert(offsetof(ABP_InteractableBreachableDoubleDoor_C, UberGraphFrame_BP_InteractableBreachableDoubleDoor_C) == 0x0006C8, "Member 'ABP_InteractableBreachableDoubleDoor_C::UberGraphFrame_BP_InteractableBreachableDoubleDoor_C' has a wrong offset!");
static_assert(offsetof(ABP_InteractableBreachableDoubleDoor_C, BreachBox_A) == 0x0006D0, "Member 'ABP_InteractableBreachableDoubleDoor_C::BreachBox_A' has a wrong offset!");
static_assert(offsetof(ABP_InteractableBreachableDoubleDoor_C, BreachBox_B) == 0x0006D8, "Member 'ABP_InteractableBreachableDoubleDoor_C::BreachBox_B' has a wrong offset!");
static_assert(offsetof(ABP_InteractableBreachableDoubleDoor_C, SBZPropDamage) == 0x0006E0, "Member 'ABP_InteractableBreachableDoubleDoor_C::SBZPropDamage' has a wrong offset!");

}

