#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IW_BRE_CUT_OPE_NAV_ATT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BPS_GlassHit_VFXData_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IW_BRE_CUT_OPE_NAV_ATT.BP_IW_BRE_CUT_OPE_NAV_ATT_C
// 0x00D8 (0x0678 - 0x05A0)
class ABP_IW_BRE_CUT_OPE_NAV_ATT_C final : public ASBZInteractableWindow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZRoomConnectorComponent*             SBZRoomConnector;                                  // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   damaged_frame_mesh;                                // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NiagaraComponent;                                  // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCuttableComponent*                  SBZCuttable;                                       // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCuttableSplineComponent*            SBZCuttableSpline;                                 // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeltingMesh_1;                                     // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZPropDamageComponent*                SBZPropDamage;                                     // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          main_top_window;                                   // 0x05E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          mobile_frame;                                      // 0x05F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          main_frame_left;                                   // 0x05F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          main_frame_top;                                    // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          main_frame_left_1;                                 // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          main_frame_right_1;                                // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          main_frame_top_1;                                  // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          main_frame_bottom;                                 // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          main_frame_right;                                  // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticWindowHandle;                                // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticFrameMesh;                                   // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Open_Offset_26E6FA8842D9BD66DED586BB91F7F097;      // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Open__Direction_26E6FA8842D9BD66DED586BB91F7F097;  // 0x0644(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_645[0x3];                                      // 0x0645(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Open;                                              // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Sliding_factor;                                    // 0x0650(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Particle_count;                                    // 0x0654(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Do_Cosmetics;                                      // 0x0658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             DamageInstigator;                                  // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBPS_GlassHit_VFXData>          VFX;                                               // 0x0668(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_IW_BRE_CUT_OPE_NAV_ATT(int32 EntryPoint);
	void BndEvt__SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature(class UActorComponent* PoolComponent, int32 Hits, bool bDoCosmetics, const struct FSBZPropDamageContext& DamageContext);
	void OnStateChanged(ESBZGateState OldState, ESBZGateState NewState, bool bIsInitialStateChange);
	void Open__UpdateFunc();
	void Open__FinishedFunc();
	class USBZCuttableComponent* GetCuttableComponent();
	class USBZCuttableSplineComponent* GetCuttableSplineComponent();
	void GetMaterialBillboardComponent();
	class UStaticMeshComponent* GetMeltingMesh();
	class UNiagaraComponent* GetNiagaraComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IW_BRE_CUT_OPE_NAV_ATT_C">();
	}
	static class ABP_IW_BRE_CUT_OPE_NAV_ATT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IW_BRE_CUT_OPE_NAV_ATT_C>();
	}
};
static_assert(alignof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C) == 0x000008, "Wrong alignment on ABP_IW_BRE_CUT_OPE_NAV_ATT_C");
static_assert(sizeof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C) == 0x000678, "Wrong size on ABP_IW_BRE_CUT_OPE_NAV_ATT_C");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, UberGraphFrame) == 0x0005A0, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, SBZRoomConnector) == 0x0005A8, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::SBZRoomConnector' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, SBZCosmeticDestruction) == 0x0005B0, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, damaged_frame_mesh) == 0x0005B8, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::damaged_frame_mesh' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, NiagaraComponent) == 0x0005C0, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::NiagaraComponent' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, SBZCuttable) == 0x0005C8, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::SBZCuttable' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, SBZCuttableSpline) == 0x0005D0, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::SBZCuttableSpline' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, MeltingMesh_1) == 0x0005D8, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::MeltingMesh_1' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, SBZPropDamage) == 0x0005E0, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::SBZPropDamage' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, main_top_window) == 0x0005E8, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::main_top_window' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, mobile_frame) == 0x0005F0, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::mobile_frame' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, main_frame_left) == 0x0005F8, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::main_frame_left' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, main_frame_top) == 0x000600, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::main_frame_top' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, main_frame_left_1) == 0x000608, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::main_frame_left_1' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, main_frame_right_1) == 0x000610, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::main_frame_right_1' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, main_frame_top_1) == 0x000618, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::main_frame_top_1' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, main_frame_bottom) == 0x000620, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::main_frame_bottom' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, main_frame_right) == 0x000628, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::main_frame_right' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, StaticWindowHandle) == 0x000630, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::StaticWindowHandle' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, StaticFrameMesh) == 0x000638, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::StaticFrameMesh' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, Open_Offset_26E6FA8842D9BD66DED586BB91F7F097) == 0x000640, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::Open_Offset_26E6FA8842D9BD66DED586BB91F7F097' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, Open__Direction_26E6FA8842D9BD66DED586BB91F7F097) == 0x000644, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::Open__Direction_26E6FA8842D9BD66DED586BB91F7F097' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, Open) == 0x000648, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::Open' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, Sliding_factor) == 0x000650, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::Sliding_factor' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, Particle_count) == 0x000654, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::Particle_count' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, Do_Cosmetics) == 0x000658, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::Do_Cosmetics' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, DamageInstigator) == 0x000660, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::DamageInstigator' has a wrong offset!");
static_assert(offsetof(ABP_IW_BRE_CUT_OPE_NAV_ATT_C, VFX) == 0x000668, "Member 'ABP_IW_BRE_CUT_OPE_NAV_ATT_C::VFX' has a wrong offset!");

}

