#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableUnBreachableSingleDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Door_opening_setup_structs.hpp"
#include "doorStateSimple_structs.hpp"
#include "BP_interactableDoor_Base_classes.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractableUnBreachableSingleDoor.BP_InteractableUnBreachableSingleDoor_C
// 0x0078 (0x0670 - 0x05F8)
#pragma pack(push, 0x1)
class alignas(0x08) ABP_InteractableUnBreachableSingleDoor_C : public ABP_interactableDoor_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_InteractableUnBreachableSingleDoor_C; // 0x05F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   breached;                                          // 0x0600(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ReinforcementMesh;                                 // 0x0608(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorBox;                                           // 0x0610(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Handle_01;                                         // 0x0618(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZDoorBoxComponent*                   SBZSlideSprintCollisionBoxBackwardA;               // 0x0620(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZDoorBoxComponent*                   SBZSlideSprintCollisionBoxForwardA;                // 0x0628(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticDoorMesh;                                    // 0x0630(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        hinge2;                                            // 0x0638(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        hinge1;                                            // 0x0640(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticFrameMesh;                                   // 0x0648(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BreachedMesh;                                      // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         BreachVFX;                                         // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            BreachedReinforcementMesh;                         // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDoor_opening_setup                           openingDirection;                                  // 0x0668(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          reverseOpeningDirection;                           // 0x0669(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_InteractableUnBreachableSingleDoor(int32 EntryPoint);
	void onOpenAnimStarted();
	void onOpenAnimUpdateTick(ESBZGateState oldState, ESBZGateState newState, float alpha);
	void onDoorBreached(ESBZGateState oldState, ESBZGateState newState);
	void initToValidPosition(ESBZGateState oldState);
	void setBreachedMeshVisibility(bool breached_0);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractableUnBreachableSingleDoor_C">();
	}
	static class ABP_InteractableUnBreachableSingleDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractableUnBreachableSingleDoor_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(ABP_InteractableUnBreachableSingleDoor_C) == 0x000008, "Wrong alignment on ABP_InteractableUnBreachableSingleDoor_C");
static_assert(sizeof(ABP_InteractableUnBreachableSingleDoor_C) == 0x000670, "Wrong size on ABP_InteractableUnBreachableSingleDoor_C");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, UberGraphFrame_BP_InteractableUnBreachableSingleDoor_C) == 0x0005F8, "Member 'ABP_InteractableUnBreachableSingleDoor_C::UberGraphFrame_BP_InteractableUnBreachableSingleDoor_C' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, breached) == 0x000600, "Member 'ABP_InteractableUnBreachableSingleDoor_C::breached' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, ReinforcementMesh) == 0x000608, "Member 'ABP_InteractableUnBreachableSingleDoor_C::ReinforcementMesh' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, DoorBox) == 0x000610, "Member 'ABP_InteractableUnBreachableSingleDoor_C::DoorBox' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, Handle_01) == 0x000618, "Member 'ABP_InteractableUnBreachableSingleDoor_C::Handle_01' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, SBZSlideSprintCollisionBoxBackwardA) == 0x000620, "Member 'ABP_InteractableUnBreachableSingleDoor_C::SBZSlideSprintCollisionBoxBackwardA' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, SBZSlideSprintCollisionBoxForwardA) == 0x000628, "Member 'ABP_InteractableUnBreachableSingleDoor_C::SBZSlideSprintCollisionBoxForwardA' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, StaticDoorMesh) == 0x000630, "Member 'ABP_InteractableUnBreachableSingleDoor_C::StaticDoorMesh' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, hinge2) == 0x000638, "Member 'ABP_InteractableUnBreachableSingleDoor_C::hinge2' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, hinge1) == 0x000640, "Member 'ABP_InteractableUnBreachableSingleDoor_C::hinge1' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, StaticFrameMesh) == 0x000648, "Member 'ABP_InteractableUnBreachableSingleDoor_C::StaticFrameMesh' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, BreachedMesh) == 0x000650, "Member 'ABP_InteractableUnBreachableSingleDoor_C::BreachedMesh' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, BreachVFX) == 0x000658, "Member 'ABP_InteractableUnBreachableSingleDoor_C::BreachVFX' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, BreachedReinforcementMesh) == 0x000660, "Member 'ABP_InteractableUnBreachableSingleDoor_C::BreachedReinforcementMesh' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, openingDirection) == 0x000668, "Member 'ABP_InteractableUnBreachableSingleDoor_C::openingDirection' has a wrong offset!");
static_assert(offsetof(ABP_InteractableUnBreachableSingleDoor_C, reverseOpeningDirection) == 0x000669, "Member 'ABP_InteractableUnBreachableSingleDoor_C::reverseOpeningDirection' has a wrong offset!");

}

