#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableUnBreachableDoubleDoor

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "doorStateSimple_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractableUnBreachableDoubleDoor.BP_InteractableUnBreachableDoubleDoor_C.ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor
// 0x04F0 (0x04F0 - 0x0000)
struct BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x000C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x009C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x012C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x01BC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x024D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24E[0x2];                                      // 0x024E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_4;  // 0x0250(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_5;  // 0x02E0(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_breached;                             // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default_1;                           // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0373(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0374(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	ESBZGateState                                 K2Node_Event_oldState_2;                           // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 K2Node_Event_oldState_1;                           // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 K2Node_Event_newState_1;                           // 0x038A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EdoorStateSimple                              CallFunc_getDoorSimpleState_simpleState;           // 0x038B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x038C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x038D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_38E[0x2];                                      // 0x038E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0390(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 K2Node_Event_oldState;                             // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 K2Node_Event_newState;                             // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_alpha;                                // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EdoorStateSimple                              CallFunc_getDoorSimpleState_simpleState_1;         // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EdoorStateSimple                              CallFunc_getDoorSimpleState_simpleState_2;         // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x03BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x03BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x03BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x03BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_6;  // 0x03C0(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_7;  // 0x0450(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E3[0x1];                                      // 0x04E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor) == 0x000008, "Wrong alignment on BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor");
static_assert(sizeof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor) == 0x0004F0, "Wrong size on BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, EntryPoint) == 0x000000, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, Temp_byte_Variable) == 0x000004, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, Temp_byte_Variable_1) == 0x000006, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, Temp_bool_Variable) == 0x000007, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, Temp_byte_Variable_2) == 0x000008, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, Temp_byte_Variable_3) == 0x00000A, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, Temp_bool_Variable_1) == 0x00000B, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00000C, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x00009C, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x00012C, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x0001BC, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_SwitchEnum_CmpSuccess_1) == 0x00024C, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_SwitchEnum_CmpSuccess_2) == 0x00024D, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult_4) == 0x000250, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult_5) == 0x0002E0, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult_5' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_Event_breached) == 0x000370, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_Event_breached' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_Select_Default) == 0x000371, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_Select_Default_1) == 0x000372, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_Not_PreBool_ReturnValue) == 0x000373, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, Temp_delegate_Variable) == 0x000374, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_Event_oldState_2) == 0x000388, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_Event_oldState_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_Event_oldState_1) == 0x000389, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_Event_oldState_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_Event_newState_1) == 0x00038A, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_Event_newState_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_getDoorSimpleState_simpleState) == 0x00038B, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_getDoorSimpleState_simpleState' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00038C, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_SwitchEnum_CmpSuccess_3) == 0x00038D, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, Temp_struct_Variable) == 0x000390, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0003A0, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_PostEvent_ReturnValue) == 0x0003A8, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_Event_oldState) == 0x0003AC, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_Event_oldState' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_Event_newState) == 0x0003AD, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_Event_newState' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, K2Node_Event_alpha) == 0x0003B0, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::K2Node_Event_alpha' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0003B4, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_getDoorSimpleState_simpleState_1) == 0x0003B8, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_getDoorSimpleState_simpleState_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_getDoorSimpleState_simpleState_2) == 0x0003B9, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_getDoorSimpleState_simpleState_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0003BA, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0003BB, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0003BC, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_BooleanOR_ReturnValue) == 0x0003BD, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0003BE, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_BooleanOR_ReturnValue_1) == 0x0003BF, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult_6) == 0x0003C0, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult_6' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_K2_SetRelativeRotation_SweepHitResult_7) == 0x000450, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_K2_SetRelativeRotation_SweepHitResult_7' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_IsValid_ReturnValue_1) == 0x0004E0, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_IsValid_ReturnValue_2) == 0x0004E1, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_BooleanAND_ReturnValue) == 0x0004E2, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x0004E4, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_IsValid_ReturnValue_3) == 0x0004E8, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor, CallFunc_BooleanAND_ReturnValue_1) == 0x0004E9, "Member 'BP_InteractableUnBreachableDoubleDoor_C_ExecuteUbergraph_BP_InteractableUnBreachableDoubleDoor::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function BP_InteractableUnBreachableDoubleDoor.BP_InteractableUnBreachableDoubleDoor_C.onOpenAnimUpdateTick
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick final
{
public:
	ESBZGateState                                 oldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 newState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         alpha;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick) == 0x000004, "Wrong alignment on BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick");
static_assert(sizeof(BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick) == 0x000008, "Wrong size on BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick, oldState) == 0x000000, "Member 'BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick::oldState' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick, newState) == 0x000001, "Member 'BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick::newState' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick, alpha) == 0x000004, "Member 'BP_InteractableUnBreachableDoubleDoor_C_onOpenAnimUpdateTick::alpha' has a wrong offset!");

// Function BP_InteractableUnBreachableDoubleDoor.BP_InteractableUnBreachableDoubleDoor_C.onDoorBreached
// 0x0002 (0x0002 - 0x0000)
struct BP_InteractableUnBreachableDoubleDoor_C_onDoorBreached final
{
public:
	ESBZGateState                                 oldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGateState                                 newState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableUnBreachableDoubleDoor_C_onDoorBreached) == 0x000001, "Wrong alignment on BP_InteractableUnBreachableDoubleDoor_C_onDoorBreached");
static_assert(sizeof(BP_InteractableUnBreachableDoubleDoor_C_onDoorBreached) == 0x000002, "Wrong size on BP_InteractableUnBreachableDoubleDoor_C_onDoorBreached");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_onDoorBreached, oldState) == 0x000000, "Member 'BP_InteractableUnBreachableDoubleDoor_C_onDoorBreached::oldState' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_onDoorBreached, newState) == 0x000001, "Member 'BP_InteractableUnBreachableDoubleDoor_C_onDoorBreached::newState' has a wrong offset!");

// Function BP_InteractableUnBreachableDoubleDoor.BP_InteractableUnBreachableDoubleDoor_C.initToValidPosition
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractableUnBreachableDoubleDoor_C_initToValidPosition final
{
public:
	ESBZGateState                                 oldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractableUnBreachableDoubleDoor_C_initToValidPosition) == 0x000001, "Wrong alignment on BP_InteractableUnBreachableDoubleDoor_C_initToValidPosition");
static_assert(sizeof(BP_InteractableUnBreachableDoubleDoor_C_initToValidPosition) == 0x000001, "Wrong size on BP_InteractableUnBreachableDoubleDoor_C_initToValidPosition");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_initToValidPosition, oldState) == 0x000000, "Member 'BP_InteractableUnBreachableDoubleDoor_C_initToValidPosition::oldState' has a wrong offset!");

// Function BP_InteractableUnBreachableDoubleDoor.BP_InteractableUnBreachableDoubleDoor_C.setBreachedMeshVisibility
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractableUnBreachableDoubleDoor_C_setBreachedMeshVisibility final
{
public:
	bool                                          breached;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractableUnBreachableDoubleDoor_C_setBreachedMeshVisibility) == 0x000001, "Wrong alignment on BP_InteractableUnBreachableDoubleDoor_C_setBreachedMeshVisibility");
static_assert(sizeof(BP_InteractableUnBreachableDoubleDoor_C_setBreachedMeshVisibility) == 0x000001, "Wrong size on BP_InteractableUnBreachableDoubleDoor_C_setBreachedMeshVisibility");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_setBreachedMeshVisibility, breached) == 0x000000, "Member 'BP_InteractableUnBreachableDoubleDoor_C_setBreachedMeshVisibility::breached' has a wrong offset!");

// Function BP_InteractableUnBreachableDoubleDoor.BP_InteractableUnBreachableDoubleDoor_C.UserConstructionScript
// 0x0002 (0x0002 - 0x0000)
struct BP_InteractableUnBreachableDoubleDoor_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractableUnBreachableDoubleDoor_C_UserConstructionScript) == 0x000001, "Wrong alignment on BP_InteractableUnBreachableDoubleDoor_C_UserConstructionScript");
static_assert(sizeof(BP_InteractableUnBreachableDoubleDoor_C_UserConstructionScript) == 0x000002, "Wrong size on BP_InteractableUnBreachableDoubleDoor_C_UserConstructionScript");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'BP_InteractableUnBreachableDoubleDoor_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractableUnBreachableDoubleDoor_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000001, "Member 'BP_InteractableUnBreachableDoubleDoor_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");

}

