#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableBreachableDoor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_InteractableUnBreachableSingleDoor_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractableBreachableDoor.BP_InteractableBreachableDoor_C
// 0x0018 (0x0688 - 0x0670)
class ABP_InteractableBreachableDoor_C : public ABP_InteractableUnBreachableSingleDoor_C
{
public:
	uint8                                         Pad_66A[0x6];                                      // 0x066A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_InteractableBreachableDoor_C;    // 0x0670(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          BreachBox;                                         // 0x0678(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZPropDamageComponent*                BreachPropDamge;                                   // 0x0680(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InteractableBreachableDoor(int32 EntryPoint);
	void setBreachedMeshVisibility(bool breached_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractableBreachableDoor_C">();
	}
	static class ABP_InteractableBreachableDoor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractableBreachableDoor_C>();
	}
};
static_assert(alignof(ABP_InteractableBreachableDoor_C) == 0x000008, "Wrong alignment on ABP_InteractableBreachableDoor_C");
static_assert(sizeof(ABP_InteractableBreachableDoor_C) == 0x000688, "Wrong size on ABP_InteractableBreachableDoor_C");
static_assert(offsetof(ABP_InteractableBreachableDoor_C, UberGraphFrame_BP_InteractableBreachableDoor_C) == 0x000670, "Member 'ABP_InteractableBreachableDoor_C::UberGraphFrame_BP_InteractableBreachableDoor_C' has a wrong offset!");
static_assert(offsetof(ABP_InteractableBreachableDoor_C, BreachBox) == 0x000678, "Member 'ABP_InteractableBreachableDoor_C::BreachBox' has a wrong offset!");
static_assert(offsetof(ABP_InteractableBreachableDoor_C, BreachPropDamge) == 0x000680, "Member 'ABP_InteractableBreachableDoor_C::BreachPropDamge' has a wrong offset!");

}

