#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableDataCenterServer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SingleBagGeneratorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractableDataCenterServer.BP_InteractableDataCenterServer_C
// 0x0028 (0x0350 - 0x0328)
class ABP_InteractableDataCenterServer_C final : public ABP_SingleBagGeneratorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class ABP_InteractableDataCenterServer_C* server)> onInteractionComplete; // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_InteractableDataCenterServer(int32 EntryPoint);
	void BndEvt__BP_InteractableDataCenterServer_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void setInteractable(bool interactable);
	void OnRep_RenderOutlines();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractableDataCenterServer_C">();
	}
	static class ABP_InteractableDataCenterServer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractableDataCenterServer_C>();
	}
};
static_assert(alignof(ABP_InteractableDataCenterServer_C) == 0x000008, "Wrong alignment on ABP_InteractableDataCenterServer_C");
static_assert(sizeof(ABP_InteractableDataCenterServer_C) == 0x000350, "Wrong size on ABP_InteractableDataCenterServer_C");
static_assert(offsetof(ABP_InteractableDataCenterServer_C, UberGraphFrame) == 0x000328, "Member 'ABP_InteractableDataCenterServer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InteractableDataCenterServer_C, Ak) == 0x000330, "Member 'ABP_InteractableDataCenterServer_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_InteractableDataCenterServer_C, StaticMesh) == 0x000338, "Member 'ABP_InteractableDataCenterServer_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_InteractableDataCenterServer_C, onInteractionComplete) == 0x000340, "Member 'ABP_InteractableDataCenterServer_C::onInteractionComplete' has a wrong offset!");

}

