#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableDegradableTechPrePlanning

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SingleBagGeneratorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractableDegradableTechPrePlanning.BP_InteractableDegradableTechPrePlanning_C
// 0x0018 (0x0340 - 0x0328)
class ABP_InteractableDegradableTechPrePlanning_C final : public ABP_SingleBagGeneratorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InteractableDegradableTechPrePlanning(int32 EntryPoint);
	void BndEvt__BP_InteractableDegradableTechPrePlanning_Interactable_K2Node_ComponentBoundEvent_5_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BndEvt__BP_InteractableDegradableTech_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BP_OnChangedToSecondaryType(bool bDoCosmetics);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractableDegradableTechPrePlanning_C">();
	}
	static class ABP_InteractableDegradableTechPrePlanning_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractableDegradableTechPrePlanning_C>();
	}
};
static_assert(alignof(ABP_InteractableDegradableTechPrePlanning_C) == 0x000008, "Wrong alignment on ABP_InteractableDegradableTechPrePlanning_C");
static_assert(sizeof(ABP_InteractableDegradableTechPrePlanning_C) == 0x000340, "Wrong size on ABP_InteractableDegradableTechPrePlanning_C");
static_assert(offsetof(ABP_InteractableDegradableTechPrePlanning_C, UberGraphFrame) == 0x000328, "Member 'ABP_InteractableDegradableTechPrePlanning_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InteractableDegradableTechPrePlanning_C, Ak) == 0x000330, "Member 'ABP_InteractableDegradableTechPrePlanning_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_InteractableDegradableTechPrePlanning_C, StaticMesh) == 0x000338, "Member 'ABP_InteractableDegradableTechPrePlanning_C::StaticMesh' has a wrong offset!");

}

