#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractablePainting_MediumValue

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractablePainting_MediumValue.BP_InteractablePainting_MediumValue_C.ExecuteUbergraph_BP_InteractablePainting_MediumValue
// 0x0050 (0x0050 - 0x0000)
struct BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSecret;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue) == 0x000008, "Wrong alignment on BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue");
static_assert(sizeof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue) == 0x000050, "Wrong size on BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue, EntryPoint) == 0x000000, "Member 'BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue, Temp_struct_Variable) == 0x000008, "Member 'BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue, Temp_delegate_Variable) == 0x000018, "Member 'BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue, CallFunc_PostEvent_ReturnValue) == 0x00002C, "Member 'BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue, K2Node_CustomEvent_IsSecret) == 0x000030, "Member 'BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue::K2Node_CustomEvent_IsSecret' has a wrong offset!");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue, K2Node_ComponentBoundEvent_Interactable) == 0x000038, "Member 'BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue, K2Node_ComponentBoundEvent_Interactor) == 0x000040, "Member 'BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000048, "Member 'BP_InteractablePainting_MediumValue_C_ExecuteUbergraph_BP_InteractablePainting_MediumValue::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_InteractablePainting_MediumValue.BP_InteractablePainting_MediumValue_C.BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_InteractablePainting_MediumValue_C_BndEvt__BP_InteractablePainting_MediumValue_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_InteractablePainting_MediumValue.BP_InteractablePainting_MediumValue_C.SetAsSecret
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractablePainting_MediumValue_C_SetAsSecret final
{
public:
	bool                                          IsSecret_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_InteractablePainting_MediumValue_C_SetAsSecret) == 0x000001, "Wrong alignment on BP_InteractablePainting_MediumValue_C_SetAsSecret");
static_assert(sizeof(BP_InteractablePainting_MediumValue_C_SetAsSecret) == 0x000001, "Wrong size on BP_InteractablePainting_MediumValue_C_SetAsSecret");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_SetAsSecret, IsSecret_0) == 0x000000, "Member 'BP_InteractablePainting_MediumValue_C_SetAsSecret::IsSecret_0' has a wrong offset!");

// Function BP_InteractablePainting_MediumValue.BP_InteractablePainting_MediumValue_C.UserConstructionScript
// 0x0004 (0x0004 - 0x0000)
struct BP_InteractablePainting_MediumValue_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_InteractablePainting_MediumValue_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_InteractablePainting_MediumValue_C_UserConstructionScript");
static_assert(sizeof(BP_InteractablePainting_MediumValue_C_UserConstructionScript) == 0x000004, "Wrong size on BP_InteractablePainting_MediumValue_C_UserConstructionScript");
static_assert(offsetof(BP_InteractablePainting_MediumValue_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000000, "Member 'BP_InteractablePainting_MediumValue_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");

}

