#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableMoneyPile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_SingleBagGeneratorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractableMoneyPile.BP_InteractableMoneyPile_C
// 0x0018 (0x0340 - 0x0328)
class ABP_InteractableMoneyPile_C : public ABP_SingleBagGeneratorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_InteractableMoneyPile(int32 EntryPoint);
	void BP_OnChangedToSecondaryType(bool bDoCosmetics);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractableMoneyPile_C">();
	}
	static class ABP_InteractableMoneyPile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractableMoneyPile_C>();
	}
};
static_assert(alignof(ABP_InteractableMoneyPile_C) == 0x000008, "Wrong alignment on ABP_InteractableMoneyPile_C");
static_assert(sizeof(ABP_InteractableMoneyPile_C) == 0x000340, "Wrong size on ABP_InteractableMoneyPile_C");
static_assert(offsetof(ABP_InteractableMoneyPile_C, UberGraphFrame) == 0x000328, "Member 'ABP_InteractableMoneyPile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_InteractableMoneyPile_C, Ak) == 0x000330, "Member 'ABP_InteractableMoneyPile_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_InteractableMoneyPile_C, StaticMesh) == 0x000338, "Member 'ABP_InteractableMoneyPile_C::StaticMesh' has a wrong offset!");

}

