#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Int_SingleDoor__reinforced_NightClub_02

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Int_SingleDoor__reinforced_NightClub_02.BP_Int_SingleDoor__reinforced_NightClub_02_C.ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02
// 0x0008 (0x0008 - 0x0000)
struct BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActorsInCloset;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02) == 0x000004, "Wrong alignment on BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02");
static_assert(sizeof(BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02) == 0x000008, "Wrong size on BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02");
static_assert(offsetof(BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02, EntryPoint) == 0x000000, "Member 'BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02, K2Node_Event_bActorsInCloset) == 0x000004, "Member 'BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02::K2Node_Event_bActorsInCloset' has a wrong offset!");
static_assert(offsetof(BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02, K2Node_Event_bDoCosmetics) == 0x000005, "Member 'BP_Int_SingleDoor__reinforced_NightClub_02_C_ExecuteUbergraph_BP_Int_SingleDoor__reinforced_NightClub_02::K2Node_Event_bDoCosmetics' has a wrong offset!");

// Function BP_Int_SingleDoor__reinforced_NightClub_02.BP_Int_SingleDoor__reinforced_NightClub_02_C.ReactToCloset
// 0x0002 (0x0002 - 0x0000)
struct BP_Int_SingleDoor__reinforced_NightClub_02_C_ReactToCloset final
{
public:
	bool                                          bActorsInCloset;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Int_SingleDoor__reinforced_NightClub_02_C_ReactToCloset) == 0x000001, "Wrong alignment on BP_Int_SingleDoor__reinforced_NightClub_02_C_ReactToCloset");
static_assert(sizeof(BP_Int_SingleDoor__reinforced_NightClub_02_C_ReactToCloset) == 0x000002, "Wrong size on BP_Int_SingleDoor__reinforced_NightClub_02_C_ReactToCloset");
static_assert(offsetof(BP_Int_SingleDoor__reinforced_NightClub_02_C_ReactToCloset, bActorsInCloset) == 0x000000, "Member 'BP_Int_SingleDoor__reinforced_NightClub_02_C_ReactToCloset::bActorsInCloset' has a wrong offset!");
static_assert(offsetof(BP_Int_SingleDoor__reinforced_NightClub_02_C_ReactToCloset, bDoCosmetics) == 0x000001, "Member 'BP_Int_SingleDoor__reinforced_NightClub_02_C_ReactToCloset::bDoCosmetics' has a wrong offset!");

}

