#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractableSatellitePart

#include "Basic.hpp"

#include "BP_SingleBagGeneratorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteractableSatellitePart.BP_InteractableSatellitePart_C
// 0x0018 (0x0340 - 0x0328)
class ABP_InteractableSatellitePart_C final : public ABP_SingleBagGeneratorBase_C
{
public:
	class UAkComponent*                           Ak;                                                // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RenderOutlines;                                    // 0x0338(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)

public:
	void OnRep_RenderOutlines();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteractableSatellitePart_C">();
	}
	static class ABP_InteractableSatellitePart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteractableSatellitePart_C>();
	}
};
static_assert(alignof(ABP_InteractableSatellitePart_C) == 0x000008, "Wrong alignment on ABP_InteractableSatellitePart_C");
static_assert(sizeof(ABP_InteractableSatellitePart_C) == 0x000340, "Wrong size on ABP_InteractableSatellitePart_C");
static_assert(offsetof(ABP_InteractableSatellitePart_C, Ak) == 0x000328, "Member 'ABP_InteractableSatellitePart_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_InteractableSatellitePart_C, StaticMesh) == 0x000330, "Member 'ABP_InteractableSatellitePart_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_InteractableSatellitePart_C, RenderOutlines) == 0x000338, "Member 'ABP_InteractableSatellitePart_C::RenderOutlines' has a wrong offset!");

}

