#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IGl_BRE_ATT_2HIT

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_AttractorDestructionBase_classes.hpp"
#include "Engine_structs.hpp"
#include "BPS_GlassHit_VFXData_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IGl_BRE_ATT_2HIT.BP_IGl_BRE_ATT_2HIT_C
// 0x0058 (0x0360 - 0x0308)
class ABP_IGl_BRE_ATT_2HIT_C : public ABP_AttractorDestructionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZAcousticPortalConnectorComponent*   SBZAcousticPortalConnector;                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Particle_count;                                    // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Particle_Size_Multiplier;                          // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Particles_Color;                                   // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Do_Cosmetics;                                      // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             DamageInstigator;                                  // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              onGlassDestroyed;                                  // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FBPS_GlassHit_VFXData>          VFX;                                               // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_BP_IGl_BRE_ATT_2HIT(int32 EntryPoint);
	void BndEvt__NewBlueprint_PropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature(class UActorComponent* PoolComponent, int32 Hits, bool bDoCosmetics, const struct FSBZPropDamageContext& DamageContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_IGl_BRE_ATT_2HIT_C">();
	}
	static class ABP_IGl_BRE_ATT_2HIT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IGl_BRE_ATT_2HIT_C>();
	}
};
static_assert(alignof(ABP_IGl_BRE_ATT_2HIT_C) == 0x000008, "Wrong alignment on ABP_IGl_BRE_ATT_2HIT_C");
static_assert(sizeof(ABP_IGl_BRE_ATT_2HIT_C) == 0x000360, "Wrong size on ABP_IGl_BRE_ATT_2HIT_C");
static_assert(offsetof(ABP_IGl_BRE_ATT_2HIT_C, UberGraphFrame) == 0x000308, "Member 'ABP_IGl_BRE_ATT_2HIT_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_IGl_BRE_ATT_2HIT_C, SBZAcousticPortalConnector) == 0x000310, "Member 'ABP_IGl_BRE_ATT_2HIT_C::SBZAcousticPortalConnector' has a wrong offset!");
static_assert(offsetof(ABP_IGl_BRE_ATT_2HIT_C, Particle_count) == 0x000318, "Member 'ABP_IGl_BRE_ATT_2HIT_C::Particle_count' has a wrong offset!");
static_assert(offsetof(ABP_IGl_BRE_ATT_2HIT_C, Particle_Size_Multiplier) == 0x00031C, "Member 'ABP_IGl_BRE_ATT_2HIT_C::Particle_Size_Multiplier' has a wrong offset!");
static_assert(offsetof(ABP_IGl_BRE_ATT_2HIT_C, Particles_Color) == 0x000320, "Member 'ABP_IGl_BRE_ATT_2HIT_C::Particles_Color' has a wrong offset!");
static_assert(offsetof(ABP_IGl_BRE_ATT_2HIT_C, Do_Cosmetics) == 0x000330, "Member 'ABP_IGl_BRE_ATT_2HIT_C::Do_Cosmetics' has a wrong offset!");
static_assert(offsetof(ABP_IGl_BRE_ATT_2HIT_C, DamageInstigator) == 0x000338, "Member 'ABP_IGl_BRE_ATT_2HIT_C::DamageInstigator' has a wrong offset!");
static_assert(offsetof(ABP_IGl_BRE_ATT_2HIT_C, onGlassDestroyed) == 0x000340, "Member 'ABP_IGl_BRE_ATT_2HIT_C::onGlassDestroyed' has a wrong offset!");
static_assert(offsetof(ABP_IGl_BRE_ATT_2HIT_C, VFX) == 0x000350, "Member 'ABP_IGl_BRE_ATT_2HIT_C::VFX' has a wrong offset!");

}

