#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KillCounter

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_KillCounter.BP_KillCounter_C.ExecuteUbergraph_BP_KillCounter
// 0x03F0 (0x03F0 - 0x0000)
struct BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerCharacter*                    K2Node_DynamicCast_AsSBZPlayer_Character;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerCharacter*                    Temp_wildcard_Variable;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ASBZPlayerCharacter*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerCharacter*                    K2Node_DynamicCast_AsSBZPlayer_Character_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsChecked)>               K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x007D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E[0x2];                                       // 0x007E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              Temp_wildcard_Variable_1;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillCounterSaveGame_C*                 K2Node_DynamicCast_AsKill_Counter_Save_Game;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USBZGameEventBroker*                    CallFunc_GetGameEventBroker_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyedActor;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZDamageEvent                        K2Node_CustomEvent_DamageEventData;                // 0x00F8(0x00C0)(ConstParm)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerCharacter*                    K2Node_DynamicCast_AsSBZPlayer_Character_2;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerCharacter*                    K2Node_CustomEvent_SBZPlayerCharacter_1;           // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_KillCount_C*                        CallFunc_Map_Find_Value;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerCharacter*                    K2Node_CustomEvent_SBZPlayerCharacter;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Damage;                         // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_KillCount_C*                        CallFunc_Map_Find_Value_1;                         // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZPlayerInEscapeChangedEvent         K2Node_CustomEvent_PlayerInEscapeChangedEventData; // 0x0218(0x0008)(ConstParm, NoDestructor)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0234(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_235[0x3];                                      // 0x0235(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FSBZPlayerInEscapeChangedEvent& PlayerInEscapeChangedEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0238(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x024C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FSBZDamageEvent& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0254(0x0014)(ZeroConstructor, NoDestructor)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue_1;        // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_1;  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerDefeatStateChangedData       K2Node_CustomEvent_InData;                         // 0x02A8(0x0010)(ConstParm, NoDestructor)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_2;  // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_3;  // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x02BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue_1;             // 0x02BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2BE[0x2];                                      // 0x02BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerCharacter*                    Temp_wildcard_Variable_2;                          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x02DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x02E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x02F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      K2Node_Select_Default;                             // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsChecked;                      // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class APlayerState*>                   CallFunc_Map_Keys_Keys;                            // 0x0310(0x0010)(ReferenceParm)
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x032C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x032D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32E[0x2];                                      // 0x032E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_KillCount_C*                        CallFunc_Map_Find_Value_2;                         // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_4;  // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_2;   // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector2D& PositionOffset, float ScaleOffset, bool HideName, bool HideMiscText, bool HideOtherPlayers)> K2Node_CreateDelegate_OutputDelegate_3; // 0x0358(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x036C(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0380(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Select_Default_1;                           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerCharacter*                    CallFunc_GetActorOfClass_ReturnValue_1;            // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x03A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPackagedForDistribution_ReturnValue_5;  // 0x03AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x03AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AE[0x2];                                      // 0x03AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_Select_Default_2;                           // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_PositionOffset;                 // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ScaleOffset;                    // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_HideName;                       // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_HideMiscText;                   // 0x03C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_HideOtherPlayers;               // 0x03C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C7[0x1];                                      // 0x03C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x03C8(0x0020)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter) == 0x000008, "Wrong alignment on BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter");
static_assert(sizeof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter) == 0x0003F0, "Wrong size on BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, EntryPoint) == 0x000000, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x000008, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_DynamicCast_AsSBZPlayer_Character) == 0x000010, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_DynamicCast_AsSBZPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_wildcard_Variable) == 0x000020, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_wildcard_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetDisplayName_ReturnValue) == 0x000028, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetActorOfClass_ReturnValue) == 0x000038, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetLocalPlayerPawn_ReturnValue_1) == 0x000040, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetLocalPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_DynamicCast_AsSBZPlayer_Character_1) == 0x000048, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_DynamicCast_AsSBZPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetPlayerController_ReturnValue) == 0x000058, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000060, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsValid_ReturnValue_2) == 0x00007C, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsPackagedForDistribution_ReturnValue) == 0x00007D, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsPackagedForDistribution_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000080, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_wildcard_Variable_1) == 0x000088, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_wildcard_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_bool_Variable) == 0x000090, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_DynamicCast_AsKill_Counter_Save_Game) == 0x000098, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_DynamicCast_AsKill_Counter_Save_Game' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_DynamicCast_bSuccess_2) == 0x0000A0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_int_Array_Index_Variable) == 0x0000A4, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetObjectClass_ReturnValue) == 0x0000A8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetClassDisplayName_ReturnValue) == 0x0000B0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_SelectString_ReturnValue) == 0x0000C0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetGameEventBroker_ReturnValue) == 0x0000D0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetGameEventBroker_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_SaveGameToSlot_ReturnValue) == 0x0000D8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_LoadGameFromSlot_ReturnValue) == 0x0000E0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsValid_ReturnValue_3) == 0x0000E8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_DestroyedActor) == 0x0000F0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_DestroyedActor' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_DamageEventData) == 0x0000F8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_FTrunc_ReturnValue) == 0x0001B8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_DynamicCast_AsSBZPlayer_Character_2) == 0x0001C0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_DynamicCast_AsSBZPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_DynamicCast_bSuccess_3) == 0x0001C8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_SBZPlayerCharacter_1) == 0x0001D0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_SBZPlayerCharacter_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Map_Find_Value) == 0x0001D8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Map_Find_ReturnValue) == 0x0001E0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_SBZPlayerCharacter) == 0x0001E8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_SBZPlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_Damage) == 0x0001F0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_Damage' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Map_Find_Value_1) == 0x0001F8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Map_Find_ReturnValue_1) == 0x000200, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000208, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000210, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_PlayerInEscapeChangedEventData) == 0x000218, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_PlayerInEscapeChangedEventData' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetPosition_ReturnValue) == 0x000220, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000228, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000234, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CreateDelegate_OutputDelegate_1) == 0x000238, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_int_Loop_Counter_Variable) == 0x00024C, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Add_IntInt_ReturnValue) == 0x000250, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CreateDelegate_OutputDelegate_2) == 0x000254, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetObjectClass_ReturnValue_1) == 0x000268, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetClassDisplayName_ReturnValue_1) == 0x000270, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetClassDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_byte_Variable) == 0x000280, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_SelectString_ReturnValue_1) == 0x000288, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetPlayerController_ReturnValue_1) == 0x000298, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsPackagedForDistribution_ReturnValue_1) == 0x0002A0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsPackagedForDistribution_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_InData) == 0x0002A8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_InData' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsPackagedForDistribution_ReturnValue_2) == 0x0002B8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsPackagedForDistribution_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002B9, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsPackagedForDistribution_ReturnValue_3) == 0x0002BA, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsPackagedForDistribution_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0002BB, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_BooleanAND_ReturnValue) == 0x0002BC, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_SaveGameToSlot_ReturnValue_1) == 0x0002BD, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_SaveGameToSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_VLerp_ReturnValue) == 0x0002C0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_wildcard_Variable_2) == 0x0002D0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_wildcard_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_BreakVector_X) == 0x0002D8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_BreakVector_Y) == 0x0002DC, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_BreakVector_Z) == 0x0002E0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_MakeVector2D_ReturnValue) == 0x0002E4, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_bool_Variable_1) == 0x0002EC, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetLocalPlayerController_ReturnValue_1) == 0x0002F0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetLocalPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_K2_SetTimer_ReturnValue) == 0x0002F8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_Select_Default) == 0x000300, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_IsChecked) == 0x000308, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_IsChecked' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Map_Keys_Keys) == 0x000310, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Array_Get_Item) == 0x000320, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Array_Length_ReturnValue) == 0x000328, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x00032C, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Less_IntInt_ReturnValue) == 0x00032D, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Map_Find_Value_2) == 0x000330, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_Map_Find_ReturnValue_2) == 0x000338, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetPlayerController_ReturnValue_2) == 0x000340, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsPackagedForDistribution_ReturnValue_4) == 0x000348, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsPackagedForDistribution_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetLocalPlayerController_ReturnValue_2) == 0x000350, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetLocalPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CreateDelegate_OutputDelegate_3) == 0x000358, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CreateDelegate_OutputDelegate_4) == 0x00036C, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000380, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_bool_Variable_2) == 0x000388, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_Select_Default_1) == 0x000390, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetPlayerController_ReturnValue_3) == 0x000398, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_GetActorOfClass_ReturnValue_1) == 0x0003A0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0003A8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, CallFunc_IsPackagedForDistribution_ReturnValue_5) == 0x0003AC, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::CallFunc_IsPackagedForDistribution_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_bool_Variable_3) == 0x0003AD, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_Select_Default_2) == 0x0003B0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_PositionOffset) == 0x0003B8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_PositionOffset' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_ScaleOffset) == 0x0003C0, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_ScaleOffset' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_HideName) == 0x0003C4, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_HideName' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_HideMiscText) == 0x0003C5, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_HideMiscText' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_CustomEvent_HideOtherPlayers) == 0x0003C6, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_CustomEvent_HideOtherPlayers' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_InputKeyEvent_Key) == 0x0003C8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_InputKeyEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, Temp_byte_Variable_1) == 0x0003E8, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter, K2Node_Select_Default_3) == 0x0003E9, "Member 'BP_KillCounter_C_ExecuteUbergraph_BP_KillCounter::K2Node_Select_Default_3' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.OnSaved_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_KillCounter_C_OnSaved_Event_0 final
{
public:
	struct FVector2D                              PositionOffset;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleOffset;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideName;                                          // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideMiscText;                                      // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          HideOtherPlayers;                                  // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_KillCounter_C_OnSaved_Event_0) == 0x000004, "Wrong alignment on BP_KillCounter_C_OnSaved_Event_0");
static_assert(sizeof(BP_KillCounter_C_OnSaved_Event_0) == 0x000010, "Wrong size on BP_KillCounter_C_OnSaved_Event_0");
static_assert(offsetof(BP_KillCounter_C_OnSaved_Event_0, PositionOffset) == 0x000000, "Member 'BP_KillCounter_C_OnSaved_Event_0::PositionOffset' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_OnSaved_Event_0, ScaleOffset) == 0x000008, "Member 'BP_KillCounter_C_OnSaved_Event_0::ScaleOffset' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_OnSaved_Event_0, HideName) == 0x00000C, "Member 'BP_KillCounter_C_OnSaved_Event_0::HideName' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_OnSaved_Event_0, HideMiscText) == 0x00000D, "Member 'BP_KillCounter_C_OnSaved_Event_0::HideMiscText' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_OnSaved_Event_0, HideOtherPlayers) == 0x00000E, "Member 'BP_KillCounter_C_OnSaved_Event_0::HideOtherPlayers' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.OnHideOtherPlayers_Event_0
// 0x0001 (0x0001 - 0x0000)
struct BP_KillCounter_C_OnHideOtherPlayers_Event_0 final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_KillCounter_C_OnHideOtherPlayers_Event_0) == 0x000001, "Wrong alignment on BP_KillCounter_C_OnHideOtherPlayers_Event_0");
static_assert(sizeof(BP_KillCounter_C_OnHideOtherPlayers_Event_0) == 0x000001, "Wrong size on BP_KillCounter_C_OnHideOtherPlayers_Event_0");
static_assert(offsetof(BP_KillCounter_C_OnHideOtherPlayers_Event_0, IsChecked) == 0x000000, "Member 'BP_KillCounter_C_OnHideOtherPlayers_Event_0::IsChecked' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.OnPlayerDefeatStateChangedDelegate_Event_0
// 0x0010 (0x0010 - 0x0000)
struct BP_KillCounter_C_OnPlayerDefeatStateChangedDelegate_Event_0 final
{
public:
	struct FSBZPlayerDefeatStateChangedData       InData;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_KillCounter_C_OnPlayerDefeatStateChangedDelegate_Event_0) == 0x000008, "Wrong alignment on BP_KillCounter_C_OnPlayerDefeatStateChangedDelegate_Event_0");
static_assert(sizeof(BP_KillCounter_C_OnPlayerDefeatStateChangedDelegate_Event_0) == 0x000010, "Wrong size on BP_KillCounter_C_OnPlayerDefeatStateChangedDelegate_Event_0");
static_assert(offsetof(BP_KillCounter_C_OnPlayerDefeatStateChangedDelegate_Event_0, InData) == 0x000000, "Member 'BP_KillCounter_C_OnPlayerDefeatStateChangedDelegate_Event_0::InData' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.OnPlayerInEscapeChanged_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_KillCounter_C_OnPlayerInEscapeChanged_Event_0 final
{
public:
	struct FSBZPlayerInEscapeChangedEvent         PlayerInEscapeChangedEventData;                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_KillCounter_C_OnPlayerInEscapeChanged_Event_0) == 0x000004, "Wrong alignment on BP_KillCounter_C_OnPlayerInEscapeChanged_Event_0");
static_assert(sizeof(BP_KillCounter_C_OnPlayerInEscapeChanged_Event_0) == 0x000008, "Wrong size on BP_KillCounter_C_OnPlayerInEscapeChanged_Event_0");
static_assert(offsetof(BP_KillCounter_C_OnPlayerInEscapeChanged_Event_0, PlayerInEscapeChangedEventData) == 0x000000, "Member 'BP_KillCounter_C_OnPlayerInEscapeChanged_Event_0::PlayerInEscapeChangedEventData' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.OnPlayerDealDamage
// 0x0010 (0x0010 - 0x0000)
struct BP_KillCounter_C_OnPlayerDealDamage final
{
public:
	class ASBZPlayerCharacter*                    SBZPlayerCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillCounter_C_OnPlayerDealDamage) == 0x000008, "Wrong alignment on BP_KillCounter_C_OnPlayerDealDamage");
static_assert(sizeof(BP_KillCounter_C_OnPlayerDealDamage) == 0x000010, "Wrong size on BP_KillCounter_C_OnPlayerDealDamage");
static_assert(offsetof(BP_KillCounter_C_OnPlayerDealDamage, SBZPlayerCharacter) == 0x000000, "Member 'BP_KillCounter_C_OnPlayerDealDamage::SBZPlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_OnPlayerDealDamage, Damage) == 0x000008, "Member 'BP_KillCounter_C_OnPlayerDealDamage::Damage' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.OnPlayerKill
// 0x0008 (0x0008 - 0x0000)
struct BP_KillCounter_C_OnPlayerKill final
{
public:
	class ASBZPlayerCharacter*                    SBZPlayerCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillCounter_C_OnPlayerKill) == 0x000008, "Wrong alignment on BP_KillCounter_C_OnPlayerKill");
static_assert(sizeof(BP_KillCounter_C_OnPlayerKill) == 0x000008, "Wrong size on BP_KillCounter_C_OnPlayerKill");
static_assert(offsetof(BP_KillCounter_C_OnPlayerKill, SBZPlayerCharacter) == 0x000000, "Member 'BP_KillCounter_C_OnPlayerKill::SBZPlayerCharacter' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.OnTakenDamage_Event_0
// 0x00C0 (0x00C0 - 0x0000)
struct BP_KillCounter_C_OnTakenDamage_Event_0 final
{
public:
	struct FSBZDamageEvent                        DamageEventData;                                   // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(BP_KillCounter_C_OnTakenDamage_Event_0) == 0x000008, "Wrong alignment on BP_KillCounter_C_OnTakenDamage_Event_0");
static_assert(sizeof(BP_KillCounter_C_OnTakenDamage_Event_0) == 0x0000C0, "Wrong size on BP_KillCounter_C_OnTakenDamage_Event_0");
static_assert(offsetof(BP_KillCounter_C_OnTakenDamage_Event_0, DamageEventData) == 0x000000, "Member 'BP_KillCounter_C_OnTakenDamage_Event_0::DamageEventData' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.OnDestroyed_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_KillCounter_C_OnDestroyed_Event_0 final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillCounter_C_OnDestroyed_Event_0) == 0x000008, "Wrong alignment on BP_KillCounter_C_OnDestroyed_Event_0");
static_assert(sizeof(BP_KillCounter_C_OnDestroyed_Event_0) == 0x000008, "Wrong size on BP_KillCounter_C_OnDestroyed_Event_0");
static_assert(offsetof(BP_KillCounter_C_OnDestroyed_Event_0, DestroyedActor) == 0x000000, "Member 'BP_KillCounter_C_OnDestroyed_Event_0::DestroyedActor' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.InpActEvt_K_K2Node_InputKeyEvent_0
// 0x0020 (0x0020 - 0x0000)
struct BP_KillCounter_C_InpActEvt_K_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillCounter_C_InpActEvt_K_K2Node_InputKeyEvent_0) == 0x000008, "Wrong alignment on BP_KillCounter_C_InpActEvt_K_K2Node_InputKeyEvent_0");
static_assert(sizeof(BP_KillCounter_C_InpActEvt_K_K2Node_InputKeyEvent_0) == 0x000020, "Wrong size on BP_KillCounter_C_InpActEvt_K_K2Node_InputKeyEvent_0");
static_assert(offsetof(BP_KillCounter_C_InpActEvt_K_K2Node_InputKeyEvent_0, Key) == 0x000000, "Member 'BP_KillCounter_C_InpActEvt_K_K2Node_InputKeyEvent_0::Key' has a wrong offset!");

// Function BP_KillCounter.BP_KillCounter_C.CreateKillCounterHUD
// 0x0030 (0x0030 - 0x0000)
struct BP_KillCounter_C_CreateKillCounterHUD final
{
public:
	class UMenu_KillCounter_C*                    CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_KillCounter_C_CreateKillCounterHUD) == 0x000008, "Wrong alignment on BP_KillCounter_C_CreateKillCounterHUD");
static_assert(sizeof(BP_KillCounter_C_CreateKillCounterHUD) == 0x000030, "Wrong size on BP_KillCounter_C_CreateKillCounterHUD");
static_assert(offsetof(BP_KillCounter_C_CreateKillCounterHUD, CallFunc_Create_ReturnValue) == 0x000000, "Member 'BP_KillCounter_C_CreateKillCounterHUD::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_CreateKillCounterHUD, CallFunc_Conv_FloatToString_ReturnValue) == 0x000008, "Member 'BP_KillCounter_C_CreateKillCounterHUD::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_KillCounter_C_CreateKillCounterHUD, CallFunc_BreakVector2D_X) == 0x000018, "Member 'BP_KillCounter_C_CreateKillCounterHUD::CallFunc_BreakVector2D_X' has a wrong offset!");
