#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KillCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ModActorBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_KillCounter.BP_KillCounter_C
// 0x00A0 (0x0368 - 0x02C8)
class ABP_KillCounter_C final : public AModActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_KillCounter_C;                   // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_6231DB4B40D3331D9737A498408DFC55; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_6231DB4B40D3331D9737A498408DFC55; // 0x02D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerCharacter*                    As_SBZPlayer_Character;                            // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InEditorTesting;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class APlayerState*, class UUI_KillCount_C*> As_SBZPlayer_Character_0;                      // 0x02F0(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	class UMenu_KillCounter_C*                    Menu_KillCounter;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HUDOriginPos;                                      // 0x0348(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UKillCounterSaveGame_C*                 As_Kill_Counter_Save_Game;                         // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHudMenu_KillCounter_C*                 HudMenu;                                           // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_KillCounter(int32 EntryPoint);
	void OnSaved_Event_0(const struct FVector2D& PositionOffset, float ScaleOffset, bool HideName, bool HideMiscText, bool HideOtherPlayers);
	void CustomEvent_0();
	void OnHideOtherPlayers_Event_0(bool IsChecked);
	void OnHudMenuCreated();
	void OnHudMenuOpen();
	void OnPlayerDefeatStateChangedDelegate_Event_0(const struct FSBZPlayerDefeatStateChangedData& InData);
	void OnPlayerInEscapeChanged_Event_0(const struct FSBZPlayerInEscapeChangedEvent& PlayerInEscapeChangedEventData);
	void OnEscapeBoundReachedMaxPlayers();
	void OnPlayerDealDamage(class ASBZPlayerCharacter* SBZPlayerCharacter, int32 Damage);
	void OnPlayerKill(class ASBZPlayerCharacter* SBZPlayerCharacter);
	void ObtainPlayers();
	void OnTakenDamage_Event_0(const struct FSBZDamageEvent& DamageEventData);
	void OnDestroyed_Event_0(class AActor* DestroyedActor);
	void ReceiveBeginPlay();
	void InpActEvt_K_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void CreateKillCounterHUD();
	void CreateKillCounterHUDMenu();
	void UpdateKillCountHUD();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_KillCounter_C">();
	}
	static class ABP_KillCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_KillCounter_C>();
	}
};
static_assert(alignof(ABP_KillCounter_C) == 0x000008, "Wrong alignment on ABP_KillCounter_C");
static_assert(sizeof(ABP_KillCounter_C) == 0x000368, "Wrong size on ABP_KillCounter_C");
static_assert(offsetof(ABP_KillCounter_C, UberGraphFrame_BP_KillCounter_C) == 0x0002C8, "Member 'ABP_KillCounter_C::UberGraphFrame_BP_KillCounter_C' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, Timeline_0_NewTrack_0_6231DB4B40D3331D9737A498408DFC55) == 0x0002D0, "Member 'ABP_KillCounter_C::Timeline_0_NewTrack_0_6231DB4B40D3331D9737A498408DFC55' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, Timeline_0__Direction_6231DB4B40D3331D9737A498408DFC55) == 0x0002D4, "Member 'ABP_KillCounter_C::Timeline_0__Direction_6231DB4B40D3331D9737A498408DFC55' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, Timeline_0) == 0x0002D8, "Member 'ABP_KillCounter_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, As_SBZPlayer_Character) == 0x0002E0, "Member 'ABP_KillCounter_C::As_SBZPlayer_Character' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, InEditorTesting) == 0x0002E8, "Member 'ABP_KillCounter_C::InEditorTesting' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, As_SBZPlayer_Character_0) == 0x0002F0, "Member 'ABP_KillCounter_C::As_SBZPlayer_Character_0' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, Menu_KillCounter) == 0x000340, "Member 'ABP_KillCounter_C::Menu_KillCounter' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, HUDOriginPos) == 0x000348, "Member 'ABP_KillCounter_C::HUDOriginPos' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, As_Kill_Counter_Save_Game) == 0x000358, "Member 'ABP_KillCounter_C::As_Kill_Counter_Save_Game' has a wrong offset!");
static_assert(offsetof(ABP_KillCounter_C, HudMenu) == 0x000360, "Member 'ABP_KillCounter_C::HudMenu' has a wrong offset!");

}

