#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_KeycardBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_KeycardBase.BP_KeycardBase_C
// 0x0038 (0x0308 - 0x02D0)
class ABP_KeycardBase_C : public ASBZDynamicInteractionActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZSensorComponent*                    SBZSensor;                                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAIObjectiveComponent*               SBZAIObjective;                                    // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_KeycardBase(int32 EntryPoint);
	void BndEvt__Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	class USBZOutlineComponent* GetSensorOutlineComponent();
	class USBZSensorComponent* GetSensorComponent();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_KeycardBase_C">();
	}
	static class ABP_KeycardBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_KeycardBase_C>();
	}
};
static_assert(alignof(ABP_KeycardBase_C) == 0x000008, "Wrong alignment on ABP_KeycardBase_C");
static_assert(sizeof(ABP_KeycardBase_C) == 0x000308, "Wrong size on ABP_KeycardBase_C");
static_assert(offsetof(ABP_KeycardBase_C, UberGraphFrame) == 0x0002D0, "Member 'ABP_KeycardBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_KeycardBase_C, SBZSensor) == 0x0002D8, "Member 'ABP_KeycardBase_C::SBZSensor' has a wrong offset!");
static_assert(offsetof(ABP_KeycardBase_C, Cube) == 0x0002E0, "Member 'ABP_KeycardBase_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_KeycardBase_C, TextRender) == 0x0002E8, "Member 'ABP_KeycardBase_C::TextRender' has a wrong offset!");
static_assert(offsetof(ABP_KeycardBase_C, SBZAIObjective) == 0x0002F0, "Member 'ABP_KeycardBase_C::SBZAIObjective' has a wrong offset!");
static_assert(offsetof(ABP_KeycardBase_C, SBZOutline) == 0x0002F8, "Member 'ABP_KeycardBase_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_KeycardBase_C, StaticMesh) == 0x000300, "Member 'ABP_KeycardBase_C::StaticMesh' has a wrong offset!");

}

