#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LA_NC_BodyGuard_Scripted

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function BP_LA_NC_BodyGuard_Scripted.BP_LA_NC_BodyGuard_Scripted_C.ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted
// 0x0040 (0x0040 - 0x0000)
struct BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZCharacter*                          K2Node_ComponentBoundEvent_Character;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 K2Node_ComponentBoundEvent_ActionInstance;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     K2Node_ComponentBoundEvent_ActionSlot;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCharacter*                          K2Node_ComponentBoundEvent_Character_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 K2Node_ComponentBoundEvent_ActionInstance_1;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     K2Node_ComponentBoundEvent_ActionSlot_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZLifeActionStopReason                      K2Node_ComponentBoundEvent_Result;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted) == 0x000008, "Wrong alignment on BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted");
static_assert(sizeof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted) == 0x000040, "Wrong size on BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted, EntryPoint) == 0x000000, "Member 'BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted, K2Node_ComponentBoundEvent_Character) == 0x000008, "Member 'BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted::K2Node_ComponentBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted, K2Node_ComponentBoundEvent_ActionInstance) == 0x000010, "Member 'BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted::K2Node_ComponentBoundEvent_ActionInstance' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted, K2Node_ComponentBoundEvent_ActionSlot) == 0x000018, "Member 'BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted::K2Node_ComponentBoundEvent_ActionSlot' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted, K2Node_ComponentBoundEvent_Character_1) == 0x000020, "Member 'BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted::K2Node_ComponentBoundEvent_Character_1' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted, K2Node_ComponentBoundEvent_ActionInstance_1) == 0x000028, "Member 'BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted::K2Node_ComponentBoundEvent_ActionInstance_1' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted, K2Node_ComponentBoundEvent_ActionSlot_1) == 0x000030, "Member 'BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted::K2Node_ComponentBoundEvent_ActionSlot_1' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted, K2Node_ComponentBoundEvent_Result) == 0x000038, "Member 'BP_LA_NC_BodyGuard_Scripted_C_ExecuteUbergraph_BP_LA_NC_BodyGuard_Scripted::K2Node_ComponentBoundEvent_Result' has a wrong offset!");

// Function BP_LA_NC_BodyGuard_Scripted.BP_LA_NC_BodyGuard_Scripted_C.BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature final
{
public:
	class ASBZCharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 ActionInstance;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     ActionSlot;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature");
static_assert(sizeof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature) == 0x000018, "Wrong size on BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature, Character) == 0x000000, "Member 'BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature::Character' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature, ActionInstance) == 0x000008, "Member 'BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature::ActionInstance' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature, ActionSlot) == 0x000010, "Member 'BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Manager_Scripted_TableButtonPress_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature::ActionSlot' has a wrong offset!");

// Function BP_LA_NC_BodyGuard_Scripted.BP_LA_NC_BodyGuard_Scripted_C.BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature final
{
public:
	class ASBZCharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 ActionInstance;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     ActionSlot;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZLifeActionStopReason                      Result;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature");
static_assert(sizeof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature) == 0x000020, "Wrong size on BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature, Character) == 0x000000, "Member 'BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature::Character' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature, ActionInstance) == 0x000008, "Member 'BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature::ActionInstance' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature, ActionSlot) == 0x000010, "Member 'BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature::ActionSlot' has a wrong offset!");
static_assert(offsetof(BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature, Result) == 0x000018, "Member 'BP_LA_NC_BodyGuard_Scripted_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature::Result' has a wrong offset!");

}

