#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LA_Scripted_Patrol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LA_Scripted_Patrol.BP_LA_Scripted_Patrol_C
// 0x0060 (0x0308 - 0x02A8)
class ABP_LA_Scripted_Patrol_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZLifeActionSlot*                     One;                                               // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     Two;                                               // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 SBZLifeActionInstance_OtherPatrolPoints;           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 SBZLifeActionInstance_FirstPatrolPoint;            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionComponent*                SBZLifeAction;                                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USBZLifeActionSlot*>             PatrolActions;                                     // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         CurrentActionIndex;                                // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          RandomOrder;                                       // 0x02F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F5[0x3];                                      // 0x02F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZCharacter*                          CurrentCharacter;                                  // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     NextActionSlot;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LA_Scripted_Patrol(int32 EntryPoint);
	void BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature(class ASBZCharacter* Character, class USBZLifeActionInstance* ActionInstance, class USBZLifeActionSlot* ActionSlot);
	void BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature(class ASBZCharacter* Character, class USBZLifeActionInstance* ActionInstance, class USBZLifeActionSlot* ActionSlot, ESBZLifeActionStopReason Result);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void GetNextAction(bool DisableRandomOrder, class USBZLifeActionSlot** NextActionSlot_0);
	void BP_LA_Manager_Scripted_Patrol_AutoGenFunc(class UObject* ObjectA, class UObject* ObjectB, bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LA_Scripted_Patrol_C">();
	}
	static class ABP_LA_Scripted_Patrol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LA_Scripted_Patrol_C>();
	}
};
static_assert(alignof(ABP_LA_Scripted_Patrol_C) == 0x000008, "Wrong alignment on ABP_LA_Scripted_Patrol_C");
static_assert(sizeof(ABP_LA_Scripted_Patrol_C) == 0x000308, "Wrong size on ABP_LA_Scripted_Patrol_C");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_LA_Scripted_Patrol_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, One) == 0x0002B0, "Member 'ABP_LA_Scripted_Patrol_C::One' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, Two) == 0x0002B8, "Member 'ABP_LA_Scripted_Patrol_C::Two' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, SBZLifeActionInstance_OtherPatrolPoints) == 0x0002C0, "Member 'ABP_LA_Scripted_Patrol_C::SBZLifeActionInstance_OtherPatrolPoints' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, SBZLifeActionInstance_FirstPatrolPoint) == 0x0002C8, "Member 'ABP_LA_Scripted_Patrol_C::SBZLifeActionInstance_FirstPatrolPoint' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, Root) == 0x0002D0, "Member 'ABP_LA_Scripted_Patrol_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, SBZLifeAction) == 0x0002D8, "Member 'ABP_LA_Scripted_Patrol_C::SBZLifeAction' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, PatrolActions) == 0x0002E0, "Member 'ABP_LA_Scripted_Patrol_C::PatrolActions' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, CurrentActionIndex) == 0x0002F0, "Member 'ABP_LA_Scripted_Patrol_C::CurrentActionIndex' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, RandomOrder) == 0x0002F4, "Member 'ABP_LA_Scripted_Patrol_C::RandomOrder' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, CurrentCharacter) == 0x0002F8, "Member 'ABP_LA_Scripted_Patrol_C::CurrentCharacter' has a wrong offset!");
static_assert(offsetof(ABP_LA_Scripted_Patrol_C, NextActionSlot) == 0x000300, "Member 'ABP_LA_Scripted_Patrol_C::NextActionSlot' has a wrong offset!");

}

