#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LiquidNitrogenRequirement

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function BP_LiquidNitrogenRequirement.BP_LiquidNitrogenRequirement_C.BP_CheckRequirement
// 0x0110 (0x0110 - 0x0000)
struct BP_LiquidNitrogenRequirement_C_BP_CheckRequirement final
{
public:
	const class USBZInteractorComponent*          Interactor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZInteractReqData                    OutData;                                           // 0x0008(0x0040)(Parm, OutParm)
	bool                                          bIsSignalRequired;                                 // 0x0048(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bInIsScreenInteract;                               // 0x0049(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsCasing;                                         // 0x004A(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsEncumbered;                                     // 0x004B(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ReturnValue;                                       // 0x004C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZInteractReqData                    LocalOutData;                                      // 0x0050(0x0040)(Edit, BlueprintVisible)
	class FText                                   Temp_text_Variable;                                // 0x0090(0x0018)(ConstParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             K2Node_DynamicCast_AsCharacter;                    // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x00C0(0x0018)(ConstParm)
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface; // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EB[0x1];                                       // 0x00EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              K2Node_DynamicCast_AsSBZInteractable_Component;    // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement) == 0x000008, "Wrong alignment on BP_LiquidNitrogenRequirement_C_BP_CheckRequirement");
static_assert(sizeof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement) == 0x000110, "Wrong size on BP_LiquidNitrogenRequirement_C_BP_CheckRequirement");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, Interactor) == 0x000000, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::Interactor' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, OutData) == 0x000008, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::OutData' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, bIsSignalRequired) == 0x000048, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::bIsSignalRequired' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, bInIsScreenInteract) == 0x000049, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::bInIsScreenInteract' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, bIsCasing) == 0x00004A, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::bIsCasing' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, bIsEncumbered) == 0x00004B, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::bIsEncumbered' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, ReturnValue) == 0x00004C, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, LocalOutData) == 0x000050, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::LocalOutData' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, Temp_text_Variable) == 0x000090, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, CallFunc_GetOwner_ReturnValue) == 0x0000A8, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, K2Node_DynamicCast_AsCharacter) == 0x0000B0, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::K2Node_DynamicCast_AsCharacter' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, Temp_text_Variable_1) == 0x0000C0, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface) == 0x0000D8, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::K2Node_DynamicCast_AsGameplay_Tag_Asset_Interface' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0000E9, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, Temp_bool_Variable) == 0x0000EA, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, CallFunc_Array_Add_ReturnValue) == 0x0000EC, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, CallFunc_Array_Add_ReturnValue_1) == 0x0000F0, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, CallFunc_GetOuterObject_ReturnValue) == 0x0000F8, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, K2Node_DynamicCast_AsSBZInteractable_Component) == 0x000100, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::K2Node_DynamicCast_AsSBZInteractable_Component' has a wrong offset!");
static_assert(offsetof(BP_LiquidNitrogenRequirement_C_BP_CheckRequirement, K2Node_DynamicCast_bSuccess_2) == 0x000108, "Member 'BP_LiquidNitrogenRequirement_C_BP_CheckRequirement::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

