#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LA_Scripted_Patrol

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function BP_LA_Scripted_Patrol.BP_LA_Scripted_Patrol_C.ExecuteUbergraph_BP_LA_Scripted_Patrol
// 0x0130 (0x0130 - 0x0000)
struct BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     CallFunc_GetNextAction_NextActionSlot;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCharacter*                          K2Node_ComponentBoundEvent_Character_1;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 K2Node_ComponentBoundEvent_ActionInstance_1;       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     K2Node_ComponentBoundEvent_ActionSlot_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZLifeActionStopReason                      K2Node_ComponentBoundEvent_Result;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZCharacter*                          K2Node_ComponentBoundEvent_Character;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 K2Node_ComponentBoundEvent_ActionInstance;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     K2Node_ComponentBoundEvent_ActionSlot;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x2];                                       // 0x005A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZAIActionData_LifeAction*            CallFunc_CreateActionData_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZAIAction*                           CallFunc_PushAction_ReturnValue;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZLifeActionRequest                  K2Node_MakeStruct_SBZLifeActionRequest;            // 0x0088(0x0040)(NoDestructor, ContainsInstancedReference)
	struct FSBZLifeActionRequest                  K2Node_MakeStruct_SBZLifeActionRequest_1;          // 0x00C8(0x0040)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CanBeReservedBy_ReturnValue;              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol) == 0x000008, "Wrong alignment on BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol");
static_assert(sizeof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol) == 0x000130, "Wrong size on BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, EntryPoint) == 0x000000, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, Temp_int_Variable) == 0x000004, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_GetNextAction_NextActionSlot) == 0x000010, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_GetNextAction_NextActionSlot' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, Temp_bool_Variable) == 0x000018, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_Not_PreBool_ReturnValue_1) == 0x000019, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_Event_DeltaSeconds) == 0x00001C, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_ComponentBoundEvent_Character_1) == 0x000020, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_ComponentBoundEvent_Character_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_ComponentBoundEvent_ActionInstance_1) == 0x000028, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_ComponentBoundEvent_ActionInstance_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_ComponentBoundEvent_ActionSlot_1) == 0x000030, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_ComponentBoundEvent_ActionSlot_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_ComponentBoundEvent_Result) == 0x000038, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_ComponentBoundEvent_Result' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_ComponentBoundEvent_Character) == 0x000040, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_ComponentBoundEvent_Character' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_ComponentBoundEvent_ActionInstance) == 0x000048, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_ComponentBoundEvent_ActionInstance' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_ComponentBoundEvent_ActionSlot) == 0x000050, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_ComponentBoundEvent_ActionSlot' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000058, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_MakeLiteralByte_ReturnValue) == 0x000059, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_Array_Find_ReturnValue) == 0x00005C, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_Array_Length_ReturnValue) == 0x000060, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000068, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_CreateActionData_ReturnValue) == 0x000070, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_CreateActionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_PushAction_ReturnValue) == 0x000078, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_PushAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_MakeStruct_SBZLifeActionRequest) == 0x000088, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_MakeStruct_SBZLifeActionRequest' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, K2Node_MakeStruct_SBZLifeActionRequest_1) == 0x0000C8, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::K2Node_MakeStruct_SBZLifeActionRequest_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_CanBeReservedBy_ReturnValue) == 0x000108, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_CanBeReservedBy_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_GetObjectName_ReturnValue) == 0x000110, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol, CallFunc_Concat_StrStr_ReturnValue) == 0x000120, "Member 'BP_LA_Scripted_Patrol_C_ExecuteUbergraph_BP_LA_Scripted_Patrol::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");

// Function BP_LA_Scripted_Patrol.BP_LA_Scripted_Patrol_C.BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature final
{
public:
	class ASBZCharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 ActionInstance;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     ActionSlot;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature");
static_assert(sizeof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature) == 0x000018, "Wrong size on BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature, Character) == 0x000000, "Member 'BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature::Character' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature, ActionInstance) == 0x000008, "Member 'BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature::ActionInstance' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature, ActionSlot) == 0x000010, "Member 'BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Manager_Scripted_EyeScan_SBZLifeAction_K2Node_ComponentBoundEvent_1_SBZLifeActionEventDelegate__DelegateSignature::ActionSlot' has a wrong offset!");

// Function BP_LA_Scripted_Patrol.BP_LA_Scripted_Patrol_C.BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature final
{
public:
	class ASBZCharacter*                          Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 ActionInstance;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     ActionSlot;                                        // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZLifeActionStopReason                      Result;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature");
static_assert(sizeof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature) == 0x000020, "Wrong size on BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature, Character) == 0x000000, "Member 'BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature::Character' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature, ActionInstance) == 0x000008, "Member 'BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature::ActionInstance' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature, ActionSlot) == 0x000010, "Member 'BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature::ActionSlot' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature, Result) == 0x000018, "Member 'BP_LA_Scripted_Patrol_C_BndEvt__BP_LA_Civ_Cosmetic_Dance_SBZLifeAction_K2Node_ComponentBoundEvent_0_SBZLifeActionStopEventDelegate__DelegateSignature::Result' has a wrong offset!");

// Function BP_LA_Scripted_Patrol.BP_LA_Scripted_Patrol_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_LA_Scripted_Patrol_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LA_Scripted_Patrol_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_LA_Scripted_Patrol_C_ReceiveTick");
static_assert(sizeof(BP_LA_Scripted_Patrol_C_ReceiveTick) == 0x000004, "Wrong size on BP_LA_Scripted_Patrol_C_ReceiveTick");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_LA_Scripted_Patrol_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_LA_Scripted_Patrol.BP_LA_Scripted_Patrol_C.UserConstructionScript
// 0x0050 (0x0050 - 0x0000)
struct BP_LA_Scripted_Patrol_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* ObjectA, class UObject* ObjectB, bool* Result)> K2Node_CreateDelegate_OutputDelegate; // 0x000C(0x0014)(ZeroConstructor, NoDestructor)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionSlot*                     K2Node_DynamicCast_As_LAS__ActionSlot;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LA_Scripted_Patrol_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_LA_Scripted_Patrol_C_UserConstructionScript");
static_assert(sizeof(BP_LA_Scripted_Patrol_C_UserConstructionScript) == 0x000050, "Wrong size on BP_LA_Scripted_Patrol_C_UserConstructionScript");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, CallFunc_GetChildrenComponents_Children) == 0x000020, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, K2Node_DynamicCast_As_LAS__ActionSlot) == 0x000038, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::K2Node_DynamicCast_As_LAS__ActionSlot' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x00004C, "Member 'BP_LA_Scripted_Patrol_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LA_Scripted_Patrol.BP_LA_Scripted_Patrol_C.GetNextAction
// 0x0060 (0x0060 - 0x0000)
struct BP_LA_Scripted_Patrol_C_GetNextAction final
{
public:
	bool                                          DisableRandomOrder;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZLifeActionSlot*                     NextActionSlot_0;                                  // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempIndex;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZLifeActionSlot*                     CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_LA_Scripted_Patrol_C_GetNextAction) == 0x000008, "Wrong alignment on BP_LA_Scripted_Patrol_C_GetNextAction");
static_assert(sizeof(BP_LA_Scripted_Patrol_C_GetNextAction) == 0x000060, "Wrong size on BP_LA_Scripted_Patrol_C_GetNextAction");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, DisableRandomOrder) == 0x000000, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::DisableRandomOrder' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, NextActionSlot_0) == 0x000008, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::NextActionSlot_0' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, TempIndex) == 0x000010, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::TempIndex' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, Index_0) == 0x000014, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::Index_0' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, Temp_bool_Variable) == 0x000019, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, Temp_int_Variable) == 0x00001C, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Not_PreBool_ReturnValue_1) == 0x000020, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Subtract_IntInt_ReturnValue) == 0x000028, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_BooleanAND_ReturnValue) == 0x00002C, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_RandomInteger_ReturnValue) == 0x000030, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000034, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, Temp_int_Variable_1) == 0x00003C, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000040, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_BooleanAND_ReturnValue_1) == 0x000049, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Array_Get_Item) == 0x000050, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Array_Length_ReturnValue_1) == 0x000058, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_GetNextAction, CallFunc_Percent_IntInt_ReturnValue) == 0x00005C, "Member 'BP_LA_Scripted_Patrol_C_GetNextAction::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");

// Function BP_LA_Scripted_Patrol.BP_LA_Scripted_Patrol_C.BP_LA_Manager_Scripted_Patrol_AutoGenFunc
// 0x0048 (0x0048 - 0x0000)
struct BP_LA_Scripted_Patrol_C_BP_LA_Manager_Scripted_Patrol_AutoGenFunc final
{
public:
	class UObject*                                ObjectA;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ObjectB;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_LA_Scripted_Patrol_C_BP_LA_Manager_Scripted_Patrol_AutoGenFunc) == 0x000008, "Wrong alignment on BP_LA_Scripted_Patrol_C_BP_LA_Manager_Scripted_Patrol_AutoGenFunc");
static_assert(sizeof(BP_LA_Scripted_Patrol_C_BP_LA_Manager_Scripted_Patrol_AutoGenFunc) == 0x000048, "Wrong size on BP_LA_Scripted_Patrol_C_BP_LA_Manager_Scripted_Patrol_AutoGenFunc");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_BP_LA_Manager_Scripted_Patrol_AutoGenFunc, ObjectA) == 0x000000, "Member 'BP_LA_Scripted_Patrol_C_BP_LA_Manager_Scripted_Patrol_AutoGenFunc::ObjectA' has a wrong offset!");
static_assert(offsetof(BP_LA_Scripted_Patrol_C_BP_LA_Manager_Scripted_Patrol_AutoGenFunc, ObjectB) == 0x000008, "Member 'BP_LA_Scripted_Patrol_C_BP_LA_Manager_Scripted_Patrol_AutoGenFunc::ObjectB' has a wrong offset!");
