#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LGT_NeonTube_01_256_a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Master_Light_Fixture_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LGT_NeonTube_01_256_a.BP_LGT_NeonTube_01_256_a_C
// 0x0030 (0x0370 - 0x0340)
class ABP_LGT_NeonTube_01_256_a_C final : public ABP_Master_Light_Fixture_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZPropDamageComponent*                SBZPropDamage;                                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Cable_Length;                                      // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      Flicker_Material;                                  // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_LGT_NeonTube_01_256_a(int32 EntryPoint);
	void BndEvt__BP_LGT_ArtCielingLamp_a_02_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature(class UActorComponent* PoolComponent, int32 Hits, bool bDoCosmetics, const struct FSBZPropDamageContext& DamageContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LGT_NeonTube_01_256_a_C">();
	}
	static class ABP_LGT_NeonTube_01_256_a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LGT_NeonTube_01_256_a_C>();
	}
};
static_assert(alignof(ABP_LGT_NeonTube_01_256_a_C) == 0x000010, "Wrong alignment on ABP_LGT_NeonTube_01_256_a_C");
static_assert(sizeof(ABP_LGT_NeonTube_01_256_a_C) == 0x000370, "Wrong size on ABP_LGT_NeonTube_01_256_a_C");
static_assert(offsetof(ABP_LGT_NeonTube_01_256_a_C, UberGraphFrame) == 0x000340, "Member 'ABP_LGT_NeonTube_01_256_a_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_LGT_NeonTube_01_256_a_C, SBZPropDamage) == 0x000348, "Member 'ABP_LGT_NeonTube_01_256_a_C::SBZPropDamage' has a wrong offset!");
static_assert(offsetof(ABP_LGT_NeonTube_01_256_a_C, SBZCosmeticDestruction) == 0x000350, "Member 'ABP_LGT_NeonTube_01_256_a_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ABP_LGT_NeonTube_01_256_a_C, Cable_Length) == 0x000358, "Member 'ABP_LGT_NeonTube_01_256_a_C::Cable_Length' has a wrong offset!");
static_assert(offsetof(ABP_LGT_NeonTube_01_256_a_C, Flicker_Material) == 0x000360, "Member 'ABP_LGT_NeonTube_01_256_a_C::Flicker_Material' has a wrong offset!");

}

