#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_LA_Civ_Cosmetic_LeanDrink_Loop_F

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_LA_Civ_Cosmetic_LeanDrink_Loop_F.BP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C
// 0x0018 (0x02C0 - 0x02A8)
class ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C final : public AActor
{
public:
	class USBZLifeActionSlot*                     SBZLifeActionSlot;                                 // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionInstance*                 SBZLifeActionInstance;                             // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionComponent*                SBZLifeAction;                                     // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C">();
	}
	static class ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C>();
	}
};
static_assert(alignof(ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C) == 0x000008, "Wrong alignment on ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C");
static_assert(sizeof(ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C) == 0x0002C0, "Wrong size on ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C");
static_assert(offsetof(ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C, SBZLifeActionSlot) == 0x0002A8, "Member 'ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C::SBZLifeActionSlot' has a wrong offset!");
static_assert(offsetof(ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C, SBZLifeActionInstance) == 0x0002B0, "Member 'ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C::SBZLifeActionInstance' has a wrong offset!");
static_assert(offsetof(ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C, SBZLifeAction) == 0x0002B8, "Member 'ABP_LA_Civ_Cosmetic_LeanDrink_Loop_F_C::SBZLifeAction' has a wrong offset!");

}

