#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Moon_Gun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Moon_Gun.BP_Moon_Gun_C
// 0x0040 (0x0B20 - 0x0AE0)
class ABP_Moon_Gun_C : public ASBZAIDrone
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      fx_lensflare;                                      // 0x0AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAmbientSoundComponent*              SBZAmbientSound;                                   // 0x0AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         DeathDuration;                                     // 0x0AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeathLinearForce;                                  // 0x0AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeathAngularForce;                                 // 0x0B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B04[0x4];                                      // 0x0B04(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          DeadMesh;                                          // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                RandomDeathVector;                                 // 0x0B10(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Moon_Gun(int32 EntryPoint);
	void BP_OnKill_Client();
	void TickExec_51BB4EA443607F8BF71EA7893F95BCE5(const class UDelegateTimer* Timer, float ElapsedTime, float TimeSinceLast);
	void TickExec_8EDFF4314BB4D040A4F521AAA5A56326(const class UDelegateTimer* Timer, float ElapsedTime, float TimeSinceLast);
	void UserConstructionScript();
	void UpdateDeath(float ElapsedTimeSinceDeath, float LinearForce, float AngularForce, float Duration, const struct FVector& RandomVector);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Moon_Gun_C">();
	}
	static class ABP_Moon_Gun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Moon_Gun_C>();
	}
};
static_assert(alignof(ABP_Moon_Gun_C) == 0x000010, "Wrong alignment on ABP_Moon_Gun_C");
static_assert(sizeof(ABP_Moon_Gun_C) == 0x000B20, "Wrong size on ABP_Moon_Gun_C");
static_assert(offsetof(ABP_Moon_Gun_C, UberGraphFrame) == 0x000AE0, "Member 'ABP_Moon_Gun_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Moon_Gun_C, fx_lensflare) == 0x000AE8, "Member 'ABP_Moon_Gun_C::fx_lensflare' has a wrong offset!");
static_assert(offsetof(ABP_Moon_Gun_C, SBZAmbientSound) == 0x000AF0, "Member 'ABP_Moon_Gun_C::SBZAmbientSound' has a wrong offset!");
static_assert(offsetof(ABP_Moon_Gun_C, DeathDuration) == 0x000AF8, "Member 'ABP_Moon_Gun_C::DeathDuration' has a wrong offset!");
static_assert(offsetof(ABP_Moon_Gun_C, DeathLinearForce) == 0x000AFC, "Member 'ABP_Moon_Gun_C::DeathLinearForce' has a wrong offset!");
static_assert(offsetof(ABP_Moon_Gun_C, DeathAngularForce) == 0x000B00, "Member 'ABP_Moon_Gun_C::DeathAngularForce' has a wrong offset!");
static_assert(offsetof(ABP_Moon_Gun_C, DeadMesh) == 0x000B08, "Member 'ABP_Moon_Gun_C::DeadMesh' has a wrong offset!");
static_assert(offsetof(ABP_Moon_Gun_C, RandomDeathVector) == 0x000B10, "Member 'ABP_Moon_Gun_C::RandomDeathVector' has a wrong offset!");

}

