#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MovingBeerCart

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MovingBeerCart.BP_MovingBeerCart_C.ExecuteUbergraph_BP_MovingBeerCart
// 0x0008 (0x0008 - 0x0000)
struct BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart) == 0x000004, "Wrong alignment on BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart");
static_assert(sizeof(BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart) == 0x000008, "Wrong size on BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart");
static_assert(offsetof(BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart, EntryPoint) == 0x000000, "Member 'BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart, K2Node_Event_bStateToChangeTo) == 0x000004, "Member 'BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart, K2Node_Event_bDoCosmetics) == 0x000005, "Member 'BP_MovingBeerCart_C_ExecuteUbergraph_BP_MovingBeerCart::K2Node_Event_bDoCosmetics' has a wrong offset!");

// Function BP_MovingBeerCart.BP_MovingBeerCart_C.OnStateChanged_1
// 0x0002 (0x0002 - 0x0000)
struct BP_MovingBeerCart_C_OnStateChanged_1 final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MovingBeerCart_C_OnStateChanged_1) == 0x000001, "Wrong alignment on BP_MovingBeerCart_C_OnStateChanged_1");
static_assert(sizeof(BP_MovingBeerCart_C_OnStateChanged_1) == 0x000002, "Wrong size on BP_MovingBeerCart_C_OnStateChanged_1");
static_assert(offsetof(BP_MovingBeerCart_C_OnStateChanged_1, bStateToChangeTo) == 0x000000, "Member 'BP_MovingBeerCart_C_OnStateChanged_1::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_MovingBeerCart_C_OnStateChanged_1, bDoCosmetics) == 0x000001, "Member 'BP_MovingBeerCart_C_OnStateChanged_1::bDoCosmetics' has a wrong offset!");

}

