#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MarkerZone

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_MarkerZone.BP_MarkerZone_C.ExecuteUbergraph_BP_MarkerZone
// 0x0008 (0x0008 - 0x0000)
struct BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone) == 0x000004, "Wrong alignment on BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone");
static_assert(sizeof(BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone) == 0x000008, "Wrong size on BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone");
static_assert(offsetof(BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone, EntryPoint) == 0x000000, "Member 'BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone, K2Node_Event_bStateToChangeTo) == 0x000004, "Member 'BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone, K2Node_Event_bDoCosmetics) == 0x000005, "Member 'BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone, CallFunc_IsDedicatedServer_ReturnValue) == 0x000006, "Member 'BP_MarkerZone_C_ExecuteUbergraph_BP_MarkerZone::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");

// Function BP_MarkerZone.BP_MarkerZone_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_MarkerZone_C_OnStateChanged final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MarkerZone_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_MarkerZone_C_OnStateChanged");
static_assert(sizeof(BP_MarkerZone_C_OnStateChanged) == 0x000002, "Wrong size on BP_MarkerZone_C_OnStateChanged");
static_assert(offsetof(BP_MarkerZone_C_OnStateChanged, bStateToChangeTo) == 0x000000, "Member 'BP_MarkerZone_C_OnStateChanged::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_MarkerZone_C_OnStateChanged, bDoCosmetics) == 0x000001, "Member 'BP_MarkerZone_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

}

