#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MLChildSave

#include "Basic.hpp"

#include "UDS_ModSaveData_structs.hpp"
#include "BP_MLSaveGame_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MLChildSave.BP_MLChildSave_C
// 0x00C0 (0x0100 - 0x0040)
class UBP_MLChildSave_C final : public UBP_MLSaveGame_Base_C
{
public:
	class FString                                 SlotName;                                          // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<class UPDA_ModMeta_C*, struct FUDS_ModSaveData> UIModSaveData;                              // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<class UPDA_ModMeta_C*, struct FUDS_ModSaveData> HiddenModSaveData;                          // 0x00A0(0x0050)(Edit, BlueprintVisible)
	class FString                                 MLVersion;                                         // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)

public:
	void AddModSaveData(class UPDA_ModMeta_C* ModMetaData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MLChildSave_C">();
	}
	static class UBP_MLChildSave_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MLChildSave_C>();
	}
};
static_assert(alignof(UBP_MLChildSave_C) == 0x000008, "Wrong alignment on UBP_MLChildSave_C");
static_assert(sizeof(UBP_MLChildSave_C) == 0x000100, "Wrong size on UBP_MLChildSave_C");
static_assert(offsetof(UBP_MLChildSave_C, SlotName) == 0x000040, "Member 'UBP_MLChildSave_C::SlotName' has a wrong offset!");
static_assert(offsetof(UBP_MLChildSave_C, UIModSaveData) == 0x000050, "Member 'UBP_MLChildSave_C::UIModSaveData' has a wrong offset!");
static_assert(offsetof(UBP_MLChildSave_C, HiddenModSaveData) == 0x0000A0, "Member 'UBP_MLChildSave_C::HiddenModSaveData' has a wrong offset!");
static_assert(offsetof(UBP_MLChildSave_C, MLVersion) == 0x0000F0, "Member 'UBP_MLChildSave_C::MLVersion' has a wrong offset!");

}

