#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MethIngredientBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MethIngredientBase.BP_MethIngredientBase_C
// 0x0030 (0x0320 - 0x02F0)
class ABP_MethIngredientBase_C : public ASBZReplicatedIntStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZInteractableComponent*              SBZInteractable;                                   // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              onInteractionCompleted;                            // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_MethIngredientBase(int32 EntryPoint);
	void OnStateChanged(int32 OldState, int32 NewState, bool bDoCosmetics);
	void BndEvt__BP_MethIngredientBase_SBZInteractable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void setObjectState(bool interactable, bool visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MethIngredientBase_C">();
	}
	static class ABP_MethIngredientBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MethIngredientBase_C>();
	}
};
static_assert(alignof(ABP_MethIngredientBase_C) == 0x000008, "Wrong alignment on ABP_MethIngredientBase_C");
static_assert(sizeof(ABP_MethIngredientBase_C) == 0x000320, "Wrong size on ABP_MethIngredientBase_C");
static_assert(offsetof(ABP_MethIngredientBase_C, UberGraphFrame) == 0x0002F0, "Member 'ABP_MethIngredientBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MethIngredientBase_C, SBZInteractable) == 0x0002F8, "Member 'ABP_MethIngredientBase_C::SBZInteractable' has a wrong offset!");
static_assert(offsetof(ABP_MethIngredientBase_C, SBZOutline) == 0x000300, "Member 'ABP_MethIngredientBase_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_MethIngredientBase_C, StaticMesh) == 0x000308, "Member 'ABP_MethIngredientBase_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_MethIngredientBase_C, onInteractionCompleted) == 0x000310, "Member 'ABP_MethIngredientBase_C::onInteractionCompleted' has a wrong offset!");

}

