#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MovingBeerCart

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_BaseMovingInteractable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MovingBeerCart.BP_MovingBeerCart_C
// 0x0028 (0x0338 - 0x0310)
class ABP_MovingBeerCart_C final : public ABP_BaseMovingInteractable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_MovingBeerCart_C;                // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh__4;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh__3;                                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh__2;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh_1;                                      // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MovingBeerCart(int32 EntryPoint);
	void OnStateChanged_1(bool bStateToChangeTo, bool bDoCosmetics);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MovingBeerCart_C">();
	}
	static class ABP_MovingBeerCart_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MovingBeerCart_C>();
	}
};
static_assert(alignof(ABP_MovingBeerCart_C) == 0x000008, "Wrong alignment on ABP_MovingBeerCart_C");
static_assert(sizeof(ABP_MovingBeerCart_C) == 0x000338, "Wrong size on ABP_MovingBeerCart_C");
static_assert(offsetof(ABP_MovingBeerCart_C, UberGraphFrame_BP_MovingBeerCart_C) == 0x000310, "Member 'ABP_MovingBeerCart_C::UberGraphFrame_BP_MovingBeerCart_C' has a wrong offset!");
static_assert(offsetof(ABP_MovingBeerCart_C, StaticMesh__4) == 0x000318, "Member 'ABP_MovingBeerCart_C::StaticMesh__4' has a wrong offset!");
static_assert(offsetof(ABP_MovingBeerCart_C, StaticMesh__3) == 0x000320, "Member 'ABP_MovingBeerCart_C::StaticMesh__3' has a wrong offset!");
static_assert(offsetof(ABP_MovingBeerCart_C, StaticMesh__2) == 0x000328, "Member 'ABP_MovingBeerCart_C::StaticMesh__2' has a wrong offset!");
static_assert(offsetof(ABP_MovingBeerCart_C, StaticMesh_1) == 0x000330, "Member 'ABP_MovingBeerCart_C::StaticMesh_1' has a wrong offset!");

}

