#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MobilePhone_01_SmallDestruction

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MobilePhone_01_SmallDestruction.BP_MobilePhone_01_SmallDestruction_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript");
static_assert(sizeof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript) == 0x000028, "Wrong size on BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript");
static_assert(offsetof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000010, "Member 'BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000014, "Member 'BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000018, "Member 'BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x00001C, "Member 'BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x000020, "Member 'BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000024, "Member 'BP_MobilePhone_01_SmallDestruction_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");

}

