#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Moon01

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Moon01.BP_Moon01_C
// 0x0028 (0x02D0 - 0x02A8)
class ABP_Moon01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Moon_Glow;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Moon_Sphere;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Orgin;                                             // 0x02C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Scale;                                             // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Moon01_C">();
	}
	static class ABP_Moon01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Moon01_C>();
	}
};
static_assert(alignof(ABP_Moon01_C) == 0x000008, "Wrong alignment on ABP_Moon01_C");
static_assert(sizeof(ABP_Moon01_C) == 0x0002D0, "Wrong size on ABP_Moon01_C");
static_assert(offsetof(ABP_Moon01_C, Moon_Glow) == 0x0002A8, "Member 'ABP_Moon01_C::Moon_Glow' has a wrong offset!");
static_assert(offsetof(ABP_Moon01_C, Moon_Sphere) == 0x0002B0, "Member 'ABP_Moon01_C::Moon_Sphere' has a wrong offset!");
static_assert(offsetof(ABP_Moon01_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_Moon01_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Moon01_C, Orgin) == 0x0002C0, "Member 'ABP_Moon01_C::Orgin' has a wrong offset!");
static_assert(offsetof(ABP_Moon01_C, Scale) == 0x0002CC, "Member 'ABP_Moon01_C::Scale' has a wrong offset!");

}

