#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Master_Decal_Fixture

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Master_Decal_Fixture.BP_Master_Decal_Fixture_C
// 0x0040 (0x02E8 - 0x02A8)
class ABP_Master_Decal_Fixture_C : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMesh*>                    Mesh;                                              // 0x02B8(0x0010)(Edit, BlueprintVisible)
	int32                                         Mesh_index;                                        // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMaterialInterface*>             Material;                                          // 0x02D0(0x0010)(Edit, BlueprintVisible)
	int32                                         MaterialIndex;                                     // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void NextMesh__();
	void __PrevMesh();
	void Build();
	void NextMaterial__();
	void __PrevMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Master_Decal_Fixture_C">();
	}
	static class ABP_Master_Decal_Fixture_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Master_Decal_Fixture_C>();
	}
};
static_assert(alignof(ABP_Master_Decal_Fixture_C) == 0x000008, "Wrong alignment on ABP_Master_Decal_Fixture_C");
static_assert(sizeof(ABP_Master_Decal_Fixture_C) == 0x0002E8, "Wrong size on ABP_Master_Decal_Fixture_C");
static_assert(offsetof(ABP_Master_Decal_Fixture_C, StaticMesh) == 0x0002A8, "Member 'ABP_Master_Decal_Fixture_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Master_Decal_Fixture_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_Master_Decal_Fixture_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Master_Decal_Fixture_C, Mesh) == 0x0002B8, "Member 'ABP_Master_Decal_Fixture_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_Master_Decal_Fixture_C, Mesh_index) == 0x0002C8, "Member 'ABP_Master_Decal_Fixture_C::Mesh_index' has a wrong offset!");
static_assert(offsetof(ABP_Master_Decal_Fixture_C, Material) == 0x0002D0, "Member 'ABP_Master_Decal_Fixture_C::Material' has a wrong offset!");
static_assert(offsetof(ABP_Master_Decal_Fixture_C, MaterialIndex) == 0x0002E0, "Member 'ABP_Master_Decal_Fixture_C::MaterialIndex' has a wrong offset!");

}

