#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MaxSaturation

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_MaxSaturation.BP_MaxSaturation_C.ExecuteUbergraph_BP_MaxSaturation
// 0x0090 (0x0090 - 0x0000)
struct BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               CallFunc_MakeVector4_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMissionState*                       CallFunc_GetSBZMissionState_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0030(0x0018)()
	TArray<class APostProcessVolume*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0048(0x0010)(ReferenceParm)
	class APostProcessVolume*                     CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASkyLight*>                      CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0068(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkyLight*                              CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation) == 0x000010, "Wrong alignment on BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation");
static_assert(sizeof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation) == 0x000090, "Wrong size on BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, EntryPoint) == 0x000000, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_MakeVector4_ReturnValue) == 0x000010, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_MakeVector4_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, Temp_int_Array_Index_Variable) == 0x000020, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_GetSBZMissionState_ReturnValue) == 0x000028, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_GetSBZMissionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_MakeLiteralText_ReturnValue) == 0x000030, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_GetAllActorsOfClass_OutActors) == 0x000048, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000060, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000068, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation, CallFunc_Add_IntInt_ReturnValue) == 0x00008C, "Member 'BP_MaxSaturation_C_ExecuteUbergraph_BP_MaxSaturation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

