#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MethBag_Burnt

#include "Basic.hpp"

#include "BP_BaseValuableBag_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MethBag_Burnt.BP_MethBag_Burnt_C
// 0x0018 (0x03B8 - 0x03A0)
class ABP_MethBag_Burnt_C final : public ABP_BaseValuableBag_C
{
public:
	class UNiagaraComponent*                      FX_Bag_Dyed;                                       // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MethBag_Burnt_C">();
	}
	static class ABP_MethBag_Burnt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MethBag_Burnt_C>();
	}
};
static_assert(alignof(ABP_MethBag_Burnt_C) == 0x000008, "Wrong alignment on ABP_MethBag_Burnt_C");
static_assert(sizeof(ABP_MethBag_Burnt_C) == 0x0003B8, "Wrong size on ABP_MethBag_Burnt_C");
static_assert(offsetof(ABP_MethBag_Burnt_C, FX_Bag_Dyed) == 0x0003A0, "Member 'ABP_MethBag_Burnt_C::FX_Bag_Dyed' has a wrong offset!");
static_assert(offsetof(ABP_MethBag_Burnt_C, SBZOutline) == 0x0003A8, "Member 'ABP_MethBag_Burnt_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_MethBag_Burnt_C, StaticMesh) == 0x0003B0, "Member 'ABP_MethBag_Burnt_C::StaticMesh' has a wrong offset!");

}

