#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Master_Light_Fixture

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Master_Light_Fixture.BP_Master_Light_Fixture_C.UserConstructionScript
// 0x0240 (0x0240 - 0x0000)
struct BP_Master_Light_Fixture_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_2;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   K2Node_DynamicCast_AsPoint_Light_Component;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USpotLightComponent*                    K2Node_DynamicCast_AsSpot_Light_Component;         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URectLightComponent*                    K2Node_DynamicCast_AsRect_Light_Component;         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalTransform_SweepHitResult;      // 0x008C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalTransform_SweepHitResult_1;    // 0x011C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_AddLocalTransform_SweepHitResult_2;    // 0x01AC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Master_Light_Fixture_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_Master_Light_Fixture_C_UserConstructionScript");
static_assert(sizeof(BP_Master_Light_Fixture_C_UserConstructionScript) == 0x000240, "Wrong size on BP_Master_Light_Fixture_C_UserConstructionScript");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_GetChildrenComponents_Children) == 0x000008, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x00001C, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000020, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000024, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000030, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000034, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_GetObjectClass_ReturnValue) == 0x000040, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_GetObjectClass_ReturnValue_1) == 0x000048, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000050, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000051, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_GetObjectClass_ReturnValue_2) == 0x000058, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_GetObjectClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, K2Node_DynamicCast_AsPoint_Light_Component) == 0x000060, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::K2Node_DynamicCast_AsPoint_Light_Component' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x000069, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, K2Node_DynamicCast_AsSpot_Light_Component) == 0x000070, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::K2Node_DynamicCast_AsSpot_Light_Component' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_1) == 0x000078, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, K2Node_DynamicCast_AsRect_Light_Component) == 0x000080, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::K2Node_DynamicCast_AsRect_Light_Component' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, K2Node_DynamicCast_bSuccess_2) == 0x000088, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_K2_AddLocalTransform_SweepHitResult) == 0x00008C, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_K2_AddLocalTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_K2_AddLocalTransform_SweepHitResult_1) == 0x00011C, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_K2_AddLocalTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Light_Fixture_C_UserConstructionScript, CallFunc_K2_AddLocalTransform_SweepHitResult_2) == 0x0001AC, "Member 'BP_Master_Light_Fixture_C_UserConstructionScript::CallFunc_K2_AddLocalTransform_SweepHitResult_2' has a wrong offset!");

}

