#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Master_Cloth_fixture

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Master_Cloth_fixture.BP_Master_Cloth_Fixture_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_Master_Cloth_Fixture_C_UserConstructionScript final
{
public:
	float                                         CallFunc_BreakVector_X;                            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Master_Cloth_Fixture_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Master_Cloth_Fixture_C_UserConstructionScript");
static_assert(sizeof(BP_Master_Cloth_Fixture_C_UserConstructionScript) == 0x000010, "Wrong size on BP_Master_Cloth_Fixture_C_UserConstructionScript");
static_assert(offsetof(BP_Master_Cloth_Fixture_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000000, "Member 'BP_Master_Cloth_Fixture_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Master_Cloth_Fixture_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000004, "Member 'BP_Master_Cloth_Fixture_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Master_Cloth_Fixture_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000008, "Member 'BP_Master_Cloth_Fixture_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Master_Cloth_Fixture_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'BP_Master_Cloth_Fixture_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

}

