#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Master_Decal_Fixture

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Master_Decal_Fixture.BP_Master_Decal_Fixture_C.NextMesh>>
// 0x0004 (0x0004 - 0x0000)
struct BP_Master_Decal_Fixture_C_NextMesh__ final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Master_Decal_Fixture_C_NextMesh__) == 0x000004, "Wrong alignment on BP_Master_Decal_Fixture_C_NextMesh__");
static_assert(sizeof(BP_Master_Decal_Fixture_C_NextMesh__) == 0x000004, "Wrong size on BP_Master_Decal_Fixture_C_NextMesh__");
static_assert(offsetof(BP_Master_Decal_Fixture_C_NextMesh__, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'BP_Master_Decal_Fixture_C_NextMesh__::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Master_Decal_Fixture.BP_Master_Decal_Fixture_C.<<PrevMesh
// 0x0004 (0x0004 - 0x0000)
struct BP_Master_Decal_Fixture_C___PrevMesh final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Master_Decal_Fixture_C___PrevMesh) == 0x000004, "Wrong alignment on BP_Master_Decal_Fixture_C___PrevMesh");
static_assert(sizeof(BP_Master_Decal_Fixture_C___PrevMesh) == 0x000004, "Wrong size on BP_Master_Decal_Fixture_C___PrevMesh");
static_assert(offsetof(BP_Master_Decal_Fixture_C___PrevMesh, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'BP_Master_Decal_Fixture_C___PrevMesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Master_Decal_Fixture.BP_Master_Decal_Fixture_C.Build
// 0x0058 (0x0058 - 0x0000)
struct BP_Master_Decal_Fixture_C_Build final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue_1;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMod_Remainder;                           // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMod_Remainder_1;                         // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FMod_ReturnValue_1;                       // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Master_Decal_Fixture_C_Build) == 0x000008, "Wrong alignment on BP_Master_Decal_Fixture_C_Build");
static_assert(sizeof(BP_Master_Decal_Fixture_C_Build) == 0x000058, "Wrong size on BP_Master_Decal_Fixture_C_Build");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Abs_Int_ReturnValue) == 0x000004, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000008, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00000C, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Array_Length_ReturnValue_1) == 0x000010, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Abs_Int_ReturnValue_1) == 0x000014, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Abs_Int_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x00001C, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_FMod_Remainder) == 0x000020, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_FMod_Remainder' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_FMod_ReturnValue) == 0x000024, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_FMod_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Array_Length_ReturnValue_2) == 0x000028, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_FTrunc_ReturnValue) == 0x00002C, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000030, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_FMod_Remainder_1) == 0x000040, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_FMod_Remainder_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_FMod_ReturnValue_1) == 0x000044, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_FMod_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_FTrunc_ReturnValue_1) == 0x000048, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_SetStaticMesh_ReturnValue) == 0x00004C, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Master_Decal_Fixture_C_Build, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'BP_Master_Decal_Fixture_C_Build::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function BP_Master_Decal_Fixture.BP_Master_Decal_Fixture_C.NextMaterial>>
// 0x0004 (0x0004 - 0x0000)
struct BP_Master_Decal_Fixture_C_NextMaterial__ final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Master_Decal_Fixture_C_NextMaterial__) == 0x000004, "Wrong alignment on BP_Master_Decal_Fixture_C_NextMaterial__");
static_assert(sizeof(BP_Master_Decal_Fixture_C_NextMaterial__) == 0x000004, "Wrong size on BP_Master_Decal_Fixture_C_NextMaterial__");
static_assert(offsetof(BP_Master_Decal_Fixture_C_NextMaterial__, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'BP_Master_Decal_Fixture_C_NextMaterial__::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_Master_Decal_Fixture.BP_Master_Decal_Fixture_C.<<PrevMaterial
// 0x0004 (0x0004 - 0x0000)
struct BP_Master_Decal_Fixture_C___PrevMaterial final
{
public:
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Master_Decal_Fixture_C___PrevMaterial) == 0x000004, "Wrong alignment on BP_Master_Decal_Fixture_C___PrevMaterial");
static_assert(sizeof(BP_Master_Decal_Fixture_C___PrevMaterial) == 0x000004, "Wrong size on BP_Master_Decal_Fixture_C___PrevMaterial");
static_assert(offsetof(BP_Master_Decal_Fixture_C___PrevMaterial, CallFunc_Add_IntInt_ReturnValue) == 0x000000, "Member 'BP_Master_Decal_Fixture_C___PrevMaterial::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

