#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Nightclub_Logo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_Master_Light_Fixture_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Nightclub_Logo.BP_Nightclub_Logo_C
// 0x0020 (0x0360 - 0x0340)
class ABP_Nightclub_Logo_C final : public ABP_Master_Light_Fixture_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZPropDamageComponent*                SBZPropDamage;                                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Flicker_Material;                                  // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Nightclub_Logo(int32 EntryPoint);
	void BndEvt__BP_LGT_ArtCielingLamp_a_02_SBZPropDamage_K2Node_ComponentBoundEvent_0_SBZPropDamageHitsSignature__DelegateSignature(class UActorComponent* PoolComponent, int32 Hits, bool bDoCosmetics, const struct FSBZPropDamageContext& DamageContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Nightclub_Logo_C">();
	}
	static class ABP_Nightclub_Logo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Nightclub_Logo_C>();
	}
};
static_assert(alignof(ABP_Nightclub_Logo_C) == 0x000010, "Wrong alignment on ABP_Nightclub_Logo_C");
static_assert(sizeof(ABP_Nightclub_Logo_C) == 0x000360, "Wrong size on ABP_Nightclub_Logo_C");
static_assert(offsetof(ABP_Nightclub_Logo_C, UberGraphFrame) == 0x000340, "Member 'ABP_Nightclub_Logo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Nightclub_Logo_C, SBZPropDamage) == 0x000348, "Member 'ABP_Nightclub_Logo_C::SBZPropDamage' has a wrong offset!");
static_assert(offsetof(ABP_Nightclub_Logo_C, Flicker_Material) == 0x000350, "Member 'ABP_Nightclub_Logo_C::Flicker_Material' has a wrong offset!");

}

