#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OfficeUnit_02_Dest_01_Chunk_03

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OfficeUnit_02_Dest_01_Chunk_03.BP_OfficeUnit_02_Dest_01_Chunk_03_C
// 0x0018 (0x02F0 - 0x02D8)
class ABP_OfficeUnit_02_Dest_01_Chunk_03_C final : public ASBZSmallCosmeticDestruction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Int_SHE_OfficeUnit_02_Ceil_01_Panel_10_Dest_01_Piece_03_top; // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OfficeUnit_02_Dest_01_Chunk_03(int32 EntryPoint);
	void BndEvt__BP_NeoClassical_Pillar_Destructible_Chunk_01_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OfficeUnit_02_Dest_01_Chunk_03_C">();
	}
	static class ABP_OfficeUnit_02_Dest_01_Chunk_03_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OfficeUnit_02_Dest_01_Chunk_03_C>();
	}
};
static_assert(alignof(ABP_OfficeUnit_02_Dest_01_Chunk_03_C) == 0x000008, "Wrong alignment on ABP_OfficeUnit_02_Dest_01_Chunk_03_C");
static_assert(sizeof(ABP_OfficeUnit_02_Dest_01_Chunk_03_C) == 0x0002F0, "Wrong size on ABP_OfficeUnit_02_Dest_01_Chunk_03_C");
static_assert(offsetof(ABP_OfficeUnit_02_Dest_01_Chunk_03_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_OfficeUnit_02_Dest_01_Chunk_03_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OfficeUnit_02_Dest_01_Chunk_03_C, Int_SHE_OfficeUnit_02_Ceil_01_Panel_10_Dest_01_Piece_03_top) == 0x0002E0, "Member 'ABP_OfficeUnit_02_Dest_01_Chunk_03_C::Int_SHE_OfficeUnit_02_Ceil_01_Panel_10_Dest_01_Piece_03_top' has a wrong offset!");
static_assert(offsetof(ABP_OfficeUnit_02_Dest_01_Chunk_03_C, SBZCosmeticDestruction) == 0x0002E8, "Member 'ABP_OfficeUnit_02_Dest_01_Chunk_03_C::SBZCosmeticDestruction' has a wrong offset!");

}

