#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OverkillBag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OverkillBag.BP_OverkillBag_C
// 0x0018 (0x03D0 - 0x03B8)
class ABP_OverkillBag_C final : public ASBZPlaceableWeaponBagItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponentBudgeted*         SkeletalMeshComponentBudgeted;                     // 0x03C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          AnimationAsset;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_OverkillBag(int32 EntryPoint);
	void BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_OverkillBag_C">();
	}
	static class ABP_OverkillBag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OverkillBag_C>();
	}
};
static_assert(alignof(ABP_OverkillBag_C) == 0x000008, "Wrong alignment on ABP_OverkillBag_C");
static_assert(sizeof(ABP_OverkillBag_C) == 0x0003D0, "Wrong size on ABP_OverkillBag_C");
static_assert(offsetof(ABP_OverkillBag_C, UberGraphFrame) == 0x0003B8, "Member 'ABP_OverkillBag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_OverkillBag_C, SkeletalMeshComponentBudgeted) == 0x0003C0, "Member 'ABP_OverkillBag_C::SkeletalMeshComponentBudgeted' has a wrong offset!");
static_assert(offsetof(ABP_OverkillBag_C, AnimationAsset) == 0x0003C8, "Member 'ABP_OverkillBag_C::AnimationAsset' has a wrong offset!");

}

