#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Order_TouchReaction

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Order_TouchReaction.BP_Order_TouchReaction_C.ExecPredicate
// 0x0048 (0x0048 - 0x0000)
struct BP_Order_TouchReaction_C_ExecPredicate final
{
public:
	const class UObject*                          Owner;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Criminal;                                          // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ExecPredicate_ReturnValue;                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZAIController*                       K2Node_DynamicCast_AsSBZAIController;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetValueAsObject_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Order_TouchReaction_C_ExecPredicate) == 0x000008, "Wrong alignment on BP_Order_TouchReaction_C_ExecPredicate");
static_assert(sizeof(BP_Order_TouchReaction_C_ExecPredicate) == 0x000048, "Wrong size on BP_Order_TouchReaction_C_ExecPredicate");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, Owner) == 0x000000, "Member 'BP_Order_TouchReaction_C_ExecPredicate::Owner' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, ReturnValue) == 0x000008, "Member 'BP_Order_TouchReaction_C_ExecPredicate::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, Criminal) == 0x00000C, "Member 'BP_Order_TouchReaction_C_ExecPredicate::Criminal' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, CallFunc_ExecPredicate_ReturnValue) == 0x000018, "Member 'BP_Order_TouchReaction_C_ExecPredicate::CallFunc_ExecPredicate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, K2Node_DynamicCast_AsSBZAIController) == 0x000020, "Member 'BP_Order_TouchReaction_C_ExecPredicate::K2Node_DynamicCast_AsSBZAIController' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_Order_TouchReaction_C_ExecPredicate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, CallFunc_GetBlackboard_ReturnValue) == 0x000030, "Member 'BP_Order_TouchReaction_C_ExecPredicate::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, CallFunc_GetValueAsObject_ReturnValue) == 0x000038, "Member 'BP_Order_TouchReaction_C_ExecPredicate::CallFunc_GetValueAsObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_Order_TouchReaction_C_ExecPredicate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, CallFunc_Not_PreBool_ReturnValue) == 0x000041, "Member 'BP_Order_TouchReaction_C_ExecPredicate::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Order_TouchReaction_C_ExecPredicate, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'BP_Order_TouchReaction_C_ExecPredicate::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

