#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OverkillBag

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_OverkillBag.BP_OverkillBag_C.ExecuteUbergraph_BP_OverkillBag
// 0x0038 (0x0038 - 0x0000)
struct BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable_1;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor_1;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag) == 0x000008, "Wrong alignment on BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag");
static_assert(sizeof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag) == 0x000038, "Wrong size on BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag");
static_assert(offsetof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag, EntryPoint) == 0x000000, "Member 'BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag, K2Node_ComponentBoundEvent_Interactable_1) == 0x000008, "Member 'BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag, K2Node_ComponentBoundEvent_Interactor_1) == 0x000010, "Member 'BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag::K2Node_ComponentBoundEvent_Interactor_1' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1) == 0x000018, "Member 'BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag, CallFunc_IsPlaying_ReturnValue) == 0x000019, "Member 'BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag::CallFunc_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag, K2Node_ComponentBoundEvent_Interactable) == 0x000020, "Member 'BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag, K2Node_ComponentBoundEvent_Interactor) == 0x000028, "Member 'BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000030, "Member 'BP_OverkillBag_C_ExecuteUbergraph_BP_OverkillBag::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_OverkillBag.BP_OverkillBag_C.BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_OverkillBag.BP_OverkillBag_C.BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_OverkillBag_C_BndEvt__BP_OverkillBag_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

}

