#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Prototype_LevelBoundsTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Prototype_LevelBoundsTrigger.BP_Prototype_LevelBoundsTrigger_C
// 0x0060 (0x0308 - 0x02A8)
class ABP_Prototype_LevelBoundsTrigger_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZPostProcessComponent*               SBZPostProcess;                                    // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PostProcessBoundsReference;                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          PostProcessArea;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Root;                                              // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Trigger;                                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowMessage;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x3];                                      // 0x02E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                PostProcessZone;                                   // 0x02E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PostProcessBlendOffset;                            // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TriggerZone;                                       // 0x02F4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TextTriggerDistanceDepth;                          // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Prototype_LevelBoundsTrigger(int32 EntryPoint);
	void BndEvt__BP_Prototype_LevelBoundsTrigger_PostProcessBoundsReference_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void BndEvt__Trigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Prototype_LevelBoundsTrigger_C">();
	}
	static class ABP_Prototype_LevelBoundsTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Prototype_LevelBoundsTrigger_C>();
	}
};
static_assert(alignof(ABP_Prototype_LevelBoundsTrigger_C) == 0x000008, "Wrong alignment on ABP_Prototype_LevelBoundsTrigger_C");
static_assert(sizeof(ABP_Prototype_LevelBoundsTrigger_C) == 0x000308, "Wrong size on ABP_Prototype_LevelBoundsTrigger_C");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_Prototype_LevelBoundsTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, SBZPostProcess) == 0x0002B0, "Member 'ABP_Prototype_LevelBoundsTrigger_C::SBZPostProcess' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, PostProcessBoundsReference) == 0x0002B8, "Member 'ABP_Prototype_LevelBoundsTrigger_C::PostProcessBoundsReference' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, PostProcessArea) == 0x0002C0, "Member 'ABP_Prototype_LevelBoundsTrigger_C::PostProcessArea' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, Root) == 0x0002C8, "Member 'ABP_Prototype_LevelBoundsTrigger_C::Root' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, Billboard) == 0x0002D0, "Member 'ABP_Prototype_LevelBoundsTrigger_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, Trigger) == 0x0002D8, "Member 'ABP_Prototype_LevelBoundsTrigger_C::Trigger' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, ShowMessage) == 0x0002E0, "Member 'ABP_Prototype_LevelBoundsTrigger_C::ShowMessage' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, PostProcessZone) == 0x0002E4, "Member 'ABP_Prototype_LevelBoundsTrigger_C::PostProcessZone' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, PostProcessBlendOffset) == 0x0002F0, "Member 'ABP_Prototype_LevelBoundsTrigger_C::PostProcessBlendOffset' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, TriggerZone) == 0x0002F4, "Member 'ABP_Prototype_LevelBoundsTrigger_C::TriggerZone' has a wrong offset!");
static_assert(offsetof(ABP_Prototype_LevelBoundsTrigger_C, TextTriggerDistanceDepth) == 0x000300, "Member 'ABP_Prototype_LevelBoundsTrigger_C::TextTriggerDistanceDepth' has a wrong offset!");

}

