#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PortableSSD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PortableSSD.BP_PortableSSD_C
// 0x0028 (0x02F8 - 0x02D0)
class ABP_PortableSSD_C final : public ASBZStaticInteractionActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Block_Placeable_Collision;                         // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PortableSSD(int32 EntryPoint);
	void BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PortableSSD_C">();
	}
	static class ABP_PortableSSD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PortableSSD_C>();
	}
};
static_assert(alignof(ABP_PortableSSD_C) == 0x000008, "Wrong alignment on ABP_PortableSSD_C");
static_assert(sizeof(ABP_PortableSSD_C) == 0x0002F8, "Wrong size on ABP_PortableSSD_C");
static_assert(offsetof(ABP_PortableSSD_C, UberGraphFrame) == 0x0002D0, "Member 'ABP_PortableSSD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PortableSSD_C, Block_Placeable_Collision) == 0x0002D8, "Member 'ABP_PortableSSD_C::Block_Placeable_Collision' has a wrong offset!");
static_assert(offsetof(ABP_PortableSSD_C, SBZOutline) == 0x0002E0, "Member 'ABP_PortableSSD_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_PortableSSD_C, Cube) == 0x0002E8, "Member 'ABP_PortableSSD_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_PortableSSD_C, Mesh) == 0x0002F0, "Member 'ABP_PortableSSD_C::Mesh' has a wrong offset!");

}

