#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PaperStack

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_PaperStack.BP_PaperStack_C.ExecuteUbergraph_BP_PaperStack
// 0x0060 (0x0060 - 0x0000)
struct BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable_2;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor_2;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_2; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable_1;         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack) == 0x000008, "Wrong alignment on BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack");
static_assert(sizeof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack) == 0x000060, "Wrong size on BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, EntryPoint) == 0x000000, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, K2Node_ComponentBoundEvent_Interactable_2) == 0x000008, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::K2Node_ComponentBoundEvent_Interactable_2' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, K2Node_ComponentBoundEvent_Interactor_2) == 0x000010, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::K2Node_ComponentBoundEvent_Interactor_2' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_2) == 0x000018, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_2' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00001C, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, K2Node_ComponentBoundEvent_Interactable_1) == 0x000028, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, K2Node_ComponentBoundEvent_Interactor_1) == 0x000030, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::K2Node_ComponentBoundEvent_Interactor_1' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1) == 0x000038, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000040, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, K2Node_ComponentBoundEvent_Interactable) == 0x000048, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, K2Node_ComponentBoundEvent_Interactor) == 0x000050, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000058, "Member 'BP_PaperStack_C_ExecuteUbergraph_BP_PaperStack::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_PaperStack.BP_PaperStack_C.BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature, Interactable) == 0x000000, "Member 'BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_PaperStack.BP_PaperStack_C.BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature, Interactable) == 0x000000, "Member 'BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_4_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_PaperStack.BP_PaperStack_C.BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, Interactable) == 0x000000, "Member 'BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_PaperStack_C_BndEvt__BP_PaperStack_InteractableComponent_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

}

