#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Placeable_AmmoBag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Placeable_AmmoBag.BP_Placeable_AmmoBag_C
// 0x0090 (0x05E0 - 0x0550)
class ABP_Placeable_AmmoBag_C : public ASBZAmmoBag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0550(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          InteractionCollision;                              // 0x0558(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Charge7;                                           // 0x0560(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Charge6;                                           // 0x0568(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Charge5;                                           // 0x0570(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Charge4;                                           // 0x0578(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Charge3;                                           // 0x0580(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Charge2;                                           // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Charge1;                                           // 0x0590(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Charge0;                                           // 0x0598(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZShoutTargetComponent*               SBZShoutTarget;                                    // 0x05A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_CCA6721B4F368C9BF24B17A6F8780240; // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InitialMeterScale;                                 // 0x05C0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ReplicatedMarkerID;                                // 0x05CC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasBeenMarked;                                     // 0x05D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_Placeable_AmmoBag(int32 EntryPoint);
	void BndEvt__BP_Placeable_AmmoBag_Interactable_K2Node_ComponentBoundEvent_3_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BndEvt__BP_Placeable_AmmoBag_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable_0, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BndEvt__BP_Placeable_AmmoBag_ProjectileMovementComponent_K2Node_ComponentBoundEvent_1_ActorComponentActivatedSignature__DelegateSignature(class UActorComponent* Component, bool bReset);
	void OnChargesChanged(float ChargesChangeTo, bool bDoCosmetics);
	void BndEvt__SBZShoutTarget_K2Node_ComponentBoundEvent_2_SBZShoutedAtDelegate__DelegateSignature(class USBZShoutTargetComponent* ShoutTarget, class APawn* Shouter);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void UpdateCharges(float NewChargeCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Placeable_AmmoBag_C">();
	}
	static class ABP_Placeable_AmmoBag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Placeable_AmmoBag_C>();
	}
};
static_assert(alignof(ABP_Placeable_AmmoBag_C) == 0x000010, "Wrong alignment on ABP_Placeable_AmmoBag_C");
static_assert(sizeof(ABP_Placeable_AmmoBag_C) == 0x0005E0, "Wrong size on ABP_Placeable_AmmoBag_C");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, UberGraphFrame) == 0x000550, "Member 'ABP_Placeable_AmmoBag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, InteractionCollision) == 0x000558, "Member 'ABP_Placeable_AmmoBag_C::InteractionCollision' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Charge7) == 0x000560, "Member 'ABP_Placeable_AmmoBag_C::Charge7' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Charge6) == 0x000568, "Member 'ABP_Placeable_AmmoBag_C::Charge6' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Charge5) == 0x000570, "Member 'ABP_Placeable_AmmoBag_C::Charge5' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Charge4) == 0x000578, "Member 'ABP_Placeable_AmmoBag_C::Charge4' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Charge3) == 0x000580, "Member 'ABP_Placeable_AmmoBag_C::Charge3' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Charge2) == 0x000588, "Member 'ABP_Placeable_AmmoBag_C::Charge2' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Charge1) == 0x000590, "Member 'ABP_Placeable_AmmoBag_C::Charge1' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Charge0) == 0x000598, "Member 'ABP_Placeable_AmmoBag_C::Charge0' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, SBZShoutTarget) == 0x0005A0, "Member 'ABP_Placeable_AmmoBag_C::SBZShoutTarget' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Scene) == 0x0005A8, "Member 'ABP_Placeable_AmmoBag_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Timeline_0__Direction_CCA6721B4F368C9BF24B17A6F8780240) == 0x0005B0, "Member 'ABP_Placeable_AmmoBag_C::Timeline_0__Direction_CCA6721B4F368C9BF24B17A6F8780240' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, Timeline_0) == 0x0005B8, "Member 'ABP_Placeable_AmmoBag_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, InitialMeterScale) == 0x0005C0, "Member 'ABP_Placeable_AmmoBag_C::InitialMeterScale' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, ReplicatedMarkerID) == 0x0005CC, "Member 'ABP_Placeable_AmmoBag_C::ReplicatedMarkerID' has a wrong offset!");
static_assert(offsetof(ABP_Placeable_AmmoBag_C, HasBeenMarked) == 0x0005D0, "Member 'ABP_Placeable_AmmoBag_C::HasBeenMarked' has a wrong offset!");

}

