#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PhoneToolClickable

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PhoneToolClickable.BP_PhoneToolClickable_C
// 0x0040 (0x05D0 - 0x0590)
class ABP_PhoneToolClickable_C final : public ASBZPhoneTool
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ControlID;                                         // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZControlsReference                  In_Controls_Reference_Idle;                        // 0x05A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_PhoneToolClickable(int32 EntryPoint);
	void OnActivated();
	void OnCanceled();
	void OnReady();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PhoneToolClickable_C">();
	}
	static class ABP_PhoneToolClickable_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PhoneToolClickable_C>();
	}
};
static_assert(alignof(ABP_PhoneToolClickable_C) == 0x000010, "Wrong alignment on ABP_PhoneToolClickable_C");
static_assert(sizeof(ABP_PhoneToolClickable_C) == 0x0005D0, "Wrong size on ABP_PhoneToolClickable_C");
static_assert(offsetof(ABP_PhoneToolClickable_C, UberGraphFrame) == 0x000590, "Member 'ABP_PhoneToolClickable_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PhoneToolClickable_C, ControlID) == 0x000598, "Member 'ABP_PhoneToolClickable_C::ControlID' has a wrong offset!");
static_assert(offsetof(ABP_PhoneToolClickable_C, In_Controls_Reference_Idle) == 0x0005A0, "Member 'ABP_PhoneToolClickable_C::In_Controls_Reference_Idle' has a wrong offset!");

}

