#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PortableSSD

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_PortableSSD.BP_PortableSSD_C.ExecuteUbergraph_BP_PortableSSD
// 0x0060 (0x0060 - 0x0000)
struct BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0020(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0030(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable_1;         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor_1;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD) == 0x000008, "Wrong alignment on BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD");
static_assert(sizeof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD) == 0x000060, "Wrong size on BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, EntryPoint) == 0x000000, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, K2Node_ComponentBoundEvent_Interactable) == 0x000008, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, K2Node_ComponentBoundEvent_Interactor) == 0x000010, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000018, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, Temp_struct_Variable) == 0x000020, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, Temp_delegate_Variable) == 0x000030, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, K2Node_ComponentBoundEvent_Interactable_1) == 0x000048, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::K2Node_ComponentBoundEvent_Interactable_1' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, K2Node_ComponentBoundEvent_Interactor_1) == 0x000050, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::K2Node_ComponentBoundEvent_Interactor_1' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1) == 0x000058, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor_1' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD, CallFunc_PostEvent_ReturnValue) == 0x00005C, "Member 'BP_PortableSSD_C_ExecuteUbergraph_BP_PortableSSD::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function BP_PortableSSD.BP_PortableSSD_C.BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_PortableSSD.BP_PortableSSD_C.BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable_0;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, Interactable_0) == 0x000000, "Member 'BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::Interactable_0' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_PortableSSD_C_BndEvt__BP_PortableSSD_Interactable_K2Node_ComponentBoundEvent_1_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

}

