#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedBinaryActor_DJKeyboard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplicatedBinaryActor_DJKeyboard.BP_ReplicatedBinaryActor_DJKeyboard_C
// 0x0050 (0x0328 - 0x02D8)
class ABP_ReplicatedBinaryActor_DJKeyboard_C final : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable;                                   // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              DJKeyboardUsed;                                    // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              MusicReset;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Interacted_1stTime;                                // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x3];                                      // 0x0321(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Flickering_Timing;                                 // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard(int32 EntryPoint);
	void BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void OnStateChanged(bool bStateToChangeTo, bool bDoCosmetics);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplicatedBinaryActor_DJKeyboard_C">();
	}
	static class ABP_ReplicatedBinaryActor_DJKeyboard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplicatedBinaryActor_DJKeyboard_C>();
	}
};
static_assert(alignof(ABP_ReplicatedBinaryActor_DJKeyboard_C) == 0x000008, "Wrong alignment on ABP_ReplicatedBinaryActor_DJKeyboard_C");
static_assert(sizeof(ABP_ReplicatedBinaryActor_DJKeyboard_C) == 0x000328, "Wrong size on ABP_ReplicatedBinaryActor_DJKeyboard_C");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJKeyboard_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_ReplicatedBinaryActor_DJKeyboard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJKeyboard_C, SBZOutline) == 0x0002E0, "Member 'ABP_ReplicatedBinaryActor_DJKeyboard_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJKeyboard_C, SBZInteractable) == 0x0002E8, "Member 'ABP_ReplicatedBinaryActor_DJKeyboard_C::SBZInteractable' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJKeyboard_C, StaticMesh) == 0x0002F0, "Member 'ABP_ReplicatedBinaryActor_DJKeyboard_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJKeyboard_C, DefaultSceneRoot) == 0x0002F8, "Member 'ABP_ReplicatedBinaryActor_DJKeyboard_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJKeyboard_C, DJKeyboardUsed) == 0x000300, "Member 'ABP_ReplicatedBinaryActor_DJKeyboard_C::DJKeyboardUsed' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJKeyboard_C, MusicReset) == 0x000310, "Member 'ABP_ReplicatedBinaryActor_DJKeyboard_C::MusicReset' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJKeyboard_C, Interacted_1stTime) == 0x000320, "Member 'ABP_ReplicatedBinaryActor_DJKeyboard_C::Interacted_1stTime' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJKeyboard_C, Flickering_Timing) == 0x000324, "Member 'ABP_ReplicatedBinaryActor_DJKeyboard_C::Flickering_Timing' has a wrong offset!");

}

