#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RinoHud_SaveManager_Utils

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "RinoHud_SaveGame_Struct_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.LoadConfig
// 0x0048 (0x0048 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_LoadConfig final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_RinoHud_Savegame_C*                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Slot_Name;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UBP_RinoHud_Savegame_C*                 CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RinoHud_Savegame_C*                 K2Node_DynamicCast_AsBP_Rino_Hud_Savegame;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_LoadConfig) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_LoadConfig");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_LoadConfig) == 0x000048, "Wrong size on BP_RinoHud_SaveManager_Utils_C_LoadConfig");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_LoadConfig, __WorldContext) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_LoadConfig::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_LoadConfig, ReturnValue) == 0x000008, "Member 'BP_RinoHud_SaveManager_Utils_C_LoadConfig::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_LoadConfig, Slot_Name) == 0x000010, "Member 'BP_RinoHud_SaveManager_Utils_C_LoadConfig::Slot_Name' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_LoadConfig, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000020, "Member 'BP_RinoHud_SaveManager_Utils_C_LoadConfig::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_LoadConfig, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000028, "Member 'BP_RinoHud_SaveManager_Utils_C_LoadConfig::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_LoadConfig, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000030, "Member 'BP_RinoHud_SaveManager_Utils_C_LoadConfig::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_LoadConfig, K2Node_DynamicCast_AsBP_Rino_Hud_Savegame) == 0x000038, "Member 'BP_RinoHud_SaveManager_Utils_C_LoadConfig::K2Node_DynamicCast_AsBP_Rino_Hud_Savegame' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_LoadConfig, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_RinoHud_SaveManager_Utils_C_LoadConfig::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.ConstructSaveCategory
// 0x3678 (0x3678 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZSettingsMenuCategoryInfo           SBZSettingsMenuCategoryInfo;                       // 0x0008(0x0080)(Parm, OutParm)
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData;               // 0x0088(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_1;             // 0x0370(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_2;             // 0x0658(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_3;             // 0x0940(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeColorSlider_SBZSettingData;          // 0x0C28(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeSlider_SBZSettingData;               // 0x0F10(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeSlider_SBZSettingData_1;             // 0x11F8(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeSlider_SBZSettingData_2;             // 0x14E0(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_4;             // 0x17C8(0x02E8)()
	TArray<struct FSBZSettingData>                K2Node_MakeArray_Array;                            // 0x1AB0(0x0010)(ReferenceParm)
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_5;             // 0x1AC0(0x02E8)()
	struct FSBZSettingsMenuGroupInfo              K2Node_MakeStruct_SBZSettingsMenuGroupInfo;        // 0x1DA8(0x0078)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_6;             // 0x1E20(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_7;             // 0x2108(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_8;             // 0x23F0(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_9;             // 0x26D8(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_10;            // 0x29C0(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_11;            // 0x2CA8(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_12;            // 0x2F90(0x02E8)()
	struct FSBZSettingData                        CallFunc__MakeToggle_SBZSettingData_13;            // 0x3278(0x02E8)()
	TArray<struct FSBZSettingData>                K2Node_MakeArray_Array_1;                          // 0x3560(0x0010)(ReferenceParm)
	struct FSBZSettingsMenuGroupInfo              K2Node_MakeStruct_SBZSettingsMenuGroupInfo_1;      // 0x3570(0x0078)()
	TArray<struct FSBZSettingsMenuGroupInfo>      K2Node_MakeArray_Array_2;                          // 0x35E8(0x0010)(ReferenceParm)
	struct FSBZSettingsMenuCategoryInfo           K2Node_MakeStruct_SBZSettingsMenuCategoryInfo;     // 0x35F8(0x0080)()
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory) == 0x003678, "Wrong size on BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, __WorldContext) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, SBZSettingsMenuCategoryInfo) == 0x000008, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::SBZSettingsMenuCategoryInfo' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData) == 0x000088, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_1) == 0x000370, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_1' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_2) == 0x000658, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_2' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_3) == 0x000940, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_3' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeColorSlider_SBZSettingData) == 0x000C28, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeColorSlider_SBZSettingData' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeSlider_SBZSettingData) == 0x000F10, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeSlider_SBZSettingData' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeSlider_SBZSettingData_1) == 0x0011F8, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeSlider_SBZSettingData_1' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeSlider_SBZSettingData_2) == 0x0014E0, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeSlider_SBZSettingData_2' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_4) == 0x0017C8, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_4' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, K2Node_MakeArray_Array) == 0x001AB0, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_5) == 0x001AC0, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_5' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, K2Node_MakeStruct_SBZSettingsMenuGroupInfo) == 0x001DA8, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::K2Node_MakeStruct_SBZSettingsMenuGroupInfo' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_6) == 0x001E20, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_6' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_7) == 0x002108, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_7' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_8) == 0x0023F0, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_8' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_9) == 0x0026D8, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_9' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_10) == 0x0029C0, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_10' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_11) == 0x002CA8, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_11' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_12) == 0x002F90, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_12' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, CallFunc__MakeToggle_SBZSettingData_13) == 0x003278, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::CallFunc__MakeToggle_SBZSettingData_13' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, K2Node_MakeArray_Array_1) == 0x003560, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, K2Node_MakeStruct_SBZSettingsMenuGroupInfo_1) == 0x003570, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::K2Node_MakeStruct_SBZSettingsMenuGroupInfo_1' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, K2Node_MakeArray_Array_2) == 0x0035E8, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory, K2Node_MakeStruct_SBZSettingsMenuCategoryInfo) == 0x0035F8, "Member 'BP_RinoHud_SaveManager_Utils_C_ConstructSaveCategory::K2Node_MakeStruct_SBZSettingsMenuCategoryInfo' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.SaveConfig
// 0x0028 (0x0028 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_SaveConfig final
{
public:
	class USaveGame*                              SaveGameObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Slot_Name;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_SaveConfig) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_SaveConfig");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_SaveConfig) == 0x000028, "Wrong size on BP_RinoHud_SaveManager_Utils_C_SaveConfig");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SaveConfig, SaveGameObject) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_SaveConfig::SaveGameObject' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SaveConfig, __WorldContext) == 0x000008, "Member 'BP_RinoHud_SaveManager_Utils_C_SaveConfig::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SaveConfig, Slot_Name) == 0x000010, "Member 'BP_RinoHud_SaveManager_Utils_C_SaveConfig::Slot_Name' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SaveConfig, CallFunc_SaveGameToSlot_ReturnValue) == 0x000020, "Member 'BP_RinoHud_SaveManager_Utils_C_SaveConfig::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C._MakeToggle
// 0x0600 (0x0600 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C__MakeToggle final
{
public:
	class FText                                   SettingName;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   PropertyName;                                      // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZSettingData                        SBZSettingData;                                    // 0x0030(0x02E8)(Parm, OutParm)
	struct FSBZSettingData                        K2Node_MakeStruct_SBZSettingData;                  // 0x0318(0x02E8)()
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C__MakeToggle) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C__MakeToggle");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C__MakeToggle) == 0x000600, "Wrong size on BP_RinoHud_SaveManager_Utils_C__MakeToggle");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeToggle, SettingName) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeToggle::SettingName' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeToggle, PropertyName) == 0x000018, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeToggle::PropertyName' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeToggle, __WorldContext) == 0x000028, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeToggle::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeToggle, SBZSettingData) == 0x000030, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeToggle::SBZSettingData' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeToggle, K2Node_MakeStruct_SBZSettingData) == 0x000318, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeToggle::K2Node_MakeStruct_SBZSettingData' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C._MakeSlider
// 0x0608 (0x0608 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C__MakeSlider final
{
public:
	class FText                                   SettingName;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   PropertyName;                                      // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Float_Min_Value;                                   // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Float_Max_Value;                                   // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Float_Increment_Value;                             // 0x002C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZSettingData                        SBZSettingData;                                    // 0x0038(0x02E8)(Parm, OutParm)
	struct FSBZSettingData                        K2Node_MakeStruct_SBZSettingData;                  // 0x0320(0x02E8)()
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C__MakeSlider) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C__MakeSlider");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C__MakeSlider) == 0x000608, "Wrong size on BP_RinoHud_SaveManager_Utils_C__MakeSlider");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeSlider, SettingName) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeSlider::SettingName' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeSlider, PropertyName) == 0x000018, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeSlider::PropertyName' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeSlider, Float_Min_Value) == 0x000024, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeSlider::Float_Min_Value' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeSlider, Float_Max_Value) == 0x000028, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeSlider::Float_Max_Value' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeSlider, Float_Increment_Value) == 0x00002C, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeSlider::Float_Increment_Value' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeSlider, __WorldContext) == 0x000030, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeSlider::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeSlider, SBZSettingData) == 0x000038, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeSlider::SBZSettingData' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeSlider, K2Node_MakeStruct_SBZSettingData) == 0x000320, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeSlider::K2Node_MakeStruct_SBZSettingData' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C._MakeColorSlider
// 0x0600 (0x0600 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C__MakeColorSlider final
{
public:
	class FText                                   SettingName;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FName                                   PropertyName;                                      // 0x0018(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZSettingData                        SBZSettingData;                                    // 0x0030(0x02E8)(Parm, OutParm)
	struct FSBZSettingData                        K2Node_MakeStruct_SBZSettingData;                  // 0x0318(0x02E8)()
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C__MakeColorSlider) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C__MakeColorSlider");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C__MakeColorSlider) == 0x000600, "Wrong size on BP_RinoHud_SaveManager_Utils_C__MakeColorSlider");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeColorSlider, SettingName) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeColorSlider::SettingName' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeColorSlider, PropertyName) == 0x000018, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeColorSlider::PropertyName' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeColorSlider, __WorldContext) == 0x000028, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeColorSlider::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeColorSlider, SBZSettingData) == 0x000030, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeColorSlider::SBZSettingData' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__MakeColorSlider, K2Node_MakeStruct_SBZSettingData) == 0x000318, "Member 'BP_RinoHud_SaveManager_Utils_C__MakeColorSlider::K2Node_MakeStruct_SBZSettingData' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.SettingsMenuManagerHasCategory
// 0x00B8 (0x00B8 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory final
{
public:
	class USBZSettingsMenuManager*                SettingsMenuManager;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CategoryName;                                      // 0x0008(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Exists;                                            // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bExists;                                           // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZSettingsMenuCategoryInfo           CallFunc_Array_Get_Item;                           // 0x0030(0x0080)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory) == 0x0000B8, "Wrong size on BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, SettingsMenuManager) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::SettingsMenuManager' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, CategoryName) == 0x000008, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::CategoryName' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, __WorldContext) == 0x000018, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, Exists) == 0x000020, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::Exists' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, bExists) == 0x000021, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::bExists' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, Temp_bool_True_if_break_was_hit_Variable) == 0x000022, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, CallFunc_Not_PreBool_ReturnValue) == 0x000023, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, Temp_int_Array_Index_Variable) == 0x000028, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, CallFunc_Array_Get_Item) == 0x000030, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, CallFunc_Less_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000B1, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, CallFunc_BooleanAND_ReturnValue) == 0x0000B2, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory, CallFunc_Add_IntInt_ReturnValue) == 0x0000B4, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuManagerHasCategory::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.SettingsMenuMangerAddCategory
// 0x0098 (0x0098 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory final
{
public:
	class USBZSettingsMenuManager*                SettingsMenuManager;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZSettingsMenuCategoryInfo           Category;                                          // 0x0008(0x0080)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0088(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory) == 0x000098, "Wrong size on BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory, SettingsMenuManager) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory::SettingsMenuManager' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory, Category) == 0x000008, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory::Category' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory, __WorldContext) == 0x000088, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'BP_RinoHud_SaveManager_Utils_C_SettingsMenuMangerAddCategory::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.AddSettingsMenu
// 0x00E8 (0x00E8 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu final
{
public:
	class UWBP_UI_SM_ActionPhaseMenu_C*           ActionPhaseMenu;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Settings_Screen_Category_C*        SettingsScreenToAdd;                               // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZNavButtonParameters                SBZNavButtonParameters;                            // 0x0010(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UObject*                                __WorldContext;                                    // 0x0080(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuNavBarButton*                   CallFunc_Create_ReturnValue;                       // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue_1;                  // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           K2Node_DynamicCast_AsCanvas_Panel;                 // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x00D8(0x0010)(NoDestructor)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu) == 0x0000E8, "Wrong size on BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, ActionPhaseMenu) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::ActionPhaseMenu' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, SettingsScreenToAdd) == 0x000008, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::SettingsScreenToAdd' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, SBZNavButtonParameters) == 0x000010, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::SBZNavButtonParameters' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, __WorldContext) == 0x000080, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, CallFunc_GetParent_ReturnValue) == 0x000088, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, CallFunc_Create_ReturnValue) == 0x000090, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, CallFunc_Array_Add_ReturnValue) == 0x000098, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, CallFunc_AddChild_ReturnValue) == 0x0000A0, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, CallFunc_GetParent_ReturnValue_1) == 0x0000A8, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::CallFunc_GetParent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, K2Node_DynamicCast_AsCanvas_Panel) == 0x0000B0, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::K2Node_DynamicCast_AsCanvas_Panel' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, CallFunc_AddChildToCanvas_ReturnValue) == 0x0000C0, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, K2Node_MakeStruct_Margin) == 0x0000C8, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu, K2Node_MakeStruct_Anchors) == 0x0000D8, "Member 'BP_RinoHud_SaveManager_Utils_C_AddSettingsMenu::K2Node_MakeStruct_Anchors' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C._ReAddWidget
// 0x00A8 (0x00A8 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C__ReAddWidget final
{
public:
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_Size_to_Content;                              // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnchorData                            Temp_Layout_Data;                                  // 0x001C(0x0028)(Edit, BlueprintVisible, NoDestructor)
	struct FVector2D                              Temp_Size;                                         // 0x0044(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_Position;                                     // 0x004C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchorData                            CallFunc_GetLayout_ReturnValue;                    // 0x0070(0x0028)(NoDestructor)
	bool                                          CallFunc_GetAutoSize_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C__ReAddWidget");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget) == 0x0000A8, "Wrong size on BP_RinoHud_SaveManager_Utils_C__ReAddWidget");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, CanvasPanel) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::CanvasPanel' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, Widget) == 0x000008, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::Widget' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, __WorldContext) == 0x000010, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, Temp_Size_to_Content) == 0x000018, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::Temp_Size_to_Content' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, Temp_Layout_Data) == 0x00001C, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::Temp_Layout_Data' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, Temp_Size) == 0x000044, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::Temp_Size' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, Temp_Position) == 0x00004C, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::Temp_Position' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, CallFunc_AddChildToCanvas_ReturnValue) == 0x000058, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000060, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, CallFunc_GetSize_ReturnValue) == 0x000068, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, CallFunc_GetLayout_ReturnValue) == 0x000070, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::CallFunc_GetLayout_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, CallFunc_GetAutoSize_ReturnValue) == 0x000098, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::CallFunc_GetAutoSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C__ReAddWidget, CallFunc_GetPosition_ReturnValue) == 0x00009C, "Member 'BP_RinoHud_SaveManager_Utils_C__ReAddWidget::CallFunc_GetPosition_ReturnValue' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.SetSettingsItemBool
// 0x0028 (0x0028 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool final
{
public:
	class FName                                   Property;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RinoHud_Savegame_C*                 CallFunc_LoadConfig_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool) == 0x000028, "Wrong size on BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool, Property) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool::Property' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool, Value) == 0x00000C, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool::Value' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool, __WorldContext) == 0x000010, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool, CallFunc_LoadConfig_ReturnValue) == 0x000020, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemBool::CallFunc_LoadConfig_ReturnValue' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.GetSettingsItemBool
// 0x0030 (0x0030 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool final
{
public:
	class FName                                   Property;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Value;                                             // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          temp;                                              // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RinoHud_Savegame_C*                 CallFunc_LoadConfig_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool) == 0x000030, "Wrong size on BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool, Property) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool::Property' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool, __WorldContext) == 0x000010, "Member 'BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool, Value) == 0x000018, "Member 'BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool::Value' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool, temp) == 0x000019, "Member 'BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool::temp' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool, CallFunc_LoadConfig_ReturnValue) == 0x000020, "Member 'BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool::CallFunc_LoadConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool, K2Node_SwitchName_CmpSuccess) == 0x000028, "Member 'BP_RinoHud_SaveManager_Utils_C_GetSettingsItemBool::K2Node_SwitchName_CmpSuccess' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.SetSettingsItemFloat
// 0x0030 (0x0030 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat final
{
public:
	class FName                                   Property;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RinoHud_Savegame_C*                 CallFunc_LoadConfig_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat) == 0x000030, "Wrong size on BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat, Property) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat::Property' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat, Value) == 0x00000C, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat::Value' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat, __WorldContext) == 0x000010, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat, K2Node_SwitchName_CmpSuccess) == 0x000018, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat, CallFunc_LoadConfig_ReturnValue) == 0x000020, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat::CallFunc_LoadConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat, CallFunc_Round_ReturnValue) == 0x000028, "Member 'BP_RinoHud_SaveManager_Utils_C_SetSettingsItemFloat::CallFunc_Round_ReturnValue' has a wrong offset!");

// Function BP_RinoHud_SaveManager_Utils.BP_RinoHud_SaveManager_Utils_C.GetSettingsItemFloat
// 0x0038 (0x0038 - 0x0000)
struct BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat final
{
public:
	class FName                                   Property;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         temp;                                              // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_RinoHud_Savegame_C*                 CallFunc_LoadConfig_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat) == 0x000008, "Wrong alignment on BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat");
static_assert(sizeof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat) == 0x000038, "Wrong size on BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat, Property) == 0x000000, "Member 'BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat::Property' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat, __WorldContext) == 0x000010, "Member 'BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat, Value) == 0x000018, "Member 'BP_RinoHud_SaveManager_Utils_C_GetSettingsItemFloat::Value' has a wrong offset!");
