#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedBinaryActor_DJKeyboard

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_ReplicatedBinaryActor_DJKeyboard.BP_ReplicatedBinaryActor_DJKeyboard_C.ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard
// 0x0050 (0x0050 - 0x0000)
struct BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard) == 0x000008, "Wrong alignment on BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard");
static_assert(sizeof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard) == 0x000050, "Wrong size on BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard, EntryPoint) == 0x000000, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard, Temp_struct_Variable) == 0x000008, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard, Temp_delegate_Variable) == 0x000018, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard, CallFunc_PostEvent_ReturnValue) == 0x00002C, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard, K2Node_Event_bStateToChangeTo) == 0x000030, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard, K2Node_Event_bDoCosmetics) == 0x000031, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard, K2Node_ComponentBoundEvent_Interactable) == 0x000038, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard, K2Node_ComponentBoundEvent_Interactor) == 0x000040, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000048, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_DJKeyboard::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_ReplicatedBinaryActor_DJKeyboard.BP_ReplicatedBinaryActor_DJKeyboard_C.BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, Interactable) == 0x000000, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_ReplicatedBinaryActor_DJKeyboard.BP_ReplicatedBinaryActor_DJKeyboard_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_ReplicatedBinaryActor_DJKeyboard_C_OnStateChanged final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ReplicatedBinaryActor_DJKeyboard_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_ReplicatedBinaryActor_DJKeyboard_C_OnStateChanged");
static_assert(sizeof(BP_ReplicatedBinaryActor_DJKeyboard_C_OnStateChanged) == 0x000002, "Wrong size on BP_ReplicatedBinaryActor_DJKeyboard_C_OnStateChanged");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_OnStateChanged, bStateToChangeTo) == 0x000000, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_OnStateChanged::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_OnStateChanged, bDoCosmetics) == 0x000001, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

// Function BP_ReplicatedBinaryActor_DJKeyboard.BP_ReplicatedBinaryActor_DJKeyboard_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_ReplicatedBinaryActor_DJKeyboard_C_UserConstructionScript final
{
public:
	struct FVector4                               K2Node_MakeStruct_Vector4;                         // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplicatedBinaryActor_DJKeyboard_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_ReplicatedBinaryActor_DJKeyboard_C_UserConstructionScript");
static_assert(sizeof(BP_ReplicatedBinaryActor_DJKeyboard_C_UserConstructionScript) == 0x000010, "Wrong size on BP_ReplicatedBinaryActor_DJKeyboard_C_UserConstructionScript");
static_assert(offsetof(BP_ReplicatedBinaryActor_DJKeyboard_C_UserConstructionScript, K2Node_MakeStruct_Vector4) == 0x000000, "Member 'BP_ReplicatedBinaryActor_DJKeyboard_C_UserConstructionScript::K2Node_MakeStruct_Vector4' has a wrong offset!");

}

