#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedBinaryActor_DJSpeakers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplicatedBinaryActor_DJSpeakers.BP_ReplicatedBinaryActor_DJSpeakers_C
// 0x0030 (0x02F8 - 0x02C8)
class ABP_ReplicatedBinaryActor_DJSpeakers_C final : public ASBZStaticInteractionBinaryState
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   OutlineMesh;                                       // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Collision;                                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplicatedBinaryActor_DJSpeakers(int32 EntryPoint);
	void BndEvt__BP_ReplicatedBinaryActor_DJSpeakers_InteractableComponent_K2Node_ComponentBoundEvent_0_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void BP_OnStateChanged(bool bNewState, bool bDoCosmentics);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplicatedBinaryActor_DJSpeakers_C">();
	}
	static class ABP_ReplicatedBinaryActor_DJSpeakers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplicatedBinaryActor_DJSpeakers_C>();
	}
};
static_assert(alignof(ABP_ReplicatedBinaryActor_DJSpeakers_C) == 0x000008, "Wrong alignment on ABP_ReplicatedBinaryActor_DJSpeakers_C");
static_assert(sizeof(ABP_ReplicatedBinaryActor_DJSpeakers_C) == 0x0002F8, "Wrong size on ABP_ReplicatedBinaryActor_DJSpeakers_C");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJSpeakers_C, UberGraphFrame) == 0x0002C8, "Member 'ABP_ReplicatedBinaryActor_DJSpeakers_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJSpeakers_C, SBZOutline) == 0x0002D0, "Member 'ABP_ReplicatedBinaryActor_DJSpeakers_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJSpeakers_C, OutlineMesh) == 0x0002D8, "Member 'ABP_ReplicatedBinaryActor_DJSpeakers_C::OutlineMesh' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJSpeakers_C, Collision) == 0x0002E0, "Member 'ABP_ReplicatedBinaryActor_DJSpeakers_C::Collision' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJSpeakers_C, StaticMesh) == 0x0002E8, "Member 'ABP_ReplicatedBinaryActor_DJSpeakers_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_DJSpeakers_C, DefaultSceneRoot) == 0x0002F0, "Member 'ABP_ReplicatedBinaryActor_DJSpeakers_C::DefaultSceneRoot' has a wrong offset!");

}

