#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedBinaryActor_LurePhone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplicatedBinaryActor_LurePhone.BP_ReplicatedBinaryActor_LurePhone_C
// 0x0040 (0x0318 - 0x02D8)
class ABP_ReplicatedBinaryActor_LurePhone_C final : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable;                                   // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              PhoneUsed;                                         // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          PhoneUsed1stTime;                                  // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_ReplicatedBinaryActor_LurePhone(int32 EntryPoint);
	void OnStateChanged(bool bStateToChangeTo, bool bDoCosmetics);
	void BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplicatedBinaryActor_LurePhone_C">();
	}
	static class ABP_ReplicatedBinaryActor_LurePhone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplicatedBinaryActor_LurePhone_C>();
	}
};
static_assert(alignof(ABP_ReplicatedBinaryActor_LurePhone_C) == 0x000008, "Wrong alignment on ABP_ReplicatedBinaryActor_LurePhone_C");
static_assert(sizeof(ABP_ReplicatedBinaryActor_LurePhone_C) == 0x000318, "Wrong size on ABP_ReplicatedBinaryActor_LurePhone_C");
static_assert(offsetof(ABP_ReplicatedBinaryActor_LurePhone_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_ReplicatedBinaryActor_LurePhone_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_LurePhone_C, SBZOutline) == 0x0002E0, "Member 'ABP_ReplicatedBinaryActor_LurePhone_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_LurePhone_C, SBZInteractable) == 0x0002E8, "Member 'ABP_ReplicatedBinaryActor_LurePhone_C::SBZInteractable' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_LurePhone_C, StaticMesh) == 0x0002F0, "Member 'ABP_ReplicatedBinaryActor_LurePhone_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_LurePhone_C, DefaultSceneRoot) == 0x0002F8, "Member 'ABP_ReplicatedBinaryActor_LurePhone_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_LurePhone_C, PhoneUsed) == 0x000300, "Member 'ABP_ReplicatedBinaryActor_LurePhone_C::PhoneUsed' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_LurePhone_C, PhoneUsed1stTime) == 0x000310, "Member 'ABP_ReplicatedBinaryActor_LurePhone_C::PhoneUsed1stTime' has a wrong offset!");

}

