#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedBinaryActor_VIPPrinter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplicatedBinaryActor_VIPPrinter.BP_ReplicatedBinaryActor_VIPPrinter_C
// 0x0098 (0x0370 - 0x02D8)
class ABP_ReplicatedBinaryActor_VIPPrinter_C final : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Blank;                                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable;                                   // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              TemplateInside;                                    // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              PrintFakeInvitation;                               // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          Interacted_1stTime;                                // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Spawn_Transform;                                   // 0x0330(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABP_VIPInvitation_Fake_C*               PrintedInvitation;                                 // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplicatedBinaryActor_VIPPrinter(int32 EntryPoint);
	void BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void OnStateChanged(bool bStateToChangeTo, bool bDoCosmetics);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplicatedBinaryActor_VIPPrinter_C">();
	}
	static class ABP_ReplicatedBinaryActor_VIPPrinter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplicatedBinaryActor_VIPPrinter_C>();
	}
};
static_assert(alignof(ABP_ReplicatedBinaryActor_VIPPrinter_C) == 0x000010, "Wrong alignment on ABP_ReplicatedBinaryActor_VIPPrinter_C");
static_assert(sizeof(ABP_ReplicatedBinaryActor_VIPPrinter_C) == 0x000370, "Wrong size on ABP_ReplicatedBinaryActor_VIPPrinter_C");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, Blank) == 0x0002E0, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::Blank' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, SBZOutline) == 0x0002E8, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, SBZInteractable) == 0x0002F0, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::SBZInteractable' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, StaticMesh) == 0x0002F8, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, DefaultSceneRoot) == 0x000300, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, TemplateInside) == 0x000308, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::TemplateInside' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, PrintFakeInvitation) == 0x000318, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::PrintFakeInvitation' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, Interacted_1stTime) == 0x000328, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::Interacted_1stTime' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, Spawn_Transform) == 0x000330, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::Spawn_Transform' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_VIPPrinter_C, PrintedInvitation) == 0x000360, "Member 'ABP_ReplicatedBinaryActor_VIPPrinter_C::PrintedInvitation' has a wrong offset!");

}

