#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedCollision

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ReplicatedCollision.BP_ReplicatedCollision_C.ExecuteUbergraph_BP_ReplicatedCollision
// 0x0138 (0x0138 - 0x0000)
struct BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0004(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics_1;                       // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x00A4(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bActorsInCloset;                      // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision) == 0x000004, "Wrong alignment on BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision");
static_assert(sizeof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision) == 0x000138, "Wrong size on BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision");
static_assert(offsetof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision, EntryPoint) == 0x000000, "Member 'BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000004, "Member 'BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision, CallFunc_MakeVector_ReturnValue) == 0x000094, "Member 'BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision, K2Node_Event_bStateToChangeTo) == 0x0000A0, "Member 'BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision, K2Node_Event_bDoCosmetics_1) == 0x0000A1, "Member 'BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision::K2Node_Event_bDoCosmetics_1' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0000A4, "Member 'BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision, K2Node_Event_bActorsInCloset) == 0x000134, "Member 'BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision::K2Node_Event_bActorsInCloset' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision, K2Node_Event_bDoCosmetics) == 0x000135, "Member 'BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision, CallFunc_Not_PreBool_ReturnValue) == 0x000136, "Member 'BP_ReplicatedCollision_C_ExecuteUbergraph_BP_ReplicatedCollision::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function BP_ReplicatedCollision.BP_ReplicatedCollision_C.ReactToCloset
// 0x0002 (0x0002 - 0x0000)
struct BP_ReplicatedCollision_C_ReactToCloset final
{
public:
	bool                                          bActorsInCloset;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ReplicatedCollision_C_ReactToCloset) == 0x000001, "Wrong alignment on BP_ReplicatedCollision_C_ReactToCloset");
static_assert(sizeof(BP_ReplicatedCollision_C_ReactToCloset) == 0x000002, "Wrong size on BP_ReplicatedCollision_C_ReactToCloset");
static_assert(offsetof(BP_ReplicatedCollision_C_ReactToCloset, bActorsInCloset) == 0x000000, "Member 'BP_ReplicatedCollision_C_ReactToCloset::bActorsInCloset' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_ReactToCloset, bDoCosmetics) == 0x000001, "Member 'BP_ReplicatedCollision_C_ReactToCloset::bDoCosmetics' has a wrong offset!");

// Function BP_ReplicatedCollision.BP_ReplicatedCollision_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_ReplicatedCollision_C_OnStateChanged final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ReplicatedCollision_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_ReplicatedCollision_C_OnStateChanged");
static_assert(sizeof(BP_ReplicatedCollision_C_OnStateChanged) == 0x000002, "Wrong size on BP_ReplicatedCollision_C_OnStateChanged");
static_assert(offsetof(BP_ReplicatedCollision_C_OnStateChanged, bStateToChangeTo) == 0x000000, "Member 'BP_ReplicatedCollision_C_OnStateChanged::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedCollision_C_OnStateChanged, bDoCosmetics) == 0x000001, "Member 'BP_ReplicatedCollision_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

}

