#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedBinaryActor_HelicopterCage_1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Enum_HelicopterCageStates_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplicatedBinaryActor_HelicopterCage_1.BP_ReplicatedBinaryActor_HelicopterCage_1_C
// 0x0108 (0x03F8 - 0x02F0)
class ABP_ReplicatedBinaryActor_HelicopterCage_1_C final : public ASBZReplicatedIntStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   BagLocation18;                                     // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation17;                                     // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation16;                                     // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation15;                                     // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation14;                                     // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation13;                                     // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation12;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation11;                                     // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation06;                                     // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation10;                                     // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation09;                                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation08;                                     // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation07;                                     // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation05;                                     // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation04;                                     // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation03;                                     // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation02;                                     // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BagLocation01;                                     // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZSecuredBagVisualizeComponent*       SBZSecuredBagVisualize;                            // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Walls;                                             // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Frame;                                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNavModifierComponent*                  NavModifier;                                       // 0x03A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              CageAssembled1;                                    // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              CageAssembled2;                                    // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              CageAssembled3;                                    // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              CageComplete;                                      // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_ReplicatedBinaryActor_HelicopterCage_1(int32 EntryPoint);
	void OnStateChanged(int32 OldState, int32 NewState, bool bDoCosmetics);
	void SetStateFunction(Enum_HelicopterCageStates State_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplicatedBinaryActor_HelicopterCage_1_C">();
	}
	static class ABP_ReplicatedBinaryActor_HelicopterCage_1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplicatedBinaryActor_HelicopterCage_1_C>();
	}
};
static_assert(alignof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C) == 0x000008, "Wrong alignment on ABP_ReplicatedBinaryActor_HelicopterCage_1_C");
static_assert(sizeof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C) == 0x0003F8, "Wrong size on ABP_ReplicatedBinaryActor_HelicopterCage_1_C");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, UberGraphFrame) == 0x0002F0, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation18) == 0x0002F8, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation18' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation17) == 0x000300, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation17' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation16) == 0x000308, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation16' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation15) == 0x000310, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation15' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation14) == 0x000318, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation14' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation13) == 0x000320, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation13' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation12) == 0x000328, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation12' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation11) == 0x000330, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation11' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation06) == 0x000338, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation06' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation10) == 0x000340, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation10' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation09) == 0x000348, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation09' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation08) == 0x000350, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation08' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation07) == 0x000358, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation07' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation05) == 0x000360, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation05' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation04) == 0x000368, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation04' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation03) == 0x000370, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation03' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation02) == 0x000378, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation02' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, BagLocation01) == 0x000380, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::BagLocation01' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, SBZSecuredBagVisualize) == 0x000388, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::SBZSecuredBagVisualize' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, Walls) == 0x000390, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::Walls' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, Frame) == 0x000398, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::Frame' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, NavModifier) == 0x0003A0, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::NavModifier' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, Mesh) == 0x0003A8, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, DefaultSceneRoot) == 0x0003B0, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, CageAssembled1) == 0x0003B8, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::CageAssembled1' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, CageAssembled2) == 0x0003C8, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::CageAssembled2' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, CageAssembled3) == 0x0003D8, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::CageAssembled3' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_HelicopterCage_1_C, CageComplete) == 0x0003E8, "Member 'ABP_ReplicatedBinaryActor_HelicopterCage_1_C::CageComplete' has a wrong offset!");

}

