#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedBinaryActor_Skylight

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ReplicatedBinaryActor_Skylight.BP_ReplicatedBinaryActor_Skylight_C.ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight
// 0x0098 (0x0098 - 0x0000)
struct BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UActorComponent*                        K2Node_ComponentBoundEvent_PoolComponent;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_Hits;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bDoCosmetics;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  K2Node_ComponentBoundEvent_DamageContext;          // 0x0018(0x0018)(ConstParm, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0034(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue;              // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0068(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCenterOfMass_ReturnValue_1;            // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue_1;      // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight) == 0x000008, "Wrong alignment on BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight");
static_assert(sizeof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight) == 0x000098, "Wrong size on BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, EntryPoint) == 0x000000, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, K2Node_ComponentBoundEvent_PoolComponent) == 0x000008, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::K2Node_ComponentBoundEvent_PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, K2Node_ComponentBoundEvent_Hits) == 0x000010, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::K2Node_ComponentBoundEvent_Hits' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, K2Node_ComponentBoundEvent_bDoCosmetics) == 0x000014, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::K2Node_ComponentBoundEvent_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, K2Node_ComponentBoundEvent_DamageContext) == 0x000018, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::K2Node_ComponentBoundEvent_DamageContext' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, K2Node_SwitchInteger_CmpSuccess) == 0x000030, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, Temp_delegate_Variable) == 0x000034, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, CallFunc_GetCenterOfMass_ReturnValue) == 0x000048, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::CallFunc_GetCenterOfMass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000058, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, K2Node_Event_bStateToChangeTo) == 0x000060, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, K2Node_Event_bDoCosmetics) == 0x000061, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, Temp_struct_Variable) == 0x000068, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, CallFunc_PostEvent_ReturnValue) == 0x000078, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, CallFunc_GetCenterOfMass_ReturnValue_1) == 0x00007C, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::CallFunc_GetCenterOfMass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, CallFunc_SpawnSystemAtLocation_ReturnValue_1) == 0x000088, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::CallFunc_SpawnSystemAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000090, "Member 'BP_ReplicatedBinaryActor_Skylight_C_ExecuteUbergraph_BP_ReplicatedBinaryActor_Skylight::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");

// Function BP_ReplicatedBinaryActor_Skylight.BP_ReplicatedBinaryActor_Skylight_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_ReplicatedBinaryActor_Skylight_C_OnStateChanged final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ReplicatedBinaryActor_Skylight_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_ReplicatedBinaryActor_Skylight_C_OnStateChanged");
static_assert(sizeof(BP_ReplicatedBinaryActor_Skylight_C_OnStateChanged) == 0x000002, "Wrong size on BP_ReplicatedBinaryActor_Skylight_C_OnStateChanged");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_OnStateChanged, bStateToChangeTo) == 0x000000, "Member 'BP_ReplicatedBinaryActor_Skylight_C_OnStateChanged::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_OnStateChanged, bDoCosmetics) == 0x000001, "Member 'BP_ReplicatedBinaryActor_Skylight_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

// Function BP_ReplicatedBinaryActor_Skylight.BP_ReplicatedBinaryActor_Skylight_C.BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature final
{
public:
	class UActorComponent*                        PoolComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Hits;                                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoCosmetics;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  DamageContext;                                     // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature");
static_assert(sizeof(BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature) == 0x000028, "Wrong size on BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature, PoolComponent) == 0x000000, "Member 'BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature::PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature, Hits) == 0x000008, "Member 'BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature::Hits' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature, bDoCosmetics) == 0x00000C, "Member 'BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature::bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature, DamageContext) == 0x000010, "Member 'BP_ReplicatedBinaryActor_Skylight_C_BndEvt__BP_ReplicatedBinaryActor_Ventilation_SBZPropDamage_K2Node_ComponentBoundEvent_1_SBZPropDamageHitsSignature__DelegateSignature::DamageContext' has a wrong offset!");

}

