#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ReplicatedBinaryActor_AccountantVisitCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ReplicatedBinaryActor_AccountantVisitCard.BP_ReplicatedBinaryActor_AccountantVisitCard_C
// 0x0048 (0x0320 - 0x02D8)
class ABP_ReplicatedBinaryActor_AccountantVisitCard_C final : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable;                                   // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              VisitCardPickedUp;                                 // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         MarkerID;                                          // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ReplicatedBinaryActor_AccountantVisitCard(int32 EntryPoint);
	void OnStateChanged(bool bStateToChangeTo, bool bDoCosmetics);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ReplicatedBinaryActor_AccountantVisitCard_C">();
	}
	static class ABP_ReplicatedBinaryActor_AccountantVisitCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ReplicatedBinaryActor_AccountantVisitCard_C>();
	}
};
static_assert(alignof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C) == 0x000008, "Wrong alignment on ABP_ReplicatedBinaryActor_AccountantVisitCard_C");
static_assert(sizeof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C) == 0x000320, "Wrong size on ABP_ReplicatedBinaryActor_AccountantVisitCard_C");
static_assert(offsetof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_ReplicatedBinaryActor_AccountantVisitCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C, Box) == 0x0002E0, "Member 'ABP_ReplicatedBinaryActor_AccountantVisitCard_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C, SBZOutline) == 0x0002E8, "Member 'ABP_ReplicatedBinaryActor_AccountantVisitCard_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C, SBZInteractable) == 0x0002F0, "Member 'ABP_ReplicatedBinaryActor_AccountantVisitCard_C::SBZInteractable' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C, StaticMesh) == 0x0002F8, "Member 'ABP_ReplicatedBinaryActor_AccountantVisitCard_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C, DefaultSceneRoot) == 0x000300, "Member 'ABP_ReplicatedBinaryActor_AccountantVisitCard_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C, VisitCardPickedUp) == 0x000308, "Member 'ABP_ReplicatedBinaryActor_AccountantVisitCard_C::VisitCardPickedUp' has a wrong offset!");
static_assert(offsetof(ABP_ReplicatedBinaryActor_AccountantVisitCard_C, MarkerID) == 0x000318, "Member 'ABP_ReplicatedBinaryActor_AccountantVisitCard_C::MarkerID' has a wrong offset!");

}

