#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RoomSpawnController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_RoomSpawnController.BP_RoomSpawnController_C
// 0x0068 (0x0310 - 0x02A8)
class ABP_RoomSpawnController_C final : public ASBZStaticReplicatedActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         PossibleSpawnLocations;                            // 0x02B8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                         PaperLocations;                                    // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         ChooseLocation;                                    // 0x02D8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ChooseTypeLocation;                                // 0x02DC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         SafeLocation;                                      // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class AActor*>                         CabinetLocation;                                   // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMulticastInlineDelegate<void()>              DispatchRedCardPickup;                             // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_RoomSpawnController(int32 EntryPoint);
	void OnCardPickupEvent(class ASBZInteractionActor* Interactable, class USBZInteractorComponent* Interactor);
	void BindRedCardEvent(class ABP_RedKeycard_C* CardRef);
	void SpawnRedCardInRoom();
	void UserConstructionScript();
	void NewFunction_0(TArray<class AActor*>& Array, class UClass* WhatShould_Spawn);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_RoomSpawnController_C">();
	}
	static class ABP_RoomSpawnController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_RoomSpawnController_C>();
	}
};
static_assert(alignof(ABP_RoomSpawnController_C) == 0x000008, "Wrong alignment on ABP_RoomSpawnController_C");
static_assert(sizeof(ABP_RoomSpawnController_C) == 0x000310, "Wrong size on ABP_RoomSpawnController_C");
static_assert(offsetof(ABP_RoomSpawnController_C, UberGraphFrame) == 0x0002A8, "Member 'ABP_RoomSpawnController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_RoomSpawnController_C, DefaultSceneRoot) == 0x0002B0, "Member 'ABP_RoomSpawnController_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_RoomSpawnController_C, PossibleSpawnLocations) == 0x0002B8, "Member 'ABP_RoomSpawnController_C::PossibleSpawnLocations' has a wrong offset!");
static_assert(offsetof(ABP_RoomSpawnController_C, PaperLocations) == 0x0002C8, "Member 'ABP_RoomSpawnController_C::PaperLocations' has a wrong offset!");
static_assert(offsetof(ABP_RoomSpawnController_C, ChooseLocation) == 0x0002D8, "Member 'ABP_RoomSpawnController_C::ChooseLocation' has a wrong offset!");
static_assert(offsetof(ABP_RoomSpawnController_C, ChooseTypeLocation) == 0x0002DC, "Member 'ABP_RoomSpawnController_C::ChooseTypeLocation' has a wrong offset!");
static_assert(offsetof(ABP_RoomSpawnController_C, SafeLocation) == 0x0002E0, "Member 'ABP_RoomSpawnController_C::SafeLocation' has a wrong offset!");
static_assert(offsetof(ABP_RoomSpawnController_C, CabinetLocation) == 0x0002F0, "Member 'ABP_RoomSpawnController_C::CabinetLocation' has a wrong offset!");
static_assert(offsetof(ABP_RoomSpawnController_C, DispatchRedCardPickup) == 0x000300, "Member 'ABP_RoomSpawnController_C::DispatchRedCardPickup' has a wrong offset!");

}

