#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Sedan_FirstResponders_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_WheeledVehicle_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Sedan_FirstResponders_Base.BP_Sedan_FirstResponders_Base_C
// 0x0070 (0x0780 - 0x0710)
class ABP_Sedan_FirstResponders_Base_C final : public ABP_WheeledVehicle_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0708(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZVehicleSpawnComponent*              SBZVehicleSpawn;                                   // 0x0710(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Spawner_R;                                         // 0x0718(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Spawner_L;                                         // 0x0720(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CoverPointRF;                                      // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CoverPointRB;                                      // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CoverPointLF;                                      // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CoverPointLB;                                      // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CoverPointBR;                                      // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CoverPointBL;                                      // 0x0750(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CoverPointFR;                                      // 0x0758(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   CoverPointFL;                                      // 0x0760(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          SpawnedPawns;                                      // 0x0768(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_Sedan_FirstResponders_Base(int32 EntryPoint);
	void ReceiveBeginPlay();
	void CustomEvent_2(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void CustomEvent_1(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Sedan_FirstResponders_Base_C">();
	}
	static class ABP_Sedan_FirstResponders_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Sedan_FirstResponders_Base_C>();
	}
};
static_assert(alignof(ABP_Sedan_FirstResponders_Base_C) == 0x000010, "Wrong alignment on ABP_Sedan_FirstResponders_Base_C");
static_assert(sizeof(ABP_Sedan_FirstResponders_Base_C) == 0x000780, "Wrong size on ABP_Sedan_FirstResponders_Base_C");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, UberGraphFrame) == 0x000708, "Member 'ABP_Sedan_FirstResponders_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, SBZVehicleSpawn) == 0x000710, "Member 'ABP_Sedan_FirstResponders_Base_C::SBZVehicleSpawn' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, Spawner_R) == 0x000718, "Member 'ABP_Sedan_FirstResponders_Base_C::Spawner_R' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, Spawner_L) == 0x000720, "Member 'ABP_Sedan_FirstResponders_Base_C::Spawner_L' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, CoverPointRF) == 0x000728, "Member 'ABP_Sedan_FirstResponders_Base_C::CoverPointRF' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, CoverPointRB) == 0x000730, "Member 'ABP_Sedan_FirstResponders_Base_C::CoverPointRB' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, CoverPointLF) == 0x000738, "Member 'ABP_Sedan_FirstResponders_Base_C::CoverPointLF' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, CoverPointLB) == 0x000740, "Member 'ABP_Sedan_FirstResponders_Base_C::CoverPointLB' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, CoverPointBR) == 0x000748, "Member 'ABP_Sedan_FirstResponders_Base_C::CoverPointBR' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, CoverPointBL) == 0x000750, "Member 'ABP_Sedan_FirstResponders_Base_C::CoverPointBL' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, CoverPointFR) == 0x000758, "Member 'ABP_Sedan_FirstResponders_Base_C::CoverPointFR' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, CoverPointFL) == 0x000760, "Member 'ABP_Sedan_FirstResponders_Base_C::CoverPointFL' has a wrong offset!");
static_assert(offsetof(ABP_Sedan_FirstResponders_Base_C, SpawnedPawns) == 0x000768, "Member 'ABP_Sedan_FirstResponders_Base_C::SpawnedPawns' has a wrong offset!");

}

