#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spikes_Pickup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Spikes_Pickup.BP_Spikes_Pickup_C
// 0x0048 (0x0320 - 0x02D8)
class ABP_Spikes_Pickup_C final : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZAIObjectiveComponent*               SBZAIObjective;                                    // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable;                                   // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Actor_Destroyed;                                   // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_Spikes_Pickup(int32 EntryPoint);
	void BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Spikes_Pickup_C">();
	}
	static class ABP_Spikes_Pickup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Spikes_Pickup_C>();
	}
};
static_assert(alignof(ABP_Spikes_Pickup_C) == 0x000008, "Wrong alignment on ABP_Spikes_Pickup_C");
static_assert(sizeof(ABP_Spikes_Pickup_C) == 0x000320, "Wrong size on ABP_Spikes_Pickup_C");
static_assert(offsetof(ABP_Spikes_Pickup_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_Spikes_Pickup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Spikes_Pickup_C, SBZAIObjective) == 0x0002E0, "Member 'ABP_Spikes_Pickup_C::SBZAIObjective' has a wrong offset!");
static_assert(offsetof(ABP_Spikes_Pickup_C, Box) == 0x0002E8, "Member 'ABP_Spikes_Pickup_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Spikes_Pickup_C, SBZOutline) == 0x0002F0, "Member 'ABP_Spikes_Pickup_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_Spikes_Pickup_C, SBZInteractable) == 0x0002F8, "Member 'ABP_Spikes_Pickup_C::SBZInteractable' has a wrong offset!");
static_assert(offsetof(ABP_Spikes_Pickup_C, StaticMesh) == 0x000300, "Member 'ABP_Spikes_Pickup_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_Spikes_Pickup_C, DefaultSceneRoot) == 0x000308, "Member 'ABP_Spikes_Pickup_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Spikes_Pickup_C, Actor_Destroyed) == 0x000310, "Member 'ABP_Spikes_Pickup_C::Actor_Destroyed' has a wrong offset!");

}

