#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: bp_screen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function bp_screen.bp_screen_C.ExecuteUbergraph_bp_screen
// 0x0040 (0x0040 - 0x0000)
struct bp_screen_C_ExecuteUbergraph_bp_screen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x0008(0x0030)(ConstParm, NoDestructor)
	float                                         CallFunc_GetRealTimeSeconds_ReturnValue;           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(bp_screen_C_ExecuteUbergraph_bp_screen) == 0x000004, "Wrong alignment on bp_screen_C_ExecuteUbergraph_bp_screen");
static_assert(sizeof(bp_screen_C_ExecuteUbergraph_bp_screen) == 0x000040, "Wrong size on bp_screen_C_ExecuteUbergraph_bp_screen");
static_assert(offsetof(bp_screen_C_ExecuteUbergraph_bp_screen, EntryPoint) == 0x000000, "Member 'bp_screen_C_ExecuteUbergraph_bp_screen::EntryPoint' has a wrong offset!");
static_assert(offsetof(bp_screen_C_ExecuteUbergraph_bp_screen, CallFunc_Play_ReturnValue) == 0x000004, "Member 'bp_screen_C_ExecuteUbergraph_bp_screen::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_screen_C_ExecuteUbergraph_bp_screen, K2Node_ComponentBoundEvent_Type) == 0x000005, "Member 'bp_screen_C_ExecuteUbergraph_bp_screen::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(bp_screen_C_ExecuteUbergraph_bp_screen, K2Node_ComponentBoundEvent_HitContext) == 0x000008, "Member 'bp_screen_C_ExecuteUbergraph_bp_screen::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");
static_assert(offsetof(bp_screen_C_ExecuteUbergraph_bp_screen, CallFunc_GetRealTimeSeconds_ReturnValue) == 0x000038, "Member 'bp_screen_C_ExecuteUbergraph_bp_screen::CallFunc_GetRealTimeSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_screen_C_ExecuteUbergraph_bp_screen, K2Node_SwitchInteger_CmpSuccess) == 0x00003C, "Member 'bp_screen_C_ExecuteUbergraph_bp_screen::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");

// Function bp_screen.bp_screen_C.BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct bp_screen_C_BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(bp_screen_C_BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on bp_screen_C_BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(bp_screen_C_BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on bp_screen_C_BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(bp_screen_C_BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'bp_screen_C_BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(bp_screen_C_BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'bp_screen_C_BndEvt__bp_screen_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

// Function bp_screen.bp_screen_C.UserConstructionScript
// 0x002C (0x002C - 0x0000)
struct bp_screen_C_UserConstructionScript final
{
public:
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0000(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_2;           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_3;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(bp_screen_C_UserConstructionScript) == 0x000004, "Wrong alignment on bp_screen_C_UserConstructionScript");
static_assert(sizeof(bp_screen_C_UserConstructionScript) == 0x00002C, "Wrong size on bp_screen_C_UserConstructionScript");
static_assert(offsetof(bp_screen_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000000, "Member 'bp_screen_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_screen_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x00000C, "Member 'bp_screen_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_screen_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000010, "Member 'bp_screen_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_screen_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue_2) == 0x000014, "Member 'bp_screen_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_screen_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000018, "Member 'bp_screen_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(bp_screen_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00001C, "Member 'bp_screen_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(bp_screen_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000020, "Member 'bp_screen_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(bp_screen_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue_3) == 0x000024, "Member 'bp_screen_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(bp_screen_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000028, "Member 'bp_screen_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");

}

