#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Tintable_Fixture

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Tintable_Fixture.BP_Tintable_Fixture_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_Tintable_Fixture_C_UserConstructionScript final
{
public:
	float                                         CallFunc_BreakColor_R;                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R_1;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G_1;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B_1;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A_1;                           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Tintable_Fixture_C_UserConstructionScript) == 0x000004, "Wrong alignment on BP_Tintable_Fixture_C_UserConstructionScript");
static_assert(sizeof(BP_Tintable_Fixture_C_UserConstructionScript) == 0x000020, "Wrong size on BP_Tintable_Fixture_C_UserConstructionScript");
static_assert(offsetof(BP_Tintable_Fixture_C_UserConstructionScript, CallFunc_BreakColor_R) == 0x000000, "Member 'BP_Tintable_Fixture_C_UserConstructionScript::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_Tintable_Fixture_C_UserConstructionScript, CallFunc_BreakColor_G) == 0x000004, "Member 'BP_Tintable_Fixture_C_UserConstructionScript::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_Tintable_Fixture_C_UserConstructionScript, CallFunc_BreakColor_B) == 0x000008, "Member 'BP_Tintable_Fixture_C_UserConstructionScript::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_Tintable_Fixture_C_UserConstructionScript, CallFunc_BreakColor_A) == 0x00000C, "Member 'BP_Tintable_Fixture_C_UserConstructionScript::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_Tintable_Fixture_C_UserConstructionScript, CallFunc_BreakColor_R_1) == 0x000010, "Member 'BP_Tintable_Fixture_C_UserConstructionScript::CallFunc_BreakColor_R_1' has a wrong offset!");
static_assert(offsetof(BP_Tintable_Fixture_C_UserConstructionScript, CallFunc_BreakColor_G_1) == 0x000014, "Member 'BP_Tintable_Fixture_C_UserConstructionScript::CallFunc_BreakColor_G_1' has a wrong offset!");
static_assert(offsetof(BP_Tintable_Fixture_C_UserConstructionScript, CallFunc_BreakColor_B_1) == 0x000018, "Member 'BP_Tintable_Fixture_C_UserConstructionScript::CallFunc_BreakColor_B_1' has a wrong offset!");
static_assert(offsetof(BP_Tintable_Fixture_C_UserConstructionScript, CallFunc_BreakColor_A_1) == 0x00001C, "Member 'BP_Tintable_Fixture_C_UserConstructionScript::CallFunc_BreakColor_A_1' has a wrong offset!");

}

