#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Van_FBI

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function BP_Van_FBI.BP_Van_FBI_C.ExecuteUbergraph_BP_Van_FBI
// 0x0038 (0x0038 - 0x0000)
struct BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_ComponentBoundEvent_PoolComponent;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_Health;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bDoCosmetics;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  K2Node_ComponentBoundEvent_DamageContext;          // 0x0018(0x0018)(ConstParm, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI) == 0x000008, "Wrong alignment on BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI");
static_assert(sizeof(BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI) == 0x000038, "Wrong size on BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI");
static_assert(offsetof(BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI, EntryPoint) == 0x000000, "Member 'BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI, K2Node_ComponentBoundEvent_PoolComponent) == 0x000008, "Member 'BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI::K2Node_ComponentBoundEvent_PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI, K2Node_ComponentBoundEvent_Health) == 0x000010, "Member 'BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI::K2Node_ComponentBoundEvent_Health' has a wrong offset!");
static_assert(offsetof(BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI, K2Node_ComponentBoundEvent_bDoCosmetics) == 0x000014, "Member 'BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI::K2Node_ComponentBoundEvent_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI, K2Node_ComponentBoundEvent_DamageContext) == 0x000018, "Member 'BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI::K2Node_ComponentBoundEvent_DamageContext' has a wrong offset!");
static_assert(offsetof(BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_Van_FBI_C_ExecuteUbergraph_BP_Van_FBI::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_Van_FBI.BP_Van_FBI_C.BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature
// 0x0028 (0x0028 - 0x0000)
struct BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature final
{
public:
	class UActorComponent*                        PoolComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Health;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDoCosmetics;                                      // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPropDamageContext                  DamageContext;                                     // 0x0010(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature");
static_assert(sizeof(BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature) == 0x000028, "Wrong size on BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature");
static_assert(offsetof(BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature, PoolComponent) == 0x000000, "Member 'BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature::PoolComponent' has a wrong offset!");
static_assert(offsetof(BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature, Health) == 0x000008, "Member 'BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature::Health' has a wrong offset!");
static_assert(offsetof(BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature, bDoCosmetics) == 0x00000C, "Member 'BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature::bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature, DamageContext) == 0x000010, "Member 'BP_Van_FBI_C_BndEvt__BP_Van_FBI_PropDamageComponent_K2Node_ComponentBoundEvent_0_SBZPropDamageHealthSignature__DelegateSignature::DamageContext' has a wrong offset!");

}

