#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VaultCodeHint

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VaultCodeHint.BP_VaultCodeHint_C
// 0x0018 (0x02C0 - 0x02A8)
class ABP_VaultCodeHint_C final : public AActor
{
public:
	class UStaticMeshComponent*                   StaticMesh_1;                                      // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_VaultCodeHint_C">();
	}
	static class ABP_VaultCodeHint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VaultCodeHint_C>();
	}
};
static_assert(alignof(ABP_VaultCodeHint_C) == 0x000008, "Wrong alignment on ABP_VaultCodeHint_C");
static_assert(sizeof(ABP_VaultCodeHint_C) == 0x0002C0, "Wrong size on ABP_VaultCodeHint_C");
static_assert(offsetof(ABP_VaultCodeHint_C, StaticMesh_1) == 0x0002A8, "Member 'ABP_VaultCodeHint_C::StaticMesh_1' has a wrong offset!");
static_assert(offsetof(ABP_VaultCodeHint_C, StaticMesh) == 0x0002B0, "Member 'ABP_VaultCodeHint_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_VaultCodeHint_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABP_VaultCodeHint_C::DefaultSceneRoot' has a wrong offset!");

}

