#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VentReactor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_VentReactor.BP_VentReactor_C.ExecuteUbergraph_BP_VentReactor
// 0x00E0 (0x00E0 - 0x0000)
struct BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bActorsInCloset;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics_1;                       // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECollisionEnabled                             K2Node_Select_Default;                             // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x00A0(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_DecorativeSmokeGrenade_C*           CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor) == 0x000010, "Wrong alignment on BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor");
static_assert(sizeof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor) == 0x0000E0, "Wrong size on BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, EntryPoint) == 0x000000, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, Temp_byte_Variable) == 0x000004, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, Temp_byte_Variable_1) == 0x000005, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, Temp_struct_Variable) == 0x000008, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, Temp_delegate_Variable) == 0x000018, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_PostEvent_ReturnValue) == 0x00002C, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, K2Node_Event_bActorsInCloset) == 0x000030, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::K2Node_Event_bActorsInCloset' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, K2Node_Event_bDoCosmetics_1) == 0x000031, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::K2Node_Event_bDoCosmetics_1' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, K2Node_Event_bStateToChangeTo) == 0x000032, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, K2Node_Event_bDoCosmetics) == 0x000033, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_Not_PreBool_ReturnValue) == 0x000034, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, Temp_bool_Variable) == 0x000035, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_BreakTransform_Location) == 0x000070, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_BreakTransform_Rotation) == 0x00007C, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_BreakTransform_Scale) == 0x000088, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, K2Node_Select_Default) == 0x000094, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000098, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_GetTransform_ReturnValue) == 0x0000A0, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000D0, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'BP_VentReactor_C_ExecuteUbergraph_BP_VentReactor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

// Function BP_VentReactor.BP_VentReactor_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_VentReactor_C_OnStateChanged final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VentReactor_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_VentReactor_C_OnStateChanged");
static_assert(sizeof(BP_VentReactor_C_OnStateChanged) == 0x000002, "Wrong size on BP_VentReactor_C_OnStateChanged");
static_assert(offsetof(BP_VentReactor_C_OnStateChanged, bStateToChangeTo) == 0x000000, "Member 'BP_VentReactor_C_OnStateChanged::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_OnStateChanged, bDoCosmetics) == 0x000001, "Member 'BP_VentReactor_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

// Function BP_VentReactor.BP_VentReactor_C.ReactToCloset
// 0x0002 (0x0002 - 0x0000)
struct BP_VentReactor_C_ReactToCloset final
{
public:
	bool                                          bActorsInCloset;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_VentReactor_C_ReactToCloset) == 0x000001, "Wrong alignment on BP_VentReactor_C_ReactToCloset");
static_assert(sizeof(BP_VentReactor_C_ReactToCloset) == 0x000002, "Wrong size on BP_VentReactor_C_ReactToCloset");
static_assert(offsetof(BP_VentReactor_C_ReactToCloset, bActorsInCloset) == 0x000000, "Member 'BP_VentReactor_C_ReactToCloset::bActorsInCloset' has a wrong offset!");
static_assert(offsetof(BP_VentReactor_C_ReactToCloset, bDoCosmetics) == 0x000001, "Member 'BP_VentReactor_C_ReactToCloset::bDoCosmetics' has a wrong offset!");

}

