#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VIPInvitation_Fake

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_VIPInvitation_Fake.BP_VIPInvitation_Fake_C.ExecuteUbergraph_BP_VIPInvitation_Fake
// 0x0008 (0x0008 - 0x0000)
struct BP_VIPInvitation_Fake_C_ExecuteUbergraph_BP_VIPInvitation_Fake final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VIPInvitation_Fake_C_ExecuteUbergraph_BP_VIPInvitation_Fake) == 0x000004, "Wrong alignment on BP_VIPInvitation_Fake_C_ExecuteUbergraph_BP_VIPInvitation_Fake");
static_assert(sizeof(BP_VIPInvitation_Fake_C_ExecuteUbergraph_BP_VIPInvitation_Fake) == 0x000008, "Wrong size on BP_VIPInvitation_Fake_C_ExecuteUbergraph_BP_VIPInvitation_Fake");
static_assert(offsetof(BP_VIPInvitation_Fake_C_ExecuteUbergraph_BP_VIPInvitation_Fake, EntryPoint) == 0x000000, "Member 'BP_VIPInvitation_Fake_C_ExecuteUbergraph_BP_VIPInvitation_Fake::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_VIPInvitation_Fake_C_ExecuteUbergraph_BP_VIPInvitation_Fake, K2Node_Event_EndPlayReason) == 0x000004, "Member 'BP_VIPInvitation_Fake_C_ExecuteUbergraph_BP_VIPInvitation_Fake::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_VIPInvitation_Fake.BP_VIPInvitation_Fake_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_VIPInvitation_Fake_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VIPInvitation_Fake_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_VIPInvitation_Fake_C_ReceiveEndPlay");
static_assert(sizeof(BP_VIPInvitation_Fake_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_VIPInvitation_Fake_C_ReceiveEndPlay");
static_assert(offsetof(BP_VIPInvitation_Fake_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_VIPInvitation_Fake_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_VIPInvitation_Fake.BP_VIPInvitation_Fake_C.GetSensorComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_VIPInvitation_Fake_C_GetSensorComponent final
{
public:
	class USBZSensorComponent*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VIPInvitation_Fake_C_GetSensorComponent) == 0x000008, "Wrong alignment on BP_VIPInvitation_Fake_C_GetSensorComponent");
static_assert(sizeof(BP_VIPInvitation_Fake_C_GetSensorComponent) == 0x000008, "Wrong size on BP_VIPInvitation_Fake_C_GetSensorComponent");
static_assert(offsetof(BP_VIPInvitation_Fake_C_GetSensorComponent, ReturnValue) == 0x000000, "Member 'BP_VIPInvitation_Fake_C_GetSensorComponent::ReturnValue' has a wrong offset!");

// Function BP_VIPInvitation_Fake.BP_VIPInvitation_Fake_C.GetSensorOutlineComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_VIPInvitation_Fake_C_GetSensorOutlineComponent final
{
public:
	class USBZOutlineComponent*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_VIPInvitation_Fake_C_GetSensorOutlineComponent) == 0x000008, "Wrong alignment on BP_VIPInvitation_Fake_C_GetSensorOutlineComponent");
static_assert(sizeof(BP_VIPInvitation_Fake_C_GetSensorOutlineComponent) == 0x000008, "Wrong size on BP_VIPInvitation_Fake_C_GetSensorOutlineComponent");
static_assert(offsetof(BP_VIPInvitation_Fake_C_GetSensorOutlineComponent, ReturnValue) == 0x000000, "Member 'BP_VIPInvitation_Fake_C_GetSensorOutlineComponent::ReturnValue' has a wrong offset!");

}

