#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WoodenCrate

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_WoodenCrate.BP_WoodenCrate_C.ExecuteUbergraph_BP_WoodenCrate
// 0x04C8 (0x04C8 - 0x0000)
struct BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseInteractableComponent*          K2Node_ComponentBoundEvent_Interactable;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                K2Node_ComponentBoundEvent_Interactor;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor; // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x001C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00AC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x013C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x01CC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bStateToChangeTo;                     // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x025D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25E[0x2];                                      // 0x025E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_2;  // 0x0264(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_3;  // 0x02F4(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0384(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_3;  // 0x0414(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x04B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x04B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bState;                 // 0x04B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bDoCosmetics;           // 0x04BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4BB[0x5];                                      // 0x04BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate) == 0x000008, "Wrong alignment on BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate");
static_assert(sizeof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate) == 0x0004C8, "Wrong size on BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, EntryPoint) == 0x000000, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, K2Node_ComponentBoundEvent_Interactable) == 0x000008, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::K2Node_ComponentBoundEvent_Interactable' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, K2Node_ComponentBoundEvent_Interactor) == 0x000010, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::K2Node_ComponentBoundEvent_Interactor' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor) == 0x000018, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::K2Node_ComponentBoundEvent_bIsLocallyControlledInteractor' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x00001C, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000AC, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x00013C, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x0001CC, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, K2Node_Event_bStateToChangeTo) == 0x00025C, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::K2Node_Event_bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, K2Node_Event_bDoCosmetics) == 0x00025D, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000260, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, CallFunc_K2_SetRelativeRotation_SweepHitResult_2) == 0x000264, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::CallFunc_K2_SetRelativeRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, CallFunc_K2_SetRelativeRotation_SweepHitResult_3) == 0x0002F4, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::CallFunc_K2_SetRelativeRotation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000384, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, CallFunc_K2_SetRelativeLocation_SweepHitResult_3) == 0x000414, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::CallFunc_K2_SetRelativeLocation_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, Temp_object_Variable) == 0x0004A8, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, Temp_object_Variable_1) == 0x0004B0, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, Temp_bool_Variable) == 0x0004B8, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, K2Node_ComponentBoundEvent_bState) == 0x0004B9, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::K2Node_ComponentBoundEvent_bState' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, K2Node_ComponentBoundEvent_bDoCosmetics) == 0x0004BA, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::K2Node_ComponentBoundEvent_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate, K2Node_Select_Default) == 0x0004C0, "Member 'BP_WoodenCrate_C_ExecuteUbergraph_BP_WoodenCrate::K2Node_Select_Default' has a wrong offset!");

// Function BP_WoodenCrate.BP_WoodenCrate_C.BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct BP_WoodenCrate_C_BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature final
{
public:
	bool                                          bState_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WoodenCrate_C_BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature) == 0x000001, "Wrong alignment on BP_WoodenCrate_C_BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature");
static_assert(sizeof(BP_WoodenCrate_C_BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature) == 0x000002, "Wrong size on BP_WoodenCrate_C_BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature");
static_assert(offsetof(BP_WoodenCrate_C_BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature, bState_0) == 0x000000, "Member 'BP_WoodenCrate_C_BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature::bState_0' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature, bDoCosmetics) == 0x000001, "Member 'BP_WoodenCrate_C_BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature::bDoCosmetics' has a wrong offset!");

// Function BP_WoodenCrate.BP_WoodenCrate_C.BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature final
{
public:
	class USBZBaseInteractableComponent*          Interactable;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInteractorComponent*                Interactor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLocallyControlledInteractor;                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature) == 0x000008, "Wrong alignment on BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature");
static_assert(sizeof(BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature) == 0x000018, "Wrong size on BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature");
static_assert(offsetof(BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, Interactable) == 0x000000, "Member 'BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::Interactable' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, Interactor) == 0x000008, "Member 'BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::Interactor' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature, bIsLocallyControlledInteractor) == 0x000010, "Member 'BP_WoodenCrate_C_BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature::bIsLocallyControlledInteractor' has a wrong offset!");

// Function BP_WoodenCrate.BP_WoodenCrate_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_WoodenCrate_C_OnStateChanged final
{
public:
	bool                                          bStateToChangeTo;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WoodenCrate_C_OnStateChanged) == 0x000001, "Wrong alignment on BP_WoodenCrate_C_OnStateChanged");
static_assert(sizeof(BP_WoodenCrate_C_OnStateChanged) == 0x000002, "Wrong size on BP_WoodenCrate_C_OnStateChanged");
static_assert(offsetof(BP_WoodenCrate_C_OnStateChanged, bStateToChangeTo) == 0x000000, "Member 'BP_WoodenCrate_C_OnStateChanged::bStateToChangeTo' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_OnStateChanged, bDoCosmetics) == 0x000001, "Member 'BP_WoodenCrate_C_OnStateChanged::bDoCosmetics' has a wrong offset!");

// Function BP_WoodenCrate.BP_WoodenCrate_C.UserConstructionScript
// 0x0440 (0x0440 - 0x0000)
struct BP_WoodenCrate_C_UserConstructionScript final
{
public:
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0000(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult;   // 0x009C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_1; // 0x012C(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_2; // 0x01BC(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0250(0x0030)(IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_3; // 0x0280(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeTransform_SweepHitResult_4; // 0x0310(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x03A0(0x0090)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Select_Default;                             // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WoodenCrate_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_WoodenCrate_C_UserConstructionScript");
static_assert(sizeof(BP_WoodenCrate_C_UserConstructionScript) == 0x000440, "Wrong size on BP_WoodenCrate_C_UserConstructionScript");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000000, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_1) == 0x000030, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_2) == 0x000060, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, Temp_bool_Variable) == 0x000090, "Member 'BP_WoodenCrate_C_UserConstructionScript::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, Temp_float_Variable) == 0x000094, "Member 'BP_WoodenCrate_C_UserConstructionScript::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, Temp_float_Variable_1) == 0x000098, "Member 'BP_WoodenCrate_C_UserConstructionScript::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult) == 0x00009C, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult_1) == 0x00012C, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult_2) == 0x0001BC, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue_3) == 0x000250, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult_3) == 0x000280, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult_3' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_K2_SetRelativeTransform_SweepHitResult_4) == 0x000310, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_K2_SetRelativeTransform_SweepHitResult_4' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x0003A0, "Member 'BP_WoodenCrate_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WoodenCrate_C_UserConstructionScript, K2Node_Select_Default) == 0x000430, "Member 'BP_WoodenCrate_C_UserConstructionScript::K2Node_Select_Default' has a wrong offset!");

// Function BP_WoodenCrate.BP_WoodenCrate_C.setMarking
// 0x0001 (0x0001 - 0x0000)
struct BP_WoodenCrate_C_setMarking final
{
public:
	bool                                          visible;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_WoodenCrate_C_setMarking) == 0x000001, "Wrong alignment on BP_WoodenCrate_C_setMarking");
static_assert(sizeof(BP_WoodenCrate_C_setMarking) == 0x000001, "Wrong size on BP_WoodenCrate_C_setMarking");
static_assert(offsetof(BP_WoodenCrate_C_setMarking, visible) == 0x000000, "Member 'BP_WoodenCrate_C_setMarking::visible' has a wrong offset!");

}

