#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WoodenCrate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WoodenCrate.BP_WoodenCrate_C
// 0x00B8 (0x0390 - 0x02D8)
class ABP_WoodenCrate_C final : public ASBZReplicatedBinaryStateActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZBinaryStateComponent*               marked_SBZBinaryState;                             // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAIObjectiveComponent*               SBZAIObjective;                                    // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SideCollision_05;                                  // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SideCollision_04;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SideCollision_03;                                  // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SideCollision_02;                                  // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SideCollision_01;                                  // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          DoorCollision_01;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZOutlineComponent*                   SBZOutline;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZInteractableComponent*              SBZInteractable;                                   // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Mesh;                                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          SmallBox_;                                         // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Boxsizer;                                          // 0x0350(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TMulticastInlineDelegate<void()>              onCrateOpened;                                     // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_WoodenCrate(int32 EntryPoint);
	void BndEvt__BP_WoodenCrate_marked_SBZBinaryState_K2Node_ComponentBoundEvent_0_SBZBinaryStateChangedSignature__DelegateSignature(bool bState_0, bool bDoCosmetics);
	void BndEvt__BP_ReplicatedBinaryActorVent_SBZInteractable_K2Node_ComponentBoundEvent_2_SBZOnInteraction__DelegateSignature(class USBZBaseInteractableComponent* Interactable, class USBZInteractorComponent* Interactor, bool bIsLocallyControlledInteractor);
	void OnStateChanged(bool bStateToChangeTo, bool bDoCosmetics);
	void UserConstructionScript();
	void setMarking(bool visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WoodenCrate_C">();
	}
	static class ABP_WoodenCrate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WoodenCrate_C>();
	}
};
static_assert(alignof(ABP_WoodenCrate_C) == 0x000010, "Wrong alignment on ABP_WoodenCrate_C");
static_assert(sizeof(ABP_WoodenCrate_C) == 0x000390, "Wrong size on ABP_WoodenCrate_C");
static_assert(offsetof(ABP_WoodenCrate_C, UberGraphFrame) == 0x0002D8, "Member 'ABP_WoodenCrate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, marked_SBZBinaryState) == 0x0002E0, "Member 'ABP_WoodenCrate_C::marked_SBZBinaryState' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, SBZAIObjective) == 0x0002E8, "Member 'ABP_WoodenCrate_C::SBZAIObjective' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, SideCollision_05) == 0x0002F0, "Member 'ABP_WoodenCrate_C::SideCollision_05' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, SideCollision_04) == 0x0002F8, "Member 'ABP_WoodenCrate_C::SideCollision_04' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, SideCollision_03) == 0x000300, "Member 'ABP_WoodenCrate_C::SideCollision_03' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, SideCollision_02) == 0x000308, "Member 'ABP_WoodenCrate_C::SideCollision_02' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, SideCollision_01) == 0x000310, "Member 'ABP_WoodenCrate_C::SideCollision_01' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, Box) == 0x000318, "Member 'ABP_WoodenCrate_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, DoorCollision_01) == 0x000320, "Member 'ABP_WoodenCrate_C::DoorCollision_01' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, SBZOutline) == 0x000328, "Member 'ABP_WoodenCrate_C::SBZOutline' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, SBZInteractable) == 0x000330, "Member 'ABP_WoodenCrate_C::SBZInteractable' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, Mesh) == 0x000338, "Member 'ABP_WoodenCrate_C::Mesh' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, DefaultSceneRoot) == 0x000340, "Member 'ABP_WoodenCrate_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, SmallBox_) == 0x000348, "Member 'ABP_WoodenCrate_C::SmallBox_' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, Boxsizer) == 0x000350, "Member 'ABP_WoodenCrate_C::Boxsizer' has a wrong offset!");
static_assert(offsetof(ABP_WoodenCrate_C, onCrateOpened) == 0x000380, "Member 'ABP_WoodenCrate_C::onCrateOpened' has a wrong offset!");

}

