#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WaterCooler_01_BottleRack_01

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WaterCooler_01_BottleRack_01.BP_WaterCooler_01_BottleRack_01_C
// 0x0040 (0x02E8 - 0x02A8)
class ABP_WaterCooler_01_BottleRack_01_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Bottle_06;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bottle_05;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bottle_04;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bottle_03;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bottle_02;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bottle_01;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BottleRack_01;                                     // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WaterCooler_01_BottleRack_01_C">();
	}
	static class ABP_WaterCooler_01_BottleRack_01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WaterCooler_01_BottleRack_01_C>();
	}
};
static_assert(alignof(ABP_WaterCooler_01_BottleRack_01_C) == 0x000008, "Wrong alignment on ABP_WaterCooler_01_BottleRack_01_C");
static_assert(sizeof(ABP_WaterCooler_01_BottleRack_01_C) == 0x0002E8, "Wrong size on ABP_WaterCooler_01_BottleRack_01_C");
static_assert(offsetof(ABP_WaterCooler_01_BottleRack_01_C, Bottle_06) == 0x0002A8, "Member 'ABP_WaterCooler_01_BottleRack_01_C::Bottle_06' has a wrong offset!");
static_assert(offsetof(ABP_WaterCooler_01_BottleRack_01_C, Bottle_05) == 0x0002B0, "Member 'ABP_WaterCooler_01_BottleRack_01_C::Bottle_05' has a wrong offset!");
static_assert(offsetof(ABP_WaterCooler_01_BottleRack_01_C, Bottle_04) == 0x0002B8, "Member 'ABP_WaterCooler_01_BottleRack_01_C::Bottle_04' has a wrong offset!");
static_assert(offsetof(ABP_WaterCooler_01_BottleRack_01_C, Bottle_03) == 0x0002C0, "Member 'ABP_WaterCooler_01_BottleRack_01_C::Bottle_03' has a wrong offset!");
static_assert(offsetof(ABP_WaterCooler_01_BottleRack_01_C, Bottle_02) == 0x0002C8, "Member 'ABP_WaterCooler_01_BottleRack_01_C::Bottle_02' has a wrong offset!");
static_assert(offsetof(ABP_WaterCooler_01_BottleRack_01_C, Bottle_01) == 0x0002D0, "Member 'ABP_WaterCooler_01_BottleRack_01_C::Bottle_01' has a wrong offset!");
static_assert(offsetof(ABP_WaterCooler_01_BottleRack_01_C, BottleRack_01) == 0x0002D8, "Member 'ABP_WaterCooler_01_BottleRack_01_C::BottleRack_01' has a wrong offset!");
static_assert(offsetof(ABP_WaterCooler_01_BottleRack_01_C, DefaultSceneRoot) == 0x0002E0, "Member 'ABP_WaterCooler_01_BottleRack_01_C::DefaultSceneRoot' has a wrong offset!");

}

