#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Zipline_BasesOnly

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Zipline_BasesOnly.BP_Zipline_BasesOnly_C.ExecuteUbergraph_BP_Zipline_BasesOnly
// 0x00C0 (0x00C0 - 0x0000)
struct BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0028(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0040(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0050(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable_2;                               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bEnabled;                             // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bDoCosmetics;                         // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_2;                         // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_3;                         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly) == 0x000008, "Wrong alignment on BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly");
static_assert(sizeof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly) == 0x0000C0, "Wrong size on BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, EntryPoint) == 0x000000, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, Temp_int_Variable) == 0x000004, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, Temp_int_Variable_1) == 0x000008, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, Temp_struct_Variable) == 0x000018, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, Temp_delegate_Variable) == 0x000028, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, Temp_struct_Variable_1) == 0x000040, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, Temp_delegate_Variable_1) == 0x000050, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, Temp_int_Variable_2) == 0x000064, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, Temp_int_Variable_3) == 0x000068, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Add_IntInt_ReturnValue_3) == 0x000070, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Array_Get_Item) == 0x000078, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Less_IntInt_ReturnValue) == 0x000084, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_PostAkEvent_ReturnValue) == 0x000088, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_PostAkEvent_ReturnValue_1) == 0x00008C, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Array_Get_Item_1) == 0x000090, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Array_Length_ReturnValue_1) == 0x000098, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Less_IntInt_ReturnValue_1) == 0x00009C, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, K2Node_Event_bEnabled) == 0x00009D, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::K2Node_Event_bEnabled' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, K2Node_Event_bDoCosmetics) == 0x00009E, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::K2Node_Event_bDoCosmetics' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Array_Get_Item_2) == 0x0000A0, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Array_Length_ReturnValue_2) == 0x0000A8, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000AC, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Array_Get_Item_3) == 0x0000B0, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Array_Length_ReturnValue_3) == 0x0000B8, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000BC, "Member 'BP_Zipline_BasesOnly_C_ExecuteUbergraph_BP_Zipline_BasesOnly::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");

// Function BP_Zipline_BasesOnly.BP_Zipline_BasesOnly_C.BP_OnZiplineEnabledChanged
// 0x0002 (0x0002 - 0x0000)
struct BP_Zipline_BasesOnly_C_BP_OnZiplineEnabledChanged final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDoCosmetics;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Zipline_BasesOnly_C_BP_OnZiplineEnabledChanged) == 0x000001, "Wrong alignment on BP_Zipline_BasesOnly_C_BP_OnZiplineEnabledChanged");
static_assert(sizeof(BP_Zipline_BasesOnly_C_BP_OnZiplineEnabledChanged) == 0x000002, "Wrong size on BP_Zipline_BasesOnly_C_BP_OnZiplineEnabledChanged");
static_assert(offsetof(BP_Zipline_BasesOnly_C_BP_OnZiplineEnabledChanged, bEnabled) == 0x000000, "Member 'BP_Zipline_BasesOnly_C_BP_OnZiplineEnabledChanged::bEnabled' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_BP_OnZiplineEnabledChanged, bDoCosmetics) == 0x000001, "Member 'BP_Zipline_BasesOnly_C_BP_OnZiplineEnabledChanged::bDoCosmetics' has a wrong offset!");

// Function BP_Zipline_BasesOnly.BP_Zipline_BasesOnly_C.UserConstructionScript
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Zipline_BasesOnly_C_UserConstructionScript final
{
public:
	struct FTransform                             Temp_struct_Variable;                              // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Zipline_BasesOnly_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Zipline_BasesOnly_C_UserConstructionScript");
static_assert(sizeof(BP_Zipline_BasesOnly_C_UserConstructionScript) == 0x0000D0, "Wrong size on BP_Zipline_BasesOnly_C_UserConstructionScript");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, Temp_struct_Variable) == 0x000000, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, Temp_int_Variable) == 0x000030, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000038, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_1) == 0x000040, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, Temp_int_Variable_1) == 0x000044, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue_2) == 0x00004C, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000064, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000070, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x00007C, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000080, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x00008C, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000098, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x0000A4, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x0000B0, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000B4, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000C0, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_VSize_ReturnValue) == 0x0000C4, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000C8, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Zipline_BasesOnly_C_UserConstructionScript, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000CC, "Member 'BP_Zipline_BasesOnly_C_UserConstructionScript::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

}

