#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ZiplineBag

#include "Basic.hpp"

#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ZiplineBag.BP_ZiplineBag_C
// 0x0020 (0x0338 - 0x0318)
class ABP_ZiplineBag_C final : public ASBZSingleBagGenerator
{
public:
	class USBZAIObjectiveComponent*               SBZAIObjective;                                    // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ZiplineBag_C">();
	}
	static class ABP_ZiplineBag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ZiplineBag_C>();
	}
};
static_assert(alignof(ABP_ZiplineBag_C) == 0x000008, "Wrong alignment on ABP_ZiplineBag_C");
static_assert(sizeof(ABP_ZiplineBag_C) == 0x000338, "Wrong size on ABP_ZiplineBag_C");
static_assert(offsetof(ABP_ZiplineBag_C, SBZAIObjective) == 0x000318, "Member 'ABP_ZiplineBag_C::SBZAIObjective' has a wrong offset!");
static_assert(offsetof(ABP_ZiplineBag_C, Ak) == 0x000320, "Member 'ABP_ZiplineBag_C::Ak' has a wrong offset!");
static_assert(offsetof(ABP_ZiplineBag_C, StaticMesh) == 0x000328, "Member 'ABP_ZiplineBag_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABP_ZiplineBag_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_ZiplineBag_C::DefaultSceneRoot' has a wrong offset!");

}

