#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPCactusPot_01_B

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPCactusPot_01_B.BPCactusPot_01_B_C
// 0x0018 (0x02C0 - 0x02A8)
class ABPCactusPot_01_B_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPCactusPot_01_B(int32 EntryPoint);
	void BndEvt__BPCactusPot_01_B_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPCactusPot_01_B_C">();
	}
	static class ABPCactusPot_01_B_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPCactusPot_01_B_C>();
	}
};
static_assert(alignof(ABPCactusPot_01_B_C) == 0x000008, "Wrong alignment on ABPCactusPot_01_B_C");
static_assert(sizeof(ABPCactusPot_01_B_C) == 0x0002C0, "Wrong size on ABPCactusPot_01_B_C");
static_assert(offsetof(ABPCactusPot_01_B_C, UberGraphFrame) == 0x0002A8, "Member 'ABPCactusPot_01_B_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPCactusPot_01_B_C, SBZCosmeticDestruction) == 0x0002B0, "Member 'ABPCactusPot_01_B_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ABPCactusPot_01_B_C, StaticMesh) == 0x0002B8, "Member 'ABPCactusPot_01_B_C::StaticMesh' has a wrong offset!");

}

