#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPFL_VOIPCalls

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPFL_VOIPCalls.BPFL_VOIPCalls_C.CanPlayerTalk
// 0x0038 (0x0038 - 0x0000)
struct BPFL_VOIPCalls_C_CanPlayerTalk final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Epic_ID;                                           // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AbleToTalk;                                        // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTLMVoiceChatSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetPlayerBlocked_ReturnValue;             // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPlayerMuted_bIsMuted;                  // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetPlayerMuted_ReturnValue;               // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayerInChannel_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_VOIPCalls_C_CanPlayerTalk) == 0x000008, "Wrong alignment on BPFL_VOIPCalls_C_CanPlayerTalk");
static_assert(sizeof(BPFL_VOIPCalls_C_CanPlayerTalk) == 0x000038, "Wrong size on BPFL_VOIPCalls_C_CanPlayerTalk");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, WorldContextObject) == 0x000000, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::WorldContextObject' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, Epic_ID) == 0x000008, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::Epic_ID' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, __WorldContext) == 0x000018, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, AbleToTalk) == 0x000020, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::AbleToTalk' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000028, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, CallFunc_GetPlayerBlocked_ReturnValue) == 0x000030, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::CallFunc_GetPlayerBlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, CallFunc_GetPlayerMuted_bIsMuted) == 0x000031, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::CallFunc_GetPlayerMuted_bIsMuted' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, CallFunc_GetPlayerMuted_ReturnValue) == 0x000032, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::CallFunc_GetPlayerMuted_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, CallFunc_Not_PreBool_ReturnValue) == 0x000033, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, CallFunc_Not_PreBool_ReturnValue_1) == 0x000034, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, CallFunc_IsPlayerInChannel_ReturnValue) == 0x000035, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::CallFunc_IsPlayerInChannel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_CanPlayerTalk, CallFunc_BooleanAND_ReturnValue) == 0x000036, "Member 'BPFL_VOIPCalls_C_CanPlayerTalk::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BPFL_VOIPCalls.BPFL_VOIPCalls_C.IsPlayerInChannel
// 0x0020 (0x0020 - 0x0000)
struct BPFL_VOIPCalls_C_IsPlayerInChannel final
{
public:
	class UObject*                                __WorldContext;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InVoiceChannel;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTLMVoiceChatSubsystem*                 CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerInChannel_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPFL_VOIPCalls_C_IsPlayerInChannel) == 0x000008, "Wrong alignment on BPFL_VOIPCalls_C_IsPlayerInChannel");
static_assert(sizeof(BPFL_VOIPCalls_C_IsPlayerInChannel) == 0x000020, "Wrong size on BPFL_VOIPCalls_C_IsPlayerInChannel");
static_assert(offsetof(BPFL_VOIPCalls_C_IsPlayerInChannel, __WorldContext) == 0x000000, "Member 'BPFL_VOIPCalls_C_IsPlayerInChannel::__WorldContext' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_IsPlayerInChannel, InVoiceChannel) == 0x000008, "Member 'BPFL_VOIPCalls_C_IsPlayerInChannel::InVoiceChannel' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_IsPlayerInChannel, CallFunc_GetGameInstanceSubsystem_ReturnValue) == 0x000010, "Member 'BPFL_VOIPCalls_C_IsPlayerInChannel::CallFunc_GetGameInstanceSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPFL_VOIPCalls_C_IsPlayerInChannel, CallFunc_IsPlayerInChannel_ReturnValue) == 0x000018, "Member 'BPFL_VOIPCalls_C_IsPlayerInChannel::CallFunc_IsPlayerInChannel_ReturnValue' has a wrong offset!");

}

