#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_RoomSpawnInsideLoc

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPI_RoomSpawnInsideLoc.BPI_RoomSpawnInsideLoc_C.SpawnItemInContainer
// 0x0018 (0x0018 - 0x0000)
struct BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer final
{
public:
	class UClass*                                 WhatShould_Spawn;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_RoomSpawnController_C*              RoomControllerRef;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 SpawnedActor;                                      // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer) == 0x000008, "Wrong alignment on BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer");
static_assert(sizeof(BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer) == 0x000018, "Wrong size on BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer");
static_assert(offsetof(BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer, WhatShould_Spawn) == 0x000000, "Member 'BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer::WhatShould_Spawn' has a wrong offset!");
static_assert(offsetof(BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer, RoomControllerRef) == 0x000008, "Member 'BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer::RoomControllerRef' has a wrong offset!");
static_assert(offsetof(BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer, SpawnedActor) == 0x000010, "Member 'BPI_RoomSpawnInsideLoc_C_SpawnItemInContainer::SpawnedActor' has a wrong offset!");

}

