#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_FloodLamp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPL_FloodLamp.BPL_FloodLamp_C
// 0x0040 (0x02E8 - 0x02A8)
class ABPL_FloodLamp_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FX_SparkBurst_M;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight_1;                                       // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_DeskLamp_0_4;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPL_FloodLamp(int32 EntryPoint);
	void BndEvt__BPL_FloodLamp_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPL_FloodLamp_C">();
	}
	static class ABPL_FloodLamp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPL_FloodLamp_C>();
	}
};
static_assert(alignof(ABPL_FloodLamp_C) == 0x000008, "Wrong alignment on ABPL_FloodLamp_C");
static_assert(sizeof(ABPL_FloodLamp_C) == 0x0002E8, "Wrong size on ABPL_FloodLamp_C");
static_assert(offsetof(ABPL_FloodLamp_C, UberGraphFrame) == 0x0002A8, "Member 'ABPL_FloodLamp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPL_FloodLamp_C, FX_SparkBurst_M) == 0x0002B0, "Member 'ABPL_FloodLamp_C::FX_SparkBurst_M' has a wrong offset!");
static_assert(offsetof(ABPL_FloodLamp_C, SBZCosmeticDestruction) == 0x0002B8, "Member 'ABPL_FloodLamp_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ABPL_FloodLamp_C, SpotLight_1) == 0x0002C0, "Member 'ABPL_FloodLamp_C::SpotLight_1' has a wrong offset!");
static_assert(offsetof(ABPL_FloodLamp_C, PointLight) == 0x0002C8, "Member 'ABPL_FloodLamp_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABPL_FloodLamp_C, SpotLight) == 0x0002D0, "Member 'ABPL_FloodLamp_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABPL_FloodLamp_C, LGT_DeskLamp_0_4) == 0x0002D8, "Member 'ABPL_FloodLamp_C::LGT_DeskLamp_0_4' has a wrong offset!");
static_assert(offsetof(ABPL_FloodLamp_C, DefaultSceneRoot) == 0x0002E0, "Member 'ABPL_FloodLamp_C::DefaultSceneRoot' has a wrong offset!");

}

