#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_WallLampCircle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPL_WallLampCircle.BPL_WallLampCircle_C
// 0x0038 (0x02E0 - 0x02A8)
class ABPL_WallLampCircle_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FX_SparkBurst_M;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZCosmeticDestructionComponent*       SBZCosmeticDestruction;                            // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   SmoothAmbiant;                                     // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_DeskLamp_02;                                   // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BPL_WallLampCircle(int32 EntryPoint);
	void BndEvt__BPL_WallLampCircle_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature(ESBZCosmeticDestructionType Type, const struct FSBZCosmeticDestructionContext& HitContext);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPL_WallLampCircle_C">();
	}
	static class ABPL_WallLampCircle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPL_WallLampCircle_C>();
	}
};
static_assert(alignof(ABPL_WallLampCircle_C) == 0x000008, "Wrong alignment on ABPL_WallLampCircle_C");
static_assert(sizeof(ABPL_WallLampCircle_C) == 0x0002E0, "Wrong size on ABPL_WallLampCircle_C");
static_assert(offsetof(ABPL_WallLampCircle_C, UberGraphFrame) == 0x0002A8, "Member 'ABPL_WallLampCircle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABPL_WallLampCircle_C, FX_SparkBurst_M) == 0x0002B0, "Member 'ABPL_WallLampCircle_C::FX_SparkBurst_M' has a wrong offset!");
static_assert(offsetof(ABPL_WallLampCircle_C, SBZCosmeticDestruction) == 0x0002B8, "Member 'ABPL_WallLampCircle_C::SBZCosmeticDestruction' has a wrong offset!");
static_assert(offsetof(ABPL_WallLampCircle_C, SpotLight) == 0x0002C0, "Member 'ABPL_WallLampCircle_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABPL_WallLampCircle_C, SmoothAmbiant) == 0x0002C8, "Member 'ABPL_WallLampCircle_C::SmoothAmbiant' has a wrong offset!");
static_assert(offsetof(ABPL_WallLampCircle_C, LGT_DeskLamp_02) == 0x0002D0, "Member 'ABPL_WallLampCircle_C::LGT_DeskLamp_02' has a wrong offset!");
static_assert(offsetof(ABPL_WallLampCircle_C, DefaultSceneRoot) == 0x0002D8, "Member 'ABPL_WallLampCircle_C::DefaultSceneRoot' has a wrong offset!");

}

