#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_FloodLampPainting

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPL_FloodLampPainting.BPL_FloodLampPainting_C
// 0x0018 (0x02C0 - 0x02A8)
class ABPL_FloodLampPainting_C final : public AActor
{
public:
	class USpotLightComponent*                    DownLight;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_DeskLamp_02;                                   // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPL_FloodLampPainting_C">();
	}
	static class ABPL_FloodLampPainting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPL_FloodLampPainting_C>();
	}
};
static_assert(alignof(ABPL_FloodLampPainting_C) == 0x000008, "Wrong alignment on ABPL_FloodLampPainting_C");
static_assert(sizeof(ABPL_FloodLampPainting_C) == 0x0002C0, "Wrong size on ABPL_FloodLampPainting_C");
static_assert(offsetof(ABPL_FloodLampPainting_C, DownLight) == 0x0002A8, "Member 'ABPL_FloodLampPainting_C::DownLight' has a wrong offset!");
static_assert(offsetof(ABPL_FloodLampPainting_C, LGT_DeskLamp_02) == 0x0002B0, "Member 'ABPL_FloodLampPainting_C::LGT_DeskLamp_02' has a wrong offset!");
static_assert(offsetof(ABPL_FloodLampPainting_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABPL_FloodLampPainting_C::DefaultSceneRoot' has a wrong offset!");

}

