#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_WallLamp_ArtDeco

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function BPL_WallLamp_ArtDeco.BPL_WallLamp_ArtDeco_C.ExecuteUbergraph_BPL_WallLamp_ArtDeco
// 0x0068 (0x0068 - 0x0000)
struct BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCosmeticDestructionType                   K2Node_ComponentBoundEvent_Type;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         K2Node_ComponentBoundEvent_HitContext;             // 0x0034(0x0030)(ConstParm, NoDestructor)
};
static_assert(alignof(BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco) == 0x000008, "Wrong alignment on BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco");
static_assert(sizeof(BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco) == 0x000068, "Wrong size on BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco");
static_assert(offsetof(BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco, EntryPoint) == 0x000000, "Member 'BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco, Temp_struct_Variable) == 0x000008, "Member 'BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco, Temp_delegate_Variable) == 0x000018, "Member 'BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco, CallFunc_PostEvent_ReturnValue) == 0x00002C, "Member 'BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco, K2Node_ComponentBoundEvent_Type) == 0x000030, "Member 'BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco::K2Node_ComponentBoundEvent_Type' has a wrong offset!");
static_assert(offsetof(BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco, K2Node_ComponentBoundEvent_HitContext) == 0x000034, "Member 'BPL_WallLamp_ArtDeco_C_ExecuteUbergraph_BPL_WallLamp_ArtDeco::K2Node_ComponentBoundEvent_HitContext' has a wrong offset!");

// Function BPL_WallLamp_ArtDeco.BPL_WallLamp_ArtDeco_C.BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature
// 0x0034 (0x0034 - 0x0000)
struct BPL_WallLamp_ArtDeco_C_BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature final
{
public:
	ESBZCosmeticDestructionType                   Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCosmeticDestructionContext         HitContext;                                        // 0x0004(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(BPL_WallLamp_ArtDeco_C_BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000004, "Wrong alignment on BPL_WallLamp_ArtDeco_C_BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(sizeof(BPL_WallLamp_ArtDeco_C_BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature) == 0x000034, "Wrong size on BPL_WallLamp_ArtDeco_C_BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature");
static_assert(offsetof(BPL_WallLamp_ArtDeco_C_BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, Type) == 0x000000, "Member 'BPL_WallLamp_ArtDeco_C_BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::Type' has a wrong offset!");
static_assert(offsetof(BPL_WallLamp_ArtDeco_C_BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature, HitContext) == 0x000004, "Member 'BPL_WallLamp_ArtDeco_C_BndEvt__BPL_WallLamp_ArtDeco_SBZCosmeticDestruction_K2Node_ComponentBoundEvent_0_SBZCosmeticDestructionComponenteSignature__DelegateSignature::HitContext' has a wrong offset!");

}

