#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_NeonLarge

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPL_NeonLarge.BPL_NeonLarge_C
// 0x0018 (0x02C0 - 0x02A8)
class ABPL_NeonLarge_C final : public AActor
{
public:
	class UPointLightComponent*                   PointLight;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RectLight;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPL_NeonLarge_C">();
	}
	static class ABPL_NeonLarge_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPL_NeonLarge_C>();
	}
};
static_assert(alignof(ABPL_NeonLarge_C) == 0x000008, "Wrong alignment on ABPL_NeonLarge_C");
static_assert(sizeof(ABPL_NeonLarge_C) == 0x0002C0, "Wrong size on ABPL_NeonLarge_C");
static_assert(offsetof(ABPL_NeonLarge_C, PointLight) == 0x0002A8, "Member 'ABPL_NeonLarge_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABPL_NeonLarge_C, RectLight) == 0x0002B0, "Member 'ABPL_NeonLarge_C::RectLight' has a wrong offset!");
static_assert(offsetof(ABPL_NeonLarge_C, DefaultSceneRoot) == 0x0002B8, "Member 'ABPL_NeonLarge_C::DefaultSceneRoot' has a wrong offset!");

}

