#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_DeskLampBol

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPL_DeskLampBol.BPL_DeskLampBol_C
// 0x0028 (0x02D0 - 0x02A8)
class ABPL_DeskLampBol_C final : public AActor
{
public:
	class UPointLightComponent*                   PointLight;                                        // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   SmoothAmbiant;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    DownLight;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_DeskLamp_02;                                   // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPL_DeskLampBol_C">();
	}
	static class ABPL_DeskLampBol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPL_DeskLampBol_C>();
	}
};
static_assert(alignof(ABPL_DeskLampBol_C) == 0x000008, "Wrong alignment on ABPL_DeskLampBol_C");
static_assert(sizeof(ABPL_DeskLampBol_C) == 0x0002D0, "Wrong size on ABPL_DeskLampBol_C");
static_assert(offsetof(ABPL_DeskLampBol_C, PointLight) == 0x0002A8, "Member 'ABPL_DeskLampBol_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABPL_DeskLampBol_C, SmoothAmbiant) == 0x0002B0, "Member 'ABPL_DeskLampBol_C::SmoothAmbiant' has a wrong offset!");
static_assert(offsetof(ABPL_DeskLampBol_C, DownLight) == 0x0002B8, "Member 'ABPL_DeskLampBol_C::DownLight' has a wrong offset!");
static_assert(offsetof(ABPL_DeskLampBol_C, LGT_DeskLamp_02) == 0x0002C0, "Member 'ABPL_DeskLampBol_C::LGT_DeskLamp_02' has a wrong offset!");
static_assert(offsetof(ABPL_DeskLampBol_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABPL_DeskLampBol_C::DefaultSceneRoot' has a wrong offset!");

}

