#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_StreetBrooklyn

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPL_StreetBrooklyn.BPL_StreetBrooklyn_C
// 0x0028 (0x02D0 - 0x02A8)
class ABPL_StreetBrooklyn_C final : public AActor
{
public:
	class USpotLightComponent*                    SpotLight_Ambience;                                // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_StreetBrooklyn_01;                             // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPL_StreetBrooklyn_C">();
	}
	static class ABPL_StreetBrooklyn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPL_StreetBrooklyn_C>();
	}
};
static_assert(alignof(ABPL_StreetBrooklyn_C) == 0x000008, "Wrong alignment on ABPL_StreetBrooklyn_C");
static_assert(sizeof(ABPL_StreetBrooklyn_C) == 0x0002D0, "Wrong size on ABPL_StreetBrooklyn_C");
static_assert(offsetof(ABPL_StreetBrooklyn_C, SpotLight_Ambience) == 0x0002A8, "Member 'ABPL_StreetBrooklyn_C::SpotLight_Ambience' has a wrong offset!");
static_assert(offsetof(ABPL_StreetBrooklyn_C, SpotLight) == 0x0002B0, "Member 'ABPL_StreetBrooklyn_C::SpotLight' has a wrong offset!");
static_assert(offsetof(ABPL_StreetBrooklyn_C, PointLight) == 0x0002B8, "Member 'ABPL_StreetBrooklyn_C::PointLight' has a wrong offset!");
static_assert(offsetof(ABPL_StreetBrooklyn_C, LGT_StreetBrooklyn_01) == 0x0002C0, "Member 'ABPL_StreetBrooklyn_C::LGT_StreetBrooklyn_01' has a wrong offset!");
static_assert(offsetof(ABPL_StreetBrooklyn_C, DefaultSceneRoot) == 0x0002C8, "Member 'ABPL_StreetBrooklyn_C::DefaultSceneRoot' has a wrong offset!");

}

