#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPL_StripLight_Warm

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BPL_StripLight_Warm.BPL_StripLight_Warm_C
// 0x0020 (0x02C8 - 0x02A8)
class ABPL_StripLight_Warm_C final : public AActor
{
public:
	class URectLightComponent*                    RectLight;                                         // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   SmoothAmbiant;                                     // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_DeskLamp_02;                                   // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPL_StripLight_Warm_C">();
	}
	static class ABPL_StripLight_Warm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABPL_StripLight_Warm_C>();
	}
};
static_assert(alignof(ABPL_StripLight_Warm_C) == 0x000008, "Wrong alignment on ABPL_StripLight_Warm_C");
static_assert(sizeof(ABPL_StripLight_Warm_C) == 0x0002C8, "Wrong size on ABPL_StripLight_Warm_C");
static_assert(offsetof(ABPL_StripLight_Warm_C, RectLight) == 0x0002A8, "Member 'ABPL_StripLight_Warm_C::RectLight' has a wrong offset!");
static_assert(offsetof(ABPL_StripLight_Warm_C, SmoothAmbiant) == 0x0002B0, "Member 'ABPL_StripLight_Warm_C::SmoothAmbiant' has a wrong offset!");
static_assert(offsetof(ABPL_StripLight_Warm_C, LGT_DeskLamp_02) == 0x0002B8, "Member 'ABPL_StripLight_Warm_C::LGT_DeskLamp_02' has a wrong offset!");
static_assert(offsetof(ABPL_StripLight_Warm_C, DefaultSceneRoot) == 0x0002C0, "Member 'ABPL_StripLight_Warm_C::DefaultSceneRoot' has a wrong offset!");

}

