#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_UI_MatchMakingCancel

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BPW_UI_MatchMakingCancel.BPW_UI_MatchMakingCancel_C.ExecuteUbergraph_BPW_UI_MatchMakingCancel
// 0x0020 (0x0020 - 0x0000)
struct BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue_1;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel) == 0x000008, "Wrong alignment on BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel");
static_assert(sizeof(BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel) == 0x000020, "Wrong size on BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel");
static_assert(offsetof(BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel, EntryPoint) == 0x000000, "Member 'BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel, K2Node_Event_bInIsHovered) == 0x000004, "Member 'BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000008, "Member 'BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel, CallFunc_GetVisibility_ReturnValue) == 0x000010, "Member 'BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000011, "Member 'BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel, CallFunc_PlayAnimationTimeRange_ReturnValue_1) == 0x000018, "Member 'BPW_UI_MatchMakingCancel_C_ExecuteUbergraph_BPW_UI_MatchMakingCancel::CallFunc_PlayAnimationTimeRange_ReturnValue_1' has a wrong offset!");

// Function BPW_UI_MatchMakingCancel.BPW_UI_MatchMakingCancel_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct BPW_UI_MatchMakingCancel_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPW_UI_MatchMakingCancel_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on BPW_UI_MatchMakingCancel_C_ButtonHoveredChanged");
static_assert(sizeof(BPW_UI_MatchMakingCancel_C_ButtonHoveredChanged) == 0x000001, "Wrong size on BPW_UI_MatchMakingCancel_C_ButtonHoveredChanged");
static_assert(offsetof(BPW_UI_MatchMakingCancel_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'BPW_UI_MatchMakingCancel_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

}

