#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPW_UI_MatchMakingCancel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BPW_UI_MatchMakingCancel.BPW_UI_MatchMakingCancel_C
// 0x0070 (0x03D0 - 0x0360)
class UBPW_UI_MatchMakingCancel_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Default;                                           // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hovered;                                           // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Cancel_B;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cancel_Bg;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Cancel_Text;                                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Edge_Img;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      HoldButtonAction;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_403;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnHold;                                            // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnRelease;                                         // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          NewVar_0;                                          // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPW_UI_MatchMakingCancel(int32 EntryPoint);
	void BndEvt__BPW_UI_MatchMakingCancel_WBP_UI_Widget_ActionInput_Hold_K2Node_ComponentBoundEvent_0_SBZOnActionChanged__DelegateSignature();
	void BndEvt__BPW_UI_MatchMakingCancel_WBP_UI_Widget_ActionInput_Hold_K2Node_ComponentBoundEvent_1_SBZOnActionChanged__DelegateSignature();
	void ButtonHoveredChanged(bool bInIsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BPW_UI_MatchMakingCancel_C">();
	}
	static class UBPW_UI_MatchMakingCancel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPW_UI_MatchMakingCancel_C>();
	}
};
static_assert(alignof(UBPW_UI_MatchMakingCancel_C) == 0x000008, "Wrong alignment on UBPW_UI_MatchMakingCancel_C");
static_assert(sizeof(UBPW_UI_MatchMakingCancel_C) == 0x0003D0, "Wrong size on UBPW_UI_MatchMakingCancel_C");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, UberGraphFrame) == 0x000360, "Member 'UBPW_UI_MatchMakingCancel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, Default) == 0x000368, "Member 'UBPW_UI_MatchMakingCancel_C::Default' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, Hovered) == 0x000370, "Member 'UBPW_UI_MatchMakingCancel_C::Hovered' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, Cancel_B) == 0x000378, "Member 'UBPW_UI_MatchMakingCancel_C::Cancel_B' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, Cancel_Bg) == 0x000380, "Member 'UBPW_UI_MatchMakingCancel_C::Cancel_Bg' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, Cancel_Text) == 0x000388, "Member 'UBPW_UI_MatchMakingCancel_C::Cancel_Text' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, Edge_Img) == 0x000390, "Member 'UBPW_UI_MatchMakingCancel_C::Edge_Img' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, HoldButtonAction) == 0x000398, "Member 'UBPW_UI_MatchMakingCancel_C::HoldButtonAction' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, Image_403) == 0x0003A0, "Member 'UBPW_UI_MatchMakingCancel_C::Image_403' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, OnHold) == 0x0003A8, "Member 'UBPW_UI_MatchMakingCancel_C::OnHold' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, OnRelease) == 0x0003B8, "Member 'UBPW_UI_MatchMakingCancel_C::OnRelease' has a wrong offset!");
static_assert(offsetof(UBPW_UI_MatchMakingCancel_C, NewVar_0) == 0x0003C8, "Member 'UBPW_UI_MatchMakingCancel_C::NewVar_0' has a wrong offset!");

}

