#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_BaseCivilian

#include "Basic.hpp"


namespace SDK::Params
{

// Function CH_BaseCivilian.CH_BaseCivilian_C.ExecuteUbergraph_CH_BaseCivilian
// 0x0034 (0x0034 - 0x0000)
struct CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_1;             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue_1;              // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue_2;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomInteger_ReturnValue_2;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian) == 0x000004, "Wrong alignment on CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian");
static_assert(sizeof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian) == 0x000034, "Wrong size on CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, EntryPoint) == 0x000000, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_Conv_IntToBool_ReturnValue) == 0x000014, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_Conv_IntToBool_ReturnValue_1) == 0x00001C, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_Conv_IntToBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_RandomInteger_ReturnValue) == 0x000020, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_RandomInteger_ReturnValue_1) == 0x000024, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_RandomInteger_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_Array_Length_ReturnValue_2) == 0x000028, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_Conv_IntToBool_ReturnValue_2) == 0x00002C, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_Conv_IntToBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian, CallFunc_RandomInteger_ReturnValue_2) == 0x000030, "Member 'CH_BaseCivilian_C_ExecuteUbergraph_CH_BaseCivilian::CallFunc_RandomInteger_ReturnValue_2' has a wrong offset!");

}

