#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_Cloaker

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CH_Cloaker.CH_Cloaker_C.ExecuteUbergraph_CH_Cloaker
// 0x0130 (0x0130 - 0x0000)
struct CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0004(0x000C)(NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0020(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0038(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0048(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                K2Node_Event_OldState;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                K2Node_Event_NewState;                             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilityByClass_ReturnValue;    // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable_2;                            // 0x0070(0x0020)(ConstParm)
	class USBZAIActionData_LifeAction*            CallFunc_CreateActionData_ReturnValue;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLifeActionManager*                  CallFunc_Get_ReturnValue;                          // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZAIAction*                           CallFunc_PushAction_ReturnValue;                   // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x00B4(0x000C)(NoDestructor, HasGetValueTypeHash)
	const class USBZLifeActionSlot*               CallFunc_GetClosestLifeActionMatchingTagAny_ReturnValue; // 0x00C0(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZLifeActionRequest                  K2Node_MakeStruct_SBZLifeActionRequest;            // 0x00C8(0x0040)(NoDestructor, ContainsInstancedReference)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APD3HeistGameState*                     K2Node_DynamicCast_AsPD3Heist_Game_State;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker) == 0x000008, "Wrong alignment on CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker");
static_assert(sizeof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker) == 0x000130, "Wrong size on CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, EntryPoint) == 0x000000, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000004, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, Temp_struct_Variable) == 0x000010, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, Temp_delegate_Variable) == 0x000020, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, Temp_struct_Variable_1) == 0x000038, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, Temp_delegate_Variable_1) == 0x000048, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_HasAuthority_ReturnValue) == 0x00005C, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x00005D, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000060, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, K2Node_Event_OldState) == 0x000068, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, K2Node_Event_NewState) == 0x000069, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_TryActivateAbilityByClass_ReturnValue) == 0x00006A, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_TryActivateAbilityByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, K2Node_SwitchEnum_CmpSuccess) == 0x00006B, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, Temp_struct_Variable_2) == 0x000070, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_CreateActionData_ReturnValue) == 0x000090, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_CreateActionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_Get_ReturnValue) == 0x000098, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_PushAction_ReturnValue) == 0x0000A0, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_PushAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000A8, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x0000B4, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_GetClosestLifeActionMatchingTagAny_ReturnValue) == 0x0000C0, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_GetClosestLifeActionMatchingTagAny_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, K2Node_MakeStruct_SBZLifeActionRequest) == 0x0000C8, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::K2Node_MakeStruct_SBZLifeActionRequest' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_GetGameState_ReturnValue) == 0x000108, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, K2Node_DynamicCast_AsPD3Heist_Game_State) == 0x000110, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::K2Node_DynamicCast_AsPD3Heist_Game_State' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_PostAkEvent_ReturnValue) == 0x00011C, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000120, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_PostAkEvent_ReturnValue_1) == 0x000124, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_IsDedicatedServer_ReturnValue) == 0x000128, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x000129, "Member 'CH_Cloaker_C_ExecuteUbergraph_CH_Cloaker::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function CH_Cloaker.CH_Cloaker_C.BP_OnHeistStateChanged
// 0x0002 (0x0002 - 0x0000)
struct CH_Cloaker_C_BP_OnHeistStateChanged final
{
public:
	EPD3HeistState                                OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_Cloaker_C_BP_OnHeistStateChanged) == 0x000001, "Wrong alignment on CH_Cloaker_C_BP_OnHeistStateChanged");
static_assert(sizeof(CH_Cloaker_C_BP_OnHeistStateChanged) == 0x000002, "Wrong size on CH_Cloaker_C_BP_OnHeistStateChanged");
static_assert(offsetof(CH_Cloaker_C_BP_OnHeistStateChanged, OldState) == 0x000000, "Member 'CH_Cloaker_C_BP_OnHeistStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(CH_Cloaker_C_BP_OnHeistStateChanged, NewState) == 0x000001, "Member 'CH_Cloaker_C_BP_OnHeistStateChanged::NewState' has a wrong offset!");

}

