#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_Dozer

#include "Basic.hpp"

#include "CH_BaseCop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_Dozer.CH_Dozer_C
// 0x0020 (0x1CC0 - 0x1CA0)
class ACH_Dozer_C final : public ACH_BaseCop_C
{
public:
	class USphereComponent*                       Sphere_1;                                          // 0x1CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZDozerFacePlate*                     FacePlate;                                         // 0x1CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x1CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZTankAIComponent*                    SBZTankAI;                                         // 0x1CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_Dozer_C">();
	}
	static class ACH_Dozer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACH_Dozer_C>();
	}
};
static_assert(alignof(ACH_Dozer_C) == 0x000010, "Wrong alignment on ACH_Dozer_C");
static_assert(sizeof(ACH_Dozer_C) == 0x001CC0, "Wrong size on ACH_Dozer_C");
static_assert(offsetof(ACH_Dozer_C, Sphere_1) == 0x001CA0, "Member 'ACH_Dozer_C::Sphere_1' has a wrong offset!");
static_assert(offsetof(ACH_Dozer_C, FacePlate) == 0x001CA8, "Member 'ACH_Dozer_C::FacePlate' has a wrong offset!");
static_assert(offsetof(ACH_Dozer_C, Sphere) == 0x001CB0, "Member 'ACH_Dozer_C::Sphere' has a wrong offset!");
static_assert(offsetof(ACH_Dozer_C, SBZTankAI) == 0x001CB8, "Member 'ACH_Dozer_C::SBZTankAI' has a wrong offset!");

}

