#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_SecurityGuard

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CH_SecurityGuard.CH_SecurityGuard_C.ExecuteUbergraph_CH_SecurityGuard
// 0x00A8 (0x00A8 - 0x0000)
struct CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPD3HeistState                                K2Node_Event_OldState;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                K2Node_Event_NewState;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSeed_ReturnValue;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          CallFunc_GetMixedRandomStream_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APD3HeistGameState*                     K2Node_DynamicCast_AsPD3Heist_Game_State;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZAIActionData_Surrender*             CallFunc_CreateActionData_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZAIAction*                           CallFunc_PushAction_ReturnValue;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B[0x5];                                       // 0x005B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0060(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0070(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0088(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard) == 0x000008, "Wrong alignment on CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard");
static_assert(sizeof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard) == 0x0000A8, "Wrong size on CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, EntryPoint) == 0x000000, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_IsDedicatedServer_ReturnValue) == 0x000004, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, Temp_bool_IsClosed_Variable) == 0x000006, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_HasAuthority_ReturnValue) == 0x000007, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, K2Node_Event_OldState) == 0x000008, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, K2Node_Event_NewState) == 0x000009, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, K2Node_SwitchEnum_CmpSuccess) == 0x00000A, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_GetSeed_ReturnValue) == 0x00000C, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_GetSeed_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_GetMixedRandomStream_ReturnValue) == 0x000010, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_GetMixedRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, Temp_delegate_Variable) == 0x000018, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x00002C, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_GetGameState_ReturnValue) == 0x000030, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, K2Node_DynamicCast_AsPD3Heist_Game_State) == 0x000038, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::K2Node_DynamicCast_AsPD3Heist_Game_State' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_HasAuthority_ReturnValue_1) == 0x000041, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_CreateActionData_ReturnValue) == 0x000048, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_CreateActionData_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_PushAction_ReturnValue) == 0x000050, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_PushAction_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_MakeLiteralByte_ReturnValue) == 0x000058, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000059, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x00005A, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, Temp_struct_Variable) == 0x000060, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, Temp_delegate_Variable_1) == 0x000070, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, Temp_struct_Variable_1) == 0x000088, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_PostAkEvent_ReturnValue) == 0x000098, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_PostAkEvent_ReturnValue_1) == 0x00009C, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000A0, "Member 'CH_SecurityGuard_C_ExecuteUbergraph_CH_SecurityGuard::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");

// Function CH_SecurityGuard.CH_SecurityGuard_C.BP_OnHeistStateChanged
// 0x0002 (0x0002 - 0x0000)
struct CH_SecurityGuard_C_BP_OnHeistStateChanged final
{
public:
	EPD3HeistState                                OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SecurityGuard_C_BP_OnHeistStateChanged) == 0x000001, "Wrong alignment on CH_SecurityGuard_C_BP_OnHeistStateChanged");
static_assert(sizeof(CH_SecurityGuard_C_BP_OnHeistStateChanged) == 0x000002, "Wrong size on CH_SecurityGuard_C_BP_OnHeistStateChanged");
static_assert(offsetof(CH_SecurityGuard_C_BP_OnHeistStateChanged, OldState) == 0x000000, "Member 'CH_SecurityGuard_C_BP_OnHeistStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(CH_SecurityGuard_C_BP_OnHeistStateChanged, NewState) == 0x000001, "Member 'CH_SecurityGuard_C_BP_OnHeistStateChanged::NewState' has a wrong offset!");

}

