#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_SWAT_SHIELD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CH_BaseCop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_SWAT_SHIELD.CH_SWAT_SHIELD_C
// 0x0040 (0x1CE0 - 0x1CA0)
class ACH_SWAT_SHIELD_C final : public ACH_BaseCop_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      Niagara;                                           // 0x1CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LightMesh;                                         // 0x1CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAIShieldSpecialComponent*           SBZAIShieldSpecial;                                // 0x1CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZRandomNoiseComponent*               SBZRandomNoise;                                    // 0x1CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   ShieldVisor;                                       // 0x1CC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAIShield*                           SBZAIShield;                                       // 0x1CD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Helmet;                                            // 0x1CD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CH_SWAT_SHIELD(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_SWAT_SHIELD_C">();
	}
	static class ACH_SWAT_SHIELD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACH_SWAT_SHIELD_C>();
	}
};
static_assert(alignof(ACH_SWAT_SHIELD_C) == 0x000010, "Wrong alignment on ACH_SWAT_SHIELD_C");
static_assert(sizeof(ACH_SWAT_SHIELD_C) == 0x001CE0, "Wrong size on ACH_SWAT_SHIELD_C");
static_assert(offsetof(ACH_SWAT_SHIELD_C, UberGraphFrame) == 0x001CA0, "Member 'ACH_SWAT_SHIELD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACH_SWAT_SHIELD_C, Niagara) == 0x001CA8, "Member 'ACH_SWAT_SHIELD_C::Niagara' has a wrong offset!");
static_assert(offsetof(ACH_SWAT_SHIELD_C, LightMesh) == 0x001CB0, "Member 'ACH_SWAT_SHIELD_C::LightMesh' has a wrong offset!");
static_assert(offsetof(ACH_SWAT_SHIELD_C, SBZAIShieldSpecial) == 0x001CB8, "Member 'ACH_SWAT_SHIELD_C::SBZAIShieldSpecial' has a wrong offset!");
static_assert(offsetof(ACH_SWAT_SHIELD_C, SBZRandomNoise) == 0x001CC0, "Member 'ACH_SWAT_SHIELD_C::SBZRandomNoise' has a wrong offset!");
static_assert(offsetof(ACH_SWAT_SHIELD_C, ShieldVisor) == 0x001CC8, "Member 'ACH_SWAT_SHIELD_C::ShieldVisor' has a wrong offset!");
static_assert(offsetof(ACH_SWAT_SHIELD_C, SBZAIShield) == 0x001CD0, "Member 'ACH_SWAT_SHIELD_C::SBZAIShield' has a wrong offset!");
static_assert(offsetof(ACH_SWAT_SHIELD_C, Helmet) == 0x001CD8, "Member 'ACH_SWAT_SHIELD_C::Helmet' has a wrong offset!");

}

