#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_SWAT_SHIELD

#include "Basic.hpp"


namespace SDK::Params
{

// Function CH_SWAT_SHIELD.CH_SWAT_SHIELD_C.ExecuteUbergraph_CH_SWAT_SHIELD
// 0x0010 (0x0010 - 0x0000)
struct CH_SWAT_SHIELD_C_ExecuteUbergraph_CH_SWAT_SHIELD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SWAT_SHIELD_C_ExecuteUbergraph_CH_SWAT_SHIELD) == 0x000008, "Wrong alignment on CH_SWAT_SHIELD_C_ExecuteUbergraph_CH_SWAT_SHIELD");
static_assert(sizeof(CH_SWAT_SHIELD_C_ExecuteUbergraph_CH_SWAT_SHIELD) == 0x000010, "Wrong size on CH_SWAT_SHIELD_C_ExecuteUbergraph_CH_SWAT_SHIELD");
static_assert(offsetof(CH_SWAT_SHIELD_C_ExecuteUbergraph_CH_SWAT_SHIELD, EntryPoint) == 0x000000, "Member 'CH_SWAT_SHIELD_C_ExecuteUbergraph_CH_SWAT_SHIELD::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_SWAT_SHIELD_C_ExecuteUbergraph_CH_SWAT_SHIELD, K2Node_Event_OtherActor) == 0x000008, "Member 'CH_SWAT_SHIELD_C_ExecuteUbergraph_CH_SWAT_SHIELD::K2Node_Event_OtherActor' has a wrong offset!");

// Function CH_SWAT_SHIELD.CH_SWAT_SHIELD_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct CH_SWAT_SHIELD_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_SWAT_SHIELD_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on CH_SWAT_SHIELD_C_ReceiveActorBeginOverlap");
static_assert(sizeof(CH_SWAT_SHIELD_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on CH_SWAT_SHIELD_C_ReceiveActorBeginOverlap");
static_assert(offsetof(CH_SWAT_SHIELD_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'CH_SWAT_SHIELD_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

