#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_SecurityGuard

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CH_BaseCop_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_SecurityGuard.CH_SecurityGuard_C
// 0x0050 (0x1CF0 - 0x1CA0)
class ACH_SecurityGuard_C : public ACH_BaseCop_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1CA0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZShoutTargetComponent*               SBZShoutTarget;                                    // 0x1CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        AttachPoint;                                       // 0x1CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USBZAIStimuliReactionComponent*         SBZAIStimuliReaction;                              // 0x1CB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FFloatRange                            SurrenderDelayRange;                               // 0x1CC0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  SurrenderTagContainer;                             // 0x1CD0(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CH_SecurityGuard(int32 EntryPoint);
	void BP_OnKill();
	void BP_OnHeistStateChanged(EPD3HeistState OldState, EPD3HeistState NewState);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_SecurityGuard_C">();
	}
	static class ACH_SecurityGuard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACH_SecurityGuard_C>();
	}
};
static_assert(alignof(ACH_SecurityGuard_C) == 0x000010, "Wrong alignment on ACH_SecurityGuard_C");
static_assert(sizeof(ACH_SecurityGuard_C) == 0x001CF0, "Wrong size on ACH_SecurityGuard_C");
static_assert(offsetof(ACH_SecurityGuard_C, UberGraphFrame) == 0x001CA0, "Member 'ACH_SecurityGuard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACH_SecurityGuard_C, SBZShoutTarget) == 0x001CA8, "Member 'ACH_SecurityGuard_C::SBZShoutTarget' has a wrong offset!");
static_assert(offsetof(ACH_SecurityGuard_C, AttachPoint) == 0x001CB0, "Member 'ACH_SecurityGuard_C::AttachPoint' has a wrong offset!");
static_assert(offsetof(ACH_SecurityGuard_C, SBZAIStimuliReaction) == 0x001CB8, "Member 'ACH_SecurityGuard_C::SBZAIStimuliReaction' has a wrong offset!");
static_assert(offsetof(ACH_SecurityGuard_C, SurrenderDelayRange) == 0x001CC0, "Member 'ACH_SecurityGuard_C::SurrenderDelayRange' has a wrong offset!");
static_assert(offsetof(ACH_SecurityGuard_C, SurrenderTagContainer) == 0x001CD0, "Member 'ACH_SecurityGuard_C::SurrenderTagContainer' has a wrong offset!");

}

