#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_Taser

#include "Basic.hpp"

#include "CH_BaseCop_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_Taser.CH_Taser_C
// 0x0020 (0x1CC0 - 0x1CA0)
class ACH_Taser_C final : public ACH_BaseCop_C
{
public:
	class USBZAITaserSpecialComponent*            SBZAITaserSpecial;                                 // 0x1CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAITaserBattery_C*                      AITaserBattery;                                    // 0x1CA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Helmet;                                            // 0x1CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CH_Taser_C">();
	}
	static class ACH_Taser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACH_Taser_C>();
	}
};
static_assert(alignof(ACH_Taser_C) == 0x000010, "Wrong alignment on ACH_Taser_C");
static_assert(sizeof(ACH_Taser_C) == 0x001CC0, "Wrong size on ACH_Taser_C");
static_assert(offsetof(ACH_Taser_C, SBZAITaserSpecial) == 0x001CA0, "Member 'ACH_Taser_C::SBZAITaserSpecial' has a wrong offset!");
static_assert(offsetof(ACH_Taser_C, AITaserBattery) == 0x001CA8, "Member 'ACH_Taser_C::AITaserBattery' has a wrong offset!");
static_assert(offsetof(ACH_Taser_C, Helmet) == 0x001CB0, "Member 'ACH_Taser_C::Helmet' has a wrong offset!");

}

