#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_Tower

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function CH_Tower.CH_Tower_C.ExecuteUbergraph_CH_Tower
// 0x0060 (0x0060 - 0x0000)
struct CH_Tower_C_ExecuteUbergraph_CH_Tower final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable; // 0x0018(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          Temp_struct_Variable_1;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1; // 0x0040(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	int32                                         CallFunc_PostAkEvent_ReturnValue;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostAkEvent_ReturnValue_1;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CH_Tower_C_ExecuteUbergraph_CH_Tower) == 0x000008, "Wrong alignment on CH_Tower_C_ExecuteUbergraph_CH_Tower");
static_assert(sizeof(CH_Tower_C_ExecuteUbergraph_CH_Tower) == 0x000060, "Wrong size on CH_Tower_C_ExecuteUbergraph_CH_Tower");
static_assert(offsetof(CH_Tower_C_ExecuteUbergraph_CH_Tower, EntryPoint) == 0x000000, "Member 'CH_Tower_C_ExecuteUbergraph_CH_Tower::EntryPoint' has a wrong offset!");
static_assert(offsetof(CH_Tower_C_ExecuteUbergraph_CH_Tower, Temp_struct_Variable) == 0x000008, "Member 'CH_Tower_C_ExecuteUbergraph_CH_Tower::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(CH_Tower_C_ExecuteUbergraph_CH_Tower, Temp_delegate_Variable) == 0x000018, "Member 'CH_Tower_C_ExecuteUbergraph_CH_Tower::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(CH_Tower_C_ExecuteUbergraph_CH_Tower, Temp_struct_Variable_1) == 0x000030, "Member 'CH_Tower_C_ExecuteUbergraph_CH_Tower::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CH_Tower_C_ExecuteUbergraph_CH_Tower, Temp_delegate_Variable_1) == 0x000040, "Member 'CH_Tower_C_ExecuteUbergraph_CH_Tower::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(CH_Tower_C_ExecuteUbergraph_CH_Tower, CallFunc_PostAkEvent_ReturnValue) == 0x000054, "Member 'CH_Tower_C_ExecuteUbergraph_CH_Tower::CallFunc_PostAkEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CH_Tower_C_ExecuteUbergraph_CH_Tower, CallFunc_PostAkEvent_ReturnValue_1) == 0x000058, "Member 'CH_Tower_C_ExecuteUbergraph_CH_Tower::CallFunc_PostAkEvent_ReturnValue_1' has a wrong offset!");

}

