#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: COHeistObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MoreHeistAtmoVarObjectHeist_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass COHeistObject.COHeistObject_C
// 0x0018 (0x0320 - 0x0308)
class ACOHeistObject_C final : public AMoreHeistAtmoVarObjectHeist_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_COHeistObject_C;                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ADirectionalLight*                      DirectionalLight;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DirLightTargetValue;                               // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_COHeistObject(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void TimeSet(const struct FTimeSettings& TimeSettings);
	void ReceiveBeginPlay();
	void TickExec_5A804B9A40075C68EF18C68E8ABE4DD1(const class UDelegateTimer* Timer, float ElapsedTime, float TimeSinceLast);
	void SetLights(class AActor* Actor, float Temperature, float Intensity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"COHeistObject_C">();
	}
	static class ACOHeistObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACOHeistObject_C>();
	}
};
static_assert(alignof(ACOHeistObject_C) == 0x000008, "Wrong alignment on ACOHeistObject_C");
static_assert(sizeof(ACOHeistObject_C) == 0x000320, "Wrong size on ACOHeistObject_C");
static_assert(offsetof(ACOHeistObject_C, UberGraphFrame_COHeistObject_C) == 0x000308, "Member 'ACOHeistObject_C::UberGraphFrame_COHeistObject_C' has a wrong offset!");
static_assert(offsetof(ACOHeistObject_C, DirectionalLight) == 0x000310, "Member 'ACOHeistObject_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(ACOHeistObject_C, DirLightTargetValue) == 0x000318, "Member 'ACOHeistObject_C::DirLightTargetValue' has a wrong offset!");

}

