#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_FP_Player

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "ControlRig_classes.hpp"


namespace SDK
{

// ControlRigBlueprintGeneratedClass CR_FP_Player.CR_FP_Player_C
// 0x0068 (0x06C8 - 0x0660)
class UCR_FP_Player_C final : public UControlRig
{
public:
	struct FSBZTankingData                        TankingData;                                       // 0x0660(0x0024)(Edit, BlueprintVisible, NoDestructor)
	struct FSBZWallReactionData                   WallReactionData;                                  // 0x0684(0x0040)(Edit, BlueprintVisible, NoDestructor)
	float                                         NewVar_0;                                          // 0x06C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CR_FP_Player_C">();
	}
	static class UCR_FP_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_FP_Player_C>();
	}
};
static_assert(alignof(UCR_FP_Player_C) == 0x000008, "Wrong alignment on UCR_FP_Player_C");
static_assert(sizeof(UCR_FP_Player_C) == 0x0006C8, "Wrong size on UCR_FP_Player_C");
static_assert(offsetof(UCR_FP_Player_C, TankingData) == 0x000660, "Member 'UCR_FP_Player_C::TankingData' has a wrong offset!");
static_assert(offsetof(UCR_FP_Player_C, WallReactionData) == 0x000684, "Member 'UCR_FP_Player_C::WallReactionData' has a wrong offset!");
static_assert(offsetof(UCR_FP_Player_C, NewVar_0) == 0x0006C4, "Member 'UCR_FP_Player_C::NewVar_0' has a wrong offset!");

}

