#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DEPRECATED_BP_DynamicSky

#include "Basic.hpp"


namespace SDK::Params
{

// Function DEPRECATED_BP_DynamicSky.DEPRECATED_BP_DynamicSky_C.UserConstructionScript
// 0x0028 (0x0028 - 0x0000)
struct DEPRECATED_BP_DynamicSky_C_UserConstructionScript final
{
public:
	class ADirectionalLight*                      CallFunc_GetActorOfClass_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue_1;           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DEPRECATED_BP_DynamicSky_C_UserConstructionScript) == 0x000008, "Wrong alignment on DEPRECATED_BP_DynamicSky_C_UserConstructionScript");
static_assert(sizeof(DEPRECATED_BP_DynamicSky_C_UserConstructionScript) == 0x000028, "Wrong size on DEPRECATED_BP_DynamicSky_C_UserConstructionScript");
static_assert(offsetof(DEPRECATED_BP_DynamicSky_C_UserConstructionScript, CallFunc_GetActorOfClass_ReturnValue) == 0x000000, "Member 'DEPRECATED_BP_DynamicSky_C_UserConstructionScript::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEPRECATED_BP_DynamicSky_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'DEPRECATED_BP_DynamicSky_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEPRECATED_BP_DynamicSky_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00000C, "Member 'DEPRECATED_BP_DynamicSky_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEPRECATED_BP_DynamicSky_C_UserConstructionScript, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000010, "Member 'DEPRECATED_BP_DynamicSky_C_UserConstructionScript::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DEPRECATED_BP_DynamicSky_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000014, "Member 'DEPRECATED_BP_DynamicSky_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DEPRECATED_BP_DynamicSky_C_UserConstructionScript, CallFunc_Conv_BoolToFloat_ReturnValue_1) == 0x000018, "Member 'DEPRECATED_BP_DynamicSky_C_UserConstructionScript::CallFunc_Conv_BoolToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DEPRECATED_BP_DynamicSky_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000020, "Member 'DEPRECATED_BP_DynamicSky_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

