#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiaDistHeistObject

#include "Basic.hpp"

#include "TimeSettings_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function DiaDistHeistObject.DiaDistHeistObject_C.ExecuteUbergraph_DiaDistHeistObject
// 0x0CA0 (0x0CA0 - 0x0000)
struct DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelegateTimer*                         CallFunc_CreateDelegateTimer_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FTimeSettings& TimeSettings)> K2Node_CreateDelegate_OutputDelegate;  // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelegateTimer*                         Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExponentialHeightFog*                  CallFunc_GetActorOfClass_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0050(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AExponentialHeightFog*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable_1;                             // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASkyAtmosphere*                         CallFunc_GetActorOfClass_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASkyAtmosphere*                         CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDelegateTimer*                   K2Node_CustomEvent_Timer;                          // 0x00F8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedTime;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSinceLast;                  // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_108[0x8];                                      // 0x0108(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSettings                          K2Node_CustomEvent_TimeSettings;                   // 0x0110(0x05B0)(HasGetValueTypeHash)
	TDelegate<void(const class UDelegateTimer* Timer, float ElapsedTime, float TimeSinceLast)> K2Node_CreateDelegate_OutputDelegate_1; // 0x06C0(0x0014)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x06D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC[0x4];                                      // 0x06DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADirectionalLight*                      CallFunc_GetActorOfClass_ReturnValue_2;            // 0x06E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x06E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6EA[0x6];                                      // 0x06EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSettings                          CallFunc_GetRowOfTimeType_Settings;                // 0x06F0(0x05B0)(HasGetValueTypeHash)
};
static_assert(alignof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject) == 0x000010, "Wrong alignment on DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject");
static_assert(sizeof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject) == 0x000CA0, "Wrong size on DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, EntryPoint) == 0x000000, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_CreateDelegateTimer_ReturnValue) == 0x000008, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_CreateDelegateTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_IsValid_ReturnValue) == 0x000024, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, Temp_object_Variable) == 0x000028, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000030, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_Multiply_IntInt_ReturnValue) == 0x000034, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003C, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000040, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, Temp_float_Variable) == 0x000044, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_GetActorOfClass_ReturnValue) == 0x000048, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_MakeTransform_ReturnValue) == 0x000050, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000080, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000090, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000091, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, Temp_float_Variable_1) == 0x000094, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_BooleanAND_ReturnValue) == 0x000098, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_Not_PreBool_ReturnValue) == 0x000099, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_GetActorOfClass_ReturnValue_1) == 0x0000A0, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_MakeTransform_ReturnValue_1) == 0x0000B0, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000E0, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000E8, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0000F0, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0000F1, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, K2Node_CustomEvent_Timer) == 0x0000F8, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::K2Node_CustomEvent_Timer' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, K2Node_CustomEvent_ElapsedTime) == 0x000100, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::K2Node_CustomEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, K2Node_CustomEvent_TimeSinceLast) == 0x000104, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::K2Node_CustomEvent_TimeSinceLast' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, K2Node_CustomEvent_TimeSettings) == 0x000110, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::K2Node_CustomEvent_TimeSettings' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, K2Node_CreateDelegate_OutputDelegate_1) == 0x0006C0, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, K2Node_Event_DeltaSeconds) == 0x0006D4, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_Lerp_ReturnValue) == 0x0006D8, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_GetActorOfClass_ReturnValue_2) == 0x0006E0, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_GetActorOfClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x0006E8, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x0006E9, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject, CallFunc_GetRowOfTimeType_Settings) == 0x0006F0, "Member 'DiaDistHeistObject_C_ExecuteUbergraph_DiaDistHeistObject::CallFunc_GetRowOfTimeType_Settings' has a wrong offset!");

// Function DiaDistHeistObject.DiaDistHeistObject_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct DiaDistHeistObject_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiaDistHeistObject_C_ReceiveTick) == 0x000004, "Wrong alignment on DiaDistHeistObject_C_ReceiveTick");
static_assert(sizeof(DiaDistHeistObject_C_ReceiveTick) == 0x000004, "Wrong size on DiaDistHeistObject_C_ReceiveTick");
static_assert(offsetof(DiaDistHeistObject_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'DiaDistHeistObject_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function DiaDistHeistObject.DiaDistHeistObject_C.Time
// 0x05B0 (0x05B0 - 0x0000)
struct DiaDistHeistObject_C_Time final
{
public:
	struct FTimeSettings                          TimeSettings;                                      // 0x0000(0x05B0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(DiaDistHeistObject_C_Time) == 0x000010, "Wrong alignment on DiaDistHeistObject_C_Time");
static_assert(sizeof(DiaDistHeistObject_C_Time) == 0x0005B0, "Wrong size on DiaDistHeistObject_C_Time");
static_assert(offsetof(DiaDistHeistObject_C_Time, TimeSettings) == 0x000000, "Member 'DiaDistHeistObject_C_Time::TimeSettings' has a wrong offset!");

// Function DiaDistHeistObject.DiaDistHeistObject_C.TickExec_1F58A76B44B48DA75304DCB8F0E1FC23
// 0x0010 (0x0010 - 0x0000)
struct DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23 final
{
public:
	const class UDelegateTimer*                   Timer;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeSinceLast;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23) == 0x000008, "Wrong alignment on DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23");
static_assert(sizeof(DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23) == 0x000010, "Wrong size on DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23");
static_assert(offsetof(DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23, Timer) == 0x000000, "Member 'DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23::Timer' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23, ElapsedTime) == 0x000008, "Member 'DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23::ElapsedTime' has a wrong offset!");
static_assert(offsetof(DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23, TimeSinceLast) == 0x00000C, "Member 'DiaDistHeistObject_C_TickExec_1F58A76B44B48DA75304DCB8F0E1FC23::TimeSinceLast' has a wrong offset!");

}

