#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fourx4_minigame_Struct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct 4x4_minigame_Struct.4x4_minigame_Struct
// 0x0030 (0x0030 - 0x0000)
struct FFourx4_minigame_Struct final
{
public:
	TArray<float>                                 Start_3_5C65C01D42ADCFC86665D19A2EBDF8AE;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 End_5_612F2B3C4451E5BE63302BBDA4056B91;            // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture*>                       Shapes_9_275A07244DA2827E65818D899C56DF04;         // 0x0020(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FFourx4_minigame_Struct) == 0x000008, "Wrong alignment on FFourx4_minigame_Struct");
static_assert(sizeof(FFourx4_minigame_Struct) == 0x000030, "Wrong size on FFourx4_minigame_Struct");
static_assert(offsetof(FFourx4_minigame_Struct, Start_3_5C65C01D42ADCFC86665D19A2EBDF8AE) == 0x000000, "Member 'FFourx4_minigame_Struct::Start_3_5C65C01D42ADCFC86665D19A2EBDF8AE' has a wrong offset!");
static_assert(offsetof(FFourx4_minigame_Struct, End_5_612F2B3C4451E5BE63302BBDA4056B91) == 0x000010, "Member 'FFourx4_minigame_Struct::End_5_612F2B3C4451E5BE63302BBDA4056B91' has a wrong offset!");
static_assert(offsetof(FFourx4_minigame_Struct, Shapes_9_275A07244DA2827E65818D899C56DF04) == 0x000020, "Member 'FFourx4_minigame_Struct::Shapes_9_275A07244DA2827E65818D899C56DF04' has a wrong offset!");

}

