#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWBHeistObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MoreHeistAtmoVarObjectHeist_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FWBHeistObject.FWBHeistObject_C
// 0x0018 (0x0320 - 0x0308)
class AFWBHeistObject_C final : public AMoreHeistAtmoVarObjectHeist_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_FWBHeistObject_C;                   // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ADirectionalLight*                      DirectionalLight;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DirLightTargetValue;                               // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FWBHeistObject(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void TimeSet(const struct FTimeSettings& TimeSettings);
	void ReceiveBeginPlay();
	void TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C(const class UDelegateTimer* Timer, float ElapsedTime, float TimeSinceLast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FWBHeistObject_C">();
	}
	static class AFWBHeistObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFWBHeistObject_C>();
	}
};
static_assert(alignof(AFWBHeistObject_C) == 0x000008, "Wrong alignment on AFWBHeistObject_C");
static_assert(sizeof(AFWBHeistObject_C) == 0x000320, "Wrong size on AFWBHeistObject_C");
static_assert(offsetof(AFWBHeistObject_C, UberGraphFrame_FWBHeistObject_C) == 0x000308, "Member 'AFWBHeistObject_C::UberGraphFrame_FWBHeistObject_C' has a wrong offset!");
static_assert(offsetof(AFWBHeistObject_C, DirectionalLight) == 0x000310, "Member 'AFWBHeistObject_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(AFWBHeistObject_C, DirLightTargetValue) == 0x000318, "Member 'AFWBHeistObject_C::DirLightTargetValue' has a wrong offset!");

}

