#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FWBHeistObject

#include "Basic.hpp"

#include "TimeSettings_structs.hpp"


namespace SDK::Params
{

// Function FWBHeistObject.FWBHeistObject_C.ExecuteUbergraph_FWBHeistObject
// 0x0690 (0x0690 - 0x0000)
struct FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDelegateTimer*                   K2Node_CustomEvent_Timer;                          // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedTime;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSinceLast;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDelegateTimer*                         Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDelegateTimer*                         CallFunc_CreateDelegateTimer_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UDelegateTimer* Timer, float ElapsedTime, float TimeSinceLast)> K2Node_CreateDelegate_OutputDelegate; // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0xC];                                       // 0x0054(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSettings                          K2Node_CustomEvent_TimeSettings;                   // 0x0060(0x05B0)(HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0610(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0614(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0618(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0624(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_625[0x3];                                      // 0x0625(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ADirectionalLight*                      CallFunc_GetActorOfClass_ReturnValue;              // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0630(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0634(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0635(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_636[0x2];                                      // 0x0636(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AStaticMeshActor*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0638(0x0010)(ReferenceParm)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0658(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x066C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x066D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66E[0x2];                                      // 0x066E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FTimeSettings& TimeSettings)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0670(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject) == 0x000010, "Wrong alignment on FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject");
static_assert(sizeof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject) == 0x000690, "Wrong size on FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, EntryPoint) == 0x000000, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, K2Node_CustomEvent_Timer) == 0x000008, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::K2Node_CustomEvent_Timer' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, K2Node_CustomEvent_ElapsedTime) == 0x000010, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::K2Node_CustomEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, K2Node_CustomEvent_TimeSinceLast) == 0x000014, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::K2Node_CustomEvent_TimeSinceLast' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, Temp_float_Variable) == 0x000018, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, Temp_float_Variable_1) == 0x00001C, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, Temp_object_Variable) == 0x000020, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_CreateDelegateTimer_ReturnValue) == 0x000028, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_CreateDelegateTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, Temp_int_Array_Index_Variable) == 0x000034, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, K2Node_CustomEvent_TimeSettings) == 0x000060, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::K2Node_CustomEvent_TimeSettings' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, K2Node_Event_DeltaSeconds) == 0x000610, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000614, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000618, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_Multiply_IntInt_ReturnValue) == 0x00061C, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_Multiply_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000620, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000624, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_GetActorOfClass_ReturnValue) == 0x000628, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_Lerp_ReturnValue) == 0x000630, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000634, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000635, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_GetAllActorsOfClass_OutActors) == 0x000638, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_BooleanOR_ReturnValue) == 0x000648, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_Array_Get_Item) == 0x000650, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_GetDisplayName_ReturnValue) == 0x000658, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_Array_Length_ReturnValue) == 0x000668, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_Contains_ReturnValue) == 0x00066C, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, CallFunc_Less_IntInt_ReturnValue) == 0x00066D, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject, K2Node_CreateDelegate_OutputDelegate_1) == 0x000670, "Member 'FWBHeistObject_C_ExecuteUbergraph_FWBHeistObject::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

// Function FWBHeistObject.FWBHeistObject_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct FWBHeistObject_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FWBHeistObject_C_ReceiveTick) == 0x000004, "Wrong alignment on FWBHeistObject_C_ReceiveTick");
static_assert(sizeof(FWBHeistObject_C_ReceiveTick) == 0x000004, "Wrong size on FWBHeistObject_C_ReceiveTick");
static_assert(offsetof(FWBHeistObject_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'FWBHeistObject_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function FWBHeistObject.FWBHeistObject_C.TimeSet
// 0x05B0 (0x05B0 - 0x0000)
struct FWBHeistObject_C_TimeSet final
{
public:
	struct FTimeSettings                          TimeSettings;                                      // 0x0000(0x05B0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(FWBHeistObject_C_TimeSet) == 0x000010, "Wrong alignment on FWBHeistObject_C_TimeSet");
static_assert(sizeof(FWBHeistObject_C_TimeSet) == 0x0005B0, "Wrong size on FWBHeistObject_C_TimeSet");
static_assert(offsetof(FWBHeistObject_C_TimeSet, TimeSettings) == 0x000000, "Member 'FWBHeistObject_C_TimeSet::TimeSettings' has a wrong offset!");

// Function FWBHeistObject.FWBHeistObject_C.TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C
// 0x0010 (0x0010 - 0x0000)
struct FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C final
{
public:
	const class UDelegateTimer*                   Timer;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeSinceLast;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C) == 0x000008, "Wrong alignment on FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C");
static_assert(sizeof(FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C) == 0x000010, "Wrong size on FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C");
static_assert(offsetof(FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C, Timer) == 0x000000, "Member 'FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C::Timer' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C, ElapsedTime) == 0x000008, "Member 'FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C::ElapsedTime' has a wrong offset!");
static_assert(offsetof(FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C, TimeSinceLast) == 0x00000C, "Member 'FWBHeistObject_C_TickExec_6A5DCE364D6E6D6D99FDA2A5127BF13C::TimeSinceLast' has a wrong offset!");

}

