#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: G_NightClub_LivingWorld

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function G_NightClub_LivingWorld.G_NightClub_LivingWorld_C.ExecuteUbergraph_G_NightClub_LivingWorld
// 0x0278 (0x0278 - 0x0000)
struct G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_23;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_23;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_22;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_22;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_21;             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_21;             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_20;             // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_20;             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_19;             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_19;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_18;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_18;             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_17;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_17;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_16;             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_16;             // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_15;             // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_15;             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_14;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_14;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_13;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_13;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_12;             // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_12;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_11;             // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_11;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_10;             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_10;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_9;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_9;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_8;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_8;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_7;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_7;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_6;              // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_6;              // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_5;              // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_5;              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZStealthBranch                             CallFunc_StealthBranch_OutputPins;                 // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                CallFunc_StealthBranch_ReturnValue;                // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_17B[0x5];                                      // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_4;              // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_4;              // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ASBZPawnSpawnPredefined*>        K2Node_MakeArray_Array;                            // 0x0190(0x0010)(ReferenceParm)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_3;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_3;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                CallFunc_Array_Get_Item;                           // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPawnSpawnRequestHandle             CallFunc_SpawnPredefined_ReturnValue;              // 0x01C0(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_2;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_2;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          K2Node_MakeArray_Array_1;                          // 0x01E8(0x0010)(ReferenceParm)
	class APawn*                                  K2Node_ActorBoundEvent_SpawnedPawn_1;              // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      K2Node_ActorBoundEvent_Spawnedloot_1;              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_Array_Get_Item_1;                         // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          K2Node_MakeArray_Array_2;                          // 0x0210(0x0010)(ReferenceParm)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_Array_Get_Item_2;                         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAIController*                       K2Node_DynamicCast_AsSBZAIController;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_Order_GoToDespawn_C*                CallFunc_CreateAIOrder_ReturnValue;                // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAIController*                       K2Node_DynamicCast_AsSBZAIController_1;            // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PushOrder_ReturnValue;                    // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25A[0x6];                                      // 0x025A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Order_GoToDespawn_C*                CallFunc_CreateAIOrder_ReturnValue_1;              // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PushOrder_ReturnValue_1;                  // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x026D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26E[0x2];                                      // 0x026E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld) == 0x000008, "Wrong alignment on G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld");
static_assert(sizeof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld) == 0x000278, "Wrong size on G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, EntryPoint) == 0x000000, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::EntryPoint' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn) == 0x000008, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot) == 0x000010, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, Temp_int_Array_Index_Variable) == 0x000020, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, Temp_int_Loop_Counter_Variable_1) == 0x000028, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, Temp_int_Array_Index_Variable_2) == 0x000030, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_23) == 0x000038, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_23' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_23) == 0x000040, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_23' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_22) == 0x000048, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_22' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_22) == 0x000050, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_22' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_21) == 0x000058, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_21' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_21) == 0x000060, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_21' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_20) == 0x000068, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_20' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_20) == 0x000070, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_20' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_19) == 0x000078, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_19' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_19) == 0x000080, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_19' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_18) == 0x000088, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_18' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_18) == 0x000090, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_18' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_17) == 0x000098, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_17' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_17) == 0x0000A0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_17' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_16) == 0x0000A8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_16' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_16) == 0x0000B0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_16' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_15) == 0x0000B8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_15' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_15) == 0x0000C0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_15' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_14) == 0x0000C8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_14' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_14) == 0x0000D0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_14' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_13) == 0x0000D8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_13' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_13) == 0x0000E0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_13' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_12) == 0x0000E8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_12' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_12) == 0x0000F0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_12' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_11) == 0x0000F8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_11' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_11) == 0x000100, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_11' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_10) == 0x000108, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_10' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_10) == 0x000110, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_10' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_9) == 0x000118, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_9' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_9) == 0x000120, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_9' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_8) == 0x000128, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_8' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_8) == 0x000130, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_8' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_7) == 0x000138, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_7' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_7) == 0x000140, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_7' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_RandomFloatInRange_ReturnValue) == 0x000148, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_6) == 0x000150, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_6' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_6) == 0x000158, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_6' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_5) == 0x000160, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_5' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_5) == 0x000168, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_5' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, Temp_int_Loop_Counter_Variable_2) == 0x000170, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Add_IntInt_ReturnValue_2) == 0x000174, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_StealthBranch_OutputPins) == 0x000178, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_StealthBranch_OutputPins' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_StealthBranch_ReturnValue) == 0x000179, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_StealthBranch_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_SwitchEnum_CmpSuccess) == 0x00017A, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_4) == 0x000180, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_4' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_4) == 0x000188, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_4' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_MakeArray_Array) == 0x000190, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_3) == 0x0001A0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_3' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_3) == 0x0001A8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_3' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Array_Get_Item) == 0x0001B0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Array_Length_ReturnValue) == 0x0001B8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_SpawnPredefined_ReturnValue) == 0x0001C0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_SpawnPredefined_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Less_IntInt_ReturnValue) == 0x0001D0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_2) == 0x0001D8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_2' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_2) == 0x0001E0, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_2' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_MakeArray_Array_1) == 0x0001E8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_SpawnedPawn_1) == 0x0001F8, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_SpawnedPawn_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_ActorBoundEvent_Spawnedloot_1) == 0x000200, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_ActorBoundEvent_Spawnedloot_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Array_Get_Item_1) == 0x000208, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_MakeArray_Array_2) == 0x000210, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_GetController_ReturnValue) == 0x000220, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Array_Get_Item_2) == 0x000228, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_DynamicCast_AsSBZAIController) == 0x000230, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_DynamicCast_AsSBZAIController' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_DynamicCast_bSuccess) == 0x000238, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_GetController_ReturnValue_1) == 0x000240, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_CreateAIOrder_ReturnValue) == 0x000248, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_CreateAIOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_DynamicCast_AsSBZAIController_1) == 0x000250, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_DynamicCast_AsSBZAIController_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, K2Node_DynamicCast_bSuccess_1) == 0x000258, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_PushOrder_ReturnValue) == 0x000259, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_PushOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_CreateAIOrder_ReturnValue_1) == 0x000260, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_CreateAIOrder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Array_Length_ReturnValue_1) == 0x000268, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_PushOrder_ReturnValue_1) == 0x00026C, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_PushOrder_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Less_IntInt_ReturnValue_1) == 0x00026D, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Array_Length_ReturnValue_2) == 0x000270, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld, CallFunc_Less_IntInt_ReturnValue_2) == 0x000274, "Member 'G_NightClub_LivingWorld_C_ExecuteUbergraph_G_NightClub_LivingWorld::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");

// Function G_NightClub_LivingWorld.G_NightClub_LivingWorld_C.BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature final
{
public:
	class APawn*                                  SpawnedPawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      Spawnedloot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(sizeof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000010, "Wrong size on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature, SpawnedPawn) == 0x000000, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature::SpawnedPawn' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature, Spawnedloot) == 0x000008, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature::Spawnedloot' has a wrong offset!");

// Function G_NightClub_LivingWorld.G_NightClub_LivingWorld_C.BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature final
{
public:
	class APawn*                                  SpawnedPawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      Spawnedloot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(sizeof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000010, "Wrong size on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature, SpawnedPawn) == 0x000000, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature::SpawnedPawn' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature, Spawnedloot) == 0x000008, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature::Spawnedloot' has a wrong offset!");

// Function G_NightClub_LivingWorld.G_NightClub_LivingWorld_C.BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature final
{
public:
	class APawn*                                  SpawnedPawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      Spawnedloot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(sizeof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000010, "Wrong size on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature, SpawnedPawn) == 0x000000, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature::SpawnedPawn' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature, Spawnedloot) == 0x000008, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature::Spawnedloot' has a wrong offset!");

// Function G_NightClub_LivingWorld.G_NightClub_LivingWorld_C.BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature final
{
public:
	class APawn*                                  SpawnedPawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      Spawnedloot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(sizeof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000010, "Wrong size on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature, SpawnedPawn) == 0x000000, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature::SpawnedPawn' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature, Spawnedloot) == 0x000008, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature::Spawnedloot' has a wrong offset!");

// Function G_NightClub_LivingWorld.G_NightClub_LivingWorld_C.BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature final
{
public:
	class APawn*                                  SpawnedPawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      Spawnedloot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(sizeof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000010, "Wrong size on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature, SpawnedPawn) == 0x000000, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature::SpawnedPawn' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature, Spawnedloot) == 0x000008, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature::Spawnedloot' has a wrong offset!");

// Function G_NightClub_LivingWorld.G_NightClub_LivingWorld_C.BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature final
{
public:
	class APawn*                                  SpawnedPawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      Spawnedloot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(sizeof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000010, "Wrong size on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature, SpawnedPawn) == 0x000000, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature::SpawnedPawn' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature, Spawnedloot) == 0x000008, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature::Spawnedloot' has a wrong offset!");

// Function G_NightClub_LivingWorld.G_NightClub_LivingWorld_C.BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature final
{
public:
	class APawn*                                  SpawnedPawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      Spawnedloot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(sizeof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000010, "Wrong size on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature, SpawnedPawn) == 0x000000, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature::SpawnedPawn' has a wrong offset!");
static_assert(offsetof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature, Spawnedloot) == 0x000008, "Member 'G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature::Spawnedloot' has a wrong offset!");

// Function G_NightClub_LivingWorld.G_NightClub_LivingWorld_C.BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_93_K2Node_ActorBoundEvent_31_SBZSpawnRequestCompletedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_93_K2Node_ActorBoundEvent_31_SBZSpawnRequestCompletedDelegate__DelegateSignature final
{
public:
	class APawn*                                  SpawnedPawn;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCarriedStaticInteractionActor*      Spawnedloot;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_93_K2Node_ActorBoundEvent_31_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_93_K2Node_ActorBoundEvent_31_SBZSpawnRequestCompletedDelegate__DelegateSignature");
static_assert(sizeof(G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_93_K2Node_ActorBoundEvent_31_SBZSpawnRequestCompletedDelegate__DelegateSignature) == 0x000010, "Wrong size on G_NightClub_LivingWorld_C_BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_93_K2Node_ActorBoundEvent_31_SBZSpawnRequestCompletedDelegate__DelegateSignature");
