#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: G_NightClub_LivingWorld

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass G_NightClub_LivingWorld.G_NightClub_LivingWorld_C
// 0x0120 (0x0460 - 0x0340)
class AG_NightClub_LivingWorld_C final : public ASBZLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_015_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_004_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_018_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_007_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_019_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_009_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_001_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_006_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_014_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_002_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_005_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_003_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_013_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_008_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_011_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_010_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_012_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_016_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_017_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_35_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_20_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_21_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_22_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_23_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_24_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0408(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_25_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_26_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_27_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_28_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_29_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_30_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_31_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_32_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_33_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPawnSpawnPredefined*                SBZPawnSpawnCivilian_VIP_34_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty; // 0x0458(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_G_NightClub_LivingWorld(int32 EntryPoint);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_80_K2Node_ActorBoundEvent_29_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_85_K2Node_ActorBoundEvent_28_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_44_K2Node_ActorBoundEvent_24_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_52_K2Node_ActorBoundEvent_19_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_OutdoorPier4_K2Node_ActorBoundEvent_14_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void DespawnExtras();
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_30_K2Node_ActorBoundEvent_12_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_21_K2Node_ActorBoundEvent_11_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_93_K2Node_ActorBoundEvent_31_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_95_K2Node_ActorBoundEvent_30_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_58_K2Node_ActorBoundEvent_27_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_45_K2Node_ActorBoundEvent_25_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_76_K2Node_ActorBoundEvent_23_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_62_K2Node_ActorBoundEvent_22_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_69_K2Node_ActorBoundEvent_21_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_64_K2Node_ActorBoundEvent_20_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_56_K2Node_ActorBoundEvent_18_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_48_K2Node_ActorBoundEvent_17_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_38_K2Node_ActorBoundEvent_16_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_35_K2Node_ActorBoundEvent_15_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_13_K2Node_ActorBoundEvent_8_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void PlayerVIP();
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_3_K2Node_ActorBoundEvent_4_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_5_K2Node_ActorBoundEvent_2_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_2_K2Node_ActorBoundEvent_1_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);
	void BndEvt__G_NightClub_LivingWorld_SBZPawnSpawnCivilian_1_K2Node_ActorBoundEvent_0_SBZSpawnRequestCompletedDelegate__DelegateSignature(class APawn* SpawnedPawn, class ASBZCarriedStaticInteractionActor* Spawnedloot);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"G_NightClub_LivingWorld_C">();
	}
	static class AG_NightClub_LivingWorld_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AG_NightClub_LivingWorld_C>();
	}
};
static_assert(alignof(AG_NightClub_LivingWorld_C) == 0x000008, "Wrong alignment on AG_NightClub_LivingWorld_C");
static_assert(sizeof(AG_NightClub_LivingWorld_C) == 0x000460, "Wrong size on AG_NightClub_LivingWorld_C");
static_assert(offsetof(AG_NightClub_LivingWorld_C, UberGraphFrame) == 0x000340, "Member 'AG_NightClub_LivingWorld_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_015_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000348, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_015_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_004_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000350, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_004_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_018_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000358, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_018_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_007_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000360, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_007_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_019_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000368, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_019_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_009_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000370, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_009_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_001_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000378, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_001_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_006_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000380, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_006_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_014_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000388, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_014_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_002_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000390, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_002_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_005_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000398, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_005_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_003_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003A0, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_003_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_013_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003A8, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_013_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_008_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003B0, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_008_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_011_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003B8, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_011_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_010_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003C0, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_010_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_012_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003C8, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_012_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_016_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003D0, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_016_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_017_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003D8, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_017_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_35_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003E0, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_35_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_20_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003E8, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_20_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_21_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003F0, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_21_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_22_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x0003F8, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_22_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_23_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000400, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_23_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_24_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000408, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_24_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_25_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000410, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_25_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_26_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000418, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_26_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_27_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000420, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_27_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_28_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000428, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_28_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_29_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000430, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_29_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_30_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000438, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_30_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_31_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000440, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_31_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_32_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000448, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_32_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_33_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000450, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_33_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");
static_assert(offsetof(AG_NightClub_LivingWorld_C, SBZPawnSpawnCivilian_VIP_34_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty) == 0x000458, "Member 'AG_NightClub_LivingWorld_C::SBZPawnSpawnCivilian_VIP_34_ExecuteUbergraph_G_NightClub_LivingWorld_RefProperty' has a wrong offset!");

}

