#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HW12DEV_WeaponStats_Entry_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function HW12DEV_WeaponStats_Entry_Base.HW12DEV_WeaponStats_Entry_Base_C.SetBaseCompare
// 0x000C (0x000C - 0x0000)
struct HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare final
{
public:
	float                                         Base;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Compare;                                           // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasCompare;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          FlipCompare;                                       // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare) == 0x000004, "Wrong alignment on HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare");
static_assert(sizeof(HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare) == 0x00000C, "Wrong size on HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare");
static_assert(offsetof(HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare, Base) == 0x000000, "Member 'HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare::Base' has a wrong offset!");
static_assert(offsetof(HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare, Compare) == 0x000004, "Member 'HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare::Compare' has a wrong offset!");
static_assert(offsetof(HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare, HasCompare) == 0x000008, "Member 'HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare::HasCompare' has a wrong offset!");
static_assert(offsetof(HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare, FlipCompare) == 0x000009, "Member 'HW12DEV_WeaponStats_Entry_Base_C_SetBaseCompare::FlipCompare' has a wrong offset!");

}

