#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KillCounterSaveGame

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass KillCounterSaveGame.KillCounterSaveGame_C
// 0x0018 (0x0048 - 0x0030)
class UKillCounterSaveGame_C final : public USaveGame
{
public:
	struct FVector2D                              PositionOffset;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideName;                                          // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          HideMiscText;                                      // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScaleOffset;                                       // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HideOtherPlayers;                                  // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KillCounterSaveGame_C">();
	}
	static class UKillCounterSaveGame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKillCounterSaveGame_C>();
	}
};
static_assert(alignof(UKillCounterSaveGame_C) == 0x000008, "Wrong alignment on UKillCounterSaveGame_C");
static_assert(sizeof(UKillCounterSaveGame_C) == 0x000048, "Wrong size on UKillCounterSaveGame_C");
static_assert(offsetof(UKillCounterSaveGame_C, PositionOffset) == 0x000030, "Member 'UKillCounterSaveGame_C::PositionOffset' has a wrong offset!");
static_assert(offsetof(UKillCounterSaveGame_C, HideName) == 0x000038, "Member 'UKillCounterSaveGame_C::HideName' has a wrong offset!");
static_assert(offsetof(UKillCounterSaveGame_C, HideMiscText) == 0x000039, "Member 'UKillCounterSaveGame_C::HideMiscText' has a wrong offset!");
static_assert(offsetof(UKillCounterSaveGame_C, ScaleOffset) == 0x00003C, "Member 'UKillCounterSaveGame_C::ScaleOffset' has a wrong offset!");
static_assert(offsetof(UKillCounterSaveGame_C, HideOtherPlayers) == 0x000040, "Member 'UKillCounterSaveGame_C::HideOtherPlayers' has a wrong offset!");

}

