#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: M_local_Volume_fog

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass M_local_Volume_fog.M_local_Volume_fog_C
// 0x0040 (0x02E8 - 0x02A8)
class AM_local_Volume_fog_C final : public AActor
{
public:
	class UStaticMeshComponent*                   Cube;                                              // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Power;                                             // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fallof;                                            // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Size;                                              // 0x02D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         distance_fade_min;                                 // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         distance_fade_max;                                 // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_local_Volume_fog_C">();
	}
	static class AM_local_Volume_fog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AM_local_Volume_fog_C>();
	}
};
static_assert(alignof(AM_local_Volume_fog_C) == 0x000008, "Wrong alignment on AM_local_Volume_fog_C");
static_assert(sizeof(AM_local_Volume_fog_C) == 0x0002E8, "Wrong size on AM_local_Volume_fog_C");
static_assert(offsetof(AM_local_Volume_fog_C, Cube) == 0x0002A8, "Member 'AM_local_Volume_fog_C::Cube' has a wrong offset!");
static_assert(offsetof(AM_local_Volume_fog_C, DefaultSceneRoot) == 0x0002B0, "Member 'AM_local_Volume_fog_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AM_local_Volume_fog_C, Power) == 0x0002B8, "Member 'AM_local_Volume_fog_C::Power' has a wrong offset!");
static_assert(offsetof(AM_local_Volume_fog_C, Fallof) == 0x0002BC, "Member 'AM_local_Volume_fog_C::Fallof' has a wrong offset!");
static_assert(offsetof(AM_local_Volume_fog_C, Color) == 0x0002C0, "Member 'AM_local_Volume_fog_C::Color' has a wrong offset!");
static_assert(offsetof(AM_local_Volume_fog_C, Size) == 0x0002D0, "Member 'AM_local_Volume_fog_C::Size' has a wrong offset!");
static_assert(offsetof(AM_local_Volume_fog_C, distance_fade_min) == 0x0002DC, "Member 'AM_local_Volume_fog_C::distance_fade_min' has a wrong offset!");
static_assert(offsetof(AM_local_Volume_fog_C, distance_fade_max) == 0x0002E0, "Member 'AM_local_Volume_fog_C::distance_fade_max' has a wrong offset!");

}

