#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MainMenu.MainMenu_C
// 0x0048 (0x0338 - 0x02F0)
class AMainMenu_C final : public ASBZLevelScriptMainMenuActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector2D                              PreviousMousePos;                                  // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACH_UI_MM_PlayerCharacter_C*            CH_UI_MM_Local_PlayerCharacter_EdGraph_0_RefProperty; // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           LobbyCamera_2_EdGraph_1_RefProperty;               // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           InventoryPlayerCharacterCamera_EdGraph_1_RefProperty; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           ChallengesCamera_EdGraph_1_RefProperty;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CustomizationItemCamera_EdGraph_1_RefProperty;     // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           ServerBrowserCamera_EdGraph_1_RefProperty;         // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           PlayerCharacterCamera_EdGraph_1_RefProperty;       // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetActiveCamera(class FName NewValue, class FName PreviousValue);
	void TickRotation(float DeltaTime);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_MainMenu(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainMenu_C">();
	}
	static class AMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMainMenu_C>();
	}
};
static_assert(alignof(AMainMenu_C) == 0x000008, "Wrong alignment on AMainMenu_C");
static_assert(sizeof(AMainMenu_C) == 0x000338, "Wrong size on AMainMenu_C");
static_assert(offsetof(AMainMenu_C, UberGraphFrame) == 0x0002F0, "Member 'AMainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMainMenu_C, PreviousMousePos) == 0x0002F8, "Member 'AMainMenu_C::PreviousMousePos' has a wrong offset!");
static_assert(offsetof(AMainMenu_C, CH_UI_MM_Local_PlayerCharacter_EdGraph_0_RefProperty) == 0x000300, "Member 'AMainMenu_C::CH_UI_MM_Local_PlayerCharacter_EdGraph_0_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainMenu_C, LobbyCamera_2_EdGraph_1_RefProperty) == 0x000308, "Member 'AMainMenu_C::LobbyCamera_2_EdGraph_1_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainMenu_C, InventoryPlayerCharacterCamera_EdGraph_1_RefProperty) == 0x000310, "Member 'AMainMenu_C::InventoryPlayerCharacterCamera_EdGraph_1_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainMenu_C, ChallengesCamera_EdGraph_1_RefProperty) == 0x000318, "Member 'AMainMenu_C::ChallengesCamera_EdGraph_1_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainMenu_C, CustomizationItemCamera_EdGraph_1_RefProperty) == 0x000320, "Member 'AMainMenu_C::CustomizationItemCamera_EdGraph_1_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainMenu_C, ServerBrowserCamera_EdGraph_1_RefProperty) == 0x000328, "Member 'AMainMenu_C::ServerBrowserCamera_EdGraph_1_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainMenu_C, PlayerCharacterCamera_EdGraph_1_RefProperty) == 0x000330, "Member 'AMainMenu_C::PlayerCharacterCamera_EdGraph_1_RefProperty' has a wrong offset!");

}

