#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Menu_KillCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Menu_KillCounter.Menu_KillCounter_C
// 0x0028 (0x02B8 - 0x0290)
class UMenu_KillCounter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScaleBox*                              ScaleBox_0;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_KillCount_C*                        UI_KillCount;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_KillCount_C*                        UI_KillCount_1;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_30;                                    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Menu_KillCounter(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Menu_KillCounter_C">();
	}
	static class UMenu_KillCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenu_KillCounter_C>();
	}
};
static_assert(alignof(UMenu_KillCounter_C) == 0x000008, "Wrong alignment on UMenu_KillCounter_C");
static_assert(sizeof(UMenu_KillCounter_C) == 0x0002B8, "Wrong size on UMenu_KillCounter_C");
static_assert(offsetof(UMenu_KillCounter_C, UberGraphFrame) == 0x000290, "Member 'UMenu_KillCounter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMenu_KillCounter_C, ScaleBox_0) == 0x000298, "Member 'UMenu_KillCounter_C::ScaleBox_0' has a wrong offset!");
static_assert(offsetof(UMenu_KillCounter_C, UI_KillCount) == 0x0002A0, "Member 'UMenu_KillCounter_C::UI_KillCount' has a wrong offset!");
static_assert(offsetof(UMenu_KillCounter_C, UI_KillCount_1) == 0x0002A8, "Member 'UMenu_KillCounter_C::UI_KillCount_1' has a wrong offset!");
static_assert(offsetof(UMenu_KillCounter_C, VerticalBox_30) == 0x0002B0, "Member 'UMenu_KillCounter_C::VerticalBox_30' has a wrong offset!");

}

