#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Menu_SimpleHealthBar

#include "Basic.hpp"


namespace SDK::Params
{

// Function Menu_SimpleHealthBar.Menu_SimpleHealthBar_C.ExecuteUbergraph_Menu_SimpleHealthBar
// 0x0070 (0x0070 - 0x0000)
struct Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_NewParam_1;                     // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Armor;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MaxArmor;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0038(0x0018)()
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Health;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_MaxHealth;                      // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_NewParam;                       // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar) == 0x000008, "Wrong alignment on Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar");
static_assert(sizeof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar) == 0x000070, "Wrong size on Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, EntryPoint) == 0x000000, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, K2Node_CustomEvent_NewParam_1) == 0x000008, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::K2Node_CustomEvent_NewParam_1' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, K2Node_CustomEvent_Armor) == 0x000018, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::K2Node_CustomEvent_Armor' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, K2Node_CustomEvent_MaxArmor) == 0x00001C, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::K2Node_CustomEvent_MaxArmor' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, CallFunc_FCeil_ReturnValue) == 0x000020, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000024, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000028, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, CallFunc_FCeil_ReturnValue_1) == 0x00002C, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000030, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, CallFunc_Conv_IntToText_ReturnValue) == 0x000038, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, CallFunc_SafeDivide_ReturnValue) == 0x000050, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, K2Node_CustomEvent_Health) == 0x000054, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::K2Node_CustomEvent_Health' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, K2Node_CustomEvent_MaxHealth) == 0x000058, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::K2Node_CustomEvent_MaxHealth' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar, K2Node_CustomEvent_NewParam) == 0x000060, "Member 'Menu_SimpleHealthBar_C_ExecuteUbergraph_Menu_SimpleHealthBar::K2Node_CustomEvent_NewParam' has a wrong offset!");

// Function Menu_SimpleHealthBar.Menu_SimpleHealthBar_C.SetText
// 0x0010 (0x0010 - 0x0000)
struct Menu_SimpleHealthBar_C_SetText final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Menu_SimpleHealthBar_C_SetText) == 0x000008, "Wrong alignment on Menu_SimpleHealthBar_C_SetText");
static_assert(sizeof(Menu_SimpleHealthBar_C_SetText) == 0x000010, "Wrong size on Menu_SimpleHealthBar_C_SetText");
static_assert(offsetof(Menu_SimpleHealthBar_C_SetText, NewParam) == 0x000000, "Member 'Menu_SimpleHealthBar_C_SetText::NewParam' has a wrong offset!");

// Function Menu_SimpleHealthBar.Menu_SimpleHealthBar_C.SetArmor
// 0x0008 (0x0008 - 0x0000)
struct Menu_SimpleHealthBar_C_SetArmor final
{
public:
	float                                         Armor;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxArmor;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Menu_SimpleHealthBar_C_SetArmor) == 0x000004, "Wrong alignment on Menu_SimpleHealthBar_C_SetArmor");
static_assert(sizeof(Menu_SimpleHealthBar_C_SetArmor) == 0x000008, "Wrong size on Menu_SimpleHealthBar_C_SetArmor");
static_assert(offsetof(Menu_SimpleHealthBar_C_SetArmor, Armor) == 0x000000, "Member 'Menu_SimpleHealthBar_C_SetArmor::Armor' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_SetArmor, MaxArmor) == 0x000004, "Member 'Menu_SimpleHealthBar_C_SetArmor::MaxArmor' has a wrong offset!");

// Function Menu_SimpleHealthBar.Menu_SimpleHealthBar_C.SetHealth
// 0x0008 (0x0008 - 0x0000)
struct Menu_SimpleHealthBar_C_SetHealth final
{
public:
	float                                         Health_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth_0;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Menu_SimpleHealthBar_C_SetHealth) == 0x000004, "Wrong alignment on Menu_SimpleHealthBar_C_SetHealth");
static_assert(sizeof(Menu_SimpleHealthBar_C_SetHealth) == 0x000008, "Wrong size on Menu_SimpleHealthBar_C_SetHealth");
static_assert(offsetof(Menu_SimpleHealthBar_C_SetHealth, Health_0) == 0x000000, "Member 'Menu_SimpleHealthBar_C_SetHealth::Health_0' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_SetHealth, MaxHealth_0) == 0x000004, "Member 'Menu_SimpleHealthBar_C_SetHealth::MaxHealth_0' has a wrong offset!");

// Function Menu_SimpleHealthBar.Menu_SimpleHealthBar_C.SetEnemyName
// 0x0010 (0x0010 - 0x0000)
struct Menu_SimpleHealthBar_C_SetEnemyName final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Menu_SimpleHealthBar_C_SetEnemyName) == 0x000008, "Wrong alignment on Menu_SimpleHealthBar_C_SetEnemyName");
static_assert(sizeof(Menu_SimpleHealthBar_C_SetEnemyName) == 0x000010, "Wrong size on Menu_SimpleHealthBar_C_SetEnemyName");
static_assert(offsetof(Menu_SimpleHealthBar_C_SetEnemyName, NewParam) == 0x000000, "Member 'Menu_SimpleHealthBar_C_SetEnemyName::NewParam' has a wrong offset!");

// Function Menu_SimpleHealthBar.Menu_SimpleHealthBar_C.UpdateHealthHUD
// 0x0058 (0x0058 - 0x0000)
struct Menu_SimpleHealthBar_C_UpdateHealthHUD final
{
public:
	float                                         Health_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxHealth_0;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_MaxHealth;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Local_Health;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue_1;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0030(0x0018)()
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Menu_SimpleHealthBar_C_UpdateHealthHUD) == 0x000008, "Wrong alignment on Menu_SimpleHealthBar_C_UpdateHealthHUD");
static_assert(sizeof(Menu_SimpleHealthBar_C_UpdateHealthHUD) == 0x000058, "Wrong size on Menu_SimpleHealthBar_C_UpdateHealthHUD");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, Health_0) == 0x000000, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::Health_0' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, MaxHealth_0) == 0x000004, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::MaxHealth_0' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, Local_MaxHealth) == 0x000008, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::Local_MaxHealth' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, Local_Health) == 0x00000C, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::Local_Health' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, CallFunc_FCeil_ReturnValue) == 0x000010, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::CallFunc_FCeil_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, CallFunc_FCeil_ReturnValue_1) == 0x000014, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::CallFunc_FCeil_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000030, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000048, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00004C, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Menu_SimpleHealthBar_C_UpdateHealthHUD, CallFunc_SafeDivide_ReturnValue) == 0x000050, "Member 'Menu_SimpleHealthBar_C_UpdateHealthHUD::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");

}

