#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_BPL_Cable_Spark

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_BPL_Cable_Spark.MM_BPL_Cable_Spark_C
// 0x0028 (0x02D0 - 0x02A8)
class AMM_BPL_Cable_Spark_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      FX_MM_NeonSparkBurst;                              // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_3701B9154A1045E1BEC2A4BAC14E2DD9; // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MM_BPL_Cable_Spark(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__SparkTrigger__EventFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_BPL_Cable_Spark_C">();
	}
	static class AMM_BPL_Cable_Spark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_BPL_Cable_Spark_C>();
	}
};
static_assert(alignof(AMM_BPL_Cable_Spark_C) == 0x000008, "Wrong alignment on AMM_BPL_Cable_Spark_C");
static_assert(sizeof(AMM_BPL_Cable_Spark_C) == 0x0002D0, "Wrong size on AMM_BPL_Cable_Spark_C");
static_assert(offsetof(AMM_BPL_Cable_Spark_C, UberGraphFrame) == 0x0002A8, "Member 'AMM_BPL_Cable_Spark_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Cable_Spark_C, FX_MM_NeonSparkBurst) == 0x0002B0, "Member 'AMM_BPL_Cable_Spark_C::FX_MM_NeonSparkBurst' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Cable_Spark_C, DefaultSceneRoot) == 0x0002B8, "Member 'AMM_BPL_Cable_Spark_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Cable_Spark_C, Timeline_0__Direction_3701B9154A1045E1BEC2A4BAC14E2DD9) == 0x0002C0, "Member 'AMM_BPL_Cable_Spark_C::Timeline_0__Direction_3701B9154A1045E1BEC2A4BAC14E2DD9' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Cable_Spark_C, Timeline_0) == 0x0002C8, "Member 'AMM_BPL_Cable_Spark_C::Timeline_0' has a wrong offset!");

}

