#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_BPL_Neon_Flickering

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_BPL_Neon_Flickering.MM_BPL_Neon_Flickering_C
// 0x0070 (0x0318 - 0x02A8)
class AMM_BPL_Neon_Flickering_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           Ak;                                                // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_MM_NeonSparkBurst____4;                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_MM_NeonSparkBurst___3;                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_MM_NeonSparkBurst__2;                           // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_MM_NeonSparkBurst_1;                            // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      FX_MM_NeonSparkBurst;                              // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_NeonSign_01_Shape_0_7;                         // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    SpotLight;                                         // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   LGT_NeonSign_01_Shape_06;                          // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_SparkForce_C5E86C60430B98E84B7BA288A52EBCF9; // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_C5E86C60430B98E84B7BA288A52EBCF9; // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_C5E86C60430B98E84B7BA288A52EBCF9; // 0x0308(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__SoundTrigger__EventFunc();
	void Timeline_0__Spark__EventFunc();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_MM_BPL_Neon_Flickering(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_BPL_Neon_Flickering_C">();
	}
	static class AMM_BPL_Neon_Flickering_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_BPL_Neon_Flickering_C>();
	}
};
static_assert(alignof(AMM_BPL_Neon_Flickering_C) == 0x000008, "Wrong alignment on AMM_BPL_Neon_Flickering_C");
static_assert(sizeof(AMM_BPL_Neon_Flickering_C) == 0x000318, "Wrong size on AMM_BPL_Neon_Flickering_C");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, UberGraphFrame) == 0x0002A8, "Member 'AMM_BPL_Neon_Flickering_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, Ak) == 0x0002B0, "Member 'AMM_BPL_Neon_Flickering_C::Ak' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, FX_MM_NeonSparkBurst____4) == 0x0002B8, "Member 'AMM_BPL_Neon_Flickering_C::FX_MM_NeonSparkBurst____4' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, FX_MM_NeonSparkBurst___3) == 0x0002C0, "Member 'AMM_BPL_Neon_Flickering_C::FX_MM_NeonSparkBurst___3' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, FX_MM_NeonSparkBurst__2) == 0x0002C8, "Member 'AMM_BPL_Neon_Flickering_C::FX_MM_NeonSparkBurst__2' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, FX_MM_NeonSparkBurst_1) == 0x0002D0, "Member 'AMM_BPL_Neon_Flickering_C::FX_MM_NeonSparkBurst_1' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, FX_MM_NeonSparkBurst) == 0x0002D8, "Member 'AMM_BPL_Neon_Flickering_C::FX_MM_NeonSparkBurst' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, LGT_NeonSign_01_Shape_0_7) == 0x0002E0, "Member 'AMM_BPL_Neon_Flickering_C::LGT_NeonSign_01_Shape_0_7' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, SpotLight) == 0x0002E8, "Member 'AMM_BPL_Neon_Flickering_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, LGT_NeonSign_01_Shape_06) == 0x0002F0, "Member 'AMM_BPL_Neon_Flickering_C::LGT_NeonSign_01_Shape_06' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, DefaultSceneRoot) == 0x0002F8, "Member 'AMM_BPL_Neon_Flickering_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, Timeline_0_SparkForce_C5E86C60430B98E84B7BA288A52EBCF9) == 0x000300, "Member 'AMM_BPL_Neon_Flickering_C::Timeline_0_SparkForce_C5E86C60430B98E84B7BA288A52EBCF9' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, Timeline_0_NewTrack_0_C5E86C60430B98E84B7BA288A52EBCF9) == 0x000304, "Member 'AMM_BPL_Neon_Flickering_C::Timeline_0_NewTrack_0_C5E86C60430B98E84B7BA288A52EBCF9' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, Timeline_0__Direction_C5E86C60430B98E84B7BA288A52EBCF9) == 0x000308, "Member 'AMM_BPL_Neon_Flickering_C::Timeline_0__Direction_C5E86C60430B98E84B7BA288A52EBCF9' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neon_Flickering_C, Timeline_0) == 0x000310, "Member 'AMM_BPL_Neon_Flickering_C::Timeline_0' has a wrong offset!");

}

