#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_BPL_Neon_Flickering

#include "Basic.hpp"


namespace SDK::Params
{

// Function MM_BPL_Neon_Flickering.MM_BPL_Neon_Flickering_C.ExecuteUbergraph_MM_BPL_Neon_Flickering
// 0x0038 (0x0038 - 0x0000)
struct MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloat_ReturnValue;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UNiagaraComponent*>              K2Node_MakeArray_Array;                            // 0x0010(0x0010)(ConstParm, ReferenceParm, ContainsInstancedReference)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_Array_Random_OutItem;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering) == 0x000008, "Wrong alignment on MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering");
static_assert(sizeof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering) == 0x000038, "Wrong size on MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering");
static_assert(offsetof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering, EntryPoint) == 0x000000, "Member 'MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering::EntryPoint' has a wrong offset!");
static_assert(offsetof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering, CallFunc_RandomFloat_ReturnValue) == 0x00000C, "Member 'MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering::CallFunc_RandomFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering, K2Node_MakeArray_Array) == 0x000010, "Member 'MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering, CallFunc_Array_Random_OutItem) == 0x000028, "Member 'MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering, CallFunc_Array_Random_OutIndex) == 0x000030, "Member 'MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000034, "Member 'MM_BPL_Neon_Flickering_C_ExecuteUbergraph_MM_BPL_Neon_Flickering::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");

}

