#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MM_BPL_Neaon_Light_Only

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass MM_BPL_Neaon_Light_Only.MM_BPL_Neaon_Light_Only_C
// 0x0030 (0x02D8 - 0x02A8)
class AMM_BPL_Neaon_Light_Only_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USpotLightComponent*                    SpotLight;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_SparkForce_D018FA6947B02B81D85F7F8D60F9860C; // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_D018FA6947B02B81D85F7F8D60F9860C; // 0x02C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_D018FA6947B02B81D85F7F8D60F9860C; // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__Spark__EventFunc();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_MM_BPL_Neaon_Light_Only(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MM_BPL_Neaon_Light_Only_C">();
	}
	static class AMM_BPL_Neaon_Light_Only_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMM_BPL_Neaon_Light_Only_C>();
	}
};
static_assert(alignof(AMM_BPL_Neaon_Light_Only_C) == 0x000008, "Wrong alignment on AMM_BPL_Neaon_Light_Only_C");
static_assert(sizeof(AMM_BPL_Neaon_Light_Only_C) == 0x0002D8, "Wrong size on AMM_BPL_Neaon_Light_Only_C");
static_assert(offsetof(AMM_BPL_Neaon_Light_Only_C, UberGraphFrame) == 0x0002A8, "Member 'AMM_BPL_Neaon_Light_Only_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neaon_Light_Only_C, SpotLight) == 0x0002B0, "Member 'AMM_BPL_Neaon_Light_Only_C::SpotLight' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neaon_Light_Only_C, DefaultSceneRoot) == 0x0002B8, "Member 'AMM_BPL_Neaon_Light_Only_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neaon_Light_Only_C, Timeline_0_SparkForce_D018FA6947B02B81D85F7F8D60F9860C) == 0x0002C0, "Member 'AMM_BPL_Neaon_Light_Only_C::Timeline_0_SparkForce_D018FA6947B02B81D85F7F8D60F9860C' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neaon_Light_Only_C, Timeline_0_NewTrack_0_D018FA6947B02B81D85F7F8D60F9860C) == 0x0002C4, "Member 'AMM_BPL_Neaon_Light_Only_C::Timeline_0_NewTrack_0_D018FA6947B02B81D85F7F8D60F9860C' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neaon_Light_Only_C, Timeline_0__Direction_D018FA6947B02B81D85F7F8D60F9860C) == 0x0002C8, "Member 'AMM_BPL_Neaon_Light_Only_C::Timeline_0__Direction_D018FA6947B02B81D85F7F8D60F9860C' has a wrong offset!");
static_assert(offsetof(AMM_BPL_Neaon_Light_Only_C, Timeline_0) == 0x0002D0, "Member 'AMM_BPL_Neaon_Light_Only_C::Timeline_0' has a wrong offset!");

}

