#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModActorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ModActorBase.ModActorBase_C
// 0x0020 (0x02C8 - 0x02A8)
class AModActorBase_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 Version;                                           // 0x02B8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ModActorBase(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ModActorBase_C">();
	}
	static class AModActorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AModActorBase_C>();
	}
};
static_assert(alignof(AModActorBase_C) == 0x000008, "Wrong alignment on AModActorBase_C");
static_assert(sizeof(AModActorBase_C) == 0x0002C8, "Wrong size on AModActorBase_C");
static_assert(offsetof(AModActorBase_C, UberGraphFrame) == 0x0002A8, "Member 'AModActorBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AModActorBase_C, DefaultSceneRoot) == 0x0002B0, "Member 'AModActorBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AModActorBase_C, Version) == 0x0002B8, "Member 'AModActorBase_C::Version' has a wrong offset!");

}

