#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModActorBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function ModActorBase.ModActorBase_C.ExecuteUbergraph_ModActorBase
// 0x0010 (0x0010 - 0x0000)
struct ModActorBase_C_ExecuteUbergraph_ModActorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModActorBase_C_ExecuteUbergraph_ModActorBase) == 0x000008, "Wrong alignment on ModActorBase_C_ExecuteUbergraph_ModActorBase");
static_assert(sizeof(ModActorBase_C_ExecuteUbergraph_ModActorBase) == 0x000010, "Wrong size on ModActorBase_C_ExecuteUbergraph_ModActorBase");
static_assert(offsetof(ModActorBase_C_ExecuteUbergraph_ModActorBase, EntryPoint) == 0x000000, "Member 'ModActorBase_C_ExecuteUbergraph_ModActorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(ModActorBase_C_ExecuteUbergraph_ModActorBase, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'ModActorBase_C_ExecuteUbergraph_ModActorBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ModActorBase_C_ExecuteUbergraph_ModActorBase, K2Node_Event_OtherActor) == 0x000008, "Member 'ModActorBase_C_ExecuteUbergraph_ModActorBase::K2Node_Event_OtherActor' has a wrong offset!");

// Function ModActorBase.ModActorBase_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct ModActorBase_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModActorBase_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on ModActorBase_C_ReceiveActorBeginOverlap");
static_assert(sizeof(ModActorBase_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on ModActorBase_C_ReceiveActorBeginOverlap");
static_assert(offsetof(ModActorBase_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'ModActorBase_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function ModActorBase.ModActorBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ModActorBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModActorBase_C_ReceiveTick) == 0x000004, "Wrong alignment on ModActorBase_C_ReceiveTick");
static_assert(sizeof(ModActorBase_C_ReceiveTick) == 0x000004, "Wrong size on ModActorBase_C_ReceiveTick");
static_assert(offsetof(ModActorBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ModActorBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

}

