#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModUserWidgetBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ModUserWidgetBase.ModUserWidgetBase_C
// 0x0020 (0x02B0 - 0x0290)
class UModUserWidgetBase_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 MLVersion;                                         // 0x0298(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)
	class UModLoaderManager_C*                    ModLoaderManager;                                  // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ModUserWidgetBase(int32 EntryPoint);
	void PostInit();
	void Init();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ModUserWidgetBase_C">();
	}
	static class UModUserWidgetBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UModUserWidgetBase_C>();
	}
};
static_assert(alignof(UModUserWidgetBase_C) == 0x000008, "Wrong alignment on UModUserWidgetBase_C");
static_assert(sizeof(UModUserWidgetBase_C) == 0x0002B0, "Wrong size on UModUserWidgetBase_C");
static_assert(offsetof(UModUserWidgetBase_C, UberGraphFrame) == 0x000290, "Member 'UModUserWidgetBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UModUserWidgetBase_C, MLVersion) == 0x000298, "Member 'UModUserWidgetBase_C::MLVersion' has a wrong offset!");
static_assert(offsetof(UModUserWidgetBase_C, ModLoaderManager) == 0x0002A8, "Member 'UModUserWidgetBase_C::ModLoaderManager' has a wrong offset!");

}

