#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MoreHeistAtmoVarObjectMenu

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function MoreHeistAtmoVarObjectMenu.MoreHeistAtmoVarObjectMenu_C.ExecuteUbergraph_MoreHeistAtmoVarObjectMenu
// 0x00A8 (0x00A8 - 0x0000)
struct MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZOnlineMatchmakingParams            CallFunc_GetMatchmakingParameters_ReturnValue;     // 0x0008(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWP_VariationSelector_C*                CallFunc_Create_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_FindPersistentModObjectByClass_ObjectInstance; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindPersistentModObjectByClass_bFound;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Map_Find_Value;                           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMoreHeistAtmospherePersistent_C*       K2Node_DynamicCast_AsMore_Heist_Atmosphere_Persistent; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_SetTables_Weather;                        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             CallFunc_SetTables_Time;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameEventBroker*                    CallFunc_GetGameEventBroker_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu) == 0x000008, "Wrong alignment on MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu");
static_assert(sizeof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu) == 0x0000A8, "Wrong size on MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, EntryPoint) == 0x000000, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_GetMatchmakingParameters_ReturnValue) == 0x000008, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_GetMatchmakingParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_Create_ReturnValue) == 0x000048, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_FindPersistentModObjectByClass_ObjectInstance) == 0x000050, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_FindPersistentModObjectByClass_ObjectInstance' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_FindPersistentModObjectByClass_bFound) == 0x000058, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_FindPersistentModObjectByClass_bFound' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_Map_Find_Value) == 0x000060, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_Map_Find_ReturnValue) == 0x000070, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, K2Node_DynamicCast_AsMore_Heist_Atmosphere_Persistent) == 0x000078, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::K2Node_DynamicCast_AsMore_Heist_Atmosphere_Persistent' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_SetTables_Weather) == 0x000088, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_SetTables_Weather' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_SetTables_Time) == 0x000090, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_SetTables_Time' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000098, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu, CallFunc_GetGameEventBroker_ReturnValue) == 0x0000A0, "Member 'MoreHeistAtmoVarObjectMenu_C_ExecuteUbergraph_MoreHeistAtmoVarObjectMenu::CallFunc_GetGameEventBroker_ReturnValue' has a wrong offset!");

// Function MoreHeistAtmoVarObjectMenu.MoreHeistAtmoVarObjectMenu_C.LoadIsWeatherRandomized
// 0x0060 (0x0060 - 0x0000)
struct MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized final
{
public:
	struct FFallbackStruct                        CallFunc_GetProjectDirectories_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_ReadText_Output;                          // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ReadText_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_SaveText_Error;                           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveText_ReturnValue;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FileExists_ReturnValue;                   // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Conv_IntToBool_ReturnValue;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized) == 0x000008, "Wrong alignment on MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized");
static_assert(sizeof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized) == 0x000060, "Wrong size on MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_GetProjectDirectories_ReturnValue) == 0x000000, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_GetProjectDirectories_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000004, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_ReadText_Output) == 0x000028, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_ReadText_Output' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_ReadText_ReturnValue) == 0x000038, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_ReadText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_SaveText_Error) == 0x000040, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_SaveText_Error' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_SaveText_ReturnValue) == 0x000050, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_SaveText_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_Conv_StringToInt_ReturnValue) == 0x000054, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_FileExists_ReturnValue) == 0x000058, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_FileExists_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized, CallFunc_Conv_IntToBool_ReturnValue) == 0x000059, "Member 'MoreHeistAtmoVarObjectMenu_C_LoadIsWeatherRandomized::CallFunc_Conv_IntToBool_ReturnValue' has a wrong offset!");

// Function MoreHeistAtmoVarObjectMenu.MoreHeistAtmoVarObjectMenu_C.SaveIsWeatherRandomized
// 0x0040 (0x0040 - 0x0000)
struct MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized final
{
public:
	struct FFallbackStruct                        CallFunc_GetProjectDirectories_ReturnValue;        // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SaveText_Error;                           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_SaveText_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized) == 0x000008, "Wrong alignment on MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized");
static_assert(sizeof(MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized) == 0x000040, "Wrong size on MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized, CallFunc_GetProjectDirectories_ReturnValue) == 0x000000, "Member 'MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized::CallFunc_GetProjectDirectories_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized, CallFunc_Conv_BoolToInt_ReturnValue) == 0x000004, "Member 'MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized::CallFunc_Conv_BoolToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized, CallFunc_SaveText_Error) == 0x000028, "Member 'MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized::CallFunc_SaveText_Error' has a wrong offset!");
static_assert(offsetof(MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized, CallFunc_SaveText_ReturnValue) == 0x000038, "Member 'MoreHeistAtmoVarObjectMenu_C_SaveIsWeatherRandomized::CallFunc_SaveText_ReturnValue' has a wrong offset!");

}

