#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NRFTWAtmoVarHeist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "MoreHeistAtmoVarObjectHeist_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NRFTWAtmoVarHeist.NRFTWAtmoVarHeist_C
// 0x0018 (0x0320 - 0x0308)
class ANRFTWAtmoVarHeist_C final : public AMoreHeistAtmoVarObjectHeist_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NRFTWAtmoVarHeist_C;                // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ADirectionalLight*                      DirectionalLight;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DirLightTargetValue;                               // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_NRFTWAtmoVarHeist(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void TimeSet(const struct FTimeSettings& TimeSettings);
	void ReceiveBeginPlay();
	void TickExec_F08F7DC24B7798AA50E3BC9749ABDAE3(const class UDelegateTimer* Timer, float ElapsedTime, float TimeSinceLast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NRFTWAtmoVarHeist_C">();
	}
	static class ANRFTWAtmoVarHeist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANRFTWAtmoVarHeist_C>();
	}
};
static_assert(alignof(ANRFTWAtmoVarHeist_C) == 0x000008, "Wrong alignment on ANRFTWAtmoVarHeist_C");
static_assert(sizeof(ANRFTWAtmoVarHeist_C) == 0x000320, "Wrong size on ANRFTWAtmoVarHeist_C");
static_assert(offsetof(ANRFTWAtmoVarHeist_C, UberGraphFrame_NRFTWAtmoVarHeist_C) == 0x000308, "Member 'ANRFTWAtmoVarHeist_C::UberGraphFrame_NRFTWAtmoVarHeist_C' has a wrong offset!");
static_assert(offsetof(ANRFTWAtmoVarHeist_C, DirectionalLight) == 0x000310, "Member 'ANRFTWAtmoVarHeist_C::DirectionalLight' has a wrong offset!");
static_assert(offsetof(ANRFTWAtmoVarHeist_C, DirLightTargetValue) == 0x000318, "Member 'ANRFTWAtmoVarHeist_C::DirLightTargetValue' has a wrong offset!");

}

