#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PenthouseHeistObject

#include "Basic.hpp"

#include "TimeSettings_structs.hpp"


namespace SDK::Params
{

// Function PenthouseHeistObject.PenthouseHeistObject_C.ExecuteUbergraph_PenthouseHeistObject
// 0x06B0 (0x06B0 - 0x0000)
struct PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FTimeSettings& TimeSettings)> K2Node_CreateDelegate_OutputDelegate;  // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSettings                          K2Node_CustomEvent_TimeSettings;                   // 0x0020(0x05B0)(HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x05D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x05E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x05E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ADirectionalLight*                      CallFunc_GetActorOfClass_ReturnValue;              // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x05F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F1[0x3];                                      // 0x05F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FA[0x6];                                      // 0x05FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelegateTimer*                         CallFunc_CreateDelegateTimer_ReturnValue;          // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0608(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0609(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x060A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x060B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_60C[0x4];                                      // 0x060C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDelegateTimer*                         Temp_object_Variable;                              // 0x0610(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_3;                  // 0x0618(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_619[0x3];                                      // 0x0619(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x061C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_4;                  // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AStaticMeshActor*>               CallFunc_GetAllActorsOfClass_OutActors;            // 0x0628(0x0010)(ReferenceParm)
	class AStaticMeshActor*                       CallFunc_Array_Get_Item;                           // 0x0638(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0640(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_644[0x4];                                      // 0x0644(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0648(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0658(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x065C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65D[0x3];                                      // 0x065D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class UDelegateTimer*                   K2Node_CustomEvent_Timer;                          // 0x0660(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_ElapsedTime;                    // 0x0668(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeSinceLast;                  // 0x066C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class UDelegateTimer* Timer, float ElapsedTime, float TimeSinceLast)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0670(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0684(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_685[0x3];                                      // 0x0685(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x068C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x068D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_68E[0x2];                                      // 0x068E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0690(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0694(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_695[0x3];                                      // 0x0695(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AVolumetricCloud*                       CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x06A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x06A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_5;                  // 0x06A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject) == 0x000010, "Wrong alignment on PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject");
static_assert(sizeof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject) == 0x0006B0, "Wrong size on PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, EntryPoint) == 0x000000, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::EntryPoint' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, Temp_int_Array_Index_Variable) == 0x000004, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_CustomEvent_TimeSettings) == 0x000020, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_CustomEvent_TimeSettings' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_Event_DeltaSeconds) == 0x0005D0, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0005D4, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0005D8, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0005DC, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0005E0, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0005E1, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0005E2, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_BooleanOR_ReturnValue) == 0x0005E3, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_GetActorOfClass_ReturnValue) == 0x0005E8, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_BooleanOR_ReturnValue_1) == 0x0005F0, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_Lerp_ReturnValue) == 0x0005F4, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0005F8, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0005F9, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_CreateDelegateTimer_ReturnValue) == 0x000600, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_CreateDelegateTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000608, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_IsValid_ReturnValue) == 0x000609, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x00060A, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_BooleanOR_ReturnValue_2) == 0x00060B, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, Temp_object_Variable) == 0x000610, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_BooleanOR_ReturnValue_3) == 0x000618, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_BooleanOR_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, Temp_float_Variable) == 0x00061C, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_BooleanOR_ReturnValue_4) == 0x000620, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_BooleanOR_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_GetAllActorsOfClass_OutActors) == 0x000628, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_Array_Get_Item) == 0x000638, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_Array_Length_ReturnValue) == 0x000640, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_GetDisplayName_ReturnValue) == 0x000648, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, Temp_float_Variable_1) == 0x000658, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::Temp_float_Variable_1' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_Contains_ReturnValue) == 0x00065C, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_CustomEvent_Timer) == 0x000660, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_CustomEvent_Timer' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_CustomEvent_ElapsedTime) == 0x000668, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_CustomEvent_ElapsedTime' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_CustomEvent_TimeSinceLast) == 0x00066C, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_CustomEvent_TimeSinceLast' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_CreateDelegate_OutputDelegate_1) == 0x000670, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_SwitchEnum_CmpSuccess) == 0x000684, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, Temp_int_Loop_Counter_Variable) == 0x000688, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_Less_IntInt_ReturnValue) == 0x00068C, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_SwitchEnum_CmpSuccess_1) == 0x00068D, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_Add_IntInt_ReturnValue) == 0x000690, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_SwitchEnum_CmpSuccess_2) == 0x000694, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000698, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_IsValid_ReturnValue_1) == 0x0006A0, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x0006A1, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x0006A2, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, K2Node_SwitchEnum_CmpSuccess_3) == 0x0006A3, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject, CallFunc_BooleanOR_ReturnValue_5) == 0x0006A4, "Member 'PenthouseHeistObject_C_ExecuteUbergraph_PenthouseHeistObject::CallFunc_BooleanOR_ReturnValue_5' has a wrong offset!");

// Function PenthouseHeistObject.PenthouseHeistObject_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct PenthouseHeistObject_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PenthouseHeistObject_C_ReceiveTick) == 0x000004, "Wrong alignment on PenthouseHeistObject_C_ReceiveTick");
static_assert(sizeof(PenthouseHeistObject_C_ReceiveTick) == 0x000004, "Wrong size on PenthouseHeistObject_C_ReceiveTick");
static_assert(offsetof(PenthouseHeistObject_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'PenthouseHeistObject_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function PenthouseHeistObject.PenthouseHeistObject_C.TimeSet
// 0x05B0 (0x05B0 - 0x0000)
struct PenthouseHeistObject_C_TimeSet final
{
public:
	struct FTimeSettings                          TimeSettings;                                      // 0x0000(0x05B0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(PenthouseHeistObject_C_TimeSet) == 0x000010, "Wrong alignment on PenthouseHeistObject_C_TimeSet");
static_assert(sizeof(PenthouseHeistObject_C_TimeSet) == 0x0005B0, "Wrong size on PenthouseHeistObject_C_TimeSet");
static_assert(offsetof(PenthouseHeistObject_C_TimeSet, TimeSettings) == 0x000000, "Member 'PenthouseHeistObject_C_TimeSet::TimeSettings' has a wrong offset!");

// Function PenthouseHeistObject.PenthouseHeistObject_C.TickExec_D530E90D4C53879745BB24846681CA28
// 0x0010 (0x0010 - 0x0000)
struct PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28 final
{
public:
	const class UDelegateTimer*                   Timer;                                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime;                                       // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeSinceLast;                                     // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28) == 0x000008, "Wrong alignment on PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28");
static_assert(sizeof(PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28) == 0x000010, "Wrong size on PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28");
static_assert(offsetof(PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28, Timer) == 0x000000, "Member 'PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28::Timer' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28, ElapsedTime) == 0x000008, "Member 'PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28::ElapsedTime' has a wrong offset!");
static_assert(offsetof(PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28, TimeSinceLast) == 0x00000C, "Member 'PenthouseHeistObject_C_TickExec_D530E90D4C53879745BB24846681CA28::TimeSinceLast' has a wrong offset!");

}

