#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PrefabricatorRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PrefabricatorRuntime_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class PrefabricatorRuntime.PrefabActor
// 0x0020 (0x02C8 - 0x02A8)
class APrefabActor : public AActor
{
public:
	class UPrefabComponent*                       PrefabComponent;                                   // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  LastUpdateID;                                      // 0x02B0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Seed;                                              // 0x02C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C4[0x3];                                      // 0x02C4(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsLocked;                                         // 0x02C7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class UPrefabricatorAsset* GetPrefabAsset();
	bool IsPrefabOutdated();
	void LoadPrefab();
	void RandomizeSeed(const struct FRandomStream& InRandom, bool bRecursive);
	void SavePrefab();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabActor">();
	}
	static class APrefabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabActor>();
	}
};
static_assert(alignof(APrefabActor) == 0x000008, "Wrong alignment on APrefabActor");
static_assert(sizeof(APrefabActor) == 0x0002C8, "Wrong size on APrefabActor");
static_assert(offsetof(APrefabActor, PrefabComponent) == 0x0002A8, "Member 'APrefabActor::PrefabComponent' has a wrong offset!");
static_assert(offsetof(APrefabActor, LastUpdateID) == 0x0002B0, "Member 'APrefabActor::LastUpdateID' has a wrong offset!");
static_assert(offsetof(APrefabActor, Seed) == 0x0002C0, "Member 'APrefabActor::Seed' has a wrong offset!");
static_assert(offsetof(APrefabActor, bIsLocked) == 0x0002C7, "Member 'APrefabActor::bIsLocked' has a wrong offset!");

// Class PrefabricatorRuntime.ReplicablePrefabActor
// 0x0000 (0x02C8 - 0x02C8)
class AReplicablePrefabActor final : public APrefabActor
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"ReplicablePrefabActor">();
	}
	static class AReplicablePrefabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AReplicablePrefabActor>();
	}
};
static_assert(alignof(AReplicablePrefabActor) == 0x000008, "Wrong alignment on AReplicablePrefabActor");
static_assert(sizeof(AReplicablePrefabActor) == 0x0002C8, "Wrong size on AReplicablePrefabActor");

// Class PrefabricatorRuntime.PrefabComponent
// 0x0030 (0x0260 - 0x0230)
class UPrefabComponent final : public USceneComponent
{
public:
	TSoftObjectPtr<class UPrefabricatorAssetInterface> PrefabAssetInterface;                         // 0x0228(0x0030)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_258[0x8];                                      // 0x0258(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabComponent">();
	}
	static class UPrefabComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabComponent>();
	}
};
static_assert(alignof(UPrefabComponent) == 0x000010, "Wrong alignment on UPrefabComponent");
static_assert(sizeof(UPrefabComponent) == 0x000260, "Wrong size on UPrefabComponent");
static_assert(offsetof(UPrefabComponent, PrefabAssetInterface) == 0x000228, "Member 'UPrefabComponent::PrefabAssetInterface' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabDebugActor
// 0x0018 (0x02C0 - 0x02A8)
class APrefabDebugActor final : public AActor
{
public:
	class AActor*                                 Actor;                                             // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ActorData;                                         // 0x02B0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabDebugActor">();
	}
	static class APrefabDebugActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabDebugActor>();
	}
};
static_assert(alignof(APrefabDebugActor) == 0x000008, "Wrong alignment on APrefabDebugActor");
static_assert(sizeof(APrefabDebugActor) == 0x0002C0, "Wrong size on APrefabDebugActor");
static_assert(offsetof(APrefabDebugActor, Actor) == 0x0002A8, "Member 'APrefabDebugActor::Actor' has a wrong offset!");
static_assert(offsetof(APrefabDebugActor, ActorData) == 0x0002B0, "Member 'APrefabDebugActor::ActorData' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabInstancingBaseActor
// 0x0060 (0x0308 - 0x02A8)
class APrefabInstancingBaseActor : public AActor
{
public:
	TArray<class AStaticMeshActor*>               ReferencedActors;                                  // 0x02A8(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B8[0x50];                                     // 0x02B8(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class AActor*> Uninstancify();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabInstancingBaseActor">();
	}
	static class APrefabInstancingBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabInstancingBaseActor>();
	}
};
static_assert(alignof(APrefabInstancingBaseActor) == 0x000008, "Wrong alignment on APrefabInstancingBaseActor");
static_assert(sizeof(APrefabInstancingBaseActor) == 0x000308, "Wrong size on APrefabInstancingBaseActor");
static_assert(offsetof(APrefabInstancingBaseActor, ReferencedActors) == 0x0002A8, "Member 'APrefabInstancingBaseActor::ReferencedActors' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabHSMIActor
// 0x0008 (0x0310 - 0x0308)
class APrefabHSMIActor final : public APrefabInstancingBaseActor
{
public:
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabHSMIActor">();
	}
	static class APrefabHSMIActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabHSMIActor>();
	}
};
static_assert(alignof(APrefabHSMIActor) == 0x000008, "Wrong alignment on APrefabHSMIActor");
static_assert(sizeof(APrefabHSMIActor) == 0x000310, "Wrong size on APrefabHSMIActor");
static_assert(offsetof(APrefabHSMIActor, HierarchicalInstancedStaticMesh) == 0x000308, "Member 'APrefabHSMIActor::HierarchicalInstancedStaticMesh' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabInstancingActor
// 0x0058 (0x0300 - 0x02A8)
class APrefabInstancingActor final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UHierarchicalInstancedStaticMeshComponent* HierarchicalInstancedStaticMesh;                // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bISM;                                              // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AStaticMeshActor*>               ReferencedActors;                                  // 0x02C0(0x0010)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D0[0x30];                                     // 0x02D0(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabInstancingActor">();
	}
	static class APrefabInstancingActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabInstancingActor>();
	}
};
static_assert(alignof(APrefabInstancingActor) == 0x000008, "Wrong alignment on APrefabInstancingActor");
static_assert(sizeof(APrefabInstancingActor) == 0x000300, "Wrong size on APrefabInstancingActor");
static_assert(offsetof(APrefabInstancingActor, InstancedStaticMesh) == 0x0002A8, "Member 'APrefabInstancingActor::InstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(APrefabInstancingActor, HierarchicalInstancedStaticMesh) == 0x0002B0, "Member 'APrefabInstancingActor::HierarchicalInstancedStaticMesh' has a wrong offset!");
static_assert(offsetof(APrefabInstancingActor, bISM) == 0x0002B8, "Member 'APrefabInstancingActor::bISM' has a wrong offset!");
static_assert(offsetof(APrefabInstancingActor, ReferencedActors) == 0x0002C0, "Member 'APrefabInstancingActor::ReferencedActors' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabInstancingMeshActor
// 0x0008 (0x0310 - 0x0308)
class APrefabInstancingMeshActor final : public APrefabInstancingBaseActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMesh;                               // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabInstancingMeshActor">();
	}
	static class APrefabInstancingMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabInstancingMeshActor>();
	}
};
static_assert(alignof(APrefabInstancingMeshActor) == 0x000008, "Wrong alignment on APrefabInstancingMeshActor");
static_assert(sizeof(APrefabInstancingMeshActor) == 0x000310, "Wrong size on APrefabInstancingMeshActor");
static_assert(offsetof(APrefabInstancingMeshActor, InstancedStaticMesh) == 0x000308, "Member 'APrefabInstancingMeshActor::InstancedStaticMesh' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabRandomizer
// 0x0040 (0x02E8 - 0x02A8)
class APrefabRandomizer final : public AActor
{
public:
	bool                                          bRandomizeOnBeginPlay;                             // 0x02A8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SeedOffset;                                        // 0x02AC(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxBuildTimePerFrame;                              // 0x02B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnRandomizationComplete;                           // 0x02B8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bFastSyncBuild;                                    // 0x02C8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C9[0x1F];                                     // 0x02C9(0x001F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Randomize(int32 InSeed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabRandomizer">();
	}
	static class APrefabRandomizer* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabRandomizer>();
	}
};
static_assert(alignof(APrefabRandomizer) == 0x000008, "Wrong alignment on APrefabRandomizer");
static_assert(sizeof(APrefabRandomizer) == 0x0002E8, "Wrong size on APrefabRandomizer");
static_assert(offsetof(APrefabRandomizer, bRandomizeOnBeginPlay) == 0x0002A8, "Member 'APrefabRandomizer::bRandomizeOnBeginPlay' has a wrong offset!");
static_assert(offsetof(APrefabRandomizer, SeedOffset) == 0x0002AC, "Member 'APrefabRandomizer::SeedOffset' has a wrong offset!");
static_assert(offsetof(APrefabRandomizer, MaxBuildTimePerFrame) == 0x0002B0, "Member 'APrefabRandomizer::MaxBuildTimePerFrame' has a wrong offset!");
static_assert(offsetof(APrefabRandomizer, OnRandomizationComplete) == 0x0002B8, "Member 'APrefabRandomizer::OnRandomizationComplete' has a wrong offset!");
static_assert(offsetof(APrefabRandomizer, bFastSyncBuild) == 0x0002C8, "Member 'APrefabRandomizer::bFastSyncBuild' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabricatorProperty
// 0x0048 (0x0078 - 0x0030)
class UPrefabricatorProperty final : public UObject
{
public:
	class FString                                 PropertyName;                                      // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ExportedValue;                                     // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FPrefabricatorPropertyAssetMapping> AssetSoftReferenceMappings;                    // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bIsCrossReferencedActor;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CrossReferencePrefabActorId;                       // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabricatorProperty">();
	}
	static class UPrefabricatorProperty* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorProperty>();
	}
};
static_assert(alignof(UPrefabricatorProperty) == 0x000008, "Wrong alignment on UPrefabricatorProperty");
static_assert(sizeof(UPrefabricatorProperty) == 0x000078, "Wrong size on UPrefabricatorProperty");
static_assert(offsetof(UPrefabricatorProperty, PropertyName) == 0x000030, "Member 'UPrefabricatorProperty::PropertyName' has a wrong offset!");
static_assert(offsetof(UPrefabricatorProperty, ExportedValue) == 0x000040, "Member 'UPrefabricatorProperty::ExportedValue' has a wrong offset!");
static_assert(offsetof(UPrefabricatorProperty, AssetSoftReferenceMappings) == 0x000050, "Member 'UPrefabricatorProperty::AssetSoftReferenceMappings' has a wrong offset!");
static_assert(offsetof(UPrefabricatorProperty, bIsCrossReferencedActor) == 0x000060, "Member 'UPrefabricatorProperty::bIsCrossReferencedActor' has a wrong offset!");
static_assert(offsetof(UPrefabricatorProperty, CrossReferencePrefabActorId) == 0x000064, "Member 'UPrefabricatorProperty::CrossReferencePrefabActorId' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabricatorEventListener
// 0x0000 (0x0030 - 0x0030)
class UPrefabricatorEventListener final : public UObject
{
public:
	void PostSpawn(class APrefabActor* Prefab);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabricatorEventListener">();
	}
	static class UPrefabricatorEventListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorEventListener>();
	}
};
static_assert(alignof(UPrefabricatorEventListener) == 0x000008, "Wrong alignment on UPrefabricatorEventListener");
static_assert(sizeof(UPrefabricatorEventListener) == 0x000030, "Wrong size on UPrefabricatorEventListener");

// Class PrefabricatorRuntime.PrefabricatorAssetInterface
// 0x0010 (0x0040 - 0x0030)
class UPrefabricatorAssetInterface : public UObject
{
public:
	TSubclassOf<class UPrefabricatorEventListener> EventListener;                                    // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReplicates;                                       // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabricatorAssetInterface">();
	}
	static class UPrefabricatorAssetInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorAssetInterface>();
	}
};
static_assert(alignof(UPrefabricatorAssetInterface) == 0x000008, "Wrong alignment on UPrefabricatorAssetInterface");
static_assert(sizeof(UPrefabricatorAssetInterface) == 0x000040, "Wrong size on UPrefabricatorAssetInterface");
static_assert(offsetof(UPrefabricatorAssetInterface, EventListener) == 0x000030, "Member 'UPrefabricatorAssetInterface::EventListener' has a wrong offset!");
static_assert(offsetof(UPrefabricatorAssetInterface, bReplicates) == 0x000038, "Member 'UPrefabricatorAssetInterface::bReplicates' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabricatorAsset
// 0x0038 (0x0078 - 0x0040)
class UPrefabricatorAsset final : public UPrefabricatorAssetInterface
{
public:
	TArray<struct FPrefabricatorActorData>        ActorData;                                         // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	EComponentMobility                            PrefabMobility;                                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  LastUpdateID;                                      // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UThumbnailInfo*                         ThumbnailInfo;                                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        Version;                                           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabricatorAsset">();
	}
	static class UPrefabricatorAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorAsset>();
	}
};
static_assert(alignof(UPrefabricatorAsset) == 0x000008, "Wrong alignment on UPrefabricatorAsset");
static_assert(sizeof(UPrefabricatorAsset) == 0x000078, "Wrong size on UPrefabricatorAsset");
static_assert(offsetof(UPrefabricatorAsset, ActorData) == 0x000040, "Member 'UPrefabricatorAsset::ActorData' has a wrong offset!");
static_assert(offsetof(UPrefabricatorAsset, PrefabMobility) == 0x000050, "Member 'UPrefabricatorAsset::PrefabMobility' has a wrong offset!");
static_assert(offsetof(UPrefabricatorAsset, LastUpdateID) == 0x000054, "Member 'UPrefabricatorAsset::LastUpdateID' has a wrong offset!");
static_assert(offsetof(UPrefabricatorAsset, ThumbnailInfo) == 0x000068, "Member 'UPrefabricatorAsset::ThumbnailInfo' has a wrong offset!");
static_assert(offsetof(UPrefabricatorAsset, Version) == 0x000070, "Member 'UPrefabricatorAsset::Version' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabricatorAssetCollection
// 0x0018 (0x0058 - 0x0040)
class UPrefabricatorAssetCollection final : public UPrefabricatorAssetInterface
{
public:
	TArray<struct FPrefabricatorAssetCollectionItem> Prefabs;                                        // 0x0040(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint32                                        Version;                                           // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabricatorAssetCollection">();
	}
	static class UPrefabricatorAssetCollection* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorAssetCollection>();
	}
};
static_assert(alignof(UPrefabricatorAssetCollection) == 0x000008, "Wrong alignment on UPrefabricatorAssetCollection");
static_assert(sizeof(UPrefabricatorAssetCollection) == 0x000058, "Wrong size on UPrefabricatorAssetCollection");
static_assert(offsetof(UPrefabricatorAssetCollection, Prefabs) == 0x000040, "Member 'UPrefabricatorAssetCollection::Prefabs' has a wrong offset!");
static_assert(offsetof(UPrefabricatorAssetCollection, Version) == 0x000050, "Member 'UPrefabricatorAssetCollection::Version' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabricatorAssetUserData
// 0x0018 (0x0048 - 0x0030)
class UPrefabricatorAssetUserData final : public UAssetUserData
{
public:
	TWeakObjectPtr<class APrefabActor>            PrefabActor;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ItemID;                                            // 0x0038(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabricatorAssetUserData">();
	}
	static class UPrefabricatorAssetUserData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorAssetUserData>();
	}
};
static_assert(alignof(UPrefabricatorAssetUserData) == 0x000008, "Wrong alignment on UPrefabricatorAssetUserData");
static_assert(sizeof(UPrefabricatorAssetUserData) == 0x000048, "Wrong size on UPrefabricatorAssetUserData");
static_assert(offsetof(UPrefabricatorAssetUserData, PrefabActor) == 0x000030, "Member 'UPrefabricatorAssetUserData::PrefabActor' has a wrong offset!");
static_assert(offsetof(UPrefabricatorAssetUserData, ItemID) == 0x000038, "Member 'UPrefabricatorAssetUserData::ItemID' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabricatorBlueprintLibrary
// 0x0000 (0x0030 - 0x0030)
class UPrefabricatorBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void GetAllAttachedActors(class AActor* Prefab, TArray<class AActor*>* AttachedActors);
	static void RandomizePrefab(class APrefabActor* PrefabActor, const struct FRandomStream& InRandom);
	static class APrefabActor* SpawnPrefab(const class UObject* WorldContextObject, class UPrefabricatorAssetInterface* Prefab, const struct FTransform& Transform, int32 Seed);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabricatorBlueprintLibrary">();
	}
	static class UPrefabricatorBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorBlueprintLibrary>();
	}
};
static_assert(alignof(UPrefabricatorBlueprintLibrary) == 0x000008, "Wrong alignment on UPrefabricatorBlueprintLibrary");
static_assert(sizeof(UPrefabricatorBlueprintLibrary) == 0x000030, "Wrong size on UPrefabricatorBlueprintLibrary");

// Class PrefabricatorRuntime.PrefabricatorSettings
// 0x0018 (0x0060 - 0x0048)
class UPrefabricatorSettings final : public UDeveloperSettings
{
public:
	EPrefabricatorPivotPosition                   PivotPosition;                                     // 0x0048(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAllowDynamicUpdate;                               // 0x0049(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DefaultThumbnailPitch;                             // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultThumbnailYaw;                               // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DefaultThumbnailZoom;                              // 0x0054(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCenteredPivotOnMerge;                             // 0x0058(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabricatorSettings">();
	}
	static class UPrefabricatorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabricatorSettings>();
	}
};
static_assert(alignof(UPrefabricatorSettings) == 0x000008, "Wrong alignment on UPrefabricatorSettings");
static_assert(sizeof(UPrefabricatorSettings) == 0x000060, "Wrong size on UPrefabricatorSettings");
static_assert(offsetof(UPrefabricatorSettings, PivotPosition) == 0x000048, "Member 'UPrefabricatorSettings::PivotPosition' has a wrong offset!");
static_assert(offsetof(UPrefabricatorSettings, bAllowDynamicUpdate) == 0x000049, "Member 'UPrefabricatorSettings::bAllowDynamicUpdate' has a wrong offset!");
static_assert(offsetof(UPrefabricatorSettings, DefaultThumbnailPitch) == 0x00004C, "Member 'UPrefabricatorSettings::DefaultThumbnailPitch' has a wrong offset!");
static_assert(offsetof(UPrefabricatorSettings, DefaultThumbnailYaw) == 0x000050, "Member 'UPrefabricatorSettings::DefaultThumbnailYaw' has a wrong offset!");
static_assert(offsetof(UPrefabricatorSettings, DefaultThumbnailZoom) == 0x000054, "Member 'UPrefabricatorSettings::DefaultThumbnailZoom' has a wrong offset!");
static_assert(offsetof(UPrefabricatorSettings, bCenteredPivotOnMerge) == 0x000058, "Member 'UPrefabricatorSettings::bCenteredPivotOnMerge' has a wrong offset!");

// Class PrefabricatorRuntime.PrefabSeedLinkerComponent
// 0x0000 (0x0230 - 0x0230)
class UPrefabSeedLinkerComponent final : public USceneComponent
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabSeedLinkerComponent">();
	}
	static class UPrefabSeedLinkerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrefabSeedLinkerComponent>();
	}
};
static_assert(alignof(UPrefabSeedLinkerComponent) == 0x000010, "Wrong alignment on UPrefabSeedLinkerComponent");
static_assert(sizeof(UPrefabSeedLinkerComponent) == 0x000230, "Wrong size on UPrefabSeedLinkerComponent");

// Class PrefabricatorRuntime.PrefabSeedLinker
// 0x0018 (0x02C0 - 0x02A8)
class APrefabSeedLinker final : public AActor
{
public:
	TArray<TWeakObjectPtr<class APrefabActor>>    LinkedActors;                                      // 0x02A8(0x0010)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class UPrefabSeedLinkerComponent*             SeedLinkerComponent;                               // 0x02B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"PrefabSeedLinker">();
	}
	static class APrefabSeedLinker* GetDefaultObj()
	{
		return GetDefaultObjImpl<APrefabSeedLinker>();
	}
};
static_assert(alignof(APrefabSeedLinker) == 0x000008, "Wrong alignment on APrefabSeedLinker");
static_assert(sizeof(APrefabSeedLinker) == 0x0002C0, "Wrong size on APrefabSeedLinker");
static_assert(offsetof(APrefabSeedLinker, LinkedActors) == 0x0002A8, "Member 'APrefabSeedLinker::LinkedActors' has a wrong offset!");
static_assert(offsetof(APrefabSeedLinker, SeedLinkerComponent) == 0x0002B8, "Member 'APrefabSeedLinker::SeedLinkerComponent' has a wrong offset!");

}

