#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RinoHud_SaveGame_Struct

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct RinoHud_SaveGame_Struct.RinoHud_SaveGame_Struct
// 0x0028 (0x0028 - 0x0000)
struct FRinoHud_SaveGame_Struct final
{
public:
	int32                                         Version_19_5034E0DC44F9383AAABA9FABFCBD6D2E;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowPagers_10_4506AA3249080EB82F34268613AA1AF9;   // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          bShowGuardsInStealth_11_C08C18894FEBA1EEB7818B90636362BF; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          bShowCamerasInStealth_12_C73C4D42411FD1387E7AA0B027DA89CE; // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          bShowCivies_22_92659DEF403E957E3A12E6A4D0468544;   // 0x0007(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          bShowSpecialUnits_13_E4714D414396B9A9E017FD837B5B81B4; // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          bShowCollectables_23_40429A4B4F91E751B5AB83A3760D083D; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          bShowMissionItems_24_A0F6AFAA408D74F91D7B0FAEFDCB7331; // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          bShowTimedActions_16_5EDEEF0241B4DD316A84C08446D86996; // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          bShowDeployables_17_A773F80C463EA7F77C5A809E8A406113; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Scale_29_27C893EF43473735A931D79C7FB15753;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              TopRightPosition_35_638DC11E40C00D03814491AB09094B69; // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAlwaysShowPing_34_959C3F924A77FAC151E3AA9B56A4DDF1; // 0x001C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 HudColor_41_AEC8EEDB4B06FF986DC385ACFF54E61C;      // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowAvailableRuntimes_43_28C1C766491024814230DEB3132C8C4B; // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowAllGuards_47_1A31EE66471EFA1457EE7DB48F41E3C7; // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bShowBags_49_4C5F454F4F096E049EC12B83B6E42B50;     // 0x0026(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bUsePlayerColors_53_2202F0CB469D131DEF551FA780B0FDCF; // 0x0027(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FRinoHud_SaveGame_Struct) == 0x000004, "Wrong alignment on FRinoHud_SaveGame_Struct");
static_assert(sizeof(FRinoHud_SaveGame_Struct) == 0x000028, "Wrong size on FRinoHud_SaveGame_Struct");
static_assert(offsetof(FRinoHud_SaveGame_Struct, Version_19_5034E0DC44F9383AAABA9FABFCBD6D2E) == 0x000000, "Member 'FRinoHud_SaveGame_Struct::Version_19_5034E0DC44F9383AAABA9FABFCBD6D2E' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowPagers_10_4506AA3249080EB82F34268613AA1AF9) == 0x000004, "Member 'FRinoHud_SaveGame_Struct::bShowPagers_10_4506AA3249080EB82F34268613AA1AF9' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowGuardsInStealth_11_C08C18894FEBA1EEB7818B90636362BF) == 0x000005, "Member 'FRinoHud_SaveGame_Struct::bShowGuardsInStealth_11_C08C18894FEBA1EEB7818B90636362BF' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowCamerasInStealth_12_C73C4D42411FD1387E7AA0B027DA89CE) == 0x000006, "Member 'FRinoHud_SaveGame_Struct::bShowCamerasInStealth_12_C73C4D42411FD1387E7AA0B027DA89CE' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowCivies_22_92659DEF403E957E3A12E6A4D0468544) == 0x000007, "Member 'FRinoHud_SaveGame_Struct::bShowCivies_22_92659DEF403E957E3A12E6A4D0468544' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowSpecialUnits_13_E4714D414396B9A9E017FD837B5B81B4) == 0x000008, "Member 'FRinoHud_SaveGame_Struct::bShowSpecialUnits_13_E4714D414396B9A9E017FD837B5B81B4' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowCollectables_23_40429A4B4F91E751B5AB83A3760D083D) == 0x000009, "Member 'FRinoHud_SaveGame_Struct::bShowCollectables_23_40429A4B4F91E751B5AB83A3760D083D' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowMissionItems_24_A0F6AFAA408D74F91D7B0FAEFDCB7331) == 0x00000A, "Member 'FRinoHud_SaveGame_Struct::bShowMissionItems_24_A0F6AFAA408D74F91D7B0FAEFDCB7331' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowTimedActions_16_5EDEEF0241B4DD316A84C08446D86996) == 0x00000B, "Member 'FRinoHud_SaveGame_Struct::bShowTimedActions_16_5EDEEF0241B4DD316A84C08446D86996' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowDeployables_17_A773F80C463EA7F77C5A809E8A406113) == 0x00000C, "Member 'FRinoHud_SaveGame_Struct::bShowDeployables_17_A773F80C463EA7F77C5A809E8A406113' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, Scale_29_27C893EF43473735A931D79C7FB15753) == 0x000010, "Member 'FRinoHud_SaveGame_Struct::Scale_29_27C893EF43473735A931D79C7FB15753' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, TopRightPosition_35_638DC11E40C00D03814491AB09094B69) == 0x000014, "Member 'FRinoHud_SaveGame_Struct::TopRightPosition_35_638DC11E40C00D03814491AB09094B69' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bAlwaysShowPing_34_959C3F924A77FAC151E3AA9B56A4DDF1) == 0x00001C, "Member 'FRinoHud_SaveGame_Struct::bAlwaysShowPing_34_959C3F924A77FAC151E3AA9B56A4DDF1' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, HudColor_41_AEC8EEDB4B06FF986DC385ACFF54E61C) == 0x000020, "Member 'FRinoHud_SaveGame_Struct::HudColor_41_AEC8EEDB4B06FF986DC385ACFF54E61C' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowAvailableRuntimes_43_28C1C766491024814230DEB3132C8C4B) == 0x000024, "Member 'FRinoHud_SaveGame_Struct::bShowAvailableRuntimes_43_28C1C766491024814230DEB3132C8C4B' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowAllGuards_47_1A31EE66471EFA1457EE7DB48F41E3C7) == 0x000025, "Member 'FRinoHud_SaveGame_Struct::bShowAllGuards_47_1A31EE66471EFA1457EE7DB48F41E3C7' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bShowBags_49_4C5F454F4F096E049EC12B83B6E42B50) == 0x000026, "Member 'FRinoHud_SaveGame_Struct::bShowBags_49_4C5F454F4F096E049EC12B83B6E42B50' has a wrong offset!");
static_assert(offsetof(FRinoHud_SaveGame_Struct, bUsePlayerColors_53_2202F0CB469D131DEF551FA780B0FDCF) == 0x000027, "Member 'FRinoHud_SaveGame_Struct::bUsePlayerColors_53_2202F0CB469D131DEF551FA780B0FDCF' has a wrong offset!");

}

