#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RRAtmoVarHeist

#include "Basic.hpp"

#include "WeatherSettings_structs.hpp"


namespace SDK::Params
{

// Function RRAtmoVarHeist.RRAtmoVarHeist_C.ExecuteUbergraph_RRAtmoVarHeist
// 0x0140 (0x0140 - 0x0000)
struct RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FWeatherSettings& Settings)> K2Node_CreateDelegate_OutputDelegate;   // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ANiagaraActor*>                  CallFunc_GetAllActorsOfClass_OutActors;            // 0x0030(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ANiagaraActor*                          CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeatherSettings                       K2Node_CustomEvent_Settings;                       // 0x0070(0x0058)(HasGetValueTypeHash)
	TArray<class ADecalActor*>                    CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x00C8(0x0010)(ReferenceParm)
	class ADecalActor*                            CallFunc_Array_Get_Item_1;                         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASBZAmbientSound*>               CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x0108(0x0010)(ReferenceParm)
	class ASBZAmbientSound*                       CallFunc_Array_Get_Item_2;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x2];                                      // 0x013A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist) == 0x000008, "Wrong alignment on RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist");
static_assert(sizeof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist) == 0x000140, "Wrong size on RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, EntryPoint) == 0x000000, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::EntryPoint' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, Temp_int_Array_Index_Variable) == 0x000018, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, Temp_int_Array_Index_Variable_2) == 0x000028, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_GetAllActorsOfClass_OutActors) == 0x000030, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, Temp_int_Loop_Counter_Variable_1) == 0x000040, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Array_Get_Item) == 0x000048, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_GetDisplayName_ReturnValue) == 0x000050, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Add_IntInt_ReturnValue_1) == 0x000060, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Contains_ReturnValue) == 0x000064, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, K2Node_CustomEvent_Settings) == 0x000070, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::K2Node_CustomEvent_Settings' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x0000C8, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Array_Get_Item_1) == 0x0000D8, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E0, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_GetDisplayName_ReturnValue_1) == 0x0000E8, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Array_Length_ReturnValue_1) == 0x0000F8, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Contains_ReturnValue_1) == 0x0000FC, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Less_IntInt_ReturnValue) == 0x0000FD, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, Temp_int_Loop_Counter_Variable_2) == 0x000100, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x000108, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Array_Get_Item_2) == 0x000118, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Array_Length_ReturnValue_2) == 0x000120, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Less_IntInt_ReturnValue_1) == 0x000124, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_GetDisplayName_ReturnValue_2) == 0x000128, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Contains_ReturnValue_2) == 0x000138, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Less_IntInt_ReturnValue_2) == 0x000139, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist, CallFunc_Add_IntInt_ReturnValue_2) == 0x00013C, "Member 'RRAtmoVarHeist_C_ExecuteUbergraph_RRAtmoVarHeist::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");

// Function RRAtmoVarHeist.RRAtmoVarHeist_C.WeatherSet
// 0x0058 (0x0058 - 0x0000)
struct RRAtmoVarHeist_C_WeatherSet final
{
public:
	struct FWeatherSettings                       Settings;                                          // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(RRAtmoVarHeist_C_WeatherSet) == 0x000008, "Wrong alignment on RRAtmoVarHeist_C_WeatherSet");
static_assert(sizeof(RRAtmoVarHeist_C_WeatherSet) == 0x000058, "Wrong size on RRAtmoVarHeist_C_WeatherSet");
static_assert(offsetof(RRAtmoVarHeist_C_WeatherSet, Settings) == 0x000000, "Member 'RRAtmoVarHeist_C_WeatherSet::Settings' has a wrong offset!");

}

