#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_EmailStructure

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_EmailStructure.S_EmailStructure
// 0x0048 (0x0048 - 0x0000)
struct FS_EmailStructure final
{
public:
	class FText                                   Header_7_A0CF47E64178423CE3E3CFB4EB8A85BE;         // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   Body_6_ED8CEF384DA1137A24E36285D4B8E764;           // 0x0018(0x0018)(Edit, BlueprintVisible)
	class FText                                   Greetings_10_214437BC4E50314B1CBA50BD855232C2;     // 0x0030(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(FS_EmailStructure) == 0x000008, "Wrong alignment on FS_EmailStructure");
static_assert(sizeof(FS_EmailStructure) == 0x000048, "Wrong size on FS_EmailStructure");
static_assert(offsetof(FS_EmailStructure, Header_7_A0CF47E64178423CE3E3CFB4EB8A85BE) == 0x000000, "Member 'FS_EmailStructure::Header_7_A0CF47E64178423CE3E3CFB4EB8A85BE' has a wrong offset!");
static_assert(offsetof(FS_EmailStructure, Body_6_ED8CEF384DA1137A24E36285D4B8E764) == 0x000018, "Member 'FS_EmailStructure::Body_6_ED8CEF384DA1137A24E36285D4B8E764' has a wrong offset!");
static_assert(offsetof(FS_EmailStructure, Greetings_10_214437BC4E50314B1CBA50BD855232C2) == 0x000030, "Member 'FS_EmailStructure::Greetings_10_214437BC4E50314B1CBA50BD855232C2' has a wrong offset!");

}

