#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBZSmallCosmeticDestruction_fading

#include "Basic.hpp"


namespace SDK::Params
{

// Function SBZSmallCosmeticDestruction_fading.SBZSmallCosmeticDestruction_fading_C.ExecuteUbergraph_SBZSmallCosmeticDestruction_fading
// 0x000C (0x000C - 0x0000)
struct SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading) == 0x000004, "Wrong alignment on SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading");
static_assert(sizeof(SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading) == 0x00000C, "Wrong size on SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading");
static_assert(offsetof(SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading, EntryPoint) == 0x000000, "Member 'SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading::EntryPoint' has a wrong offset!");
static_assert(offsetof(SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000004, "Member 'SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading, CallFunc_FClamp_ReturnValue) == 0x000008, "Member 'SBZSmallCosmeticDestruction_fading_C_ExecuteUbergraph_SBZSmallCosmeticDestruction_fading::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function SBZSmallCosmeticDestruction_fading.SBZSmallCosmeticDestruction_fading_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct SBZSmallCosmeticDestruction_fading_C_UserConstructionScript final
{
public:
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SBZSmallCosmeticDestruction_fading_C_UserConstructionScript) == 0x000004, "Wrong alignment on SBZSmallCosmeticDestruction_fading_C_UserConstructionScript");
static_assert(sizeof(SBZSmallCosmeticDestruction_fading_C_UserConstructionScript) == 0x000008, "Wrong size on SBZSmallCosmeticDestruction_fading_C_UserConstructionScript");
static_assert(offsetof(SBZSmallCosmeticDestruction_fading_C_UserConstructionScript, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000000, "Member 'SBZSmallCosmeticDestruction_fading_C_UserConstructionScript::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SBZSmallCosmeticDestruction_fading_C_UserConstructionScript, CallFunc_FClamp_ReturnValue) == 0x000004, "Member 'SBZSmallCosmeticDestruction_fading_C_UserConstructionScript::CallFunc_FClamp_ReturnValue' has a wrong offset!");

}

