#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBZUtilityPlugin

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class SBZUtilityPlugin.SBZGameModeBase
// 0x0010 (0x0358 - 0x0348)
class ASBZGameModeBase : public AGameModeBase
{
public:
	TArray<class AActor*>                         SeamlessActors;                                    // 0x0348(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SBZGameModeBase">();
	}
	static class ASBZGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASBZGameModeBase>();
	}
};
static_assert(alignof(ASBZGameModeBase) == 0x000008, "Wrong alignment on ASBZGameModeBase");
static_assert(sizeof(ASBZGameModeBase) == 0x000358, "Wrong size on ASBZGameModeBase");
static_assert(offsetof(ASBZGameModeBase, SeamlessActors) == 0x000348, "Member 'ASBZGameModeBase::SeamlessActors' has a wrong offset!");

// Class SBZUtilityPlugin.SBZGameSessionBase
// 0x0020 (0x02E8 - 0x02C8)
class ASBZGameSessionBase : public AGameSession
{
public:
	uint8                                         Pad_2C8[0x20];                                     // 0x02C8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SBZGameSessionBase">();
	}
	static class ASBZGameSessionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASBZGameSessionBase>();
	}
};
static_assert(alignof(ASBZGameSessionBase) == 0x000008, "Wrong alignment on ASBZGameSessionBase");
static_assert(sizeof(ASBZGameSessionBase) == 0x0002E8, "Wrong size on ASBZGameSessionBase");

// Class SBZUtilityPlugin.SBZUtilityLibrary
// 0x0000 (0x0030 - 0x0030)
class USBZUtilityLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class APlayerController* GetLocalPlayerController(const class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SBZUtilityLibrary">();
	}
	static class USBZUtilityLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<USBZUtilityLibrary>();
	}
};
static_assert(alignof(USBZUtilityLibrary) == 0x000008, "Wrong alignment on USBZUtilityLibrary");
static_assert(sizeof(USBZUtilityLibrary) == 0x000030, "Wrong size on USBZUtilityLibrary");

}

