#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SBZWeaponCustomiaztionSlotButton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function SBZWeaponCustomiaztionSlotButton.SBZWeaponCustomiaztionSlotButton_C.ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton
// 0x0080 (0x0080 - 0x0000)
struct SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZModularPartSlotBase*          K2Node_CustomEvent_ModularSlot;                    // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZModularPartDataAsset*         K2Node_CustomEvent_EquippedPart;                   // 0x0010(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0060(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton) == 0x000008, "Wrong alignment on SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton");
static_assert(sizeof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton) == 0x000080, "Wrong size on SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, EntryPoint) == 0x000000, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, K2Node_CustomEvent_ModularSlot) == 0x000008, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::K2Node_CustomEvent_ModularSlot' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, K2Node_CustomEvent_EquippedPart) == 0x000010, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::K2Node_CustomEvent_EquippedPart' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, CallFunc_GetDisplayName_ReturnValue) == 0x000020, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, CallFunc_GetDisplayName_ReturnValue_1) == 0x000050, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000060, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, Temp_bool_Variable) == 0x000078, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, Temp_byte_Variable) == 0x000079, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, K2Node_Event_bInHasFocus) == 0x00007A, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, Temp_byte_Variable_1) == 0x00007B, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton, K2Node_Select_Default) == 0x00007C, "Member 'SBZWeaponCustomiaztionSlotButton_C_ExecuteUbergraph_SBZWeaponCustomiaztionSlotButton::K2Node_Select_Default' has a wrong offset!");

// Function SBZWeaponCustomiaztionSlotButton.SBZWeaponCustomiaztionSlotButton_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct SBZWeaponCustomiaztionSlotButton_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SBZWeaponCustomiaztionSlotButton_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on SBZWeaponCustomiaztionSlotButton_C_ButtonFocusedChanged");
static_assert(sizeof(SBZWeaponCustomiaztionSlotButton_C_ButtonFocusedChanged) == 0x000001, "Wrong size on SBZWeaponCustomiaztionSlotButton_C_ButtonFocusedChanged");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'SBZWeaponCustomiaztionSlotButton_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function SBZWeaponCustomiaztionSlotButton.SBZWeaponCustomiaztionSlotButton_C.Setup
// 0x0010 (0x0010 - 0x0000)
struct SBZWeaponCustomiaztionSlotButton_C_Setup final
{
public:
	const class USBZModularPartSlotBase*          ModularSlot;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZModularPartDataAsset*         EquippedPart;                                      // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SBZWeaponCustomiaztionSlotButton_C_Setup) == 0x000008, "Wrong alignment on SBZWeaponCustomiaztionSlotButton_C_Setup");
static_assert(sizeof(SBZWeaponCustomiaztionSlotButton_C_Setup) == 0x000010, "Wrong size on SBZWeaponCustomiaztionSlotButton_C_Setup");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_Setup, ModularSlot) == 0x000000, "Member 'SBZWeaponCustomiaztionSlotButton_C_Setup::ModularSlot' has a wrong offset!");
static_assert(offsetof(SBZWeaponCustomiaztionSlotButton_C_Setup, EquippedPart) == 0x000008, "Member 'SBZWeaponCustomiaztionSlotButton_C_Setup::EquippedPart' has a wrong offset!");

}

