#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_InstantLootValue

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ST_InstantLootValue.ST_InstantLootValue
// 0x0078 (0x0078 - 0x0000)
struct FST_InstantLootValue final
{
public:
	TArray<int32>                                 StealthMaxPayoutArray_5_E70B0E8741C200F9378C1B84E3AD3D3B; // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<int32>                                 LoudMaxPayoutArray_3_E8CA85934967355D1A8C5798180A4F7A; // 0x0010(0x0010)(Edit, BlueprintVisible)
	int32                                         TotalPoints_8_E886E4CC4777D0DAC3CF4A87564D6020;    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, int32>                    NameToPointMap_13_45055C5941BFDC38A3FBD28E5646CDBE; // 0x0028(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FST_InstantLootValue) == 0x000008, "Wrong alignment on FST_InstantLootValue");
static_assert(sizeof(FST_InstantLootValue) == 0x000078, "Wrong size on FST_InstantLootValue");
static_assert(offsetof(FST_InstantLootValue, StealthMaxPayoutArray_5_E70B0E8741C200F9378C1B84E3AD3D3B) == 0x000000, "Member 'FST_InstantLootValue::StealthMaxPayoutArray_5_E70B0E8741C200F9378C1B84E3AD3D3B' has a wrong offset!");
static_assert(offsetof(FST_InstantLootValue, LoudMaxPayoutArray_3_E8CA85934967355D1A8C5798180A4F7A) == 0x000010, "Member 'FST_InstantLootValue::LoudMaxPayoutArray_3_E8CA85934967355D1A8C5798180A4F7A' has a wrong offset!");
static_assert(offsetof(FST_InstantLootValue, TotalPoints_8_E886E4CC4777D0DAC3CF4A87564D6020) == 0x000020, "Member 'FST_InstantLootValue::TotalPoints_8_E886E4CC4777D0DAC3CF4A87564D6020' has a wrong offset!");
static_assert(offsetof(FST_InstantLootValue, NameToPointMap_13_45055C5941BFDC38A3FBD28E5646CDBE) == 0x000028, "Member 'FST_InstantLootValue::NameToPointMap_13_45055C5941BFDC38A3FBD28E5646CDBE' has a wrong offset!");

}

