#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_MissionPayout

#include "Basic.hpp"

#include "ST_DifficultyBasedValue_structs.hpp"
#include "ST_InstantLootValue_structs.hpp"


namespace SDK
{

// UserDefinedStruct ST_MissionPayout.ST_MissionPayout
// 0x0118 (0x0118 - 0x0000)
struct FST_MissionPayout final
{
public:
	TMap<class FString, struct FST_DifficultyBasedValue> StealthLootValuesArray_5_01E54386466F5FA1823A59B164DB5291; // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FST_DifficultyBasedValue> LoudLootValuesArray_7_41B646D44C227740664B6A84F232EC38; // 0x0050(0x0050)(Edit, BlueprintVisible)
	struct FST_InstantLootValue                   InstantLootValues_11_164DE60A47539652EAF212B6BD4A8B19; // 0x00A0(0x0078)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FST_MissionPayout) == 0x000008, "Wrong alignment on FST_MissionPayout");
static_assert(sizeof(FST_MissionPayout) == 0x000118, "Wrong size on FST_MissionPayout");
static_assert(offsetof(FST_MissionPayout, StealthLootValuesArray_5_01E54386466F5FA1823A59B164DB5291) == 0x000000, "Member 'FST_MissionPayout::StealthLootValuesArray_5_01E54386466F5FA1823A59B164DB5291' has a wrong offset!");
static_assert(offsetof(FST_MissionPayout, LoudLootValuesArray_7_41B646D44C227740664B6A84F232EC38) == 0x000050, "Member 'FST_MissionPayout::LoudLootValuesArray_7_41B646D44C227740664B6A84F232EC38' has a wrong offset!");
static_assert(offsetof(FST_MissionPayout, InstantLootValues_11_164DE60A47539652EAF212B6BD4A8B19) == 0x0000A0, "Member 'FST_MissionPayout::InstantLootValues_11_164DE60A47539652EAF212B6BD4A8B19' has a wrong offset!");

}

