#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Struct_NameLocationAndSpawn

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct Struct_NameLocationAndSpawn.Struct_NameLocationAndSpawn
// 0x0050 (0x0050 - 0x0000)
struct FStruct_NameLocationAndSpawn final
{
public:
	class ABP_RoomSpawnController_C*              HiddenCardActor_15_D834260D47DD9C1D92E8D0A376A625CA; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   MainInformation_12_31B6B7EF4490EA41E87B21903FF526AA; // 0x0008(0x0018)(Edit, BlueprintVisible)
	class FText                                   SecondaryInformation_13_5C0372EF487A8081BB05A19C496E48F4; // 0x0020(0x0018)(Edit, BlueprintVisible)
	class FText                                   AdditionalInformation_14_9469D7E54EA3821AA87C92B6B46C82C7; // 0x0038(0x0018)(Edit, BlueprintVisible)
};
static_assert(alignof(FStruct_NameLocationAndSpawn) == 0x000008, "Wrong alignment on FStruct_NameLocationAndSpawn");
static_assert(sizeof(FStruct_NameLocationAndSpawn) == 0x000050, "Wrong size on FStruct_NameLocationAndSpawn");
static_assert(offsetof(FStruct_NameLocationAndSpawn, HiddenCardActor_15_D834260D47DD9C1D92E8D0A376A625CA) == 0x000000, "Member 'FStruct_NameLocationAndSpawn::HiddenCardActor_15_D834260D47DD9C1D92E8D0A376A625CA' has a wrong offset!");
static_assert(offsetof(FStruct_NameLocationAndSpawn, MainInformation_12_31B6B7EF4490EA41E87B21903FF526AA) == 0x000008, "Member 'FStruct_NameLocationAndSpawn::MainInformation_12_31B6B7EF4490EA41E87B21903FF526AA' has a wrong offset!");
static_assert(offsetof(FStruct_NameLocationAndSpawn, SecondaryInformation_13_5C0372EF487A8081BB05A19C496E48F4) == 0x000020, "Member 'FStruct_NameLocationAndSpawn::SecondaryInformation_13_5C0372EF487A8081BB05A19C496E48F4' has a wrong offset!");
static_assert(offsetof(FStruct_NameLocationAndSpawn, AdditionalInformation_14_9469D7E54EA3821AA87C92B6B46C82C7) == 0x000038, "Member 'FStruct_NameLocationAndSpawn::AdditionalInformation_14_9469D7E54EA3821AA87C92B6B46C82C7' has a wrong offset!");

}

