#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Threex3_Turn_Puzzle_Struct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct 3x3_Turn_Puzzle_Struct.3x3_Turn_Puzzle_Struct
// 0x0030 (0x0030 - 0x0000)
struct FThreex3_Turn_Puzzle_Struct final
{
public:
	TArray<float>                                 Start_9_3AE255454F3445AE7D8A18811DDE051B;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 End_11_A8D6F6884EAA70C896C8A9BF88AC7DF5;           // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture*>                       Textures_14_B1E277234B83E7630A204685802D3E77;      // 0x0020(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FThreex3_Turn_Puzzle_Struct) == 0x000008, "Wrong alignment on FThreex3_Turn_Puzzle_Struct");
static_assert(sizeof(FThreex3_Turn_Puzzle_Struct) == 0x000030, "Wrong size on FThreex3_Turn_Puzzle_Struct");
static_assert(offsetof(FThreex3_Turn_Puzzle_Struct, Start_9_3AE255454F3445AE7D8A18811DDE051B) == 0x000000, "Member 'FThreex3_Turn_Puzzle_Struct::Start_9_3AE255454F3445AE7D8A18811DDE051B' has a wrong offset!");
static_assert(offsetof(FThreex3_Turn_Puzzle_Struct, End_11_A8D6F6884EAA70C896C8A9BF88AC7DF5) == 0x000010, "Member 'FThreex3_Turn_Puzzle_Struct::End_11_A8D6F6884EAA70C896C8A9BF88AC7DF5' has a wrong offset!");
static_assert(offsetof(FThreex3_Turn_Puzzle_Struct, Textures_14_B1E277234B83E7630A204685802D3E77) == 0x000020, "Member 'FThreex3_Turn_Puzzle_Struct::Textures_14_B1E277234B83E7630A204685802D3E77' has a wrong offset!");

}

