#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Twox2_Minigame_Structs

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct 2x2_Minigame_Structs.2x2_Minigame_Structs
// 0x0030 (0x0030 - 0x0000)
struct FTwox2_Minigame_Structs final
{
public:
	TArray<float>                                 Start_3_4994ED2D492051E2C3BC8EA553C31AFC;          // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<float>                                 End_5_B38A85554FB36F24ECCA52A3F242A209;            // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UTexture*>                       Textures_10_5AEF012641C99C5A8866349CDACC1418;      // 0x0020(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FTwox2_Minigame_Structs) == 0x000008, "Wrong alignment on FTwox2_Minigame_Structs");
static_assert(sizeof(FTwox2_Minigame_Structs) == 0x000030, "Wrong size on FTwox2_Minigame_Structs");
static_assert(offsetof(FTwox2_Minigame_Structs, Start_3_4994ED2D492051E2C3BC8EA553C31AFC) == 0x000000, "Member 'FTwox2_Minigame_Structs::Start_3_4994ED2D492051E2C3BC8EA553C31AFC' has a wrong offset!");
static_assert(offsetof(FTwox2_Minigame_Structs, End_5_B38A85554FB36F24ECCA52A3F242A209) == 0x000010, "Member 'FTwox2_Minigame_Structs::End_5_B38A85554FB36F24ECCA52A3F242A209' has a wrong offset!");
static_assert(offsetof(FTwox2_Minigame_Structs, Textures_10_5AEF012641C99C5A8866349CDACC1418) == 0x000020, "Member 'FTwox2_Minigame_Structs::Textures_10_5AEF012641C99C5A8866349CDACC1418' has a wrong offset!");

}

