#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_ModSaveData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UDS_ModActorTransforms_structs.hpp"


namespace SDK
{

// UserDefinedStruct UDS_ModSaveData.UDS_ModSaveData
// 0x0280 (0x0280 - 0x0000)
struct FUDS_ModSaveData final
{
public:
	TMap<class FString, bool>                     ModBools_8_AC78131A485A538FF4BB2EB82D1A5BDE;       // 0x0000(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, float>                    ModFloats_11_0DE133CE4C8DF9EBC1E47A9308281BEA;     // 0x0050(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, int32>                    ModInts_14_6E2EDA6343212FB8E88877B0744F361B;       // 0x00A0(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, class FString>            ModStrings_23_829488F5401FD5EA988963B009622BDD;    // 0x00F0(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, class UClass*>            ModClasses_20_3796B4474EC0DD97F51425933B591AA5;    // 0x0140(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, class UObject*>           ModObjects_29_6844AD1E449FB101A1E4F7BC19D35D02;    // 0x0190(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FTransform>        ModTransforms_17_E26653984DBC16860AA8D586CD48E4A3; // 0x01E0(0x0050)(Edit, BlueprintVisible)
	TMap<class FString, struct FUDS_ModActorTransforms> ModActorTransforms_34_1816A58741DCFF73D6BFBDAA08FB529D; // 0x0230(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(FUDS_ModSaveData) == 0x000008, "Wrong alignment on FUDS_ModSaveData");
static_assert(sizeof(FUDS_ModSaveData) == 0x000280, "Wrong size on FUDS_ModSaveData");
static_assert(offsetof(FUDS_ModSaveData, ModBools_8_AC78131A485A538FF4BB2EB82D1A5BDE) == 0x000000, "Member 'FUDS_ModSaveData::ModBools_8_AC78131A485A538FF4BB2EB82D1A5BDE' has a wrong offset!");
static_assert(offsetof(FUDS_ModSaveData, ModFloats_11_0DE133CE4C8DF9EBC1E47A9308281BEA) == 0x000050, "Member 'FUDS_ModSaveData::ModFloats_11_0DE133CE4C8DF9EBC1E47A9308281BEA' has a wrong offset!");
static_assert(offsetof(FUDS_ModSaveData, ModInts_14_6E2EDA6343212FB8E88877B0744F361B) == 0x0000A0, "Member 'FUDS_ModSaveData::ModInts_14_6E2EDA6343212FB8E88877B0744F361B' has a wrong offset!");
static_assert(offsetof(FUDS_ModSaveData, ModStrings_23_829488F5401FD5EA988963B009622BDD) == 0x0000F0, "Member 'FUDS_ModSaveData::ModStrings_23_829488F5401FD5EA988963B009622BDD' has a wrong offset!");
static_assert(offsetof(FUDS_ModSaveData, ModClasses_20_3796B4474EC0DD97F51425933B591AA5) == 0x000140, "Member 'FUDS_ModSaveData::ModClasses_20_3796B4474EC0DD97F51425933B591AA5' has a wrong offset!");
static_assert(offsetof(FUDS_ModSaveData, ModObjects_29_6844AD1E449FB101A1E4F7BC19D35D02) == 0x000190, "Member 'FUDS_ModSaveData::ModObjects_29_6844AD1E449FB101A1E4F7BC19D35D02' has a wrong offset!");
static_assert(offsetof(FUDS_ModSaveData, ModTransforms_17_E26653984DBC16860AA8D586CD48E4A3) == 0x0001E0, "Member 'FUDS_ModSaveData::ModTransforms_17_E26653984DBC16860AA8D586CD48E4A3' has a wrong offset!");
static_assert(offsetof(FUDS_ModSaveData, ModActorTransforms_34_1816A58741DCFF73D6BFBDAA08FB529D) == 0x000230, "Member 'FUDS_ModSaveData::ModActorTransforms_34_1816A58741DCFF73D6BFBDAA08FB529D' has a wrong offset!");

}

