#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_ModActorStruct

#include "Basic.hpp"

#include "UDE_ModSpawnTiming_structs.hpp"


namespace SDK
{

// UserDefinedStruct UDS_ModActorStruct.UDS_ModActorStruct
// 0x0010 (0x0010 - 0x0000)
struct FUDS_ModActorStruct final
{
public:
	class UClass*                                 ModActorClass_2_979CC56042986004577FB28B5B60328D;  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUDE_ModSpawnTiming                           SpawnTiming_12_8D9073594040428F0C0D80A1C93023C8;   // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRespawnImmediateSpawn_17_09960D6B4D5B3D6BC0763A8EAC171C04; // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bEnsureSingleton_10_0F7E6FBA4BDA9B26E62765BD1BECE59D; // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FUDS_ModActorStruct) == 0x000008, "Wrong alignment on FUDS_ModActorStruct");
static_assert(sizeof(FUDS_ModActorStruct) == 0x000010, "Wrong size on FUDS_ModActorStruct");
static_assert(offsetof(FUDS_ModActorStruct, ModActorClass_2_979CC56042986004577FB28B5B60328D) == 0x000000, "Member 'FUDS_ModActorStruct::ModActorClass_2_979CC56042986004577FB28B5B60328D' has a wrong offset!");
static_assert(offsetof(FUDS_ModActorStruct, SpawnTiming_12_8D9073594040428F0C0D80A1C93023C8) == 0x000008, "Member 'FUDS_ModActorStruct::SpawnTiming_12_8D9073594040428F0C0D80A1C93023C8' has a wrong offset!");
static_assert(offsetof(FUDS_ModActorStruct, bRespawnImmediateSpawn_17_09960D6B4D5B3D6BC0763A8EAC171C04) == 0x000009, "Member 'FUDS_ModActorStruct::bRespawnImmediateSpawn_17_09960D6B4D5B3D6BC0763A8EAC171C04' has a wrong offset!");
static_assert(offsetof(FUDS_ModActorStruct, bEnsureSingleton_10_0F7E6FBA4BDA9B26E62765BD1BECE59D) == 0x00000A, "Member 'FUDS_ModActorStruct::bEnsureSingleton_10_0F7E6FBA4BDA9B26E62765BD1BECE59D' has a wrong offset!");

}

