#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_KillCount

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_KillCount.UI_KillCount_C
// 0x0070 (0x0300 - 0x0290)
class UUI_KillCount_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_565;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_623;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PlayerName;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_1;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_2;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_4;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_5;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   NewVar_0;                                          // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_UI_KillCount(int32 EntryPoint);
	void OnPlayerDamage(int32 NewParam);
	void OnPlayerKills();
	void OnInitialized();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_KillCount_C">();
	}
	static class UUI_KillCount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_KillCount_C>();
	}
};
static_assert(alignof(UUI_KillCount_C) == 0x000008, "Wrong alignment on UUI_KillCount_C");
static_assert(sizeof(UUI_KillCount_C) == 0x000300, "Wrong size on UUI_KillCount_C");
static_assert(offsetof(UUI_KillCount_C, UberGraphFrame) == 0x000290, "Member 'UUI_KillCount_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, Image) == 0x000298, "Member 'UUI_KillCount_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, Image_565) == 0x0002A0, "Member 'UUI_KillCount_C::Image_565' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, Image_623) == 0x0002A8, "Member 'UUI_KillCount_C::Image_623' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, PlayerName) == 0x0002B0, "Member 'UUI_KillCount_C::PlayerName' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, SizeBox_0) == 0x0002B8, "Member 'UUI_KillCount_C::SizeBox_0' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, SizeBox_1) == 0x0002C0, "Member 'UUI_KillCount_C::SizeBox_1' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, TextBlock) == 0x0002C8, "Member 'UUI_KillCount_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, TextBlock_2) == 0x0002D0, "Member 'UUI_KillCount_C::TextBlock_2' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, TextBlock_4) == 0x0002D8, "Member 'UUI_KillCount_C::TextBlock_4' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, TextBlock_5) == 0x0002E0, "Member 'UUI_KillCount_C::TextBlock_5' has a wrong offset!");
static_assert(offsetof(UUI_KillCount_C, NewVar_0) == 0x0002E8, "Member 'UUI_KillCount_C::NewVar_0' has a wrong offset!");

}

