#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_WeaponStatsBlueprint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function UI_WeaponStatsBlueprint.UI_WeaponStatsBlueprint_C.GetAccuracyValueArray
// 0x00A0 (0x00A0 - 0x0000)
struct UI_WeaponStatsBlueprint_C_GetAccuracyValueArray final
{
public:
	const class USBZRangedWeaponData*             RangedWeaponData;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 OutValueArray;                                     // 0x0008(0x0010)(Parm, OutParm)
	float                                         AdditionalSpreadCap;                               // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditionalSpreadStart;                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShotgunMaxRadius;                                  // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShotgunMinRadius;                                  // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZShotgunSpreadPattern               CallFunc_Array_Get_Item;                           // 0x0048(0x0010)()
	struct FVector2D                              CallFunc_Array_Get_Item_1;                         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DistanceSquared2D_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue_1;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMin_ReturnValue;                         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray) == 0x000008, "Wrong alignment on UI_WeaponStatsBlueprint_C_GetAccuracyValueArray");
static_assert(sizeof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray) == 0x0000A0, "Wrong size on UI_WeaponStatsBlueprint_C_GetAccuracyValueArray");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, RangedWeaponData) == 0x000000, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::RangedWeaponData' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, OutValueArray) == 0x000008, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::OutValueArray' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, AdditionalSpreadCap) == 0x000018, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::AdditionalSpreadCap' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, AdditionalSpreadStart) == 0x00001C, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::AdditionalSpreadStart' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, ShotgunMaxRadius) == 0x000020, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::ShotgunMaxRadius' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, ShotgunMinRadius) == 0x000024, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::ShotgunMinRadius' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, Temp_int_Array_Index_Variable) == 0x000028, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, Temp_int_Loop_Counter_Variable) == 0x000034, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Less_IntInt_ReturnValue) == 0x000039, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, Temp_int_Array_Index_Variable_1) == 0x000040, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Array_Get_Item) == 0x000048, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Array_Get_Item_1) == 0x000058, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Array_Length_ReturnValue_2) == 0x000060, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000064, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_DistanceSquared2D_ReturnValue) == 0x00006C, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_DistanceSquared2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, K2Node_MakeArray_Array) == 0x000070, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Sqrt_ReturnValue) == 0x000080, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Sqrt_ReturnValue_1) == 0x000084, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Sqrt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_FMax_ReturnValue) == 0x000088, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_FMin_ReturnValue) == 0x00008C, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, Temp_int_Loop_Counter_Variable_1) == 0x000090, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Less_IntInt_ReturnValue_1) == 0x000094, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetAccuracyValueArray, CallFunc_Add_IntInt_ReturnValue_1) == 0x000098, "Member 'UI_WeaponStatsBlueprint_C_GetAccuracyValueArray::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function UI_WeaponStatsBlueprint.UI_WeaponStatsBlueprint_C.GetDamageValueArray
// 0x0068 (0x0068 - 0x0000)
struct UI_WeaponStatsBlueprint_C_GetDamageValueArray final
{
public:
	const class USBZRangedWeaponData*             RangedWeaponData;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 OutValueArray;                                     // 0x0008(0x0010)(Parm, OutParm)
	TArray<float>                                 ValueArray;                                        // 0x0018(0x0010)(Edit, BlueprintVisible)
	class USBZPlayerWeaponFireData*               K2Node_DynamicCast_AsSBZPlayer_Weapon_Fire_Data;   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetProjectilesPerFiredRound_ReturnValue;  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 CallFunc_GetCriticalMultipliersOnEachDistance_OutMultiplierArray; // 0x0038(0x0010)(ReferenceParm)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 CallFunc_GetDamageOnEachDistance_OutDamageArray;   // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_WeaponStatsBlueprint_C_GetDamageValueArray) == 0x000008, "Wrong alignment on UI_WeaponStatsBlueprint_C_GetDamageValueArray");
static_assert(sizeof(UI_WeaponStatsBlueprint_C_GetDamageValueArray) == 0x000068, "Wrong size on UI_WeaponStatsBlueprint_C_GetDamageValueArray");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, RangedWeaponData) == 0x000000, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::RangedWeaponData' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, OutValueArray) == 0x000008, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::OutValueArray' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, ValueArray) == 0x000018, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::ValueArray' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, K2Node_DynamicCast_AsSBZPlayer_Weapon_Fire_Data) == 0x000028, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::K2Node_DynamicCast_AsSBZPlayer_Weapon_Fire_Data' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, CallFunc_GetProjectilesPerFiredRound_ReturnValue) == 0x000034, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::CallFunc_GetProjectilesPerFiredRound_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, CallFunc_GetCriticalMultipliersOnEachDistance_OutMultiplierArray) == 0x000038, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::CallFunc_GetCriticalMultipliersOnEachDistance_OutMultiplierArray' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000048, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, CallFunc_GetDamageOnEachDistance_OutDamageArray) == 0x000050, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::CallFunc_GetDamageOnEachDistance_OutDamageArray' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetDamageValueArray, CallFunc_Array_Add_ReturnValue_1) == 0x000064, "Member 'UI_WeaponStatsBlueprint_C_GetDamageValueArray::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function UI_WeaponStatsBlueprint.UI_WeaponStatsBlueprint_C.GetFireRateValueArray
// 0x0028 (0x0028 - 0x0000)
struct UI_WeaponStatsBlueprint_C_GetFireRateValueArray final
{
public:
	const class USBZRangedWeaponData*             RangedWeaponData;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 OutValueArray;                                     // 0x0008(0x0010)(Parm, OutParm)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
};
static_assert(alignof(UI_WeaponStatsBlueprint_C_GetFireRateValueArray) == 0x000008, "Wrong alignment on UI_WeaponStatsBlueprint_C_GetFireRateValueArray");
static_assert(sizeof(UI_WeaponStatsBlueprint_C_GetFireRateValueArray) == 0x000028, "Wrong size on UI_WeaponStatsBlueprint_C_GetFireRateValueArray");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetFireRateValueArray, RangedWeaponData) == 0x000000, "Member 'UI_WeaponStatsBlueprint_C_GetFireRateValueArray::RangedWeaponData' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetFireRateValueArray, OutValueArray) == 0x000008, "Member 'UI_WeaponStatsBlueprint_C_GetFireRateValueArray::OutValueArray' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetFireRateValueArray, K2Node_MakeArray_Array) == 0x000018, "Member 'UI_WeaponStatsBlueprint_C_GetFireRateValueArray::K2Node_MakeArray_Array' has a wrong offset!");

// Function UI_WeaponStatsBlueprint.UI_WeaponStatsBlueprint_C.GetHandlingValueArray
// 0x0060 (0x0060 - 0x0000)
struct UI_WeaponStatsBlueprint_C_GetHandlingValueArray final
{
public:
	const class USBZRangedWeaponData*             RangedWeaponData;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 OutValueArray;                                     // 0x0008(0x0010)(Parm, OutParm)
	float                                         TargetingTransitionSum;                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZCachedWeaponTargeting              CallFunc_Array_Get_Item;                           // 0x0028(0x0010)(NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray) == 0x000008, "Wrong alignment on UI_WeaponStatsBlueprint_C_GetHandlingValueArray");
static_assert(sizeof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray) == 0x000060, "Wrong size on UI_WeaponStatsBlueprint_C_GetHandlingValueArray");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, RangedWeaponData) == 0x000000, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::RangedWeaponData' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, OutValueArray) == 0x000008, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::OutValueArray' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, TargetingTransitionSum) == 0x000018, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::TargetingTransitionSum' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, CallFunc_Array_Get_Item) == 0x000028, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, K2Node_MakeArray_Array) == 0x000040, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetHandlingValueArray, CallFunc_Add_FloatFloat_ReturnValue) == 0x000058, "Member 'UI_WeaponStatsBlueprint_C_GetHandlingValueArray::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function UI_WeaponStatsBlueprint.UI_WeaponStatsBlueprint_C.GetRecoilValueArray
// 0x0090 (0x0090 - 0x0000)
struct UI_WeaponStatsBlueprint_C_GetRecoilValueArray final
{
public:
	const class USBZRangedWeaponData*             RangedWeaponData;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 OutValueArray;                                     // 0x0008(0x0010)(Parm, OutParm)
	float                                         LastY;                                             // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastX;                                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxOffsetX;                                        // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxOffsetY;                                        // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxY;                                              // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxX;                                              // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_1;                       // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item;                           // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_2;                        // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_2;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_3;                        // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue_3;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray) == 0x000008, "Wrong alignment on UI_WeaponStatsBlueprint_C_GetRecoilValueArray");
static_assert(sizeof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray) == 0x000090, "Wrong size on UI_WeaponStatsBlueprint_C_GetRecoilValueArray");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, RangedWeaponData) == 0x000000, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::RangedWeaponData' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, OutValueArray) == 0x000008, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::OutValueArray' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, LastY) == 0x000018, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::LastY' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, LastX) == 0x00001C, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::LastX' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, MaxOffsetX) == 0x000020, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::MaxOffsetX' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, MaxOffsetY) == 0x000024, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::MaxOffsetY' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, MaxY) == 0x000028, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::MaxY' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, MaxX) == 0x00002C, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::MaxX' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Abs_ReturnValue) == 0x000034, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_FMax_ReturnValue) == 0x000038, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Abs_ReturnValue_1) == 0x00003C, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_FMax_ReturnValue_1) == 0x000040, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, Temp_int_Loop_Counter_Variable) == 0x000044, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, K2Node_MakeArray_Array) == 0x000048, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, Temp_int_Array_Index_Variable) == 0x000060, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Array_Get_Item) == 0x000064, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_BreakVector2D_X) == 0x00006C, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_BreakVector2D_Y) == 0x000070, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000074, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Abs_ReturnValue_2) == 0x000078, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Abs_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x00007C, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_FMax_ReturnValue_2) == 0x000080, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_FMax_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_Abs_ReturnValue_3) == 0x000084, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_Abs_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetRecoilValueArray, CallFunc_FMax_ReturnValue_3) == 0x000088, "Member 'UI_WeaponStatsBlueprint_C_GetRecoilValueArray::CallFunc_FMax_ReturnValue_3' has a wrong offset!");

// Function UI_WeaponStatsBlueprint.UI_WeaponStatsBlueprint_C.GetStabilityValueArray
// 0x0048 (0x0048 - 0x0000)
struct UI_WeaponStatsBlueprint_C_GetStabilityValueArray final
{
public:
	const class USBZRangedWeaponData*             RangedWeaponData;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 OutValueArray;                                     // 0x0008(0x0010)(Parm, OutParm)
	float                                         CallFunc_GetGunKickHorizontalLeft_OutMin;          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGunKickHorizontalLeft_OutMax;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGunKickVerticalTop_OutMin;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGunKickVerticalTop_OutMax;             // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGunKickVerticalBottom_OutMin;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGunKickVerticalBottom_OutMax;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGunKickHorizontalRight_OutMin;         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGunKickHorizontalRight_OutMax;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
};
static_assert(alignof(UI_WeaponStatsBlueprint_C_GetStabilityValueArray) == 0x000008, "Wrong alignment on UI_WeaponStatsBlueprint_C_GetStabilityValueArray");
static_assert(sizeof(UI_WeaponStatsBlueprint_C_GetStabilityValueArray) == 0x000048, "Wrong size on UI_WeaponStatsBlueprint_C_GetStabilityValueArray");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetStabilityValueArray, RangedWeaponData) == 0x000000, "Member 'UI_WeaponStatsBlueprint_C_GetStabilityValueArray::RangedWeaponData' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetStabilityValueArray, OutValueArray) == 0x000008, "Member 'UI_WeaponStatsBlueprint_C_GetStabilityValueArray::OutValueArray' has a wrong offset!");
static_assert(offsetof(UI_WeaponStatsBlueprint_C_GetStabilityValueArray, CallFunc_GetGunKickHorizontalLeft_OutMin) == 0x000018, "Member 'UI_WeaponStatsBlueprint_C_GetStabilityValueArray::CallFunc_GetGunKickHorizontalLeft_OutMin' has a wrong offset!");
