#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTD_ReturnToStart

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function UTD_ReturnToStart.UTD_ReturnToStart_C.ExecuteUbergraph_UTD_ReturnToStart
// 0x0020 (0x0020 - 0x0000)
struct UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBTNodeResult                                 K2Node_Event_NodeResult;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAICharacter*                        K2Node_DynamicCast_AsSBZAICharacter;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart) == 0x000008, "Wrong alignment on UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart");
static_assert(sizeof(UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart) == 0x000020, "Wrong size on UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart");
static_assert(offsetof(UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart, EntryPoint) == 0x000000, "Member 'UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart, K2Node_Event_NodeResult) == 0x000004, "Member 'UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart::K2Node_Event_NodeResult' has a wrong offset!");
static_assert(offsetof(UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart, K2Node_DynamicCast_AsSBZAICharacter) == 0x000010, "Member 'UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart::K2Node_DynamicCast_AsSBZAICharacter' has a wrong offset!");
static_assert(offsetof(UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UTD_ReturnToStart_C_ExecuteUbergraph_UTD_ReturnToStart::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function UTD_ReturnToStart.UTD_ReturnToStart_C.OnDeactivatedBP
// 0x0001 (0x0001 - 0x0000)
struct UTD_ReturnToStart_C_OnDeactivatedBP final
{
public:
	EBTNodeResult                                 NodeResult;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTD_ReturnToStart_C_OnDeactivatedBP) == 0x000001, "Wrong alignment on UTD_ReturnToStart_C_OnDeactivatedBP");
static_assert(sizeof(UTD_ReturnToStart_C_OnDeactivatedBP) == 0x000001, "Wrong size on UTD_ReturnToStart_C_OnDeactivatedBP");
static_assert(offsetof(UTD_ReturnToStart_C_OnDeactivatedBP, NodeResult) == 0x000000, "Member 'UTD_ReturnToStart_C_OnDeactivatedBP::NodeResult' has a wrong offset!");

}

