#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTS_Commit

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UTS_Commit.UTS_Commit_C
// 0x0010 (0x0070 - 0x0060)
class UUTS_Commit_C final : public USBZAIUtilityScorer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Bonus;                                             // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Started;                                           // 0x006C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_UTS_Commit(int32 EntryPoint);
	void OnDeactivatedBP(EBTNodeResult NodeResult);
	void OnDeselectedBP();
	void OnSelectedBP();

	float CalcScoreBP() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UTS_Commit_C">();
	}
	static class UUTS_Commit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUTS_Commit_C>();
	}
};
static_assert(alignof(UUTS_Commit_C) == 0x000008, "Wrong alignment on UUTS_Commit_C");
static_assert(sizeof(UUTS_Commit_C) == 0x000070, "Wrong size on UUTS_Commit_C");
static_assert(offsetof(UUTS_Commit_C, UberGraphFrame) == 0x000060, "Member 'UUTS_Commit_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUTS_Commit_C, Bonus) == 0x000068, "Member 'UUTS_Commit_C::Bonus' has a wrong offset!");
static_assert(offsetof(UUTS_Commit_C, Started) == 0x00006C, "Member 'UUTS_Commit_C::Started' has a wrong offset!");

}

