#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UTS_LastAgilityTime

#include "Basic.hpp"


namespace SDK::Params
{

// Function UTS_LastAgilityTime.UTS_LastAgilityTime_C.ExecuteUbergraph_UTS_LastAgilityTime
// 0x0004 (0x0004 - 0x0000)
struct UTS_LastAgilityTime_C_ExecuteUbergraph_UTS_LastAgilityTime final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTS_LastAgilityTime_C_ExecuteUbergraph_UTS_LastAgilityTime) == 0x000004, "Wrong alignment on UTS_LastAgilityTime_C_ExecuteUbergraph_UTS_LastAgilityTime");
static_assert(sizeof(UTS_LastAgilityTime_C_ExecuteUbergraph_UTS_LastAgilityTime) == 0x000004, "Wrong size on UTS_LastAgilityTime_C_ExecuteUbergraph_UTS_LastAgilityTime");
static_assert(offsetof(UTS_LastAgilityTime_C_ExecuteUbergraph_UTS_LastAgilityTime, EntryPoint) == 0x000000, "Member 'UTS_LastAgilityTime_C_ExecuteUbergraph_UTS_LastAgilityTime::EntryPoint' has a wrong offset!");

// Function UTS_LastAgilityTime.UTS_LastAgilityTime_C.CalcScoreBP
// 0x0030 (0x0030 - 0x0000)
struct UTS_LastAgilityTime_C_CalcScoreBP final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAIBaseCharacter*                    K2Node_DynamicCast_AsSBZAIBase_Character;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimeSinceLastAgility_ReturnValue;      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UTS_LastAgilityTime_C_CalcScoreBP) == 0x000008, "Wrong alignment on UTS_LastAgilityTime_C_CalcScoreBP");
static_assert(sizeof(UTS_LastAgilityTime_C_CalcScoreBP) == 0x000030, "Wrong size on UTS_LastAgilityTime_C_CalcScoreBP");
static_assert(offsetof(UTS_LastAgilityTime_C_CalcScoreBP, ReturnValue) == 0x000000, "Member 'UTS_LastAgilityTime_C_CalcScoreBP::ReturnValue' has a wrong offset!");
static_assert(offsetof(UTS_LastAgilityTime_C_CalcScoreBP, CallFunc_K2_GetPawn_ReturnValue) == 0x000008, "Member 'UTS_LastAgilityTime_C_CalcScoreBP::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTS_LastAgilityTime_C_CalcScoreBP, K2Node_DynamicCast_AsSBZAIBase_Character) == 0x000010, "Member 'UTS_LastAgilityTime_C_CalcScoreBP::K2Node_DynamicCast_AsSBZAIBase_Character' has a wrong offset!");
static_assert(offsetof(UTS_LastAgilityTime_C_CalcScoreBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'UTS_LastAgilityTime_C_CalcScoreBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UTS_LastAgilityTime_C_CalcScoreBP, CallFunc_GetTimeSinceLastAgility_ReturnValue) == 0x00001C, "Member 'UTS_LastAgilityTime_C_CalcScoreBP::CallFunc_GetTimeSinceLastAgility_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTS_LastAgilityTime_C_CalcScoreBP, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'UTS_LastAgilityTime_C_CalcScoreBP::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTS_LastAgilityTime_C_CalcScoreBP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000024, "Member 'UTS_LastAgilityTime_C_CalcScoreBP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(UTS_LastAgilityTime_C_CalcScoreBP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'UTS_LastAgilityTime_C_CalcScoreBP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

}

