#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_TutorialMouseButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_TutorialMouseButton.WBP_UI_TutorialMouseButton_C
// 0x0030 (0x02E8 - 0x02B8)
class UWBP_UI_TutorialMouseButton_C final : public USBZMenuTutorialMouseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             IconHelp;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Image_Close;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Highlight;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_C*           Widget_Input;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_TutorialMouseButton(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnShowingTutorialChanged();
	void OnInitialized();
	void ButtonHoveredChanged(bool bInIsHovered);
	void SetHovered(bool bIsHovered);
	void SetActive(bool bIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_TutorialMouseButton_C">();
	}
	static class UWBP_UI_TutorialMouseButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_TutorialMouseButton_C>();
	}
};
static_assert(alignof(UWBP_UI_TutorialMouseButton_C) == 0x000008, "Wrong alignment on UWBP_UI_TutorialMouseButton_C");
static_assert(sizeof(UWBP_UI_TutorialMouseButton_C) == 0x0002E8, "Wrong size on UWBP_UI_TutorialMouseButton_C");
static_assert(offsetof(UWBP_UI_TutorialMouseButton_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_UI_TutorialMouseButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TutorialMouseButton_C, IconHelp) == 0x0002C0, "Member 'UWBP_UI_TutorialMouseButton_C::IconHelp' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TutorialMouseButton_C, Image_Background) == 0x0002C8, "Member 'UWBP_UI_TutorialMouseButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TutorialMouseButton_C, Image_Close) == 0x0002D0, "Member 'UWBP_UI_TutorialMouseButton_C::Image_Close' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TutorialMouseButton_C, Image_Highlight) == 0x0002D8, "Member 'UWBP_UI_TutorialMouseButton_C::Image_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TutorialMouseButton_C, Widget_Input) == 0x0002E0, "Member 'UWBP_UI_TutorialMouseButton_C::Widget_Input' has a wrong offset!");

}

