#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComputerTrueActive

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ComputerTrueActive.WBP_ComputerTrueActive_C
// 0x0080 (0x0310 - 0x0290)
class UWBP_ComputerTrueActive_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Screensaver;                                       // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_372;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_461;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_541;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_679;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderBottom;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderLeft;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderRight;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderTop;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo;                                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Border;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PasswordField;                                     // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBlockBody;                                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBlockTitle;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ComputerTrueActive(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ComputerTrueActive_C">();
	}
	static class UWBP_ComputerTrueActive_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ComputerTrueActive_C>();
	}
};
static_assert(alignof(UWBP_ComputerTrueActive_C) == 0x000008, "Wrong alignment on UWBP_ComputerTrueActive_C");
static_assert(sizeof(UWBP_ComputerTrueActive_C) == 0x000310, "Wrong size on UWBP_ComputerTrueActive_C");
static_assert(offsetof(UWBP_ComputerTrueActive_C, UberGraphFrame) == 0x000290, "Member 'UWBP_ComputerTrueActive_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Screensaver) == 0x000298, "Member 'UWBP_ComputerTrueActive_C::Screensaver' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Background) == 0x0002A0, "Member 'UWBP_ComputerTrueActive_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Image_372) == 0x0002A8, "Member 'UWBP_ComputerTrueActive_C::Image_372' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Image_461) == 0x0002B0, "Member 'UWBP_ComputerTrueActive_C::Image_461' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Image_541) == 0x0002B8, "Member 'UWBP_ComputerTrueActive_C::Image_541' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Image_679) == 0x0002C0, "Member 'UWBP_ComputerTrueActive_C::Image_679' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Image_BorderBottom) == 0x0002C8, "Member 'UWBP_ComputerTrueActive_C::Image_BorderBottom' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Image_BorderLeft) == 0x0002D0, "Member 'UWBP_ComputerTrueActive_C::Image_BorderLeft' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Image_BorderRight) == 0x0002D8, "Member 'UWBP_ComputerTrueActive_C::Image_BorderRight' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Image_BorderTop) == 0x0002E0, "Member 'UWBP_ComputerTrueActive_C::Image_BorderTop' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Logo) == 0x0002E8, "Member 'UWBP_ComputerTrueActive_C::Logo' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, Overlay_Border) == 0x0002F0, "Member 'UWBP_ComputerTrueActive_C::Overlay_Border' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, PasswordField) == 0x0002F8, "Member 'UWBP_ComputerTrueActive_C::PasswordField' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, TextBlockBody) == 0x000300, "Member 'UWBP_ComputerTrueActive_C::TextBlockBody' has a wrong offset!");
static_assert(offsetof(UWBP_ComputerTrueActive_C, TextBlockTitle) == 0x000308, "Member 'UWBP_ComputerTrueActive_C::TextBlockTitle' has a wrong offset!");

}

