#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PlayingHUD

#include "Basic.hpp"

#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_PlayingHUD.WBP_UI_Widget_PlayingHUD_C
// 0x0058 (0x02F0 - 0x0298)
class UWBP_UI_Widget_PlayingHUD_C final : public USBZHUDPlayingWidget
{
public:
	class URetainerBox*                           RetainerBox_NeededForGlitchEfffect;                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root_CAnvas;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionNotification_C*    Widget_ActionNotification;                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_DamageIndicatorContainer_C* Widget_DamageIndicatorContainer;                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_DefeatTimer_C*           Widget_DefeatTimer;                                // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_EscapeCounter_C*         Widget_EscapeCounter;                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_HitIndicators_C*         Widget_HitIndicators;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_MaskOnNotification_C*    Widget_MaskOnNotification;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_PagerWidget_C*                  Widget_PagerWidget;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_HUD_Shoutout_C*                 Widget_Shoutout;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_VoipWidget_C*               Widget_VoipWidget;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_PlayingHUD_C">();
	}
	static class UWBP_UI_Widget_PlayingHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_PlayingHUD_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_PlayingHUD_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_PlayingHUD_C");
static_assert(sizeof(UWBP_UI_Widget_PlayingHUD_C) == 0x0002F0, "Wrong size on UWBP_UI_Widget_PlayingHUD_C");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, RetainerBox_NeededForGlitchEfffect) == 0x000298, "Member 'UWBP_UI_Widget_PlayingHUD_C::RetainerBox_NeededForGlitchEfffect' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Root_CAnvas) == 0x0002A0, "Member 'UWBP_UI_Widget_PlayingHUD_C::Root_CAnvas' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Widget_ActionNotification) == 0x0002A8, "Member 'UWBP_UI_Widget_PlayingHUD_C::Widget_ActionNotification' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Widget_DamageIndicatorContainer) == 0x0002B0, "Member 'UWBP_UI_Widget_PlayingHUD_C::Widget_DamageIndicatorContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Widget_DefeatTimer) == 0x0002B8, "Member 'UWBP_UI_Widget_PlayingHUD_C::Widget_DefeatTimer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Widget_EscapeCounter) == 0x0002C0, "Member 'UWBP_UI_Widget_PlayingHUD_C::Widget_EscapeCounter' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Widget_HitIndicators) == 0x0002C8, "Member 'UWBP_UI_Widget_PlayingHUD_C::Widget_HitIndicators' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Widget_MaskOnNotification) == 0x0002D0, "Member 'UWBP_UI_Widget_PlayingHUD_C::Widget_MaskOnNotification' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Widget_PagerWidget) == 0x0002D8, "Member 'UWBP_UI_Widget_PlayingHUD_C::Widget_PagerWidget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Widget_Shoutout) == 0x0002E0, "Member 'UWBP_UI_Widget_PlayingHUD_C::Widget_Shoutout' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayingHUD_C, Widget_VoipWidget) == 0x0002E8, "Member 'UWBP_UI_Widget_PlayingHUD_C::Widget_VoipWidget' has a wrong offset!");

}

