#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Local_Navbar_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Local_Navbar_Button.WBP_Local_Navbar_Button_C
// 0x0068 (0x03C8 - 0x0360)
class UWBP_Local_Navbar_Button_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Stubbie_Secondary;                                 // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Stubbie_main;                                      // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Background_WS;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoveredBkg_I;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root_SB;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectedBkg_I;                                     // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Title_T;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NavBarIndex;                                       // 0x03A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3AC[0x4];                                      // 0x03AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 OutNavBarIndex)> MouseClicked;                               // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         MinWidth;                                          // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsFocused;                                         // 0x03C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsSecondLayer;                                     // 0x03C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_Local_Navbar_Button(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonSelected();
	void OnInitialized();
	void SetFocused(bool InFocused);
	void SetHovered(bool InHovered);
	void InitializeButton(const class FText& InTitle);
	void SetActive(bool InActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Local_Navbar_Button_C">();
	}
	static class UWBP_Local_Navbar_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Local_Navbar_Button_C>();
	}
};
static_assert(alignof(UWBP_Local_Navbar_Button_C) == 0x000008, "Wrong alignment on UWBP_Local_Navbar_Button_C");
static_assert(sizeof(UWBP_Local_Navbar_Button_C) == 0x0003C8, "Wrong size on UWBP_Local_Navbar_Button_C");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, UberGraphFrame) == 0x000360, "Member 'UWBP_Local_Navbar_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, Stubbie_Secondary) == 0x000368, "Member 'UWBP_Local_Navbar_Button_C::Stubbie_Secondary' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, Stubbie_main) == 0x000370, "Member 'UWBP_Local_Navbar_Button_C::Stubbie_main' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, Background_I) == 0x000378, "Member 'UWBP_Local_Navbar_Button_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, Background_WS) == 0x000380, "Member 'UWBP_Local_Navbar_Button_C::Background_WS' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, HoveredBkg_I) == 0x000388, "Member 'UWBP_Local_Navbar_Button_C::HoveredBkg_I' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, Root_SB) == 0x000390, "Member 'UWBP_Local_Navbar_Button_C::Root_SB' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, SelectedBkg_I) == 0x000398, "Member 'UWBP_Local_Navbar_Button_C::SelectedBkg_I' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, Title_T) == 0x0003A0, "Member 'UWBP_Local_Navbar_Button_C::Title_T' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, NavBarIndex) == 0x0003A8, "Member 'UWBP_Local_Navbar_Button_C::NavBarIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, MouseClicked) == 0x0003B0, "Member 'UWBP_Local_Navbar_Button_C::MouseClicked' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, MinWidth) == 0x0003C0, "Member 'UWBP_Local_Navbar_Button_C::MinWidth' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, IsFocused) == 0x0003C4, "Member 'UWBP_Local_Navbar_Button_C::IsFocused' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_Button_C, IsSecondLayer) == 0x0003C5, "Member 'UWBP_Local_Navbar_Button_C::IsSecondLayer' has a wrong offset!");

}

