#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_BaseDistancePercentage_RinoHud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_BaseDistancePercentage_RinoHud.WBP_UI_Widget_BaseDistancePercentage_RinoHud_C
// 0x0028 (0x02B8 - 0x0290)
class UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             distance;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_98;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             percentage;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         bPercentage;                                       // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         bDistance;                                         // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetValues(float Distance, float Percentage);
	void _Update();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_BaseDistancePercentage_RinoHud_C">();
	}
	static class UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C");
static_assert(sizeof(UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C) == 0x0002B8, "Wrong size on UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C");
static_assert(offsetof(UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C, distance) == 0x000298, "Member 'UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C::distance' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C, Image_98) == 0x0002A0, "Member 'UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C::Image_98' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C, percentage) == 0x0002A8, "Member 'UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C::percentage' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C, bPercentage) == 0x0002B0, "Member 'UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C::bPercentage' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C, bDistance) == 0x0002B4, "Member 'UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C::bDistance' has a wrong offset!");

}

