#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PSOCompilationScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_PSOCompilationScreen.WBP_PSOCompilationScreen_C.ExecuteUbergraph_WBP_PSOCompilationScreen
// 0x0128 (0x0128 - 0x0000)
struct WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 CurrentProgress, int32 TotalRemaining)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_CurrentProgress;                // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TotalRemaining;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0068(0x0040)(HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
};
static_assert(alignof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen) == 0x000008, "Wrong alignment on WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen");
static_assert(sizeof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen) == 0x000128, "Wrong size on WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, EntryPoint) == 0x000000, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, K2Node_CustomEvent_CurrentProgress) == 0x000018, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::K2Node_CustomEvent_CurrentProgress' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, K2Node_CustomEvent_TotalRemaining) == 0x00001C, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::K2Node_CustomEvent_TotalRemaining' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000060, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, K2Node_MakeStruct_FormatArgumentData_1) == 0x000068, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0000A8, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0000AC, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, K2Node_Event_IsDesignTime) == 0x0000B0, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x0000B4, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, CallFunc_FTrunc_ReturnValue) == 0x0000B8, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000C0, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, K2Node_MakeArray_Array) == 0x000100, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen, CallFunc_Format_ReturnValue) == 0x000110, "Member 'WBP_PSOCompilationScreen_C_ExecuteUbergraph_WBP_PSOCompilationScreen::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_PSOCompilationScreen.WBP_PSOCompilationScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PSOCompilationScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PSOCompilationScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PSOCompilationScreen_C_PreConstruct");
static_assert(sizeof(WBP_PSOCompilationScreen_C_PreConstruct) == 0x000001, "Wrong size on WBP_PSOCompilationScreen_C_PreConstruct");
static_assert(offsetof(WBP_PSOCompilationScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PSOCompilationScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PSOCompilationScreen.WBP_PSOCompilationScreen_C.UpdatePSOProgress
// 0x0008 (0x0008 - 0x0000)
struct WBP_PSOCompilationScreen_C_UpdatePSOProgress final
{
public:
	int32                                         CurrentProgress;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalRemaining;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PSOCompilationScreen_C_UpdatePSOProgress) == 0x000004, "Wrong alignment on WBP_PSOCompilationScreen_C_UpdatePSOProgress");
static_assert(sizeof(WBP_PSOCompilationScreen_C_UpdatePSOProgress) == 0x000008, "Wrong size on WBP_PSOCompilationScreen_C_UpdatePSOProgress");
static_assert(offsetof(WBP_PSOCompilationScreen_C_UpdatePSOProgress, CurrentProgress) == 0x000000, "Member 'WBP_PSOCompilationScreen_C_UpdatePSOProgress::CurrentProgress' has a wrong offset!");
static_assert(offsetof(WBP_PSOCompilationScreen_C_UpdatePSOProgress, TotalRemaining) == 0x000004, "Member 'WBP_PSOCompilationScreen_C_UpdatePSOProgress::TotalRemaining' has a wrong offset!");

}

