#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Skills_Button

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ESBZSkillEquipResult_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.ExecuteUbergraph_WBP_UI_Skills_Button
// 0x0258 (0x0258 - 0x0000)
struct WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillType                                 Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZSideBarNotificationData            K2Node_MakeStruct_SBZSideBarNotificationData;      // 0x0010(0x0040)()
	struct FSBZSideBarNotificationData            K2Node_MakeStruct_SBZSideBarNotificationData_1;    // 0x0050(0x0040)()
	struct FSBZSideBarNotificationData            K2Node_MakeStruct_SBZSideBarNotificationData_2;    // 0x0090(0x0040)()
	class UWBP_Tooltip_C*                         CallFunc_Create_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable;                              // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_1;                            // 0x00E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default;                             // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00F4(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillEquipResult                          CallFunc_CanSelectSkill_Result;                    // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x010E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10F[0x1];                                      // 0x010F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0110(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocked_IsLocked;                        // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZSkillState                                K2Node_Select_Default_2;                           // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bEquipped;                      // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bEquipped)>               K2Node_CreateDelegate_OutputDelegate_2;            // 0x014C(0x0014)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_IsLocked_1;                      // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0162(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0163(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite_1;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x01A0(0x0090)()
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button) == 0x000008, "Wrong alignment on WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button");
static_assert(sizeof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button) == 0x000258, "Wrong size on WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, EntryPoint) == 0x000000, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_bool_Variable) == 0x000009, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_byte_Variable_5) == 0x00000A, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_byte_Variable_6) == 0x00000B, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_bool_Variable_1) == 0x00000C, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_byte_Variable_7) == 0x00000D, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_byte_Variable_8) == 0x00000E, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_MakeStruct_SBZSideBarNotificationData) == 0x000010, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_MakeStruct_SBZSideBarNotificationData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_MakeStruct_SBZSideBarNotificationData_1) == 0x000050, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_MakeStruct_SBZSideBarNotificationData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_MakeStruct_SBZSideBarNotificationData_2) == 0x000090, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_MakeStruct_SBZSideBarNotificationData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_Create_ReturnValue) == 0x0000D0, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_bool_Variable_2) == 0x0000D8, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_struct_Variable) == 0x0000DC, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_struct_Variable_1) == 0x0000E4, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_Select_Default) == 0x0000EC, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_CreateDelegate_OutputDelegate) == 0x0000F4, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000108, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_Event_bInHasFocus) == 0x000109, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_Select_Default_1) == 0x00010A, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_CanSelectSkill_Result) == 0x00010B, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_CanSelectSkill_Result' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x00010C, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_SwitchEnum_CmpSuccess) == 0x00010D, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_IsValid_ReturnValue) == 0x00010E, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_CreateDelegate_OutputDelegate_1) == 0x000110, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_object_Variable) == 0x000128, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_DynamicCast_AsPaper_Sprite) == 0x000130, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_IsLocked_IsLocked) == 0x000139, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_IsLocked_IsLocked' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_Event_bInIsHovered) == 0x00013A, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_Select_Default_2) == 0x00013B, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_CustomEvent_Loaded) == 0x000140, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000148, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_CustomEvent_bEquipped) == 0x000149, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_CustomEvent_bEquipped' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_CreateDelegate_OutputDelegate_2) == 0x00014C, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_Select_Default_3) == 0x000160, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_IsLocked_IsLocked_1) == 0x000161, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_IsLocked_IsLocked_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_Not_PreBool_ReturnValue) == 0x000162, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_BooleanAND_ReturnValue) == 0x000163, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_Array_Contains_ReturnValue) == 0x000164, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_PlayAnimationForward_ReturnValue) == 0x000168, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_GetUIManager_ReturnValue) == 0x000170, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_GetUIManager_ReturnValue_1) == 0x000178, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_GetUIManager_ReturnValue_2) == 0x000180, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, Temp_object_Variable_1) == 0x000188, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_DynamicCast_AsPaper_Sprite_1) == 0x000190, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_DynamicCast_AsPaper_Sprite_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_DynamicCast_bSuccess_1) == 0x000198, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_MakeStruct_SlateBrush) == 0x0001A0, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_MakeStruct_SlateBrush' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_Play2DSound_ReturnValue) == 0x000230, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_CustomEvent_Loaded_1) == 0x000238, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, K2Node_Event_IsDesignTime) == 0x000240, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000248, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000250, "Member 'WBP_UI_Skills_Button_C_ExecuteUbergraph_WBP_UI_Skills_Button::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Button_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Skills_Button_C_PreConstruct");
static_assert(sizeof(WBP_UI_Skills_Button_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Skills_Button_C_PreConstruct");
static_assert(offsetof(WBP_UI_Skills_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Skills_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.OnBaseSkillEquipChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Button_C_OnBaseSkillEquipChanged final
{
public:
	bool                                          bEquipped;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Button_C_OnBaseSkillEquipChanged) == 0x000001, "Wrong alignment on WBP_UI_Skills_Button_C_OnBaseSkillEquipChanged");
static_assert(sizeof(WBP_UI_Skills_Button_C_OnBaseSkillEquipChanged) == 0x000001, "Wrong size on WBP_UI_Skills_Button_C_OnBaseSkillEquipChanged");
static_assert(offsetof(WBP_UI_Skills_Button_C_OnBaseSkillEquipChanged, bEquipped) == 0x000000, "Member 'WBP_UI_Skills_Button_C_OnBaseSkillEquipChanged::bEquipped' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Button_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Button_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_UI_Skills_Button_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_UI_Skills_Button_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_UI_Skills_Button_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_UI_Skills_Button_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_UI_Skills_Button_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Button_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Button_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_UI_Skills_Button_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_UI_Skills_Button_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_UI_Skills_Button_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_UI_Skills_Button_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_UI_Skills_Button_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.OnLoaded_768385304A5076C4893ADC97ABC601C1
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Skills_Button_C_OnLoaded_768385304A5076C4893ADC97ABC601C1 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Button_C_OnLoaded_768385304A5076C4893ADC97ABC601C1) == 0x000008, "Wrong alignment on WBP_UI_Skills_Button_C_OnLoaded_768385304A5076C4893ADC97ABC601C1");
static_assert(sizeof(WBP_UI_Skills_Button_C_OnLoaded_768385304A5076C4893ADC97ABC601C1) == 0x000008, "Wrong size on WBP_UI_Skills_Button_C_OnLoaded_768385304A5076C4893ADC97ABC601C1");
static_assert(offsetof(WBP_UI_Skills_Button_C_OnLoaded_768385304A5076C4893ADC97ABC601C1, Loaded) == 0x000000, "Member 'WBP_UI_Skills_Button_C_OnLoaded_768385304A5076C4893ADC97ABC601C1::Loaded' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.OnLoaded_B5E36C62476E1F58F16D1589DC03935D
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Skills_Button_C_OnLoaded_B5E36C62476E1F58F16D1589DC03935D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Button_C_OnLoaded_B5E36C62476E1F58F16D1589DC03935D) == 0x000008, "Wrong alignment on WBP_UI_Skills_Button_C_OnLoaded_B5E36C62476E1F58F16D1589DC03935D");
static_assert(sizeof(WBP_UI_Skills_Button_C_OnLoaded_B5E36C62476E1F58F16D1589DC03935D) == 0x000008, "Wrong size on WBP_UI_Skills_Button_C_OnLoaded_B5E36C62476E1F58F16D1589DC03935D");
static_assert(offsetof(WBP_UI_Skills_Button_C_OnLoaded_B5E36C62476E1F58F16D1589DC03935D, Loaded) == 0x000000, "Member 'WBP_UI_Skills_Button_C_OnLoaded_B5E36C62476E1F58F16D1589DC03935D::Loaded' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.Set State
// 0x0128 (0x0128 - 0x0000)
struct WBP_UI_Skills_Button_C_Set_State final
{
public:
	ESBZSkillState                                State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            ModBrush;                                          // 0x0008(0x0090)(Edit, BlueprintVisible)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x00BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00BE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x00BF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_6;                              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x00E4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue_1;      // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0103(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_IsLocked;                        // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0105(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_106[0x2];                                      // 0x0106(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x010D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10E[0x2];                                      // 0x010E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_2;                           // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocked_IsLocked_1;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Button_C_Set_State) == 0x000008, "Wrong alignment on WBP_UI_Skills_Button_C_Set_State");
static_assert(sizeof(WBP_UI_Skills_Button_C_Set_State) == 0x000128, "Wrong size on WBP_UI_Skills_Button_C_Set_State");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, State) == 0x000000, "Member 'WBP_UI_Skills_Button_C_Set_State::State' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, ModBrush) == 0x000008, "Member 'WBP_UI_Skills_Button_C_Set_State::ModBrush' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_struct_Variable) == 0x000098, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_struct_Variable_1) == 0x0000A8, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_bool_Variable) == 0x0000B8, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_byte_Variable) == 0x0000B9, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_byte_Variable_1) == 0x0000BA, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_MakeLiteralByte_ReturnValue) == 0x0000BB, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_bool_Variable_1) == 0x0000BC, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_byte_Variable_2) == 0x0000BD, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_byte_Variable_3) == 0x0000BE, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_bool_Variable_2) == 0x0000BF, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_bool_Variable_3) == 0x0000C0, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_float_Variable) == 0x0000C4, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_bool_Variable_4) == 0x0000C8, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_byte_Variable_4) == 0x0000C9, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_byte_Variable_5) == 0x0000CA, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x0000CB, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x0000CC, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_struct_Variable_2) == 0x0000D0, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_byte_Variable_6) == 0x0000E0, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, K2Node_Select_Default) == 0x0000E4, "Member 'WBP_UI_Skills_Button_C_Set_State::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_PlayAnimation_ReturnValue) == 0x0000F8, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_byte_Variable_7) == 0x000100, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_GreaterEqual_ByteByte_ReturnValue_1) == 0x000101, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_GreaterEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000102, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_byte_Variable_8) == 0x000103, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_IsLocked_IsLocked) == 0x000104, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_IsLocked_IsLocked' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, Temp_bool_Variable_5) == 0x000105, "Member 'WBP_UI_Skills_Button_C_Set_State::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000108, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, K2Node_Select_Default_1) == 0x00010C, "Member 'WBP_UI_Skills_Button_C_Set_State::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00010D, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000110, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, K2Node_Select_Default_2) == 0x000114, "Member 'WBP_UI_Skills_Button_C_Set_State::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, K2Node_Select_Default_3) == 0x000118, "Member 'WBP_UI_Skills_Button_C_Set_State::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_IsLocked_IsLocked_1) == 0x00011C, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_IsLocked_IsLocked_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, K2Node_Select_Default_4) == 0x00011D, "Member 'WBP_UI_Skills_Button_C_Set_State::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, K2Node_Select_Default_5) == 0x00011E, "Member 'WBP_UI_Skills_Button_C_Set_State::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00011F, "Member 'WBP_UI_Skills_Button_C_Set_State::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Set_State, K2Node_Select_Default_6) == 0x000120, "Member 'WBP_UI_Skills_Button_C_Set_State::K2Node_Select_Default_6' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.IsLocked
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_Skills_Button_C_IsLocked final
{
public:
	bool                                          IsLocked_0;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Button_C_IsLocked) == 0x000001, "Wrong alignment on WBP_UI_Skills_Button_C_IsLocked");
static_assert(sizeof(WBP_UI_Skills_Button_C_IsLocked) == 0x000002, "Wrong size on WBP_UI_Skills_Button_C_IsLocked");
static_assert(offsetof(WBP_UI_Skills_Button_C_IsLocked, IsLocked_0) == 0x000000, "Member 'WBP_UI_Skills_Button_C_IsLocked::IsLocked_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_IsLocked, CallFunc_Less_FloatFloat_ReturnValue) == 0x000001, "Member 'WBP_UI_Skills_Button_C_IsLocked::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.SetFocused
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_UI_Skills_Button_C_SetFocused final
{
public:
	bool                                          Focus;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0034(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_1;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         K2Node_Select_Default;                             // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Button_C_SetFocused) == 0x000008, "Wrong alignment on WBP_UI_Skills_Button_C_SetFocused");
static_assert(sizeof(WBP_UI_Skills_Button_C_SetFocused) == 0x0000A0, "Wrong size on WBP_UI_Skills_Button_C_SetFocused");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, Focus) == 0x000000, "Member 'WBP_UI_Skills_Button_C_SetFocused::Focus' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, Temp_object_Variable) == 0x000008, "Member 'WBP_UI_Skills_Button_C_SetFocused::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, CallFunc_SelectColor_ReturnValue) == 0x000010, "Member 'WBP_UI_Skills_Button_C_SetFocused::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, CallFunc_SelectColor_ReturnValue_1) == 0x000020, "Member 'WBP_UI_Skills_Button_C_SetFocused::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, Temp_byte_Variable) == 0x000030, "Member 'WBP_UI_Skills_Button_C_SetFocused::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, Temp_struct_Variable) == 0x000034, "Member 'WBP_UI_Skills_Button_C_SetFocused::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, Temp_struct_Variable_1) == 0x000044, "Member 'WBP_UI_Skills_Button_C_SetFocused::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, Temp_struct_Variable_2) == 0x000054, "Member 'WBP_UI_Skills_Button_C_SetFocused::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, Temp_object_Variable_1) == 0x000068, "Member 'WBP_UI_Skills_Button_C_SetFocused::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, Temp_bool_Variable) == 0x000070, "Member 'WBP_UI_Skills_Button_C_SetFocused::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, K2Node_Select_Default) == 0x000078, "Member 'WBP_UI_Skills_Button_C_SetFocused::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, K2Node_Select_Default_1) == 0x000080, "Member 'WBP_UI_Skills_Button_C_SetFocused::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_SetFocused, CallFunc_SelectColor_ReturnValue_2) == 0x000090, "Member 'WBP_UI_Skills_Button_C_SetFocused::CallFunc_SelectColor_ReturnValue_2' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.Selected
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Button_C_Selected final
{
public:
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_ByteByte_ReturnValue;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Play2DSound_ReturnValue_1;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Button_C_Selected) == 0x000004, "Wrong alignment on WBP_UI_Skills_Button_C_Selected");
static_assert(sizeof(WBP_UI_Skills_Button_C_Selected) == 0x000010, "Wrong size on WBP_UI_Skills_Button_C_Selected");
static_assert(offsetof(WBP_UI_Skills_Button_C_Selected, CallFunc_Play2DSound_ReturnValue) == 0x000000, "Member 'WBP_UI_Skills_Button_C_Selected::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Selected, CallFunc_MakeLiteralByte_ReturnValue) == 0x000004, "Member 'WBP_UI_Skills_Button_C_Selected::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Selected, CallFunc_LessEqual_ByteByte_ReturnValue) == 0x000005, "Member 'WBP_UI_Skills_Button_C_Selected::CallFunc_LessEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Selected, CallFunc_Play2DSound_ReturnValue_1) == 0x000008, "Member 'WBP_UI_Skills_Button_C_Selected::CallFunc_Play2DSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Selected, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'WBP_UI_Skills_Button_C_Selected::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Selected, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'WBP_UI_Skills_Button_C_Selected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Button_C_Selected, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'WBP_UI_Skills_Button_C_Selected::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Button.WBP_UI_Skills_Button_C.Unselected
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Button_C_Unselected final
{
public:
	ESBZSkillState                                Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_2;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_3;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_4;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable_5;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
