#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ArmorInventoryScreen

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.ExecuteUbergraph_WBP_UI_ArmorInventoryScreen
// 0x03B0 (0x03B0 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_ArmorSlotIndex;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x002C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     CallFunc_GetContextAwareControlReference_ControlsReference; // 0x0050(0x0010)(ReferenceParm)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0078(0x0028)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x00A8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget;          // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasSuccessful;                       // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasSuccessful_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZInventorySlotStoreItem             K2Node_Event_Item;                                 // 0x0110(0x00E0)(ConstParm)
	class UWBP_UI_Inventory_SuitSlotStoreItemButton_C* K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button; // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x01F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0209(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_20A[0x6];                                      // 0x020A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     CallFunc_GetContextAwareControlReference_ControlsReference_1; // 0x0210(0x0010)(ReferenceParm)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0220(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x0238(0x0028)()
	bool                                          Temp_bool_Variable;                                // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_Event_InFocusedButton;                      // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFocused;                           // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Inventory_ArmorSlotButton_C*    K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button; // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZArmorInventorySlot                 CallFunc_GetArmorSlot_ReturnValue;                 // 0x0290(0x0068)()
	TArray<struct FSBZButtonControlReference>     CallFunc_GetContextAwareControlReference_ControlsReference_2; // 0x02F8(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_2;    // 0x0308(0x0028)()
	const class USBZArmorData*                    CallFunc_GetArmorInSlot_ReturnValue;               // 0x0330(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_1;              // 0x0348(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_351[0x7];                                      // 0x0351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_1;        // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CustomizeArmorInSlot_ReturnValue;         // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0362(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_363[0x5];                                      // 0x0363(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0368(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Inventory_ArmorSlotButton_C*    K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button_1; // 0x0388(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x3];                                      // 0x0391(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0394(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0398(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x039C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39D[0x3];                                      // 0x039D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_2;                           // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen) == 0x000008, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen) == 0x0003B0, "Wrong size on WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Event_ArmorSlotIndex) == 0x000004, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Event_ArmorSlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Event_PreviousValue) == 0x00002C, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetContextAwareControlReference_ControlsReference) == 0x000050, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetContextAwareControlReference_ControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000078, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetUIManager_ReturnValue) == 0x0000A0, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_PopStack_ReturnValue) == 0x0000A8, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetMenuWidget_ReturnValue) == 0x0000B8, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget) == 0x0000C0, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_IsVisible_ReturnValue) == 0x0000C9, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x0000D0, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x0000D8, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Event_bWasSuccessful) == 0x0000E4, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Event_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_IsValid_ReturnValue) == 0x0000E5, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetChildAt_ReturnValue_1) == 0x0000E8, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetChildrenCount_ReturnValue) == 0x0000F0, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000F4, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0000F8, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_Clamp_ReturnValue) == 0x0000FC, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetChildAt_ReturnValue_2) == 0x000100, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Event_bWasSuccessful_1) == 0x000108, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Event_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Event_Item) == 0x000110, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button) == 0x0001F0, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_bSuccess_1) == 0x0001F8, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, Temp_byte_Variable) == 0x0001F9, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_ComponentBoundEvent_Button) == 0x000200, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000208, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, Temp_byte_Variable_1) == 0x000209, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetContextAwareControlReference_ControlsReference_1) == 0x000210, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetContextAwareControlReference_ControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x000220, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference_1) == 0x000238, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, Temp_bool_Variable) == 0x000260, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Event_InFocusedButton) == 0x000268, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Event_InFocusedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Event_bIsFocused) == 0x000270, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Event_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000278, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button) == 0x000280, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_bSuccess_2) == 0x000288, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetArmorSlot_ReturnValue) == 0x000290, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetArmorSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetContextAwareControlReference_ControlsReference_2) == 0x0002F8, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetContextAwareControlReference_ControlsReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference_2) == 0x000308, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetArmorInSlot_ReturnValue) == 0x000330, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetArmorInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_IsValid_ReturnValue_1) == 0x000338, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetUIManager_ReturnValue_1) == 0x000340, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetMenuWidget_ReturnValue_1) == 0x000348, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetMenuWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Select_Default) == 0x000350, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget_1) == 0x000358, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_bSuccess_3) == 0x000360, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_CustomizeArmorInSlot_ReturnValue) == 0x000361, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_CustomizeArmorInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, Temp_bool_Variable_1) == 0x000362, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_GetAllChildren_ReturnValue) == 0x000368, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Select_Default_1) == 0x000378, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_Array_Get_Item) == 0x000380, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button_1) == 0x000388, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_DynamicCast_bSuccess_4) == 0x000390, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_Array_Length_ReturnValue) == 0x000394, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, Temp_int_Loop_Counter_Variable) == 0x000398, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_Less_IntInt_ReturnValue) == 0x00039C, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, CallFunc_Add_IntInt_ReturnValue) == 0x0003A0, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, Temp_bool_Variable_2) == 0x0003A4, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen, K2Node_Select_Default_2) == 0x0003A8, "Member 'WBP_UI_ArmorInventoryScreen_C_ExecuteUbergraph_WBP_UI_ArmorInventoryScreen::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.ArmorSlotButtonFocusedChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_ArmorSlotButtonFocusedChanged final
{
public:
	class USBZMenuButton*                         InFocusedButton;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_ArmorSlotButtonFocusedChanged) == 0x000008, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_ArmorSlotButtonFocusedChanged");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_ArmorSlotButtonFocusedChanged) == 0x000010, "Wrong size on WBP_UI_ArmorInventoryScreen_C_ArmorSlotButtonFocusedChanged");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ArmorSlotButtonFocusedChanged, InFocusedButton) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_ArmorSlotButtonFocusedChanged::InFocusedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ArmorSlotButtonFocusedChanged, bIsFocused) == 0x000008, "Member 'WBP_UI_ArmorInventoryScreen_C_ArmorSlotButtonFocusedChanged::bIsFocused' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_ArmorInventoryScreen_C_BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_ArmorInventoryScreen_C_BndEvt__WBP_UI_MaskInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.OnSlotPriceChanged
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_OnSlotPriceChanged final
{
public:
	struct FSBZInventorySlotStoreItem             Item;                                              // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_OnSlotPriceChanged) == 0x000008, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_OnSlotPriceChanged");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_OnSlotPriceChanged) == 0x0000E0, "Wrong size on WBP_UI_ArmorInventoryScreen_C_OnSlotPriceChanged");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_OnSlotPriceChanged, Item) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_OnSlotPriceChanged::Item' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.OnItemDiscarded
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_OnItemDiscarded final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_OnItemDiscarded) == 0x000001, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_OnItemDiscarded");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_OnItemDiscarded) == 0x000001, "Wrong size on WBP_UI_ArmorInventoryScreen_C_OnItemDiscarded");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_OnItemDiscarded, bWasSuccessful) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_OnItemDiscarded::bWasSuccessful' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.OnEditButtonPressed
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_OnEditButtonPressed final
{
public:
	int32                                         ArmorSlotIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_OnEditButtonPressed) == 0x000004, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_OnEditButtonPressed");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_OnEditButtonPressed) == 0x000004, "Wrong size on WBP_UI_ArmorInventoryScreen_C_OnEditButtonPressed");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_OnEditButtonPressed, ArmorSlotIndex) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_OnEditButtonPressed::ArmorSlotIndex' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_ArmorInventoryScreen_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.OnSlotPurchaseComplete
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_OnSlotPurchaseComplete final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_OnSlotPurchaseComplete) == 0x000001, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_OnSlotPurchaseComplete");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_OnSlotPurchaseComplete) == 0x000001, "Wrong size on WBP_UI_ArmorInventoryScreen_C_OnSlotPurchaseComplete");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_OnSlotPurchaseComplete, bWasSuccessful) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_OnSlotPurchaseComplete::bWasSuccessful' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.ShowArmorOnly
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_ShowArmorOnly final
{
public:
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_ShowArmorOnly) == 0x000008, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_ShowArmorOnly");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_ShowArmorOnly) == 0x000008, "Wrong size on WBP_UI_ArmorInventoryScreen_C_ShowArmorOnly");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ShowArmorOnly, CallFunc_GetCustomizationManager_ReturnValue) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_ShowArmorOnly::CallFunc_GetCustomizationManager_ReturnValue' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.SetActiveButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_SetActiveButton final
{
public:
	class USBZMenuButton*                         ArmorButton;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_SetActiveButton) == 0x000008, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_SetActiveButton");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_SetActiveButton) == 0x000010, "Wrong size on WBP_UI_ArmorInventoryScreen_C_SetActiveButton");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_SetActiveButton, ArmorButton) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_SetActiveButton::ArmorButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_SetActiveButton, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_UI_ArmorInventoryScreen_C_SetActiveButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_SetActiveButton, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'WBP_UI_ArmorInventoryScreen_C_SetActiveButton::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_SetActiveButton, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'WBP_UI_ArmorInventoryScreen_C_SetActiveButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.GetContextAwareControlReference
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference final
{
public:
	class UWBP_UI_Inventory_ArmorSlotButton_C*    ArmorButton;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZButtonControlReference>     ControlsReference;                                 // 0x0008(0x0010)(Parm, OutParm)
	TArray<struct FSBZButtonControlReference>     ControlRefArray;                                   // 0x0018(0x0010)(Edit, BlueprintVisible)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0028(0x0030)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsMenuStatePrePlanning_IsPreplanning;     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanDiscardArmorInSlot_ReturnValue;        // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCustomize_CanCustomize;                // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0078(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0090(0x0018)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x00A8(0x0030)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference) == 0x000008, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference) == 0x0000E0, "Wrong size on WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, ArmorButton) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::ArmorButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, ControlsReference) == 0x000008, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::ControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, ControlRefArray) == 0x000018, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::ControlRefArray' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, K2Node_MakeStruct_SBZButtonControlReference) == 0x000028, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_IsMenuStatePrePlanning_IsPreplanning) == 0x000070, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_IsMenuStatePrePlanning_IsPreplanning' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_Not_PreBool_ReturnValue) == 0x000071, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_CanDiscardArmorInSlot_ReturnValue) == 0x000072, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_CanDiscardArmorInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_CanCustomize_CanCustomize) == 0x000073, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_CanCustomize_CanCustomize' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_BooleanAND_ReturnValue) == 0x000074, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_MakeLiteralText_ReturnValue) == 0x000078, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_TextToUpper_ReturnValue) == 0x000090, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x0000A8, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_Array_Add_ReturnValue) == 0x0000D8, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference, CallFunc_Array_Add_ReturnValue_1) == 0x0000DC, "Member 'WBP_UI_ArmorInventoryScreen_C_GetContextAwareControlReference::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.OnDiscardPressed
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed final
{
public:
	class UWBP_UI_Inventory_ArmorSlotButton_C*    K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button; // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetArmorSlotIndex_ReturnValue;            // 0x000C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed) == 0x000008, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed) == 0x000010, "Wrong size on WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed, K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed::K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed, CallFunc_GetArmorSlotIndex_ReturnValue) == 0x00000C, "Member 'WBP_UI_ArmorInventoryScreen_C_OnDiscardPressed::CallFunc_GetArmorSlotIndex_ReturnValue' has a wrong offset!");

// Function WBP_UI_ArmorInventoryScreen.WBP_UI_ArmorInventoryScreen_C.ControlsReferenceActionPressed
// 0x0040 (0x0040 - 0x0000)
struct WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Inventory_ArmorSlotButton_C*    K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetArmorSlotIndex_ReturnValue;            // 0x001C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0030(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed) == 0x000008, "Wrong alignment on WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed");
static_assert(sizeof(WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed) == 0x000040, "Wrong size on WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed, ActionName) == 0x000000, "Member 'WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed::ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed, K2Node_SwitchName_CmpSuccess) == 0x00000C, "Member 'WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed, K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button) == 0x000010, "Member 'WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed::K2Node_DynamicCast_AsWBP_UI_Inventory_Armor_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed, CallFunc_GetArmorSlotIndex_ReturnValue) == 0x00001C, "Member 'WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed::CallFunc_GetArmorSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed, CallFunc_IsVisible_ReturnValue) == 0x000020, "Member 'WBP_UI_ArmorInventoryScreen_C_ControlsReferenceActionPressed::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
