#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PageCycleCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PageCycleCounter.WBP_PageCycleCounter_C
// 0x0030 (0x02C0 - 0x0290)
class UWBP_PageCycleCounter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_GenericContainerButton_C*       MouseButton;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Root_WS;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 InIndex)> OnClickedItem;                                     // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         Index_0;                                           // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PageCycleCounter(int32 EntryPoint);
	void BndEvt__WBP_PageCycleCount_MouseButton_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature(class USBZMenuMouseButton* Button);
	void SetInactive();
	void SetActive();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PageCycleCounter_C">();
	}
	static class UWBP_PageCycleCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PageCycleCounter_C>();
	}
};
static_assert(alignof(UWBP_PageCycleCounter_C) == 0x000008, "Wrong alignment on UWBP_PageCycleCounter_C");
static_assert(sizeof(UWBP_PageCycleCounter_C) == 0x0002C0, "Wrong size on UWBP_PageCycleCounter_C");
static_assert(offsetof(UWBP_PageCycleCounter_C, UberGraphFrame) == 0x000290, "Member 'UWBP_PageCycleCounter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycleCounter_C, MouseButton) == 0x000298, "Member 'UWBP_PageCycleCounter_C::MouseButton' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycleCounter_C, Root_WS) == 0x0002A0, "Member 'UWBP_PageCycleCounter_C::Root_WS' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycleCounter_C, OnClickedItem) == 0x0002A8, "Member 'UWBP_PageCycleCounter_C::OnClickedItem' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycleCounter_C, Index_0) == 0x0002B8, "Member 'UWBP_PageCycleCounter_C::Index_0' has a wrong offset!");

}

