#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Local_Navbar_Button

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Local_Navbar_Button.WBP_Local_Navbar_Button_C.ExecuteUbergraph_WBP_Local_Navbar_Button
// 0x0050 (0x0050 - 0x0000)
struct WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button) == 0x000008, "Wrong alignment on WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button");
static_assert(sizeof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button) == 0x000050, "Wrong size on WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, EntryPoint) == 0x000000, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, Temp_bool_Variable) == 0x000004, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, Temp_object_Variable) == 0x000008, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, CallFunc_IsHovered_ReturnValue) == 0x000018, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, K2Node_Select_Default) == 0x000020, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, K2Node_Event_bInIsHovered) == 0x000028, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, K2Node_Event_IsDesignTime) == 0x000029, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, CallFunc_SelectColor_ReturnValue) == 0x00002C, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, CallFunc_SelectColor_ReturnValue_1) == 0x00003C, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button, CallFunc_SelectFloat_ReturnValue) == 0x00004C, "Member 'WBP_Local_Navbar_Button_C_ExecuteUbergraph_WBP_Local_Navbar_Button::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function WBP_Local_Navbar_Button.WBP_Local_Navbar_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Local_Navbar_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Local_Navbar_Button_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Local_Navbar_Button_C_PreConstruct");
static_assert(sizeof(WBP_Local_Navbar_Button_C_PreConstruct) == 0x000001, "Wrong size on WBP_Local_Navbar_Button_C_PreConstruct");
static_assert(offsetof(WBP_Local_Navbar_Button_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Local_Navbar_Button_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Local_Navbar_Button.WBP_Local_Navbar_Button_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Local_Navbar_Button_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Local_Navbar_Button_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_Local_Navbar_Button_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_Local_Navbar_Button_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_Local_Navbar_Button_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_Local_Navbar_Button_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_Local_Navbar_Button_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_Local_Navbar_Button.WBP_Local_Navbar_Button_C.SetFocused
// 0x0090 (0x0090 - 0x0000)
struct WBP_Local_Navbar_Button_C_SetFocused final
{
public:
	bool                                          InFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         Temp_object_Variable_5;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_6;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          K2Node_Select_Default_2;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          K2Node_Select_Default_3;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         K2Node_Select_Default_4;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Local_Navbar_Button_C_SetFocused) == 0x000008, "Wrong alignment on WBP_Local_Navbar_Button_C_SetFocused");
static_assert(sizeof(WBP_Local_Navbar_Button_C_SetFocused) == 0x000090, "Wrong size on WBP_Local_Navbar_Button_C_SetFocused");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, InFocused) == 0x000000, "Member 'WBP_Local_Navbar_Button_C_SetFocused::InFocused' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_object_Variable) == 0x000008, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_bool_Variable) == 0x000018, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_object_Variable_2) == 0x000020, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_object_Variable_3) == 0x000028, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_bool_Variable_1) == 0x000030, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_object_Variable_4) == 0x000038, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_object_Variable_5) == 0x000040, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_bool_Variable_2) == 0x000048, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_bool_Variable_3) == 0x000049, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_object_Variable_6) == 0x000050, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, CallFunc_SelectInt_ReturnValue) == 0x000058, "Member 'WBP_Local_Navbar_Button_C_SetFocused::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, K2Node_Select_Default) == 0x000060, "Member 'WBP_Local_Navbar_Button_C_SetFocused::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, K2Node_Select_Default_1) == 0x000068, "Member 'WBP_Local_Navbar_Button_C_SetFocused::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, Temp_bool_Variable_4) == 0x000070, "Member 'WBP_Local_Navbar_Button_C_SetFocused::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, CallFunc_SelectInt_ReturnValue_1) == 0x000074, "Member 'WBP_Local_Navbar_Button_C_SetFocused::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, K2Node_Select_Default_2) == 0x000078, "Member 'WBP_Local_Navbar_Button_C_SetFocused::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, K2Node_Select_Default_3) == 0x000080, "Member 'WBP_Local_Navbar_Button_C_SetFocused::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetFocused, K2Node_Select_Default_4) == 0x000088, "Member 'WBP_Local_Navbar_Button_C_SetFocused::K2Node_Select_Default_4' has a wrong offset!");

// Function WBP_Local_Navbar_Button.WBP_Local_Navbar_Button_C.SetHovered
// 0x0098 (0x0098 - 0x0000)
struct WBP_Local_Navbar_Button_C_SetHovered final
{
public:
	bool                                          InHovered;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         Temp_object_Variable_5;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_6;                            // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue_1;     // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          K2Node_Select_Default;                             // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          K2Node_Select_Default_1;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          K2Node_Select_Default_2;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         K2Node_Select_Default_3;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         K2Node_Select_Default_4;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Local_Navbar_Button_C_SetHovered) == 0x000008, "Wrong alignment on WBP_Local_Navbar_Button_C_SetHovered");
static_assert(sizeof(WBP_Local_Navbar_Button_C_SetHovered) == 0x000098, "Wrong size on WBP_Local_Navbar_Button_C_SetHovered");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, InHovered) == 0x000000, "Member 'WBP_Local_Navbar_Button_C_SetHovered::InHovered' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_bool_Variable) == 0x000001, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'WBP_Local_Navbar_Button_C_SetHovered::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_object_Variable) == 0x000008, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_object_Variable_2) == 0x000020, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_object_Variable_3) == 0x000028, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_bool_Variable_2) == 0x000030, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_bool_Variable_3) == 0x000031, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_object_Variable_4) == 0x000038, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_object_Variable_5) == 0x000040, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_bool_Variable_4) == 0x000048, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, Temp_object_Variable_6) == 0x000050, "Member 'WBP_Local_Navbar_Button_C_SetHovered::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000058, "Member 'WBP_Local_Navbar_Button_C_SetHovered::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, CallFunc_PlayAnimationTimeRange_ReturnValue_1) == 0x000060, "Member 'WBP_Local_Navbar_Button_C_SetHovered::CallFunc_PlayAnimationTimeRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, CallFunc_SelectInt_ReturnValue_1) == 0x000068, "Member 'WBP_Local_Navbar_Button_C_SetHovered::CallFunc_SelectInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, K2Node_Select_Default) == 0x000070, "Member 'WBP_Local_Navbar_Button_C_SetHovered::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, K2Node_Select_Default_1) == 0x000078, "Member 'WBP_Local_Navbar_Button_C_SetHovered::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, K2Node_Select_Default_2) == 0x000080, "Member 'WBP_Local_Navbar_Button_C_SetHovered::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, K2Node_Select_Default_3) == 0x000088, "Member 'WBP_Local_Navbar_Button_C_SetHovered::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetHovered, K2Node_Select_Default_4) == 0x000090, "Member 'WBP_Local_Navbar_Button_C_SetHovered::K2Node_Select_Default_4' has a wrong offset!");

// Function WBP_Local_Navbar_Button.WBP_Local_Navbar_Button_C.InitializeButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_Local_Navbar_Button_C_InitializeButton final
{
public:
	class FText                                   InTitle;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Local_Navbar_Button_C_InitializeButton) == 0x000008, "Wrong alignment on WBP_Local_Navbar_Button_C_InitializeButton");
static_assert(sizeof(WBP_Local_Navbar_Button_C_InitializeButton) == 0x000018, "Wrong size on WBP_Local_Navbar_Button_C_InitializeButton");
static_assert(offsetof(WBP_Local_Navbar_Button_C_InitializeButton, InTitle) == 0x000000, "Member 'WBP_Local_Navbar_Button_C_InitializeButton::InTitle' has a wrong offset!");

// Function WBP_Local_Navbar_Button.WBP_Local_Navbar_Button_C.SetActive
// 0x0001 (0x0001 - 0x0000)
struct WBP_Local_Navbar_Button_C_SetActive final
{
public:
	bool                                          InActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Local_Navbar_Button_C_SetActive) == 0x000001, "Wrong alignment on WBP_Local_Navbar_Button_C_SetActive");
static_assert(sizeof(WBP_Local_Navbar_Button_C_SetActive) == 0x000001, "Wrong size on WBP_Local_Navbar_Button_C_SetActive");
static_assert(offsetof(WBP_Local_Navbar_Button_C_SetActive, InActive) == 0x000000, "Member 'WBP_Local_Navbar_Button_C_SetActive::InActive' has a wrong offset!");

}

