#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Results_Reward_SkillProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Results_Reward_SkillProgress.WBP_UI_Results_Reward_SkillProgress_C.ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress
// 0x0180 (0x0180 - 0x0000)
struct WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExperienceValues_CurrentExp;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExperienceValues_TargetExp;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x003C(0x0014)(ZeroConstructor, NoDestructor)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0028)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPaperSprite>            K2Node_Select_Default;                             // 0x0088(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExperienceValues_CurrentExp_1;         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExperienceValues_TargetExp_1;          // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0118(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0168(0x0018)()
};
static_assert(alignof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress");
static_assert(sizeof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress) == 0x000180, "Wrong size on WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, EntryPoint) == 0x000000, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_GetExperienceValues_CurrentExp) == 0x000004, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_GetExperienceValues_CurrentExp' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_GetExperienceValues_TargetExp) == 0x000008, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_GetExperienceValues_TargetExp' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, Temp_bool_Variable) == 0x00000C, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000D, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, K2Node_CreateDelegate_OutputDelegate_1) == 0x00003C, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, K2Node_MakeStruct_SlateColor) == 0x000050, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000078, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, K2Node_Event_IsDesignTime) == 0x000080, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000081, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, K2Node_Select_Default) == 0x000088, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, Temp_object_Variable) == 0x0000B8, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_IsValid_ReturnValue_1) == 0x0000C0, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_Play2DSound_ReturnValue) == 0x0000C4, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_PlayAnimationForward_ReturnValue) == 0x0000C8, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_GetExperienceValues_CurrentExp_1) == 0x0000D0, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_GetExperienceValues_CurrentExp_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_GetExperienceValues_TargetExp_1) == 0x0000D4, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_GetExperienceValues_TargetExp_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, K2Node_MakeStruct_FormatArgumentData) == 0x0000D8, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, K2Node_MakeStruct_FormatArgumentData_1) == 0x000118, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, K2Node_MakeArray_Array) == 0x000158, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress, CallFunc_Format_ReturnValue) == 0x000168, "Member 'WBP_UI_Results_Reward_SkillProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_UI_Results_Reward_SkillProgress.WBP_UI_Results_Reward_SkillProgress_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Results_Reward_SkillProgress_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Results_Reward_SkillProgress_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Results_Reward_SkillProgress_C_PreConstruct");
static_assert(sizeof(WBP_UI_Results_Reward_SkillProgress_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Results_Reward_SkillProgress_C_PreConstruct");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Results_Reward_SkillProgress_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Results_Reward_SkillProgress.WBP_UI_Results_Reward_SkillProgress_C.OnLoaded_4365A4A44829CA194ACBEB912D0DDA4C
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Results_Reward_SkillProgress_C_OnLoaded_4365A4A44829CA194ACBEB912D0DDA4C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Results_Reward_SkillProgress_C_OnLoaded_4365A4A44829CA194ACBEB912D0DDA4C) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_SkillProgress_C_OnLoaded_4365A4A44829CA194ACBEB912D0DDA4C");
static_assert(sizeof(WBP_UI_Results_Reward_SkillProgress_C_OnLoaded_4365A4A44829CA194ACBEB912D0DDA4C) == 0x000008, "Wrong size on WBP_UI_Results_Reward_SkillProgress_C_OnLoaded_4365A4A44829CA194ACBEB912D0DDA4C");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_OnLoaded_4365A4A44829CA194ACBEB912D0DDA4C, Loaded) == 0x000000, "Member 'WBP_UI_Results_Reward_SkillProgress_C_OnLoaded_4365A4A44829CA194ACBEB912D0DDA4C::Loaded' has a wrong offset!");

// Function WBP_UI_Results_Reward_SkillProgress.WBP_UI_Results_Reward_SkillProgress_C.SetProgress
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Results_Reward_SkillProgress_C_SetProgress final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Tooltip_C*                         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Results_Reward_SkillProgress_C_SetProgress) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_SkillProgress_C_SetProgress");
static_assert(sizeof(WBP_UI_Results_Reward_SkillProgress_C_SetProgress) == 0x000020, "Wrong size on WBP_UI_Results_Reward_SkillProgress_C_SetProgress");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_SetProgress, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_UI_Results_Reward_SkillProgress_C_SetProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_SetProgress, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'WBP_UI_Results_Reward_SkillProgress_C_SetProgress::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_SetProgress, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000004, "Member 'WBP_UI_Results_Reward_SkillProgress_C_SetProgress::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_SetProgress, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_UI_Results_Reward_SkillProgress_C_SetProgress::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_SetProgress, CallFunc_Add_FloatFloat_ReturnValue) == 0x000010, "Member 'WBP_UI_Results_Reward_SkillProgress_C_SetProgress::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_SetProgress, CallFunc_SafeDivide_ReturnValue) == 0x000014, "Member 'WBP_UI_Results_Reward_SkillProgress_C_SetProgress::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_SetProgress, CallFunc_SafeDivide_ReturnValue_1) == 0x000018, "Member 'WBP_UI_Results_Reward_SkillProgress_C_SetProgress::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_Results_Reward_SkillProgress.WBP_UI_Results_Reward_SkillProgress_C.PlayAppearAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Results_Reward_SkillProgress_C_PlayAppearAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Results_Reward_SkillProgress_C_PlayAppearAnim) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_SkillProgress_C_PlayAppearAnim");
static_assert(sizeof(WBP_UI_Results_Reward_SkillProgress_C_PlayAppearAnim) == 0x000008, "Wrong size on WBP_UI_Results_Reward_SkillProgress_C_PlayAppearAnim");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_PlayAppearAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_UI_Results_Reward_SkillProgress_C_PlayAppearAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_UI_Results_Reward_SkillProgress.WBP_UI_Results_Reward_SkillProgress_C.AnimateBarsAndText
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Results_Reward_SkillProgress_C_AnimateBarsAndText final
{
public:
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Results_Reward_SkillProgress_C_AnimateBarsAndText) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_SkillProgress_C_AnimateBarsAndText");
static_assert(sizeof(WBP_UI_Results_Reward_SkillProgress_C_AnimateBarsAndText) == 0x000008, "Wrong size on WBP_UI_Results_Reward_SkillProgress_C_AnimateBarsAndText");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_AnimateBarsAndText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000000, "Member 'WBP_UI_Results_Reward_SkillProgress_C_AnimateBarsAndText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");

// Function WBP_UI_Results_Reward_SkillProgress.WBP_UI_Results_Reward_SkillProgress_C.GetExperienceValues
// 0x0024 (0x0024 - 0x0000)
struct WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues final
{
public:
	bool                                          IncludeExpDiff;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentExp;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TargetExp;                                         // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues) == 0x000004, "Wrong alignment on WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues");
static_assert(sizeof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues) == 0x000024, "Wrong size on WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues, IncludeExpDiff) == 0x000000, "Member 'WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues::IncludeExpDiff' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues, CurrentExp) == 0x000004, "Member 'WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues::CurrentExp' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues, TargetExp) == 0x000008, "Member 'WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues::TargetExp' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues, CallFunc_SelectInt_ReturnValue) == 0x00000C, "Member 'WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues, CallFunc_FTrunc_ReturnValue) == 0x000010, "Member 'WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000014, "Member 'WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues, CallFunc_SelectFloat_ReturnValue) == 0x00001C, "Member 'WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues, CallFunc_FTrunc_ReturnValue_1) == 0x000020, "Member 'WBP_UI_Results_Reward_SkillProgress_C_GetExperienceValues::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");

}

