#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_CharacterPreferenceDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_CharacterPreferenceDisplay.WBP_UI_CharacterPreferenceDisplay_C
// 0x0018 (0x02F0 - 0x02D8)
class UWBP_UI_CharacterPreferenceDisplay_C final : public USBZMainMenuInventoryCharacterPreferenceDisplay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_Widget_ActionInput_Hold_C*      Widget_TabBackward;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      Widget_TabForward;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_CharacterPreferenceDisplay_C">();
	}
	static class UWBP_UI_CharacterPreferenceDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_CharacterPreferenceDisplay_C>();
	}
};
static_assert(alignof(UWBP_UI_CharacterPreferenceDisplay_C) == 0x000008, "Wrong alignment on UWBP_UI_CharacterPreferenceDisplay_C");
static_assert(sizeof(UWBP_UI_CharacterPreferenceDisplay_C) == 0x0002F0, "Wrong size on UWBP_UI_CharacterPreferenceDisplay_C");
static_assert(offsetof(UWBP_UI_CharacterPreferenceDisplay_C, UberGraphFrame) == 0x0002D8, "Member 'UWBP_UI_CharacterPreferenceDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CharacterPreferenceDisplay_C, Widget_TabBackward) == 0x0002E0, "Member 'UWBP_UI_CharacterPreferenceDisplay_C::Widget_TabBackward' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CharacterPreferenceDisplay_C, Widget_TabForward) == 0x0002E8, "Member 'UWBP_UI_CharacterPreferenceDisplay_C::Widget_TabForward' has a wrong offset!");

}

