#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_CircularCallWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_HUD_CircularCallWidget.WBP_UI_HUD_CircularCallWidget_C
// 0x0060 (0x0358 - 0x02F8)
class UWBP_UI_HUD_CircularCallWidget_C final : public USBZCircularInteractionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OpenAnimCirularWidget;                             // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AnimCircularWidget;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Selection;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Selections;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Selection;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               RadialMaterial;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   InspectText;                                       // 0x0340(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnNumSectionsChanged();
	void OnInitialized();
	void OnSelected(int32 SelectedIndex);
	void OnIndexChanged();
	void PreConstruct(bool IsDesignTime);
	void HackyFunction(float InAngle, float* OutAngle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_HUD_CircularCallWidget_C">();
	}
	static class UWBP_UI_HUD_CircularCallWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_HUD_CircularCallWidget_C>();
	}
};
static_assert(alignof(UWBP_UI_HUD_CircularCallWidget_C) == 0x000008, "Wrong alignment on UWBP_UI_HUD_CircularCallWidget_C");
static_assert(sizeof(UWBP_UI_HUD_CircularCallWidget_C) == 0x000358, "Wrong size on UWBP_UI_HUD_CircularCallWidget_C");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_UI_HUD_CircularCallWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, OpenAnimCirularWidget) == 0x000300, "Member 'UWBP_UI_HUD_CircularCallWidget_C::OpenAnimCirularWidget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, AnimCircularWidget) == 0x000308, "Member 'UWBP_UI_HUD_CircularCallWidget_C::AnimCircularWidget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, Image_Icon) == 0x000310, "Member 'UWBP_UI_HUD_CircularCallWidget_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, Image_Selection) == 0x000318, "Member 'UWBP_UI_HUD_CircularCallWidget_C::Image_Selection' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, Overlay_Selections) == 0x000320, "Member 'UWBP_UI_HUD_CircularCallWidget_C::Overlay_Selections' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, Text_Selection) == 0x000328, "Member 'UWBP_UI_HUD_CircularCallWidget_C::Text_Selection' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, Radius) == 0x000330, "Member 'UWBP_UI_HUD_CircularCallWidget_C::Radius' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, RadialMaterial) == 0x000338, "Member 'UWBP_UI_HUD_CircularCallWidget_C::RadialMaterial' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_CircularCallWidget_C, InspectText) == 0x000340, "Member 'UWBP_UI_HUD_CircularCallWidget_C::InspectText' has a wrong offset!");

}

