#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PartyMemberRevive

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_PartyMemberRevive.WBP_UI_Widget_PartyMemberRevive_C.ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive
// 0x0048 (0x0048 - 0x0000)
struct WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive) == 0x000008, "Wrong alignment on WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive");
static_assert(sizeof(WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive) == 0x000048, "Wrong size on WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive");
static_assert(offsetof(WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'WBP_UI_Widget_PartyMemberRevive_C_ExecuteUbergraph_WBP_UI_Widget_PartyMemberRevive::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_PartyMemberRevive.WBP_UI_Widget_PartyMemberRevive_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_UI_Widget_PartyMemberRevive_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PartyMemberRevive_C_Tick) == 0x000004, "Wrong alignment on WBP_UI_Widget_PartyMemberRevive_C_Tick");
static_assert(sizeof(WBP_UI_Widget_PartyMemberRevive_C_Tick) == 0x00003C, "Wrong size on WBP_UI_Widget_PartyMemberRevive_C_Tick");
static_assert(offsetof(WBP_UI_Widget_PartyMemberRevive_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_UI_Widget_PartyMemberRevive_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyMemberRevive_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_UI_Widget_PartyMemberRevive_C_Tick::InDeltaTime' has a wrong offset!");

}

