#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Results_PlayerStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "struct_PlayerStatsToCompare_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Results_PlayerStatus.WBP_UI_Results_PlayerStatus_C
// 0x01C8 (0x0458 - 0x0290)
class UWBP_UI_Results_PlayerStatus_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomGradient;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        CashSecured_Text;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        CashSecured_Title;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharacterIcon;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ConnectionStateText;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        DamageDealt_Text;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        DamageDealt_Title;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        DevicesHacked_Text;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        DevicesHacked_Title;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Headshots_Text;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Headshots_Text_Title;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        HostagesTraded_Text;                               // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        HostagesTraded_Title;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_205;                                         // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NebulaIcon;                                  // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlatformIcon;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        LocksPicked_Text;                                  // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        LocksPicked_Title;                                 // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        LooseCashSecured_Text;                             // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        LooseCashSecured_Title;                            // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         NebulaName_Border;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Player_Border;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                PlayerData_Border;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        PrimaryAccuracy_Text;                              // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        PrimaryAccuracy_Title;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Revives_Text;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Revives_Title;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SecondaryAccuracy_Text;                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SecondaryAccuracy_Title;                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SpecialKilled_Text;                                // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SpecialKilled_Title;                               // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StayAsPartyResultIcon;                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_InfamyLevel;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NebulaPlayerName;                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_PlatformPlayerName;                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TotalDowns_Text;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TotalDowns_Title;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TotalKilled_Text;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TotalKilled_Title;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RenownLevel_C*                     WBP_RenownLevel;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoIP_C*                            WBP_VoIP;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASBZPlayerState*                        PlayerState;                                       // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 AccelByteDisplayName;                              // 0x0410(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsLocalPlayerState;                                // 0x0420(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_421[0x3];                                      // 0x0421(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct Fstruct_PlayerStatsToCompare           PlayerStats;                                       // 0x0424(0x0034)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Results_PlayerStatus(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateInfamyLevel(class ASBZPlayerState* PlayerState_0);
	void SetAccelByteDisplayName(const class FString& AccelByteDisplayName_0);
	void UpdateTextNebulaPlayerName();
	void GetPlayerStats();
	void SetPlayerStats();
	void GetStatByIndex(int32 Index_0, int32* Value);
	void GetTextByIndex(int32 Index_0, class USBZUITextBlock** Text, class USBZUITextBlock** Title);
	void SetCategoryWon(int32 Selection);
	void OnPlayerLeave(class AActor* DestroyedActor);
	void PlayAddedAnim();
	void GetWeaponAccuracy(int32 InIndex, TArray<struct FSBZEquippableEndMissionResultData>& InArray, int32* Accuracy);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Results_PlayerStatus_C">();
	}
	static class UWBP_UI_Results_PlayerStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Results_PlayerStatus_C>();
	}
};
static_assert(alignof(UWBP_UI_Results_PlayerStatus_C) == 0x000008, "Wrong alignment on UWBP_UI_Results_PlayerStatus_C");
static_assert(sizeof(UWBP_UI_Results_PlayerStatus_C) == 0x000458, "Wrong size on UWBP_UI_Results_PlayerStatus_C");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Results_PlayerStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, FadeIn) == 0x000298, "Member 'UWBP_UI_Results_PlayerStatus_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, BottomGradient) == 0x0002A0, "Member 'UWBP_UI_Results_PlayerStatus_C::BottomGradient' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, CashSecured_Text) == 0x0002A8, "Member 'UWBP_UI_Results_PlayerStatus_C::CashSecured_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, CashSecured_Title) == 0x0002B0, "Member 'UWBP_UI_Results_PlayerStatus_C::CashSecured_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, CharacterIcon) == 0x0002B8, "Member 'UWBP_UI_Results_PlayerStatus_C::CharacterIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, ConnectionStateText) == 0x0002C0, "Member 'UWBP_UI_Results_PlayerStatus_C::ConnectionStateText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, DamageDealt_Text) == 0x0002C8, "Member 'UWBP_UI_Results_PlayerStatus_C::DamageDealt_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, DamageDealt_Title) == 0x0002D0, "Member 'UWBP_UI_Results_PlayerStatus_C::DamageDealt_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, DevicesHacked_Text) == 0x0002D8, "Member 'UWBP_UI_Results_PlayerStatus_C::DevicesHacked_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, DevicesHacked_Title) == 0x0002E0, "Member 'UWBP_UI_Results_PlayerStatus_C::DevicesHacked_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Headshots_Text) == 0x0002E8, "Member 'UWBP_UI_Results_PlayerStatus_C::Headshots_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Headshots_Text_Title) == 0x0002F0, "Member 'UWBP_UI_Results_PlayerStatus_C::Headshots_Text_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, HostagesTraded_Text) == 0x0002F8, "Member 'UWBP_UI_Results_PlayerStatus_C::HostagesTraded_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, HostagesTraded_Title) == 0x000300, "Member 'UWBP_UI_Results_PlayerStatus_C::HostagesTraded_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Image_6) == 0x000308, "Member 'UWBP_UI_Results_PlayerStatus_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Image_7) == 0x000310, "Member 'UWBP_UI_Results_PlayerStatus_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Image_8) == 0x000318, "Member 'UWBP_UI_Results_PlayerStatus_C::Image_8' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Image_9) == 0x000320, "Member 'UWBP_UI_Results_PlayerStatus_C::Image_9' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Image_205) == 0x000328, "Member 'UWBP_UI_Results_PlayerStatus_C::Image_205' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Image_NebulaIcon) == 0x000330, "Member 'UWBP_UI_Results_PlayerStatus_C::Image_NebulaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Image_PlatformIcon) == 0x000338, "Member 'UWBP_UI_Results_PlayerStatus_C::Image_PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, LocksPicked_Text) == 0x000340, "Member 'UWBP_UI_Results_PlayerStatus_C::LocksPicked_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, LocksPicked_Title) == 0x000348, "Member 'UWBP_UI_Results_PlayerStatus_C::LocksPicked_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, LooseCashSecured_Text) == 0x000350, "Member 'UWBP_UI_Results_PlayerStatus_C::LooseCashSecured_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, LooseCashSecured_Title) == 0x000358, "Member 'UWBP_UI_Results_PlayerStatus_C::LooseCashSecured_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, NebulaName_Border) == 0x000360, "Member 'UWBP_UI_Results_PlayerStatus_C::NebulaName_Border' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Player_Border) == 0x000368, "Member 'UWBP_UI_Results_PlayerStatus_C::Player_Border' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, PlayerData_Border) == 0x000370, "Member 'UWBP_UI_Results_PlayerStatus_C::PlayerData_Border' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, PrimaryAccuracy_Text) == 0x000378, "Member 'UWBP_UI_Results_PlayerStatus_C::PrimaryAccuracy_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, PrimaryAccuracy_Title) == 0x000380, "Member 'UWBP_UI_Results_PlayerStatus_C::PrimaryAccuracy_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Revives_Text) == 0x000388, "Member 'UWBP_UI_Results_PlayerStatus_C::Revives_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Revives_Title) == 0x000390, "Member 'UWBP_UI_Results_PlayerStatus_C::Revives_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, SecondaryAccuracy_Text) == 0x000398, "Member 'UWBP_UI_Results_PlayerStatus_C::SecondaryAccuracy_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, SecondaryAccuracy_Title) == 0x0003A0, "Member 'UWBP_UI_Results_PlayerStatus_C::SecondaryAccuracy_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, SpecialKilled_Text) == 0x0003A8, "Member 'UWBP_UI_Results_PlayerStatus_C::SpecialKilled_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, SpecialKilled_Title) == 0x0003B0, "Member 'UWBP_UI_Results_PlayerStatus_C::SpecialKilled_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, StayAsPartyResultIcon) == 0x0003B8, "Member 'UWBP_UI_Results_PlayerStatus_C::StayAsPartyResultIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Text_InfamyLevel) == 0x0003C0, "Member 'UWBP_UI_Results_PlayerStatus_C::Text_InfamyLevel' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Text_NebulaPlayerName) == 0x0003C8, "Member 'UWBP_UI_Results_PlayerStatus_C::Text_NebulaPlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, Text_PlatformPlayerName) == 0x0003D0, "Member 'UWBP_UI_Results_PlayerStatus_C::Text_PlatformPlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, TotalDowns_Text) == 0x0003D8, "Member 'UWBP_UI_Results_PlayerStatus_C::TotalDowns_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, TotalDowns_Title) == 0x0003E0, "Member 'UWBP_UI_Results_PlayerStatus_C::TotalDowns_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, TotalKilled_Text) == 0x0003E8, "Member 'UWBP_UI_Results_PlayerStatus_C::TotalKilled_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, TotalKilled_Title) == 0x0003F0, "Member 'UWBP_UI_Results_PlayerStatus_C::TotalKilled_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, WBP_RenownLevel) == 0x0003F8, "Member 'UWBP_UI_Results_PlayerStatus_C::WBP_RenownLevel' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, WBP_VoIP) == 0x000400, "Member 'UWBP_UI_Results_PlayerStatus_C::WBP_VoIP' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, PlayerState) == 0x000408, "Member 'UWBP_UI_Results_PlayerStatus_C::PlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, AccelByteDisplayName) == 0x000410, "Member 'UWBP_UI_Results_PlayerStatus_C::AccelByteDisplayName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, IsLocalPlayerState) == 0x000420, "Member 'UWBP_UI_Results_PlayerStatus_C::IsLocalPlayerState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_PlayerStatus_C, PlayerStats) == 0x000424, "Member 'UWBP_UI_Results_PlayerStatus_C::PlayerStats' has a wrong offset!");

}

