#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Overskill_Level

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Overskill_Level.WBP_UI_Overskill_Level_C.ExecuteUbergraph_WBP_UI_Overskill_Level
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZOverskillData*                K2Node_Event_InOverskillData;                      // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InProgress;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCurrentLevel_CurrentLevel;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level) == 0x000008, "Wrong alignment on WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level");
static_assert(sizeof(WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level) == 0x000020, "Wrong size on WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level");
static_assert(offsetof(WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level, EntryPoint) == 0x000000, "Member 'WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level, K2Node_Event_InOverskillData) == 0x000008, "Member 'WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level::K2Node_Event_InOverskillData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level, K2Node_Event_InProgress) == 0x000010, "Member 'WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level::K2Node_Event_InProgress' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level, CallFunc_GetCurrentLevel_CurrentLevel) == 0x000014, "Member 'WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level::CallFunc_GetCurrentLevel_CurrentLevel' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000019, "Member 'WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level, K2Node_Event_IsDesignTime) == 0x00001A, "Member 'WBP_UI_Overskill_Level_C_ExecuteUbergraph_WBP_UI_Overskill_Level::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_Overskill_Level.WBP_UI_Overskill_Level_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Overskill_Level_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Overskill_Level_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Overskill_Level_C_PreConstruct");
static_assert(sizeof(WBP_UI_Overskill_Level_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Overskill_Level_C_PreConstruct");
static_assert(offsetof(WBP_UI_Overskill_Level_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Overskill_Level_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Overskill_Level.WBP_UI_Overskill_Level_C.OnOverskillChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Overskill_Level_C_OnOverskillChanged final
{
public:
	const class USBZOverskillData*                InOverskillData;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InProgress;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Overskill_Level_C_OnOverskillChanged) == 0x000008, "Wrong alignment on WBP_UI_Overskill_Level_C_OnOverskillChanged");
static_assert(sizeof(WBP_UI_Overskill_Level_C_OnOverskillChanged) == 0x000010, "Wrong size on WBP_UI_Overskill_Level_C_OnOverskillChanged");
static_assert(offsetof(WBP_UI_Overskill_Level_C_OnOverskillChanged, InOverskillData) == 0x000000, "Member 'WBP_UI_Overskill_Level_C_OnOverskillChanged::InOverskillData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_OnOverskillChanged, InProgress) == 0x000008, "Member 'WBP_UI_Overskill_Level_C_OnOverskillChanged::InProgress' has a wrong offset!");

// Function WBP_UI_Overskill_Level.WBP_UI_Overskill_Level_C.SetLevelVisuals
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Overskill_Level_C_SetLevelVisuals final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetValueText_OutText;                     // 0x0008(0x0018)()
};
static_assert(alignof(WBP_UI_Overskill_Level_C_SetLevelVisuals) == 0x000008, "Wrong alignment on WBP_UI_Overskill_Level_C_SetLevelVisuals");
static_assert(sizeof(WBP_UI_Overskill_Level_C_SetLevelVisuals) == 0x000020, "Wrong size on WBP_UI_Overskill_Level_C_SetLevelVisuals");
static_assert(offsetof(WBP_UI_Overskill_Level_C_SetLevelVisuals, Index_0) == 0x000000, "Member 'WBP_UI_Overskill_Level_C_SetLevelVisuals::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_SetLevelVisuals, CallFunc_GetValueText_OutText) == 0x000008, "Member 'WBP_UI_Overskill_Level_C_SetLevelVisuals::CallFunc_GetValueText_OutText' has a wrong offset!");

// Function WBP_UI_Overskill_Level.WBP_UI_Overskill_Level_C.SetColorVisuals
// 0x0014 (0x0014 - 0x0000)
struct WBP_UI_Overskill_Level_C_SetColorVisuals final
{
public:
	bool                                          IsLocked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetKeyColor_OutColor;                     // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Overskill_Level_C_SetColorVisuals) == 0x000004, "Wrong alignment on WBP_UI_Overskill_Level_C_SetColorVisuals");
static_assert(sizeof(WBP_UI_Overskill_Level_C_SetColorVisuals) == 0x000014, "Wrong size on WBP_UI_Overskill_Level_C_SetColorVisuals");
static_assert(offsetof(WBP_UI_Overskill_Level_C_SetColorVisuals, IsLocked) == 0x000000, "Member 'WBP_UI_Overskill_Level_C_SetColorVisuals::IsLocked' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_SetColorVisuals, CallFunc_GetKeyColor_OutColor) == 0x000004, "Member 'WBP_UI_Overskill_Level_C_SetColorVisuals::CallFunc_GetKeyColor_OutColor' has a wrong offset!");

// Function WBP_UI_Overskill_Level.WBP_UI_Overskill_Level_C.GetKeyColor
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Overskill_Level_C_GetKeyColor final
{
public:
	struct FLinearColor                           OutColor;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FLinearColor>                   CallFunc_Map_Keys_Keys;                            // 0x0010(0x0010)(ReferenceParm)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Overskill_Level_C_GetKeyColor) == 0x000008, "Wrong alignment on WBP_UI_Overskill_Level_C_GetKeyColor");
static_assert(sizeof(WBP_UI_Overskill_Level_C_GetKeyColor) == 0x000030, "Wrong size on WBP_UI_Overskill_Level_C_GetKeyColor");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetKeyColor, OutColor) == 0x000000, "Member 'WBP_UI_Overskill_Level_C_GetKeyColor::OutColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetKeyColor, CallFunc_Map_Keys_Keys) == 0x000010, "Member 'WBP_UI_Overskill_Level_C_GetKeyColor::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetKeyColor, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_UI_Overskill_Level_C_GetKeyColor::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_UI_Overskill_Level.WBP_UI_Overskill_Level_C.GetValueText
// 0x0040 (0x0040 - 0x0000)
struct WBP_UI_Overskill_Level_C_GetValueText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0018)(Parm, OutParm)
	TArray<class FText>                           CallFunc_Map_Values_Values;                        // 0x0018(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0028(0x0018)()
};
static_assert(alignof(WBP_UI_Overskill_Level_C_GetValueText) == 0x000008, "Wrong alignment on WBP_UI_Overskill_Level_C_GetValueText");
static_assert(sizeof(WBP_UI_Overskill_Level_C_GetValueText) == 0x000040, "Wrong size on WBP_UI_Overskill_Level_C_GetValueText");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetValueText, OutText) == 0x000000, "Member 'WBP_UI_Overskill_Level_C_GetValueText::OutText' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetValueText, CallFunc_Map_Values_Values) == 0x000018, "Member 'WBP_UI_Overskill_Level_C_GetValueText::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetValueText, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_UI_Overskill_Level_C_GetValueText::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_UI_Overskill_Level.WBP_UI_Overskill_Level_C.GetCurrentLevel
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Overskill_Level_C_GetCurrentLevel final
{
public:
	float                                         Progress_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentLevel;                                      // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurLevel;                                          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZSkillData*                          CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Overskill_Level_C_GetCurrentLevel) == 0x000008, "Wrong alignment on WBP_UI_Overskill_Level_C_GetCurrentLevel");
static_assert(sizeof(WBP_UI_Overskill_Level_C_GetCurrentLevel) == 0x000030, "Wrong size on WBP_UI_Overskill_Level_C_GetCurrentLevel");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, Progress_0) == 0x000000, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::Progress_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CurrentLevel) == 0x000004, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CurrentLevel' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CurLevel) == 0x000008, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CurLevel' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CallFunc_Not_PreBool_ReturnValue) == 0x000019, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x00002D, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Overskill_Level_C_GetCurrentLevel, CallFunc_BooleanAND_ReturnValue) == 0x00002E, "Member 'WBP_UI_Overskill_Level_C_GetCurrentLevel::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

