#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_BaseTimedSkill_RinoHud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_BaseTimedSkill_RinoHud.WBP_UI_Widget_BaseTimedSkill_RinoHud_C
// 0x0038 (0x02C8 - 0x0290)
class UWBP_UI_Widget_BaseTimedSkill_RinoHud_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_109;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icon;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_98;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             time;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         val_duration;                                      // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         val_remaining;                                     // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           in_sprite;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_BaseTimedSkill_RinoHud(int32 EntryPoint);
	void OnInitialized();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void _Update();
	void SetInitial(float Duration);
	void SetValues(float remaining);
	void SetIcon(class UPaperSprite* AtlasRegion);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_BaseTimedSkill_RinoHud_C">();
	}
	static class UWBP_UI_Widget_BaseTimedSkill_RinoHud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_BaseTimedSkill_RinoHud_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_BaseTimedSkill_RinoHud_C");
static_assert(sizeof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C) == 0x0002C8, "Wrong size on UWBP_UI_Widget_BaseTimedSkill_RinoHud_C");
static_assert(offsetof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_BaseTimedSkill_RinoHud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C, Border_109) == 0x000298, "Member 'UWBP_UI_Widget_BaseTimedSkill_RinoHud_C::Border_109' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C, icon) == 0x0002A0, "Member 'UWBP_UI_Widget_BaseTimedSkill_RinoHud_C::icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C, Image_98) == 0x0002A8, "Member 'UWBP_UI_Widget_BaseTimedSkill_RinoHud_C::Image_98' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C, time) == 0x0002B0, "Member 'UWBP_UI_Widget_BaseTimedSkill_RinoHud_C::time' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C, val_duration) == 0x0002B8, "Member 'UWBP_UI_Widget_BaseTimedSkill_RinoHud_C::val_duration' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C, val_remaining) == 0x0002BC, "Member 'UWBP_UI_Widget_BaseTimedSkill_RinoHud_C::val_remaining' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseTimedSkill_RinoHud_C, in_sprite) == 0x0002C0, "Member 'UWBP_UI_Widget_BaseTimedSkill_RinoHud_C::in_sprite' has a wrong offset!");

}

