#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Loadout_RenamePopup

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Loadout_RenamePopup.WBP_Loadout_RenamePopup_C.ExecuteUbergraph_WBP_Loadout_RenamePopup
// 0x0078 (0x0078 - 0x0000)
struct WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0008(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FText& Text)>      K2Node_CreateDelegate_OutputDelegate;              // 0x005C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup) == 0x000008, "Wrong alignment on WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup");
static_assert(sizeof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup) == 0x000078, "Wrong size on WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup, EntryPoint) == 0x000000, "Member 'WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup, K2Node_CustomEvent_Text) == 0x000008, "Member 'WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup::K2Node_CustomEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup, CallFunc_Conv_TextToString_ReturnValue) == 0x000020, "Member 'WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup, CallFunc_Left_ReturnValue) == 0x000030, "Member 'WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup, CallFunc_Len_ReturnValue) == 0x000058, "Member 'WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup, K2Node_CreateDelegate_OutputDelegate) == 0x00005C, "Member 'WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup, CallFunc_Greater_IntInt_ReturnValue) == 0x000070, "Member 'WBP_Loadout_RenamePopup_C_ExecuteUbergraph_WBP_Loadout_RenamePopup::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Loadout_RenamePopup.WBP_Loadout_RenamePopup_C.UpdateName
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_RenamePopup_C_UpdateName final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Loadout_RenamePopup_C_UpdateName) == 0x000008, "Wrong alignment on WBP_Loadout_RenamePopup_C_UpdateName");
static_assert(sizeof(WBP_Loadout_RenamePopup_C_UpdateName) == 0x000018, "Wrong size on WBP_Loadout_RenamePopup_C_UpdateName");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_UpdateName, Text) == 0x000000, "Member 'WBP_Loadout_RenamePopup_C_UpdateName::Text' has a wrong offset!");

// Function WBP_Loadout_RenamePopup.WBP_Loadout_RenamePopup_C.ShowCurrentName
// 0x0018 (0x0018 - 0x0000)
struct WBP_Loadout_RenamePopup_C_ShowCurrentName final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Loadout_RenamePopup_C_ShowCurrentName) == 0x000008, "Wrong alignment on WBP_Loadout_RenamePopup_C_ShowCurrentName");
static_assert(sizeof(WBP_Loadout_RenamePopup_C_ShowCurrentName) == 0x000018, "Wrong size on WBP_Loadout_RenamePopup_C_ShowCurrentName");
static_assert(offsetof(WBP_Loadout_RenamePopup_C_ShowCurrentName, InText) == 0x000000, "Member 'WBP_Loadout_RenamePopup_C_ShowCurrentName::InText' has a wrong offset!");

}

