#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_CrimeNet_ServerBrowser

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_MainMenu_CrimeNet_ServerBrowser.WBP_UI_MainMenu_CrimeNet_ServerBrowser_C.ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser
// 0x0648 (0x0648 - 0x0000)
struct WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0004(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZOnlineCode                                Temp_byte_Variable;                                // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsJoinBlocked_bIsJoinBlocked;             // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZOnlineSearchResult>         Temp_struct_Variable;                              // 0x0058(0x0010)(ReferenceParm)
	struct FSBZOnlineSessionParams                K2Node_MakeStruct_SBZOnlineSessionParams;          // 0x0068(0x0070)()
	struct FSBZOnlineSearchResult                 CallFunc_Array_Get_Item;                           // 0x00D8(0x0198)()
	class USBZSessionUpdateListCallbackProxy*     CallFunc_SessionUpdateList_ReturnValue;            // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRequestInProgress_ReturnValue;          // 0x027D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27E[0x2];                                      // 0x027E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZOnlineSearchResult                 K2Node_CustomEvent_RemoteSessionInfo;              // 0x0280(0x0198)(ConstParm)
	ESBZOnlineCode                                K2Node_CustomEvent_ErrorCode;                      // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x041C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_422[0x2];                                      // 0x0422(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0424(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBZOnlineCode ErrorCode)>     K2Node_CreateDelegate_OutputDelegate_1;            // 0x0428(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FSBZOnlineSearchResult& RemoteSessionInfo)> K2Node_CreateDelegate_OutputDelegate_2; // 0x043C(0x0014)(ZeroConstructor, NoDestructor)
	ESBZOnlineCode                                K2Node_CustomEvent_ErrorCode_1;                    // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZOnlineSearchResult>         K2Node_CustomEvent_Results;                        // 0x0458(0x0010)(ConstParm, ReferenceParm)
	class UWBP_UI_MainMenu_CrimeNet_ServerButton_C* CallFunc_SpawnObject_ReturnValue;                // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InActionInput;                  // 0x0478(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_485[0x3];                                      // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0490(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESBZOnlineCode ErrorCode, const TArray<struct FSBZOnlineSearchResult>& Results)> K2Node_CreateDelegate_OutputDelegate_3; // 0x04A0(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x04B4(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x04C8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x04E0(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0510(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x0540(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x0570(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x05A0(0x0010)(ReferenceParm)
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x05B0(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x05C0(0x0028)()
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x05E8(0x0028)()
	TDelegate<void(class USBZMenuButton* Button, bool bIsEnabled)> K2Node_CreateDelegate_OutputDelegate_6; // 0x0610(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_CustomEvent_Button;                         // 0x0628(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsEnabled;                     // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_MainMenu_CrimeNet_ServerButton_C* K2Node_DynamicCast_AsWBP_UI_Main_Menu_Crime_Net_Server_Button; // 0x0638(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0640(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser");
static_assert(sizeof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser) == 0x000648, "Wrong size on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, EntryPoint) == 0x000000, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_Event_PreviousValue) == 0x000004, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_GetSBZOnline_ReturnValue) == 0x000010, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_GetSBZOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_GetSBZOnline_ReturnValue_1) == 0x000030, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_GetSBZOnline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000040, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_GetChildAt_ReturnValue) == 0x000048, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, Temp_byte_Variable) == 0x000051, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_IsJoinBlocked_bIsJoinBlocked) == 0x000052, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_IsJoinBlocked_bIsJoinBlocked' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, Temp_struct_Variable) == 0x000058, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_MakeStruct_SBZOnlineSessionParams) == 0x000068, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_MakeStruct_SBZOnlineSessionParams' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_SessionUpdateList_ReturnValue) == 0x000270, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_SessionUpdateList_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_Array_Length_ReturnValue) == 0x000278, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_IsValid_ReturnValue_1) == 0x00027C, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_IsRequestInProgress_ReturnValue) == 0x00027D, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_IsRequestInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CustomEvent_RemoteSessionInfo) == 0x000280, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CustomEvent_RemoteSessionInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CustomEvent_ErrorCode) == 0x000418, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, Temp_int_Loop_Counter_Variable) == 0x00041C, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000420, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_Less_IntInt_ReturnValue) == 0x000421, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_Add_IntInt_ReturnValue) == 0x000424, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CreateDelegate_OutputDelegate_1) == 0x000428, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CreateDelegate_OutputDelegate_2) == 0x00043C, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CustomEvent_ErrorCode_1) == 0x000450, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CustomEvent_ErrorCode_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CustomEvent_Results) == 0x000458, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CustomEvent_Results' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_SpawnObject_ReturnValue) == 0x000468, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_AddChild_ReturnValue) == 0x000470, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CustomEvent_InActionInput) == 0x000478, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CustomEvent_InActionInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_SwitchName_CmpSuccess) == 0x000484, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_GetUIManager_ReturnValue) == 0x000488, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_PopStack_ReturnValue) == 0x000490, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, CallFunc_IsValid_ReturnValue_2) == 0x00049C, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CreateDelegate_OutputDelegate_3) == 0x0004A0, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CreateDelegate_OutputDelegate_4) == 0x0004B4, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CreateDelegate_OutputDelegate_5) == 0x0004C8, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_MakeStruct_SBZButtonControlReference) == 0x0004E0, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000510, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x000540, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x000570, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_MakeArray_Array) == 0x0005A0, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_MakeArray_Array_1) == 0x0005B0, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_MakeStruct_SBZButtonControlsReference) == 0x0005C0, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_MakeStruct_SBZButtonControlsReference_1) == 0x0005E8, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_MakeStruct_SBZButtonControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CreateDelegate_OutputDelegate_6) == 0x000610, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CustomEvent_Button) == 0x000628, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_CustomEvent_bIsEnabled) == 0x000630, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_CustomEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_DynamicCast_AsWBP_UI_Main_Menu_Crime_Net_Server_Button) == 0x000638, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_DynamicCast_AsWBP_UI_Main_Menu_Crime_Net_Server_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser, K2Node_DynamicCast_bSuccess) == 0x000640, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_UI_MainMenu_CrimeNet_ServerBrowser.WBP_UI_MainMenu_CrimeNet_ServerBrowser_C.OnButtonFocusedChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnButtonFocusedChanged final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnButtonFocusedChanged) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnButtonFocusedChanged");
static_assert(sizeof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnButtonFocusedChanged) == 0x000010, "Wrong size on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnButtonFocusedChanged");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnButtonFocusedChanged, Button) == 0x000000, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnButtonFocusedChanged::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnButtonFocusedChanged, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnButtonFocusedChanged::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_MainMenu_CrimeNet_ServerBrowser.WBP_UI_MainMenu_CrimeNet_ServerBrowser_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnControlsReferenceClicked final
{
public:
	class FName                                   InActionInput;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnControlsReferenceClicked, InActionInput) == 0x000000, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnControlsReferenceClicked::InActionInput' has a wrong offset!");

// Function WBP_UI_MainMenu_CrimeNet_ServerBrowser.WBP_UI_MainMenu_CrimeNet_ServerBrowser_C.OnInviteFinished
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnInviteFinished final
{
public:
	ESBZOnlineCode                                ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnInviteFinished) == 0x000001, "Wrong alignment on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnInviteFinished");
static_assert(sizeof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnInviteFinished) == 0x000001, "Wrong size on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnInviteFinished");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnInviteFinished, ErrorCode) == 0x000000, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnInviteFinished::ErrorCode' has a wrong offset!");

// Function WBP_UI_MainMenu_CrimeNet_ServerBrowser.WBP_UI_MainMenu_CrimeNet_ServerBrowser_C.OnJoinStarted
// 0x0198 (0x0198 - 0x0000)
struct WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnJoinStarted final
{
public:
	struct FSBZOnlineSearchResult                 RemoteSessionInfo;                                 // 0x0000(0x0198)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnJoinStarted) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnJoinStarted");
static_assert(sizeof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnJoinStarted) == 0x000198, "Wrong size on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnJoinStarted");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnJoinStarted, RemoteSessionInfo) == 0x000000, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnJoinStarted::RemoteSessionInfo' has a wrong offset!");

// Function WBP_UI_MainMenu_CrimeNet_ServerBrowser.WBP_UI_MainMenu_CrimeNet_ServerBrowser_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_MainMenu_CrimeNet_ServerBrowser.WBP_UI_MainMenu_CrimeNet_ServerBrowser_C.OnComplete_EB7A1BA74C1C1AA3C504FCA022A4D55A
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnComplete_EB7A1BA74C1C1AA3C504FCA022A4D55A final
{
public:
	ESBZOnlineCode                                ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZOnlineSearchResult>         Results;                                           // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnComplete_EB7A1BA74C1C1AA3C504FCA022A4D55A) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnComplete_EB7A1BA74C1C1AA3C504FCA022A4D55A");
static_assert(sizeof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnComplete_EB7A1BA74C1C1AA3C504FCA022A4D55A) == 0x000018, "Wrong size on WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnComplete_EB7A1BA74C1C1AA3C504FCA022A4D55A");
static_assert(offsetof(WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnComplete_EB7A1BA74C1C1AA3C504FCA022A4D55A, ErrorCode) == 0x000000, "Member 'WBP_UI_MainMenu_CrimeNet_ServerBrowser_C_OnComplete_EB7A1BA74C1C1AA3C504FCA022A4D55A::ErrorCode' has a wrong offset!");
