#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Widget_VoipWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Widget_VoipWidget.WBP_Widget_VoipWidget_C.ExecuteUbergraph_WBP_Widget_VoipWidget
// 0x0028 (0x0028 - 0x0000)
struct WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_PlayerName;                           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlayerTalking;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget) == 0x000008, "Wrong alignment on WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget");
static_assert(sizeof(WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget) == 0x000028, "Wrong size on WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget");
static_assert(offsetof(WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget, EntryPoint) == 0x000000, "Member 'WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget, K2Node_Event_PlayerName) == 0x000008, "Member 'WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget::K2Node_Event_PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget, K2Node_Event_bPlayerTalking) == 0x000018, "Member 'WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget::K2Node_Event_bPlayerTalking' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget, CallFunc_Array_AddUnique_ReturnValue) == 0x00001C, "Member 'WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget, CallFunc_Array_RemoveItem_ReturnValue) == 0x000020, "Member 'WBP_Widget_VoipWidget_C_ExecuteUbergraph_WBP_Widget_VoipWidget::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function WBP_Widget_VoipWidget.WBP_Widget_VoipWidget_C.OnPlayerTalkingChangedEvent
// 0x0018 (0x0018 - 0x0000)
struct WBP_Widget_VoipWidget_C_OnPlayerTalkingChangedEvent final
{
public:
	class FString                                 PlayerName;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bPlayerTalking;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Widget_VoipWidget_C_OnPlayerTalkingChangedEvent) == 0x000008, "Wrong alignment on WBP_Widget_VoipWidget_C_OnPlayerTalkingChangedEvent");
static_assert(sizeof(WBP_Widget_VoipWidget_C_OnPlayerTalkingChangedEvent) == 0x000018, "Wrong size on WBP_Widget_VoipWidget_C_OnPlayerTalkingChangedEvent");
static_assert(offsetof(WBP_Widget_VoipWidget_C_OnPlayerTalkingChangedEvent, PlayerName) == 0x000000, "Member 'WBP_Widget_VoipWidget_C_OnPlayerTalkingChangedEvent::PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_OnPlayerTalkingChangedEvent, bPlayerTalking) == 0x000010, "Member 'WBP_Widget_VoipWidget_C_OnPlayerTalkingChangedEvent::bPlayerTalking' has a wrong offset!");

// Function WBP_Widget_VoipWidget.WBP_Widget_VoipWidget_C.UpdateVisuals
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_Widget_VoipWidget_C_UpdateVisuals final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0010(0x0060)(HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             CallFunc_SpawnObject_ReturnValue;                  // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x6];                                       // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Widget_VoipWidget_C_UpdateVisuals) == 0x000008, "Wrong alignment on WBP_Widget_VoipWidget_C_UpdateVisuals");
static_assert(sizeof(WBP_Widget_VoipWidget_C_UpdateVisuals) == 0x0000D8, "Wrong size on WBP_Widget_VoipWidget_C_UpdateVisuals");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, K2Node_MakeStruct_SlateFontInfo) == 0x000010, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::K2Node_MakeStruct_SlateFontInfo' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, Temp_byte_Variable) == 0x000070, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, CallFunc_Greater_IntInt_ReturnValue) == 0x000078, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, CallFunc_SpawnObject_ReturnValue) == 0x000080, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, Temp_byte_Variable_1) == 0x000088, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, Temp_bool_Variable) == 0x000089, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, CallFunc_AddChild_ReturnValue) == 0x000090, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, K2Node_Select_Default) == 0x000098, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Widget_VoipWidget_C_UpdateVisuals, CallFunc_Less_IntInt_ReturnValue) == 0x0000D0, "Member 'WBP_Widget_VoipWidget_C_UpdateVisuals::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

