#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Skills_Line

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Skills_Line.WBP_UI_Skills_Line_C
// 0x0088 (0x0318 - 0x0290)
class UWBP_UI_Skills_Line_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_Skills_Button_C*                BaseSkillButton;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_134;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_188;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_340;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Skills_Button_C*                MasteryButton;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SkillLineDescription_SizeBox;                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SkillLineDescription_T;                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         SubSkills_horizontal;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SkillLineName;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZSkillLine*                          SkillLineData;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_UI_Skills_Menu_C*                  Skills_Menu;                                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FMargin                                Margin;                                            // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<class UWBP_UI_Skills_Button_C*>        SkillsButtonArray;                                 // 0x0308(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_WBP_UI_Skills_Line(int32 EntryPoint);
	void OnCultureChanged();
	void OnLanguageChanged(const class FString& InLanguage);
	void SkillButtonFocused(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetSkillLineMainAndMasteryButtons();
	void SetResearched(bool IsResearched);
	void CheckResearchMarker();
	void WBP_UI_Skills_Line_AutoGenFunc(EUINavigation Navigation_0);
	void SetSkillLineDescriptionEnabled(bool bInFocused);
	void UpdateSkillLineDescription();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Skills_Line_C">();
	}
	static class UWBP_UI_Skills_Line_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Skills_Line_C>();
	}
};
static_assert(alignof(UWBP_UI_Skills_Line_C) == 0x000008, "Wrong alignment on UWBP_UI_Skills_Line_C");
static_assert(sizeof(UWBP_UI_Skills_Line_C) == 0x000318, "Wrong size on UWBP_UI_Skills_Line_C");
static_assert(offsetof(UWBP_UI_Skills_Line_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Skills_Line_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, BaseSkillButton) == 0x000298, "Member 'UWBP_UI_Skills_Line_C::BaseSkillButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, Image) == 0x0002A0, "Member 'UWBP_UI_Skills_Line_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, Image_134) == 0x0002A8, "Member 'UWBP_UI_Skills_Line_C::Image_134' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, Image_188) == 0x0002B0, "Member 'UWBP_UI_Skills_Line_C::Image_188' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, Image_340) == 0x0002B8, "Member 'UWBP_UI_Skills_Line_C::Image_340' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, MasteryButton) == 0x0002C0, "Member 'UWBP_UI_Skills_Line_C::MasteryButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, SkillLineDescription_SizeBox) == 0x0002C8, "Member 'UWBP_UI_Skills_Line_C::SkillLineDescription_SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, SkillLineDescription_T) == 0x0002D0, "Member 'UWBP_UI_Skills_Line_C::SkillLineDescription_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, SubSkills_horizontal) == 0x0002D8, "Member 'UWBP_UI_Skills_Line_C::SubSkills_horizontal' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, Text_SkillLineName) == 0x0002E0, "Member 'UWBP_UI_Skills_Line_C::Text_SkillLineName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, SkillLineData) == 0x0002E8, "Member 'UWBP_UI_Skills_Line_C::SkillLineData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, Skills_Menu) == 0x0002F0, "Member 'UWBP_UI_Skills_Line_C::Skills_Menu' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, Margin) == 0x0002F8, "Member 'UWBP_UI_Skills_Line_C::Margin' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Line_C, SkillsButtonArray) == 0x000308, "Member 'UWBP_UI_Skills_Line_C::SkillsButtonArray' has a wrong offset!");

}

