#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Crimenet_SecurityCompanyDetails

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Crimenet_SecurityCompanyDetails.WBP_UI_Crimenet_SecurityCompanyDetails_C
// 0x0028 (0x0388 - 0x0360)
class UWBP_UI_Crimenet_SecurityCompanyDetails_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Highlight;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CrimeNet_SecurityCompanyDisplay_C* Widget_SecurityCompany;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESBZSecurityCompany                           ESecurityCompany;                                  // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDetails(int32 EntryPoint);
	void ButtonSelected();
	void PreConstruct(bool IsDesignTime);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnInitialized();
	void OnSecurityCompaniesChanged(const TArray<ESBZSecurityCompany>& SecurityCompanies);
	void OnHover(bool bIsHovered);
	void OnFocus(bool bIsFocused);
	void OnSelected();
	void SetIsActive(bool bIsActive);
	void InitSecurityCompany(ESBZSecurityCompany InSecurityCompany);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Crimenet_SecurityCompanyDetails_C">();
	}
	static class UWBP_UI_Crimenet_SecurityCompanyDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Crimenet_SecurityCompanyDetails_C>();
	}
};
static_assert(alignof(UWBP_UI_Crimenet_SecurityCompanyDetails_C) == 0x000008, "Wrong alignment on UWBP_UI_Crimenet_SecurityCompanyDetails_C");
static_assert(sizeof(UWBP_UI_Crimenet_SecurityCompanyDetails_C) == 0x000388, "Wrong size on UWBP_UI_Crimenet_SecurityCompanyDetails_C");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDetails_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_Crimenet_SecurityCompanyDetails_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDetails_C, Image_Background) == 0x000368, "Member 'UWBP_UI_Crimenet_SecurityCompanyDetails_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDetails_C, Image_Highlight) == 0x000370, "Member 'UWBP_UI_Crimenet_SecurityCompanyDetails_C::Image_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDetails_C, Widget_SecurityCompany) == 0x000378, "Member 'UWBP_UI_Crimenet_SecurityCompanyDetails_C::Widget_SecurityCompany' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDetails_C, ESecurityCompany) == 0x000380, "Member 'UWBP_UI_Crimenet_SecurityCompanyDetails_C::ESecurityCompany' has a wrong offset!");

}

