#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_PopUpWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_PopUpWidget.WBP_UI_PopUpWidget_C
// 0x0050 (0x03A8 - 0x0358)
class UWBP_UI_PopUpWidget_C final : public USBZPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Dash_Loop;                                         // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 CenterBackground_I;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_256;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text_1;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text_2;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text_3;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBodyBox;                                   // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_PopUpWidget(int32 EntryPoint);
	void OnDisplayPopUp();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_PopUpWidget_C">();
	}
	static class UWBP_UI_PopUpWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_PopUpWidget_C>();
	}
};
static_assert(alignof(UWBP_UI_PopUpWidget_C) == 0x000008, "Wrong alignment on UWBP_UI_PopUpWidget_C");
static_assert(sizeof(UWBP_UI_PopUpWidget_C) == 0x0003A8, "Wrong size on UWBP_UI_PopUpWidget_C");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, UberGraphFrame) == 0x000358, "Member 'UWBP_UI_PopUpWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, Dash_Loop) == 0x000360, "Member 'UWBP_UI_PopUpWidget_C::Dash_Loop' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, Show) == 0x000368, "Member 'UWBP_UI_PopUpWidget_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, CenterBackground_I) == 0x000370, "Member 'UWBP_UI_PopUpWidget_C::CenterBackground_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, Image_256) == 0x000378, "Member 'UWBP_UI_PopUpWidget_C::Image_256' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, TinyTop_Text) == 0x000380, "Member 'UWBP_UI_PopUpWidget_C::TinyTop_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, TinyTop_Text_1) == 0x000388, "Member 'UWBP_UI_PopUpWidget_C::TinyTop_Text_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, TinyTop_Text_2) == 0x000390, "Member 'UWBP_UI_PopUpWidget_C::TinyTop_Text_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, TinyTop_Text_3) == 0x000398, "Member 'UWBP_UI_PopUpWidget_C::TinyTop_Text_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PopUpWidget_C, VerticalBodyBox) == 0x0003A0, "Member 'UWBP_UI_PopUpWidget_C::VerticalBodyBox' has a wrong offset!");

}

