#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LocalPlayerInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LocalPlayerInfo.WBP_LocalPlayerInfo_C
// 0x0058 (0x02E8 - 0x0290)
class UWBP_LocalPlayerInfo_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_I;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon_Platform;                               // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_InfamyCircularWidget_C*         InfamyLevel;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NebulaIcon_I;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         NebulaName_HB;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        NebulaName_T;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PlayerIcon_C*                      PlayerIcon;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        PlayerName_T;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RenownLevel_C*                     RenownLevel;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         RenownLevel_HB;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_LocalPlayerInfo(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LocalPlayerInfo_C">();
	}
	static class UWBP_LocalPlayerInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LocalPlayerInfo_C>();
	}
};
static_assert(alignof(UWBP_LocalPlayerInfo_C) == 0x000008, "Wrong alignment on UWBP_LocalPlayerInfo_C");
static_assert(sizeof(UWBP_LocalPlayerInfo_C) == 0x0002E8, "Wrong size on UWBP_LocalPlayerInfo_C");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, UberGraphFrame) == 0x000290, "Member 'UWBP_LocalPlayerInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, Background_I) == 0x000298, "Member 'UWBP_LocalPlayerInfo_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, Image_Icon_Platform) == 0x0002A0, "Member 'UWBP_LocalPlayerInfo_C::Image_Icon_Platform' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, InfamyLevel) == 0x0002A8, "Member 'UWBP_LocalPlayerInfo_C::InfamyLevel' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, NebulaIcon_I) == 0x0002B0, "Member 'UWBP_LocalPlayerInfo_C::NebulaIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, NebulaName_HB) == 0x0002B8, "Member 'UWBP_LocalPlayerInfo_C::NebulaName_HB' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, NebulaName_T) == 0x0002C0, "Member 'UWBP_LocalPlayerInfo_C::NebulaName_T' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, PlayerIcon) == 0x0002C8, "Member 'UWBP_LocalPlayerInfo_C::PlayerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, PlayerName_T) == 0x0002D0, "Member 'UWBP_LocalPlayerInfo_C::PlayerName_T' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, RenownLevel) == 0x0002D8, "Member 'UWBP_LocalPlayerInfo_C::RenownLevel' has a wrong offset!");
static_assert(offsetof(UWBP_LocalPlayerInfo_C, RenownLevel_HB) == 0x0002E0, "Member 'UWBP_LocalPlayerInfo_C::RenownLevel_HB' has a wrong offset!");

}

