#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Social_PlayerCard

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C
// 0x00C8 (0x0488 - 0x03C0)
class UWBP_UI_Social_PlayerCard_C final : public USBZPlayerCard
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnFocused;                                         // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Background;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMenuAnchor*                            ContextMenu_Anchor;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EmptyOverlay;                                      // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        GameStatus_T;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HoverBorder_Image;                                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Blocked;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Host;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Nebula;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Platform;                                     // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        LobbyOwner_T;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        NebulaName_T;                                      // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         NebulaRow_HB;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PlayerOverlay;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_PlayerLevel;                                  // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_PlayerName_Platform;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Unavailable_Border;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RenownLevel_C*                     WBP_RenownLevel;                                   // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoIP_C*                            WBP_VoIP;                                          // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Social_ContextMenu_C*           SpawnedContextMenu;                                // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UWBP_UI_Social_PlayerCard_C* ActiveContext)> ContextMenuOpened; // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UWBP_PlayerCardContainer_C*             ParentPlayerCardContainer;                         // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_Social_PlayerCard(int32 EntryPoint);
	void ButtonFocusChanging(bool bInHasFocus);
	void DisabledButtonSelected();
	void OnInitialized();
	void Destruct();
	void BndEvt__WBP_UI_Social_PlayerCard_MenuAnchor_112_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature(bool bIsOpen);
	void Construct();
	void ButtonDisabledChanged(bool bInIsDisabled);
	void ButtonSelected();
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnPlayerDataSet(const struct FSBZUser& InUserEntry);
	void PlayerCardHover(bool InFocus);
	void PopulatePlayerData(const struct FSBZFriendListEntry& SBZFriendListEntry);
	void DisplayUserStatus(ESBZUserStatus UserStatus, int32 LevelIdx, const struct FSBZUserActivity& UserActivity);
	void SetPlatformName(const class FText& InPlatformName);
	void SetLevel(const class FText& InLevel);
	void SetPlatformIcon(class UPaperSprite* InPlatformIcon);
	void SetStatus(int32 LevelIndex, const struct FSBZUserActivity& UserActivity, bool IsLocalPlayer, bool IsPlatformNameEmpty);
	void SetBlockedIconVisibility(bool bIsBlocked, bool bIsPlatformBlocked);
	void SetHostIconVisibility(bool IsPartyLeader, int32 PartySessionMembers);
	void OnReferenceSelected(class FName ActionName);
	class UUserWidget* OnContextMenuSpawned();
	void RemoveContextMenu(bool RemoveHighlight);
	void IsContextMenuDisplayed(class UWBP_UI_Social_ContextMenu_C** ContextMenu);
	void GetUserId(class FString* UserId);
	bool IsSamePlayer(class UWBP_UI_Social_PlayerCard_C* InPlayerCard);
	void OpenContactsTab();
	void FindPlayerForVOIP(bool* PlayerFound, struct FSBZLobbyCharacterInfoUi* CharacterInfo);
	void SetupVOIPIndicator();
	void PopulatePlayerNames(const class FText& PlatformName, const class FText& NebulaName, class UPaperSprite* PlatformIcon);
	void UpdateLobbyOwnerVisiblity(bool InIsHost);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Social_PlayerCard_C">();
	}
	static class UWBP_UI_Social_PlayerCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Social_PlayerCard_C>();
	}
};
static_assert(alignof(UWBP_UI_Social_PlayerCard_C) == 0x000008, "Wrong alignment on UWBP_UI_Social_PlayerCard_C");
static_assert(sizeof(UWBP_UI_Social_PlayerCard_C) == 0x000488, "Wrong size on UWBP_UI_Social_PlayerCard_C");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, UberGraphFrame) == 0x0003C0, "Member 'UWBP_UI_Social_PlayerCard_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, OnFocused) == 0x0003C8, "Member 'UWBP_UI_Social_PlayerCard_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, Background) == 0x0003D0, "Member 'UWBP_UI_Social_PlayerCard_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, ContextMenu_Anchor) == 0x0003D8, "Member 'UWBP_UI_Social_PlayerCard_C::ContextMenu_Anchor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, EmptyOverlay) == 0x0003E0, "Member 'UWBP_UI_Social_PlayerCard_C::EmptyOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, GameStatus_T) == 0x0003E8, "Member 'UWBP_UI_Social_PlayerCard_C::GameStatus_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, HoverBorder_Image) == 0x0003F0, "Member 'UWBP_UI_Social_PlayerCard_C::HoverBorder_Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, Icon_Blocked) == 0x0003F8, "Member 'UWBP_UI_Social_PlayerCard_C::Icon_Blocked' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, Icon_Host) == 0x000400, "Member 'UWBP_UI_Social_PlayerCard_C::Icon_Host' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, Icon_Nebula) == 0x000408, "Member 'UWBP_UI_Social_PlayerCard_C::Icon_Nebula' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, Icon_Platform) == 0x000410, "Member 'UWBP_UI_Social_PlayerCard_C::Icon_Platform' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, LobbyOwner_T) == 0x000418, "Member 'UWBP_UI_Social_PlayerCard_C::LobbyOwner_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, NebulaName_T) == 0x000420, "Member 'UWBP_UI_Social_PlayerCard_C::NebulaName_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, NebulaRow_HB) == 0x000428, "Member 'UWBP_UI_Social_PlayerCard_C::NebulaRow_HB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, PlayerOverlay) == 0x000430, "Member 'UWBP_UI_Social_PlayerCard_C::PlayerOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, Text_PlayerLevel) == 0x000438, "Member 'UWBP_UI_Social_PlayerCard_C::Text_PlayerLevel' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, Text_PlayerName_Platform) == 0x000440, "Member 'UWBP_UI_Social_PlayerCard_C::Text_PlayerName_Platform' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, Unavailable_Border) == 0x000448, "Member 'UWBP_UI_Social_PlayerCard_C::Unavailable_Border' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, WBP_RenownLevel) == 0x000450, "Member 'UWBP_UI_Social_PlayerCard_C::WBP_RenownLevel' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, WBP_VoIP) == 0x000458, "Member 'UWBP_UI_Social_PlayerCard_C::WBP_VoIP' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, SpawnedContextMenu) == 0x000460, "Member 'UWBP_UI_Social_PlayerCard_C::SpawnedContextMenu' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, ContextMenuOpened) == 0x000468, "Member 'UWBP_UI_Social_PlayerCard_C::ContextMenuOpened' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, ParentPlayerCardContainer) == 0x000478, "Member 'UWBP_UI_Social_PlayerCard_C::ParentPlayerCardContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_PlayerCard_C, NewVar_0) == 0x000480, "Member 'UWBP_UI_Social_PlayerCard_C::NewVar_0' has a wrong offset!");

}

