#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CableBox

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_CableBox.WBP_CableBox_C.SetCodeText
// 0x0018 (0x0018 - 0x0000)
struct WBP_CableBox_C_SetCodeText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CableBox_C_SetCodeText) == 0x000008, "Wrong alignment on WBP_CableBox_C_SetCodeText");
static_assert(sizeof(WBP_CableBox_C_SetCodeText) == 0x000018, "Wrong size on WBP_CableBox_C_SetCodeText");
static_assert(offsetof(WBP_CableBox_C_SetCodeText, InText) == 0x000000, "Member 'WBP_CableBox_C_SetCodeText::InText' has a wrong offset!");

// Function WBP_CableBox.WBP_CableBox_C.SetState
// 0x0018 (0x0018 - 0x0000)
struct WBP_CableBox_C_SetState final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_CableBox_C_SetState) == 0x000008, "Wrong alignment on WBP_CableBox_C_SetState");
static_assert(sizeof(WBP_CableBox_C_SetState) == 0x000018, "Wrong size on WBP_CableBox_C_SetState");
static_assert(offsetof(WBP_CableBox_C_SetState, InText) == 0x000000, "Member 'WBP_CableBox_C_SetState::InText' has a wrong offset!");

}

