#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_UnifiedButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_UnifiedButton.WBP_UI_UnifiedButton_C.ExecuteUbergraph_WBP_UI_UnifiedButton
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsButtonDisabled_ReturnValue;             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x2];                                       // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsDisabled;                        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x007C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton) == 0x000008, "Wrong alignment on WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton");
static_assert(sizeof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton) == 0x0000B0, "Wrong size on WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, EntryPoint) == 0x000000, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, CallFunc_IsButtonDisabled_ReturnValue) == 0x000004, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::CallFunc_IsButtonDisabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, Temp_bool_Variable) == 0x000005, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, CallFunc_Not_PreBool_ReturnValue) == 0x000006, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, Temp_struct_Variable) == 0x000008, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, Temp_struct_Variable_1) == 0x00001C, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, K2Node_Event_bInHasFocus) == 0x000038, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, Temp_bool_Variable_2) == 0x000039, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, K2Node_Select_Default) == 0x00003C, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, Temp_struct_Variable_2) == 0x00004C, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, Temp_bool_Variable_3) == 0x00005C, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, CallFunc_BreakVector2D_X) == 0x000060, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, CallFunc_BreakVector2D_Y) == 0x000064, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, K2Node_Select_Default_1) == 0x000068, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, K2Node_Event_bInIsDisabled) == 0x000078, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::K2Node_Event_bInIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, K2Node_Select_Default_2) == 0x00007C, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, Temp_bool_Variable_4) == 0x00008C, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, K2Node_Select_Default_3) == 0x000090, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton, K2Node_Select_Default_4) == 0x0000A0, "Member 'WBP_UI_UnifiedButton_C_ExecuteUbergraph_WBP_UI_UnifiedButton::K2Node_Select_Default_4' has a wrong offset!");

// Function WBP_UI_UnifiedButton.WBP_UI_UnifiedButton_C.ButtonDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_UnifiedButton_C_ButtonDisabledChanged final
{
public:
	bool                                          bInIsDisabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_UnifiedButton_C_ButtonDisabledChanged) == 0x000001, "Wrong alignment on WBP_UI_UnifiedButton_C_ButtonDisabledChanged");
static_assert(sizeof(WBP_UI_UnifiedButton_C_ButtonDisabledChanged) == 0x000001, "Wrong size on WBP_UI_UnifiedButton_C_ButtonDisabledChanged");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ButtonDisabledChanged, bInIsDisabled) == 0x000000, "Member 'WBP_UI_UnifiedButton_C_ButtonDisabledChanged::bInIsDisabled' has a wrong offset!");

// Function WBP_UI_UnifiedButton.WBP_UI_UnifiedButton_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_UnifiedButton_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_UnifiedButton_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_UI_UnifiedButton_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_UI_UnifiedButton_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_UI_UnifiedButton_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_UI_UnifiedButton_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_UI_UnifiedButton_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_UI_UnifiedButton.WBP_UI_UnifiedButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_UnifiedButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_UnifiedButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_UnifiedButton_C_PreConstruct");
static_assert(sizeof(WBP_UI_UnifiedButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_UnifiedButton_C_PreConstruct");
static_assert(offsetof(WBP_UI_UnifiedButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_UnifiedButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

