#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScreenTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ScreenTitle.WBP_ScreenTitle_C
// 0x0038 (0x02C8 - 0x0290)
class UWBP_ScreenTitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       title_intro;                                       // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 LeftEdge_I;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Title_T;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   TitleText;                                         // 0x02B0(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_ScreenTitle(int32 EntryPoint);
	void UpdateTitle(const class FText& InText);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void OnOwningStackScreenGainedFocus(const class FName OldStackValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ScreenTitle_C">();
	}
	static class UWBP_ScreenTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ScreenTitle_C>();
	}
};
static_assert(alignof(UWBP_ScreenTitle_C) == 0x000008, "Wrong alignment on UWBP_ScreenTitle_C");
static_assert(sizeof(UWBP_ScreenTitle_C) == 0x0002C8, "Wrong size on UWBP_ScreenTitle_C");
static_assert(offsetof(UWBP_ScreenTitle_C, UberGraphFrame) == 0x000290, "Member 'UWBP_ScreenTitle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ScreenTitle_C, title_intro) == 0x000298, "Member 'UWBP_ScreenTitle_C::title_intro' has a wrong offset!");
static_assert(offsetof(UWBP_ScreenTitle_C, LeftEdge_I) == 0x0002A0, "Member 'UWBP_ScreenTitle_C::LeftEdge_I' has a wrong offset!");
static_assert(offsetof(UWBP_ScreenTitle_C, Title_T) == 0x0002A8, "Member 'UWBP_ScreenTitle_C::Title_T' has a wrong offset!");
static_assert(offsetof(UWBP_ScreenTitle_C, TitleText) == 0x0002B0, "Member 'UWBP_ScreenTitle_C::TitleText' has a wrong offset!");

}

