#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_TutorialSelectionButton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.ExecuteUbergraph_WBP_UI_TutorialSelectionButton
// 0x0080 (0x0080 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UPD3HeistDataAsset*               CallFunc_GetHeistData_ReturnValue;                 // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsDisabled;                        // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1; // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton) == 0x000008, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton) == 0x000080, "Wrong size on WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, EntryPoint) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, K2Node_Event_bInHasFocus) == 0x000004, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, Temp_object_Variable) == 0x000008, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, K2Node_DynamicCast_AsPaper_Sprite) == 0x000010, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, CallFunc_GetHeistData_ReturnValue) == 0x000040, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::CallFunc_GetHeistData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, K2Node_Event_bInIsDisabled) == 0x000049, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::K2Node_Event_bInIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x00004A, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000050, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000058, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, K2Node_Event_bInIsHovered) == 0x000068, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, K2Node_Event_IsDesignTime) == 0x000069, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1) == 0x000070, "Member 'WBP_UI_TutorialSelectionButton_C_ExecuteUbergraph_WBP_UI_TutorialSelectionButton::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.ButtonFocusChanging
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_ButtonFocusChanging final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_ButtonFocusChanging) == 0x000001, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_ButtonFocusChanging");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_ButtonFocusChanging) == 0x000001, "Wrong size on WBP_UI_TutorialSelectionButton_C_ButtonFocusChanging");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ButtonFocusChanging, bInHasFocus) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_ButtonFocusChanging::bInHasFocus' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_PreConstruct");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_TutorialSelectionButton_C_PreConstruct");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_UI_TutorialSelectionButton_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.ButtonDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_ButtonDisabledChanged final
{
public:
	bool                                          bInIsDisabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_ButtonDisabledChanged) == 0x000001, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_ButtonDisabledChanged");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_ButtonDisabledChanged) == 0x000001, "Wrong size on WBP_UI_TutorialSelectionButton_C_ButtonDisabledChanged");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ButtonDisabledChanged, bInIsDisabled) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_ButtonDisabledChanged::bInIsDisabled' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.OnLoaded_D46F04B04CE4B5F1991D4C910BE505CA
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_OnLoaded_D46F04B04CE4B5F1991D4C910BE505CA final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_OnLoaded_D46F04B04CE4B5F1991D4C910BE505CA) == 0x000008, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_OnLoaded_D46F04B04CE4B5F1991D4C910BE505CA");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_OnLoaded_D46F04B04CE4B5F1991D4C910BE505CA) == 0x000008, "Wrong size on WBP_UI_TutorialSelectionButton_C_OnLoaded_D46F04B04CE4B5F1991D4C910BE505CA");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnLoaded_D46F04B04CE4B5F1991D4C910BE505CA, Loaded) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_OnLoaded_D46F04B04CE4B5F1991D4C910BE505CA::Loaded' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.OnHoverChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_OnHoverChanged final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_OnHoverChanged) == 0x000001, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_OnHoverChanged");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_OnHoverChanged) == 0x000001, "Wrong size on WBP_UI_TutorialSelectionButton_C_OnHoverChanged");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnHoverChanged, bIsHovered) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_OnHoverChanged::bIsHovered' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.OnFocusedChanged
// 0x0048 (0x0048 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_OnFocusedChanged final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_2;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged) == 0x000008, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_OnFocusedChanged");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged) == 0x000048, "Wrong size on WBP_UI_TutorialSelectionButton_C_OnFocusedChanged");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, bIsFocused) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, Temp_bool_Variable) == 0x000003, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, Temp_object_Variable) == 0x000008, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, Temp_object_Variable_1) == 0x000010, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, K2Node_Select_Default) == 0x000020, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, Temp_byte_Variable_2) == 0x000028, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, Temp_byte_Variable_3) == 0x000029, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, K2Node_Select_Default_1) == 0x00002A, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, Temp_bool_Variable_2) == 0x00002B, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, K2Node_Select_Default_2) == 0x000038, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnFocusedChanged, CallFunc_PlayAnimation_ReturnValue_1) == 0x000040, "Member 'WBP_UI_TutorialSelectionButton_C_OnFocusedChanged::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.InitializeButtonVisuals
// 0x0078 (0x0078 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0048(0x0018)(ConstParm)
	class FText                                   CallFunc_ClampText_ReturnValue;                    // 0x0060(0x0018)()
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals) == 0x000008, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals) == 0x000078, "Wrong size on WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals, CallFunc_BreakSoftObjectPath_PathString) == 0x000008, "Member 'WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals::CallFunc_BreakSoftObjectPath_PathString' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals, CallFunc_GetBaseFilename_ReturnValue) == 0x000018, "Member 'WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals, K2Node_Select_Default) == 0x000048, "Member 'WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals, CallFunc_ClampText_ReturnValue) == 0x000060, "Member 'WBP_UI_TutorialSelectionButton_C_InitializeButtonVisuals::CallFunc_ClampText_ReturnValue' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.OnDisabledChanged
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_OnDisabledChanged final
{
public:
	bool                                          bDisabled;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_OnDisabledChanged) == 0x000008, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_OnDisabledChanged");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_OnDisabledChanged) == 0x000018, "Wrong size on WBP_UI_TutorialSelectionButton_C_OnDisabledChanged");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnDisabledChanged, bDisabled) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_OnDisabledChanged::bDisabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnDisabledChanged, Temp_bool_Variable) == 0x000001, "Member 'WBP_UI_TutorialSelectionButton_C_OnDisabledChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnDisabledChanged, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'WBP_UI_TutorialSelectionButton_C_OnDisabledChanged::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnDisabledChanged, Temp_byte_Variable) == 0x000008, "Member 'WBP_UI_TutorialSelectionButton_C_OnDisabledChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnDisabledChanged, Temp_byte_Variable_1) == 0x000009, "Member 'WBP_UI_TutorialSelectionButton_C_OnDisabledChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnDisabledChanged, K2Node_Select_Default) == 0x00000A, "Member 'WBP_UI_TutorialSelectionButton_C_OnDisabledChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_OnDisabledChanged, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'WBP_UI_TutorialSelectionButton_C_OnDisabledChanged::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WBP_UI_TutorialSelectionButton.WBP_UI_TutorialSelectionButton_C.ShowBlackAndWhite
// 0x0014 (0x0014 - 0x0000)
struct WBP_UI_TutorialSelectionButton_C_ShowBlackAndWhite final
{
public:
	bool                                          InShow;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable_1;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_TutorialSelectionButton_C_ShowBlackAndWhite) == 0x000004, "Wrong alignment on WBP_UI_TutorialSelectionButton_C_ShowBlackAndWhite");
static_assert(sizeof(WBP_UI_TutorialSelectionButton_C_ShowBlackAndWhite) == 0x000014, "Wrong size on WBP_UI_TutorialSelectionButton_C_ShowBlackAndWhite");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ShowBlackAndWhite, InShow) == 0x000000, "Member 'WBP_UI_TutorialSelectionButton_C_ShowBlackAndWhite::InShow' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialSelectionButton_C_ShowBlackAndWhite, Temp_float_Variable) == 0x000004, "Member 'WBP_UI_TutorialSelectionButton_C_ShowBlackAndWhite::Temp_float_Variable' has a wrong offset!");
