#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SocialButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SocialButton.WBP_SocialButton_C
// 0x0038 (0x0398 - 0x0360)
class UWBP_SocialButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_Widget_ActionInput_C*           ActionInput;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_I;                                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_63;                                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outline_I;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          ShouldBlockSocialBasedOnPrivilege;                 // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_SocialButton(int32 EntryPoint);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ToggleSocials();
	void ButtonSelected();
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnInitialized();
	void OnPrivilegeQueried(ESBZUserPrivilegesProxy Privilege, bool bPrivilegeAllowed);
	void OnInstallStateChanged(bool bIsGameInstallPending);
	void UpdateAccessBasedOnPrivilege(bool CanPlayOnline, bool InstallPending);
	void SetFocusedVisuals();
	void SetDefaultVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SocialButton_C">();
	}
	static class UWBP_SocialButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SocialButton_C>();
	}
};
static_assert(alignof(UWBP_SocialButton_C) == 0x000008, "Wrong alignment on UWBP_SocialButton_C");
static_assert(sizeof(UWBP_SocialButton_C) == 0x000398, "Wrong size on UWBP_SocialButton_C");
static_assert(offsetof(UWBP_SocialButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_SocialButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SocialButton_C, ActionInput) == 0x000368, "Member 'UWBP_SocialButton_C::ActionInput' has a wrong offset!");
static_assert(offsetof(UWBP_SocialButton_C, Background_I) == 0x000370, "Member 'UWBP_SocialButton_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_SocialButton_C, Icon_I) == 0x000378, "Member 'UWBP_SocialButton_C::Icon_I' has a wrong offset!");
static_assert(offsetof(UWBP_SocialButton_C, Image_63) == 0x000380, "Member 'UWBP_SocialButton_C::Image_63' has a wrong offset!");
static_assert(offsetof(UWBP_SocialButton_C, Outline_I) == 0x000388, "Member 'UWBP_SocialButton_C::Outline_I' has a wrong offset!");
static_assert(offsetof(UWBP_SocialButton_C, ShouldBlockSocialBasedOnPrivilege) == 0x000390, "Member 'UWBP_SocialButton_C::ShouldBlockSocialBasedOnPrivilege' has a wrong offset!");

}

