#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Results_Payout

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_Results_Payout.WBP_Results_Payout_C.SetPayoutData
// 0x0440 (0x0440 - 0x0000)
struct WBP_Results_Payout_C_SetPayoutData final
{
public:
	struct FSBZEndMissionResultData               ResultData;                                        // 0x0000(0x0280)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         PlayerId;                                          // 0x0280(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerEndMissionResultData         CallFunc_GetPlayerData_ReturnValue;                // 0x0288(0x01B0)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Results_Payout_C_SetPayoutData) == 0x000008, "Wrong alignment on WBP_Results_Payout_C_SetPayoutData");
static_assert(sizeof(WBP_Results_Payout_C_SetPayoutData) == 0x000440, "Wrong size on WBP_Results_Payout_C_SetPayoutData");
static_assert(offsetof(WBP_Results_Payout_C_SetPayoutData, ResultData) == 0x000000, "Member 'WBP_Results_Payout_C_SetPayoutData::ResultData' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_SetPayoutData, PlayerId) == 0x000280, "Member 'WBP_Results_Payout_C_SetPayoutData::PlayerId' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_SetPayoutData, CallFunc_GetPlayerData_ReturnValue) == 0x000288, "Member 'WBP_Results_Payout_C_SetPayoutData::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_SetPayoutData, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000438, "Member 'WBP_Results_Payout_C_SetPayoutData::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Results_Payout.WBP_Results_Payout_C.OnShowBags
// 0x0238 (0x0238 - 0x0000)
struct WBP_Results_Payout_C_OnShowBags final
{
public:
	int32                                         BagValue;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_CollectedBagIcon_C*      CallFunc_Create_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerEndMissionResultData         CallFunc_GetPlayerData_ReturnValue;                // 0x0068(0x01B0)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZCashRewardBagData                  CallFunc_Array_Get_Item;                           // 0x021C(0x000C)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Results_Payout_C_OnShowBags) == 0x000008, "Wrong alignment on WBP_Results_Payout_C_OnShowBags");
static_assert(sizeof(WBP_Results_Payout_C_OnShowBags) == 0x000238, "Wrong size on WBP_Results_Payout_C_OnShowBags");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, BagValue) == 0x000000, "Member 'WBP_Results_Payout_C_OnShowBags::BagValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, Temp_int_Variable) == 0x000004, "Member 'WBP_Results_Payout_C_OnShowBags::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Results_Payout_C_OnShowBags::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Add_IntInt_ReturnValue_1) == 0x000010, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_Results_Payout_C_OnShowBags::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Play2DSound_ReturnValue) == 0x000018, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_PlayAnimationForward_ReturnValue) == 0x000020, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Create_ReturnValue) == 0x000030, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Array_Add_ReturnValue) == 0x000038, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000058, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_MakeLiteralByte_ReturnValue) == 0x000060, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_GetPlayerData_ReturnValue) == 0x000068, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Array_Length_ReturnValue) == 0x000218, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Array_Get_Item) == 0x00021C, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Less_IntInt_ReturnValue) == 0x000228, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000229, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Add_IntInt_ReturnValue_2) == 0x00022C, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBags, CallFunc_Add_IntInt_ReturnValue_3) == 0x000230, "Member 'WBP_Results_Payout_C_OnShowBags::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");

// Function WBP_Results_Payout.WBP_Results_Payout_C.OnShowTickingLoot
// 0x0250 (0x0250 - 0x0000)
struct WBP_Results_Payout_C_OnShowTickingLoot final
{
public:
	int32                                         BagValue;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZPlayerEndMissionResultData         CallFunc_GetPlayerData_ReturnValue;                // 0x0030(0x01B0)(ConstParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x01E8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0228(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0238(0x0018)()
};
static_assert(alignof(WBP_Results_Payout_C_OnShowTickingLoot) == 0x000008, "Wrong alignment on WBP_Results_Payout_C_OnShowTickingLoot");
static_assert(sizeof(WBP_Results_Payout_C_OnShowTickingLoot) == 0x000250, "Wrong size on WBP_Results_Payout_C_OnShowTickingLoot");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, BagValue) == 0x000000, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::BagValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, CallFunc_Play2DSound_ReturnValue) == 0x000004, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, CallFunc_GetPlayerData_ReturnValue) == 0x000030, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001E0, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, K2Node_MakeStruct_FormatArgumentData) == 0x0001E8, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, K2Node_MakeArray_Array) == 0x000228, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowTickingLoot, CallFunc_Format_ReturnValue) == 0x000238, "Member 'WBP_Results_Payout_C_OnShowTickingLoot::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_Results_Payout.WBP_Results_Payout_C.OnShowLooseCash
// 0x01E0 (0x01E0 - 0x0000)
struct WBP_Results_Payout_C_OnShowLooseCash final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FSBZPlayerEndMissionResultData         CallFunc_GetPlayerData_ReturnValue;                // 0x0028(0x01B0)(ConstParm)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Results_Payout_C_OnShowLooseCash) == 0x000008, "Wrong alignment on WBP_Results_Payout_C_OnShowLooseCash");
static_assert(sizeof(WBP_Results_Payout_C_OnShowLooseCash) == 0x0001E0, "Wrong size on WBP_Results_Payout_C_OnShowLooseCash");
static_assert(offsetof(WBP_Results_Payout_C_OnShowLooseCash, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_Results_Payout_C_OnShowLooseCash::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowLooseCash, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_Results_Payout_C_OnShowLooseCash::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowLooseCash, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_Results_Payout_C_OnShowLooseCash::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowLooseCash, CallFunc_GetPlayerData_ReturnValue) == 0x000028, "Member 'WBP_Results_Payout_C_OnShowLooseCash::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowLooseCash, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001D8, "Member 'WBP_Results_Payout_C_OnShowLooseCash::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");

// Function WBP_Results_Payout.WBP_Results_Payout_C.OnShowCivilian
// 0x0238 (0x0238 - 0x0000)
struct WBP_Results_Payout_C_OnShowCivilian final
{
public:
	int32                                         TotalCashReduction;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerEndMissionResultData         CallFunc_GetPlayerData_ReturnValue;                // 0x0050(0x01B0)(ConstParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0200(0x0018)()
	struct FSBZCashRewardReductionData            CallFunc_Array_Get_Item;                           // 0x0218(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Results_Payout_C_OnShowCivilian) == 0x000008, "Wrong alignment on WBP_Results_Payout_C_OnShowCivilian");
static_assert(sizeof(WBP_Results_Payout_C_OnShowCivilian) == 0x000238, "Wrong size on WBP_Results_Payout_C_OnShowCivilian");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, TotalCashReduction) == 0x000000, "Member 'WBP_Results_Payout_C_OnShowCivilian::TotalCashReduction' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Results_Payout_C_OnShowCivilian::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Results_Payout_C_OnShowCivilian::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_Play2DSound_ReturnValue) == 0x000010, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_Results_Payout_C_OnShowCivilian::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000040, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_GetPlayerData_ReturnValue) == 0x000050, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_Conv_IntToText_ReturnValue) == 0x000200, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_Array_Get_Item) == 0x000218, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_Array_Length_ReturnValue) == 0x000228, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00022C, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_Less_IntInt_ReturnValue) == 0x00022D, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCivilian, CallFunc_Add_IntInt_ReturnValue_1) == 0x000230, "Member 'WBP_Results_Payout_C_OnShowCivilian::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_Results_Payout.WBP_Results_Payout_C.OnShowCustody
// 0x0238 (0x0238 - 0x0000)
struct WBP_Results_Payout_C_OnShowCustody final
{
public:
	int32                                         TotalCashReduction;                                // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerEndMissionResultData         CallFunc_GetPlayerData_ReturnValue;                // 0x0050(0x01B0)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZCashRewardReductionData            CallFunc_Array_Get_Item;                           // 0x0204(0x0010)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_216[0x2];                                      // 0x0216(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0220(0x0018)()
};
static_assert(alignof(WBP_Results_Payout_C_OnShowCustody) == 0x000008, "Wrong alignment on WBP_Results_Payout_C_OnShowCustody");
static_assert(sizeof(WBP_Results_Payout_C_OnShowCustody) == 0x000238, "Wrong size on WBP_Results_Payout_C_OnShowCustody");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, TotalCashReduction) == 0x000000, "Member 'WBP_Results_Payout_C_OnShowCustody::TotalCashReduction' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_Results_Payout_C_OnShowCustody::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_Results_Payout_C_OnShowCustody::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_Play2DSound_ReturnValue) == 0x000010, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_PlayAnimationForward_ReturnValue) == 0x000018, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_Results_Payout_C_OnShowCustody::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000040, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_GetPlayerData_ReturnValue) == 0x000050, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_Array_Length_ReturnValue) == 0x000200, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_Array_Get_Item) == 0x000204, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_Less_IntInt_ReturnValue) == 0x000214, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000215, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_Add_IntInt_ReturnValue_1) == 0x000218, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowCustody, CallFunc_Conv_IntToText_ReturnValue) == 0x000220, "Member 'WBP_Results_Payout_C_OnShowCustody::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_Results_Payout.WBP_Results_Payout_C.OnShowPayout
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_Results_Payout_C_OnShowPayout final
{
public:
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FSBZPlayerEndMissionResultData         CallFunc_GetPlayerData_ReturnValue;                // 0x0030(0x01B0)(ConstParm)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Results_Payout_C_OnShowPayout) == 0x000008, "Wrong alignment on WBP_Results_Payout_C_OnShowPayout");
static_assert(sizeof(WBP_Results_Payout_C_OnShowPayout) == 0x0001F0, "Wrong size on WBP_Results_Payout_C_OnShowPayout");
static_assert(offsetof(WBP_Results_Payout_C_OnShowPayout, CallFunc_Play2DSound_ReturnValue) == 0x000000, "Member 'WBP_Results_Payout_C_OnShowPayout::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowPayout, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_Results_Payout_C_OnShowPayout::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowPayout, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_Results_Payout_C_OnShowPayout::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowPayout, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WBP_Results_Payout_C_OnShowPayout::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowPayout, CallFunc_GetPlayerData_ReturnValue) == 0x000030, "Member 'WBP_Results_Payout_C_OnShowPayout::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowPayout, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001E0, "Member 'WBP_Results_Payout_C_OnShowPayout::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowPayout, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001E8, "Member 'WBP_Results_Payout_C_OnShowPayout::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");

// Function WBP_Results_Payout.WBP_Results_Payout_C.OnShowBalance
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_Results_Payout_C_OnShowBalance final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZCurrencyManager*                    CallFunc_GetCurrencyManager_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZPlayerEndMissionResultData         CallFunc_GetPlayerData_ReturnValue;                // 0x0010(0x01B0)(ConstParm)
	int64                                         CallFunc_GetCurrentAmount_ReturnValue;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Add_Int64Int64_ReturnValue;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Results_Payout_C_OnShowBalance) == 0x000008, "Wrong alignment on WBP_Results_Payout_C_OnShowBalance");
static_assert(sizeof(WBP_Results_Payout_C_OnShowBalance) == 0x0001D8, "Wrong size on WBP_Results_Payout_C_OnShowBalance");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBalance, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_Results_Payout_C_OnShowBalance::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBalance, CallFunc_GetCurrencyManager_ReturnValue) == 0x000008, "Member 'WBP_Results_Payout_C_OnShowBalance::CallFunc_GetCurrencyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBalance, CallFunc_GetPlayerData_ReturnValue) == 0x000010, "Member 'WBP_Results_Payout_C_OnShowBalance::CallFunc_GetPlayerData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBalance, CallFunc_GetCurrentAmount_ReturnValue) == 0x0001C0, "Member 'WBP_Results_Payout_C_OnShowBalance::CallFunc_GetCurrentAmount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBalance, CallFunc_Conv_IntToInt64_ReturnValue) == 0x0001C8, "Member 'WBP_Results_Payout_C_OnShowBalance::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnShowBalance, CallFunc_Add_Int64Int64_ReturnValue) == 0x0001D0, "Member 'WBP_Results_Payout_C_OnShowBalance::CallFunc_Add_Int64Int64_ReturnValue' has a wrong offset!");

// Function WBP_Results_Payout.WBP_Results_Payout_C.OnAddBag
// 0x0080 (0x0080 - 0x0000)
struct WBP_Results_Payout_C_OnAddBag final
{
public:
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Play2DSound_ReturnValue_1;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0048(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UWBP_UI_Widget_CollectedBagIcon_C*      CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWrapBoxSlot*                           CallFunc_AddChildToWrapBox_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Results_Payout_C_OnAddBag) == 0x000008, "Wrong alignment on WBP_Results_Payout_C_OnAddBag");
static_assert(sizeof(WBP_Results_Payout_C_OnAddBag) == 0x000080, "Wrong size on WBP_Results_Payout_C_OnAddBag");
static_assert(offsetof(WBP_Results_Payout_C_OnAddBag, CallFunc_Play2DSound_ReturnValue) == 0x000000, "Member 'WBP_Results_Payout_C_OnAddBag::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnAddBag, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Results_Payout_C_OnAddBag::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_Payout_C_OnAddBag, CallFunc_Play2DSound_ReturnValue_1) == 0x000008, "Member 'WBP_Results_Payout_C_OnAddBag::CallFunc_Play2DSound_ReturnValue_1' has a wrong offset!");
