#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActorSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "UDS_ModActorStruct_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ActorSpawner.WBP_ActorSpawner_C
// 0x00B8 (0x0348 - 0x0290)
class UWBP_ActorSpawner_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_2;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_3;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_4;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_5;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_1;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_2;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_3;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_4;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                              CheckBox_5;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UModLoaderManager_C*                    ModLoaderManagerRef;                               // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FUDS_ModActorStruct>            ImmediateSpawnModActorStructs;                     // 0x0310(0x0010)(Edit, BlueprintVisible)
	TArray<struct FUDS_ModActorStruct>            HeistStartModActorStructs;                         // 0x0320(0x0010)(Edit, BlueprintVisible)
	bool                                          bFirstSpawnOfMenu;                                 // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Version;                                           // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, AdvancedDisplay, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ActorSpawner(int32 EntryPoint);
	void OnJobOverviewComplete(EBlackScreenTransitionType BlackScreenTransitionType);
	void Destruct();
	void Construct();
	void SpawnImmediateActors();
	void SpawnHeistStartActors();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ActorSpawner_C">();
	}
	static class UWBP_ActorSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ActorSpawner_C>();
	}
};
static_assert(alignof(UWBP_ActorSpawner_C) == 0x000008, "Wrong alignment on UWBP_ActorSpawner_C");
static_assert(sizeof(UWBP_ActorSpawner_C) == 0x000348, "Wrong size on UWBP_ActorSpawner_C");
static_assert(offsetof(UWBP_ActorSpawner_C, UberGraphFrame) == 0x000290, "Member 'UWBP_ActorSpawner_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, Button) == 0x000298, "Member 'UWBP_ActorSpawner_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, Button_1) == 0x0002A0, "Member 'UWBP_ActorSpawner_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, Button_2) == 0x0002A8, "Member 'UWBP_ActorSpawner_C::Button_2' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, Button_3) == 0x0002B0, "Member 'UWBP_ActorSpawner_C::Button_3' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, Button_4) == 0x0002B8, "Member 'UWBP_ActorSpawner_C::Button_4' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, Button_5) == 0x0002C0, "Member 'UWBP_ActorSpawner_C::Button_5' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, CanvasPanel) == 0x0002C8, "Member 'UWBP_ActorSpawner_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, CheckBox) == 0x0002D0, "Member 'UWBP_ActorSpawner_C::CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, CheckBox_1) == 0x0002D8, "Member 'UWBP_ActorSpawner_C::CheckBox_1' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, CheckBox_2) == 0x0002E0, "Member 'UWBP_ActorSpawner_C::CheckBox_2' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, CheckBox_3) == 0x0002E8, "Member 'UWBP_ActorSpawner_C::CheckBox_3' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, CheckBox_4) == 0x0002F0, "Member 'UWBP_ActorSpawner_C::CheckBox_4' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, CheckBox_5) == 0x0002F8, "Member 'UWBP_ActorSpawner_C::CheckBox_5' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, Image_0) == 0x000300, "Member 'UWBP_ActorSpawner_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, ModLoaderManagerRef) == 0x000308, "Member 'UWBP_ActorSpawner_C::ModLoaderManagerRef' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, ImmediateSpawnModActorStructs) == 0x000310, "Member 'UWBP_ActorSpawner_C::ImmediateSpawnModActorStructs' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, HeistStartModActorStructs) == 0x000320, "Member 'UWBP_ActorSpawner_C::HeistStartModActorStructs' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, bFirstSpawnOfMenu) == 0x000330, "Member 'UWBP_ActorSpawner_C::bFirstSpawnOfMenu' has a wrong offset!");
static_assert(offsetof(UWBP_ActorSpawner_C, Version) == 0x000338, "Member 'UWBP_ActorSpawner_C::Version' has a wrong offset!");

}

