#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowserButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerBrowserButton.WBP_ServerBrowserButton_C
// 0x0018 (0x0378 - 0x0360)
class UWBP_ServerBrowserButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             Content;                                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkAudioEvent*                          Selected;                                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ServerBrowserButton(int32 EntryPoint);
	void ButtonSelected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerBrowserButton_C">();
	}
	static class UWBP_ServerBrowserButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerBrowserButton_C>();
	}
};
static_assert(alignof(UWBP_ServerBrowserButton_C) == 0x000008, "Wrong alignment on UWBP_ServerBrowserButton_C");
static_assert(sizeof(UWBP_ServerBrowserButton_C) == 0x000378, "Wrong size on UWBP_ServerBrowserButton_C");
static_assert(offsetof(UWBP_ServerBrowserButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_ServerBrowserButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowserButton_C, Content) == 0x000368, "Member 'UWBP_ServerBrowserButton_C::Content' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowserButton_C, Selected) == 0x000370, "Member 'UWBP_ServerBrowserButton_C::Selected' has a wrong offset!");

}

