#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Results_PlayerList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Results_PlayerList.WBP_Results_PlayerList_C.ExecuteUbergraph_WBP_Results_PlayerList
// 0x0150 (0x0150 - 0x0000)
struct WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Results_PlayerStatus_C*         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASBZPlayerState*>                K2Node_Event_PlayerStateArray;                     // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TArray<class ASBZAICrewState*>                K2Node_Event_AICrewStateArray;                     // 0x0028(0x0010)(ConstParm, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAICrewState*                        CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, class FString>                    K2Node_Event_PlayerIdToAccelByteDisplayNameMap;    // 0x0050(0x0050)(ConstParm)
	class UWBP_UI_Results_AICrewStatus_C*         CallFunc_Create_ReturnValue_1;                     // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerState*                        K2Node_Event_InPlayerState;                        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInMergeParty;                        // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Event_PlayerDisplayName;                    // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsMergePartySelected;                // 0x00C8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00D6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00D7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerState*                        CallFunc_Array_Get_Item_1;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_2;                         // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Results_PlayerStatus_C*         K2Node_DynamicCast_AsWBP_UI_Results_Player_Status; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Map_Find_Value;                           // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList) == 0x000008, "Wrong alignment on WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList");
static_assert(sizeof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList) == 0x000150, "Wrong size on WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, EntryPoint) == 0x000000, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, Temp_bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000011, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Not_PreBool_ReturnValue_1) == 0x000013, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, K2Node_Event_PlayerStateArray) == 0x000018, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::K2Node_Event_PlayerStateArray' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, K2Node_Event_AICrewStateArray) == 0x000028, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::K2Node_Event_AICrewStateArray' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, Temp_int_Array_Index_Variable_1) == 0x00004C, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, K2Node_Event_PlayerIdToAccelByteDisplayNameMap) == 0x000050, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::K2Node_Event_PlayerIdToAccelByteDisplayNameMap' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Create_ReturnValue_1) == 0x0000A0, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, K2Node_Event_InPlayerState) == 0x0000A8, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::K2Node_Event_InPlayerState' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, K2Node_Event_bInMergeParty) == 0x0000B0, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::K2Node_Event_bInMergeParty' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, K2Node_Event_PlayerDisplayName) == 0x0000B8, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::K2Node_Event_PlayerDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, K2Node_Event_bIsMergePartySelected) == 0x0000C8, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::K2Node_Event_bIsMergePartySelected' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, Temp_int_Loop_Counter_Variable) == 0x0000CC, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, Temp_int_Loop_Counter_Variable_1) == 0x0000D0, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Less_IntInt_ReturnValue) == 0x0000D4, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_BooleanAND_ReturnValue) == 0x0000D5, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000D6, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_BooleanAND_ReturnValue_1) == 0x0000D7, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000DC, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, Temp_int_Loop_Counter_Variable_2) == 0x0000E0, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, Temp_int_Array_Index_Variable_2) == 0x0000E4, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Array_Get_Item_1) == 0x0000E8, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000F4, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_GetChildrenCount_ReturnValue) == 0x0000F8, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_GetAllChildren_ReturnValue) == 0x000100, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Less_IntInt_ReturnValue_2) == 0x000110, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Array_Get_Item_2) == 0x000118, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, K2Node_DynamicCast_AsWBP_UI_Results_Player_Status) == 0x000120, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::K2Node_DynamicCast_AsWBP_UI_Results_Player_Status' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, K2Node_DynamicCast_bSuccess) == 0x000128, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Array_Length_ReturnValue_2) == 0x00012C, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Map_Find_Value) == 0x000130, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Map_Find_ReturnValue) == 0x000140, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Less_IntInt_ReturnValue_3) == 0x000141, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Array_Add_ReturnValue) == 0x000144, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList, CallFunc_Array_Add_ReturnValue_1) == 0x000148, "Member 'WBP_Results_PlayerList_C_ExecuteUbergraph_WBP_Results_PlayerList::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function WBP_Results_PlayerList.WBP_Results_PlayerList_C.OnMergePartyUpdated
// 0x0018 (0x0018 - 0x0000)
struct WBP_Results_PlayerList_C_OnMergePartyUpdated final
{
public:
	class FString                                 PlayerDisplayName;                                 // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          bIsMergePartySelected;                             // 0x0010(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Results_PlayerList_C_OnMergePartyUpdated) == 0x000008, "Wrong alignment on WBP_Results_PlayerList_C_OnMergePartyUpdated");
static_assert(sizeof(WBP_Results_PlayerList_C_OnMergePartyUpdated) == 0x000018, "Wrong size on WBP_Results_PlayerList_C_OnMergePartyUpdated");
static_assert(offsetof(WBP_Results_PlayerList_C_OnMergePartyUpdated, PlayerDisplayName) == 0x000000, "Member 'WBP_Results_PlayerList_C_OnMergePartyUpdated::PlayerDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_OnMergePartyUpdated, bIsMergePartySelected) == 0x000010, "Member 'WBP_Results_PlayerList_C_OnMergePartyUpdated::bIsMergePartySelected' has a wrong offset!");

// Function WBP_Results_PlayerList.WBP_Results_PlayerList_C.OnPlayerMergePartyChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_Results_PlayerList_C_OnPlayerMergePartyChanged final
{
public:
	class ASBZPlayerState*                        InPlayerState;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInMergeParty;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Results_PlayerList_C_OnPlayerMergePartyChanged) == 0x000008, "Wrong alignment on WBP_Results_PlayerList_C_OnPlayerMergePartyChanged");
static_assert(sizeof(WBP_Results_PlayerList_C_OnPlayerMergePartyChanged) == 0x000010, "Wrong size on WBP_Results_PlayerList_C_OnPlayerMergePartyChanged");
static_assert(offsetof(WBP_Results_PlayerList_C_OnPlayerMergePartyChanged, InPlayerState) == 0x000000, "Member 'WBP_Results_PlayerList_C_OnPlayerMergePartyChanged::InPlayerState' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_OnPlayerMergePartyChanged, bInMergeParty) == 0x000008, "Member 'WBP_Results_PlayerList_C_OnPlayerMergePartyChanged::bInMergeParty' has a wrong offset!");

// Function WBP_Results_PlayerList.WBP_Results_PlayerList_C.OnSanitizeDisplayNamesComplete
// 0x0050 (0x0050 - 0x0000)
struct WBP_Results_PlayerList_C_OnSanitizeDisplayNamesComplete final
{
public:
	TMap<int32, class FString>                    PlayerIdToAccelByteDisplayNameMap;                 // 0x0000(0x0050)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Results_PlayerList_C_OnSanitizeDisplayNamesComplete) == 0x000008, "Wrong alignment on WBP_Results_PlayerList_C_OnSanitizeDisplayNamesComplete");
static_assert(sizeof(WBP_Results_PlayerList_C_OnSanitizeDisplayNamesComplete) == 0x000050, "Wrong size on WBP_Results_PlayerList_C_OnSanitizeDisplayNamesComplete");
static_assert(offsetof(WBP_Results_PlayerList_C_OnSanitizeDisplayNamesComplete, PlayerIdToAccelByteDisplayNameMap) == 0x000000, "Member 'WBP_Results_PlayerList_C_OnSanitizeDisplayNamesComplete::PlayerIdToAccelByteDisplayNameMap' has a wrong offset!");

// Function WBP_Results_PlayerList.WBP_Results_PlayerList_C.OnSetup
// 0x0020 (0x0020 - 0x0000)
struct WBP_Results_PlayerList_C_OnSetup final
{
public:
	TArray<class ASBZPlayerState*>                PlayerStateArray;                                  // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class ASBZAICrewState*>                AICrewStateArray;                                  // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_Results_PlayerList_C_OnSetup) == 0x000008, "Wrong alignment on WBP_Results_PlayerList_C_OnSetup");
static_assert(sizeof(WBP_Results_PlayerList_C_OnSetup) == 0x000020, "Wrong size on WBP_Results_PlayerList_C_OnSetup");
static_assert(offsetof(WBP_Results_PlayerList_C_OnSetup, PlayerStateArray) == 0x000000, "Member 'WBP_Results_PlayerList_C_OnSetup::PlayerStateArray' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_OnSetup, AICrewStateArray) == 0x000010, "Member 'WBP_Results_PlayerList_C_OnSetup::AICrewStateArray' has a wrong offset!");

// Function WBP_Results_PlayerList.WBP_Results_PlayerList_C.HighlightTopStat
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_Results_PlayerList_C_HighlightTopStat final
{
public:
	bool                                          IsInverted;                                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 CurStatWinners;                                    // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         MinValue;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxValue;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Get_Item;                           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Results_PlayerStatus_C*         CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Results_PlayerStatus_C*         CallFunc_Array_Get_Item_2;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetStatByIndex_Value;                     // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Min_ReturnValue;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Results_PlayerList_C_HighlightTopStat) == 0x000008, "Wrong alignment on WBP_Results_PlayerList_C_HighlightTopStat");
static_assert(sizeof(WBP_Results_PlayerList_C_HighlightTopStat) == 0x0000B0, "Wrong size on WBP_Results_PlayerList_C_HighlightTopStat");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, IsInverted) == 0x000000, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::IsInverted' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CurStatWinners) == 0x000008, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CurStatWinners' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, MinValue) == 0x000018, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::MinValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, MaxValue) == 0x00001C, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::MaxValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, Temp_int_Variable) == 0x000020, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, Temp_bool_Variable) == 0x000024, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Less_IntInt_ReturnValue) == 0x000025, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, Temp_int_Array_Index_Variable) == 0x000028, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, Temp_int_Loop_Counter_Variable) == 0x00002C, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, Temp_int_Array_Index_Variable_1) == 0x000034, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000038, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, K2Node_Select_Default) == 0x00003C, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Add_IntInt_ReturnValue_1) == 0x000044, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000060, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, Temp_int_Loop_Counter_Variable_1) == 0x000068, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Add_IntInt_ReturnValue_2) == 0x00006C, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Array_Add_ReturnValue) == 0x000070, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Array_Get_Item) == 0x000074, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Less_IntInt_ReturnValue_1) == 0x00007C, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, Temp_bool_Variable_1) == 0x000088, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Array_Length_ReturnValue_1) == 0x00008C, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Array_Get_Item_2) == 0x000090, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Less_IntInt_ReturnValue_2) == 0x000098, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_GetStatByIndex_Value) == 0x00009C, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_GetStatByIndex_Value' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, K2Node_Select_Default_1) == 0x0000A4, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000A9, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_HighlightTopStat, CallFunc_Min_ReturnValue) == 0x0000AC, "Member 'WBP_Results_PlayerList_C_HighlightTopStat::CallFunc_Min_ReturnValue' has a wrong offset!");

// Function WBP_Results_PlayerList.WBP_Results_PlayerList_C.AddInPlayerCards
// 0x0068 (0x0068 - 0x0000)
struct WBP_Results_PlayerList_C_AddInPlayerCards final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Results_PlayerStatus_C*         CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Results_PlayerList_C_AddInPlayerCards) == 0x000008, "Wrong alignment on WBP_Results_PlayerList_C_AddInPlayerCards");
static_assert(sizeof(WBP_Results_PlayerList_C_AddInPlayerCards) == 0x000068, "Wrong size on WBP_Results_PlayerList_C_AddInPlayerCards");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_Play2DSound_ReturnValue) == 0x000004, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, Temp_int_Variable) == 0x000020, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, K2Node_MakeStruct_Margin) == 0x000030, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000050, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_AddChild_ReturnValue) == 0x000058, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInPlayerCards, CallFunc_IsValid_ReturnValue_1) == 0x000061, "Member 'WBP_Results_PlayerList_C_AddInPlayerCards::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_Results_PlayerList.WBP_Results_PlayerList_C.AddInBotCards
// 0x0068 (0x0068 - 0x0000)
struct WBP_Results_PlayerList_C_AddInBotCards final
{
public:
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Results_AICrewStatus_C*         CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Results_PlayerList_C_AddInBotCards) == 0x000008, "Wrong alignment on WBP_Results_PlayerList_C_AddInBotCards");
static_assert(sizeof(WBP_Results_PlayerList_C_AddInBotCards) == 0x000068, "Wrong size on WBP_Results_PlayerList_C_AddInBotCards");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInBotCards, CallFunc_Play2DSound_ReturnValue) == 0x000000, "Member 'WBP_Results_PlayerList_C_AddInBotCards::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Results_PlayerList_C_AddInBotCards, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Results_PlayerList_C_AddInBotCards::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
