#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PlayerDefeatState

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_PlayerDefeatState.WBP_UI_Widget_PlayerDefeatState_C.ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState
// 0x0060 (0x0060 - 0x0000)
struct WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_13;                             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               Temp_byte_Variable_14;                             // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_15;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_16;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_17;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_18;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_19;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_20;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_21;                             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_22;                             // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_23;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_24;                             // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               Temp_byte_Variable_25;                             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               Temp_byte_Variable_26;                             // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               K2Node_Event_OldState;                             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               K2Node_Event_NewState;                             // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       K2Node_Select_Default_3;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_5;                           // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState) == 0x000008, "Wrong alignment on WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState");
static_assert(sizeof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState) == 0x000060, "Wrong size on WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_6) == 0x00000A, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_7) == 0x00000B, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_8) == 0x00000C, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_9) == 0x00000D, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_10) == 0x00000E, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_11) == 0x00000F, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_bool_Variable) == 0x000010, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_12) == 0x000011, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_13) == 0x000012, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_14) == 0x000013, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_15) == 0x000014, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_16) == 0x000015, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_17) == 0x000016, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_17' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_18) == 0x000017, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_18' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_19) == 0x000018, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_19' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_20) == 0x000019, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_20' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_21) == 0x00001A, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_21' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_22) == 0x00001B, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_22' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_23) == 0x00001C, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_23' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_24) == 0x00001D, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_24' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_object_Variable) == 0x000020, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_25) == 0x000028, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_25' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, K2Node_Event_IsDesignTime) == 0x000029, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, K2Node_Select_Default) == 0x00002A, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, Temp_byte_Variable_26) == 0x00002B, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::Temp_byte_Variable_26' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, K2Node_Event_OldState) == 0x00002C, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::K2Node_Event_OldState' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, K2Node_Event_NewState) == 0x00002D, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, K2Node_Select_Default_1) == 0x000030, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, K2Node_Select_Default_2) == 0x000038, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, K2Node_Select_Default_3) == 0x000040, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, K2Node_Select_Default_4) == 0x000048, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState, K2Node_Select_Default_5) == 0x000058, "Member 'WBP_UI_Widget_PlayerDefeatState_C_ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState::K2Node_Select_Default_5' has a wrong offset!");

// Function WBP_UI_Widget_PlayerDefeatState.WBP_UI_Widget_PlayerDefeatState_C.OnDefeatStateChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_Widget_PlayerDefeatState_C_OnDefeatStateChanged final
{
public:
	EPD3DefeatState                               OldState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               NewState;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PlayerDefeatState_C_OnDefeatStateChanged) == 0x000001, "Wrong alignment on WBP_UI_Widget_PlayerDefeatState_C_OnDefeatStateChanged");
static_assert(sizeof(WBP_UI_Widget_PlayerDefeatState_C_OnDefeatStateChanged) == 0x000002, "Wrong size on WBP_UI_Widget_PlayerDefeatState_C_OnDefeatStateChanged");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_OnDefeatStateChanged, OldState) == 0x000000, "Member 'WBP_UI_Widget_PlayerDefeatState_C_OnDefeatStateChanged::OldState' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_OnDefeatStateChanged, NewState) == 0x000001, "Member 'WBP_UI_Widget_PlayerDefeatState_C_OnDefeatStateChanged::NewState' has a wrong offset!");

// Function WBP_UI_Widget_PlayerDefeatState.WBP_UI_Widget_PlayerDefeatState_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_PlayerDefeatState_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_PlayerDefeatState_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_PlayerDefeatState_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_PlayerDefeatState_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_PlayerDefeatState_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_PlayerDefeatState_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_PlayerDefeatState_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

