#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_YesNoToggleButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_YesNoToggleButton.WBP_UI_YesNoToggleButton_C.ExecuteUbergraph_WBP_UI_YesNoToggleButton
// 0x0050 (0x0050 - 0x0000)
struct WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton) == 0x000008, "Wrong alignment on WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton");
static_assert(sizeof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton) == 0x000050, "Wrong size on WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton, EntryPoint) == 0x000000, "Member 'WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton, Temp_bool_Variable) == 0x000004, "Member 'WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton, Temp_struct_Variable) == 0x000008, "Member 'WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton, K2Node_Event_bInHasFocus) == 0x000038, "Member 'WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton, K2Node_Select_Default) == 0x00003C, "Member 'WBP_UI_YesNoToggleButton_C_ExecuteUbergraph_WBP_UI_YesNoToggleButton::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_YesNoToggleButton.WBP_UI_YesNoToggleButton_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_YesNoToggleButton_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_YesNoToggleButton_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_UI_YesNoToggleButton_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_UI_YesNoToggleButton_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_UI_YesNoToggleButton_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_UI_YesNoToggleButton_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_UI_YesNoToggleButton.WBP_UI_YesNoToggleButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_YesNoToggleButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_YesNoToggleButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_YesNoToggleButton_C_PreConstruct");
static_assert(sizeof(WBP_UI_YesNoToggleButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_YesNoToggleButton_C_PreConstruct");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_YesNoToggleButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_YesNoToggleButton.WBP_UI_YesNoToggleButton_C.SetState
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_UI_YesNoToggleButton_C_SetState final
{
public:
	bool                                          NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_4;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         Temp_object_Variable_5;                            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0070(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable_6;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable_7;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          K2Node_Select_Default;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          K2Node_Select_Default_1;                           // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         K2Node_Select_Default_2;                           // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         K2Node_Select_Default_3;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x00D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_YesNoToggleButton_C_SetState) == 0x000008, "Wrong alignment on WBP_UI_YesNoToggleButton_C_SetState");
static_assert(sizeof(WBP_UI_YesNoToggleButton_C_SetState) == 0x0000E8, "Wrong size on WBP_UI_YesNoToggleButton_C_SetState");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, NewState) == 0x000000, "Member 'WBP_UI_YesNoToggleButton_C_SetState::NewState' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_bool_Variable) == 0x000001, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_object_Variable) == 0x000008, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_object_Variable_1) == 0x000010, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_object_Variable_2) == 0x000020, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_object_Variable_3) == 0x000028, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_bool_Variable_2) == 0x000030, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_object_Variable_4) == 0x000038, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_object_Variable_5) == 0x000040, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_object_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_bool_Variable_3) == 0x000048, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_struct_Variable) == 0x00004C, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_struct_Variable_1) == 0x00005C, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_bool_Variable_4) == 0x00006C, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_struct_Variable_2) == 0x000070, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_struct_Variable_3) == 0x000080, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_object_Variable_6) == 0x000090, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_object_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_object_Variable_7) == 0x000098, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_object_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, Temp_bool_Variable_5) == 0x0000A0, "Member 'WBP_UI_YesNoToggleButton_C_SetState::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, K2Node_Select_Default) == 0x0000A8, "Member 'WBP_UI_YesNoToggleButton_C_SetState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, K2Node_Select_Default_1) == 0x0000B0, "Member 'WBP_UI_YesNoToggleButton_C_SetState::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, K2Node_Select_Default_2) == 0x0000B8, "Member 'WBP_UI_YesNoToggleButton_C_SetState::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, K2Node_Select_Default_3) == 0x0000C0, "Member 'WBP_UI_YesNoToggleButton_C_SetState::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, K2Node_Select_Default_4) == 0x0000C8, "Member 'WBP_UI_YesNoToggleButton_C_SetState::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_YesNoToggleButton_C_SetState, K2Node_Select_Default_5) == 0x0000D8, "Member 'WBP_UI_YesNoToggleButton_C_SetState::K2Node_Select_Default_5' has a wrong offset!");

}

