#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_DebugWidgetScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_DebugWidgetScreen.WBP_UI_Widget_DebugWidgetScreen_C
// 0x0068 (0x0308 - 0x02A0)
class UWBP_UI_Widget_DebugWidgetScreen_C final : public USBZDebugWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Circ_0;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Circ_90;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Circ_180;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Circ_270;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_FullscreenDebug;                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Watermark;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_MatchmakingGroup;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Time;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Watermark;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_DEBUG_RoomStatus_C*             WBP_UI_DEBUG_RoomStatus;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_WidgetDebugPing_C*              WBP_UI_WidgetDebugPing;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MissionSeed;                                       // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_DebugWidgetScreen(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void OnMissionSeedSet(int32 MissionSeed_0);
	void OnInitialized();
	void OnFullscreenMode();
	void OnCinematicMode();
	void OnWatermarkMode();
	void InitializeHudData();
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_DebugWidgetScreen_C">();
	}
	static class UWBP_UI_Widget_DebugWidgetScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_DebugWidgetScreen_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_DebugWidgetScreen_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_DebugWidgetScreen_C");
static_assert(sizeof(UWBP_UI_Widget_DebugWidgetScreen_C) == 0x000308, "Wrong size on UWBP_UI_Widget_DebugWidgetScreen_C");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, Image_Circ_0) == 0x0002A8, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::Image_Circ_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, Image_Circ_90) == 0x0002B0, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::Image_Circ_90' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, Image_Circ_180) == 0x0002B8, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::Image_Circ_180' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, Image_Circ_270) == 0x0002C0, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::Image_Circ_270' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, Overlay_FullscreenDebug) == 0x0002C8, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::Overlay_FullscreenDebug' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, Overlay_Watermark) == 0x0002D0, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::Overlay_Watermark' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, Text_MatchmakingGroup) == 0x0002D8, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::Text_MatchmakingGroup' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, Text_Time) == 0x0002E0, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::Text_Time' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, Text_Watermark) == 0x0002E8, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::Text_Watermark' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, WBP_UI_DEBUG_RoomStatus) == 0x0002F0, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::WBP_UI_DEBUG_RoomStatus' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, WBP_UI_WidgetDebugPing) == 0x0002F8, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::WBP_UI_WidgetDebugPing' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DebugWidgetScreen_C, MissionSeed) == 0x000300, "Member 'UWBP_UI_Widget_DebugWidgetScreen_C::MissionSeed' has a wrong offset!");

}

