#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_AttributeBar

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_AttributeBar.WBP_UI_Widget_AttributeBar_C.ExecuteUbergraph_WBP_UI_Widget_AttributeBar
// 0x0038 (0x0038 - 0x0000)
struct WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_CurrentValueSetup;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_MaxValueSetup;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_PercentageSetup;                      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewValue_1;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_OldPercentage_1;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewPercentage_1;                      // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewValue;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_OldPercentage;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewPercentage;                        // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetMaterialInstance_MatInst;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar) == 0x000008, "Wrong alignment on WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar");
static_assert(sizeof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar) == 0x000038, "Wrong size on WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_CurrentValueSetup) == 0x000004, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_CurrentValueSetup' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_MaxValueSetup) == 0x000008, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_MaxValueSetup' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_PercentageSetup) == 0x00000C, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_PercentageSetup' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_NewValue_1) == 0x000010, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_OldPercentage_1) == 0x000014, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_OldPercentage_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_NewPercentage_1) == 0x000018, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_NewPercentage_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_NewValue) == 0x00001C, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_OldPercentage) == 0x000020, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_OldPercentage' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_NewPercentage) == 0x000024, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_NewPercentage' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, CallFunc_GetMaterialInstance_MatInst) == 0x000028, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::CallFunc_GetMaterialInstance_MatInst' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar, K2Node_Event_IsDesignTime) == 0x000030, "Member 'WBP_UI_Widget_AttributeBar_C_ExecuteUbergraph_WBP_UI_Widget_AttributeBar::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_AttributeBar.WBP_UI_Widget_AttributeBar_C.OnMaxAttributeUpdate
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldPercentage;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewPercentage;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate) == 0x000004, "Wrong alignment on WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate");
static_assert(sizeof(WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate) == 0x00000C, "Wrong size on WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate, NewValue) == 0x000000, "Member 'WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate, OldPercentage) == 0x000004, "Member 'WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate::OldPercentage' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate, NewPercentage) == 0x000008, "Member 'WBP_UI_Widget_AttributeBar_C_OnMaxAttributeUpdate::NewPercentage' has a wrong offset!");

// Function WBP_UI_Widget_AttributeBar.WBP_UI_Widget_AttributeBar_C.OnCurrentAttributeUpdate
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldPercentage;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewPercentage;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate) == 0x000004, "Wrong alignment on WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate");
static_assert(sizeof(WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate) == 0x00000C, "Wrong size on WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate, NewValue) == 0x000000, "Member 'WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate, OldPercentage) == 0x000004, "Member 'WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate::OldPercentage' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate, NewPercentage) == 0x000008, "Member 'WBP_UI_Widget_AttributeBar_C_OnCurrentAttributeUpdate::NewPercentage' has a wrong offset!");

// Function WBP_UI_Widget_AttributeBar.WBP_UI_Widget_AttributeBar_C.OnSetup
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Widget_AttributeBar_C_OnSetup final
{
public:
	float                                         CurrentValueSetup;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxValueSetup;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PercentageSetup;                                   // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_AttributeBar_C_OnSetup) == 0x000004, "Wrong alignment on WBP_UI_Widget_AttributeBar_C_OnSetup");
static_assert(sizeof(WBP_UI_Widget_AttributeBar_C_OnSetup) == 0x00000C, "Wrong size on WBP_UI_Widget_AttributeBar_C_OnSetup");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_OnSetup, CurrentValueSetup) == 0x000000, "Member 'WBP_UI_Widget_AttributeBar_C_OnSetup::CurrentValueSetup' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_OnSetup, MaxValueSetup) == 0x000004, "Member 'WBP_UI_Widget_AttributeBar_C_OnSetup::MaxValueSetup' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_OnSetup, PercentageSetup) == 0x000008, "Member 'WBP_UI_Widget_AttributeBar_C_OnSetup::PercentageSetup' has a wrong offset!");

// Function WBP_UI_Widget_AttributeBar.WBP_UI_Widget_AttributeBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_AttributeBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_AttributeBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_AttributeBar_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_AttributeBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_AttributeBar_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_AttributeBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_AttributeBar.WBP_UI_Widget_AttributeBar_C.SetShaderProgress
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_AttributeBar_C_SetShaderProgress final
{
public:
	float                                         Progress_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetMaterialInstance_MatInst;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_AttributeBar_C_SetShaderProgress) == 0x000008, "Wrong alignment on WBP_UI_Widget_AttributeBar_C_SetShaderProgress");
static_assert(sizeof(WBP_UI_Widget_AttributeBar_C_SetShaderProgress) == 0x000010, "Wrong size on WBP_UI_Widget_AttributeBar_C_SetShaderProgress");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_SetShaderProgress, Progress_0) == 0x000000, "Member 'WBP_UI_Widget_AttributeBar_C_SetShaderProgress::Progress_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_SetShaderProgress, CallFunc_GetMaterialInstance_MatInst) == 0x000008, "Member 'WBP_UI_Widget_AttributeBar_C_SetShaderProgress::CallFunc_GetMaterialInstance_MatInst' has a wrong offset!");

// Function WBP_UI_Widget_AttributeBar.WBP_UI_Widget_AttributeBar_C.SetShaderParams
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_Widget_AttributeBar_C_SetShaderParams final
{
public:
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_AttributeBar_C_SetShaderParams) == 0x000004, "Wrong alignment on WBP_UI_Widget_AttributeBar_C_SetShaderParams");
static_assert(sizeof(WBP_UI_Widget_AttributeBar_C_SetShaderParams) == 0x000004, "Wrong size on WBP_UI_Widget_AttributeBar_C_SetShaderParams");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_SetShaderParams, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_AttributeBar_C_SetShaderParams::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_AttributeBar.WBP_UI_Widget_AttributeBar_C.GetMaterialInstance
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Widget_AttributeBar_C_GetMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               MatInst_0;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_AttributeBar_C_GetMaterialInstance) == 0x000008, "Wrong alignment on WBP_UI_Widget_AttributeBar_C_GetMaterialInstance");
static_assert(sizeof(WBP_UI_Widget_AttributeBar_C_GetMaterialInstance) == 0x000018, "Wrong size on WBP_UI_Widget_AttributeBar_C_GetMaterialInstance");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_GetMaterialInstance, MatInst_0) == 0x000000, "Member 'WBP_UI_Widget_AttributeBar_C_GetMaterialInstance::MatInst_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_GetMaterialInstance, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_AttributeBar_C_GetMaterialInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_GetMaterialInstance, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'WBP_UI_Widget_AttributeBar_C_GetMaterialInstance::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_AttributeBar.WBP_UI_Widget_AttributeBar_C.UpdateVisibility
// 0x0005 (0x0005 - 0x0000)
struct WBP_UI_Widget_AttributeBar_C_UpdateVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_AttributeBar_C_UpdateVisibility) == 0x000001, "Wrong alignment on WBP_UI_Widget_AttributeBar_C_UpdateVisibility");
static_assert(sizeof(WBP_UI_Widget_AttributeBar_C_UpdateVisibility) == 0x000005, "Wrong size on WBP_UI_Widget_AttributeBar_C_UpdateVisibility");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_UpdateVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_Widget_AttributeBar_C_UpdateVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_UpdateVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_Widget_AttributeBar_C_UpdateVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_UpdateVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UI_Widget_AttributeBar_C_UpdateVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_UpdateVisibility, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000003, "Member 'WBP_UI_Widget_AttributeBar_C_UpdateVisibility::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_AttributeBar_C_UpdateVisibility, K2Node_Select_Default) == 0x000004, "Member 'WBP_UI_Widget_AttributeBar_C_UpdateVisibility::K2Node_Select_Default' has a wrong offset!");

}

