#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Skills_Description

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Skills_Description.WBP_UI_Skills_Description_C
// 0x0060 (0x02F0 - 0x0290)
class UWBP_UI_Skills_Description_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URichTextBlock*                         DescriptionText;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_961;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1099;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ProgressText;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SkillName;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SkillState;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_Icon;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Skills_Button_C*                FocusedButton;                                     // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Aced;                                              // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x3];                                      // 0x02E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ScrollSpeed;                                       // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Skills_Description(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetFocusedButton(class UWBP_UI_Skills_Button_C* Skill);
	void SetSkillInfoOld(class USBZSkillData* Skill_data);
	void SetSkillInfo(class UWBP_UI_Skills_Button_C* SkillButton);
	void SetSkillDescription(class UWBP_UI_Skills_Button_C* SkillButton);
	void SetSkillImage(class UWBP_UI_Skills_Button_C* SkillButton);
	void SetState(class UWBP_UI_Skills_Button_C* SkillsButton);
	void SetSkillProgress(class UWBP_UI_Skills_Button_C* SkillButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Skills_Description_C">();
	}
	static class UWBP_UI_Skills_Description_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Skills_Description_C>();
	}
};
static_assert(alignof(UWBP_UI_Skills_Description_C) == 0x000008, "Wrong alignment on UWBP_UI_Skills_Description_C");
static_assert(sizeof(UWBP_UI_Skills_Description_C) == 0x0002F0, "Wrong size on UWBP_UI_Skills_Description_C");
static_assert(offsetof(UWBP_UI_Skills_Description_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Skills_Description_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, DescriptionText) == 0x000298, "Member 'UWBP_UI_Skills_Description_C::DescriptionText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, Image_961) == 0x0002A0, "Member 'UWBP_UI_Skills_Description_C::Image_961' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, Image_1099) == 0x0002A8, "Member 'UWBP_UI_Skills_Description_C::Image_1099' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, ProgressBar) == 0x0002B0, "Member 'UWBP_UI_Skills_Description_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, ProgressText) == 0x0002B8, "Member 'UWBP_UI_Skills_Description_C::ProgressText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, ScrollBox) == 0x0002C0, "Member 'UWBP_UI_Skills_Description_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, SkillName) == 0x0002C8, "Member 'UWBP_UI_Skills_Description_C::SkillName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, SkillState) == 0x0002D0, "Member 'UWBP_UI_Skills_Description_C::SkillState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, Widget_Icon) == 0x0002D8, "Member 'UWBP_UI_Skills_Description_C::Widget_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, FocusedButton) == 0x0002E0, "Member 'UWBP_UI_Skills_Description_C::FocusedButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, Aced) == 0x0002E8, "Member 'UWBP_UI_Skills_Description_C::Aced' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Description_C, ScrollSpeed) == 0x0002EC, "Member 'UWBP_UI_Skills_Description_C::ScrollSpeed' has a wrong offset!");

}

