#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ActorSpawner

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UDS_ModActorStruct_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_ActorSpawner.WBP_ActorSpawner_C.ExecuteUbergraph_WBP_ActorSpawner
// 0x0078 (0x0078 - 0x0000)
struct WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EBlackScreenTransitionType BlackScreenTransitionType)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_ActorSpawner_C*                    CallFunc_SpawnModMenu_Return;                      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	EBlackScreenTransitionType                    K2Node_CustomEvent_BlackScreenTransitionType;      // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0064(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner) == 0x000008, "Wrong alignment on WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner");
static_assert(sizeof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner) == 0x000078, "Wrong size on WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner");
static_assert(offsetof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner, EntryPoint) == 0x000000, "Member 'WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner, CallFunc_GetGameStateMachine_ReturnValue) == 0x000008, "Member 'WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner, CallFunc_SpawnModMenu_Return) == 0x000028, "Member 'WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner::CallFunc_SpawnModMenu_Return' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner, K2Node_CustomEvent_BlackScreenTransitionType) == 0x000044, "Member 'WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner::K2Node_CustomEvent_BlackScreenTransitionType' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner, CallFunc_GetGameStateMachine_ReturnValue_1) == 0x000048, "Member 'WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner::CallFunc_GetGameStateMachine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner, K2Node_CreateDelegate_OutputDelegate_3) == 0x000064, "Member 'WBP_ActorSpawner_C_ExecuteUbergraph_WBP_ActorSpawner::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");

// Function WBP_ActorSpawner.WBP_ActorSpawner_C.OnJobOverviewComplete
// 0x0001 (0x0001 - 0x0000)
struct WBP_ActorSpawner_C_OnJobOverviewComplete final
{
public:
	EBlackScreenTransitionType                    BlackScreenTransitionType;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActorSpawner_C_OnJobOverviewComplete) == 0x000001, "Wrong alignment on WBP_ActorSpawner_C_OnJobOverviewComplete");
static_assert(sizeof(WBP_ActorSpawner_C_OnJobOverviewComplete) == 0x000001, "Wrong size on WBP_ActorSpawner_C_OnJobOverviewComplete");
static_assert(offsetof(WBP_ActorSpawner_C_OnJobOverviewComplete, BlackScreenTransitionType) == 0x000000, "Member 'WBP_ActorSpawner_C_OnJobOverviewComplete::BlackScreenTransitionType' has a wrong offset!");

// Function WBP_ActorSpawner.WBP_ActorSpawner_C.SpawnImmediateActors
// 0x0090 (0x0090 - 0x0000)
struct WBP_ActorSpawner_C_SpawnImmediateActors final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClearNullObjectReferencesFromArray_bRemoved; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	struct FUDS_ModActorStruct                    CallFunc_Array_Get_Item;                           // 0x0040(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AModActorBase_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_FilterArray_FilteredArray;                // 0x0068(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActorSpawner_C_SpawnImmediateActors) == 0x000010, "Wrong alignment on WBP_ActorSpawner_C_SpawnImmediateActors");
static_assert(sizeof(WBP_ActorSpawner_C_SpawnImmediateActors) == 0x000090, "Wrong size on WBP_ActorSpawner_C_SpawnImmediateActors");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_ClearNullObjectReferencesFromArray_bRemoved) == 0x000004, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_ClearNullObjectReferencesFromArray_bRemoved' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_Less_IntInt_ReturnValue) == 0x000054, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_BooleanOR_ReturnValue) == 0x000055, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000058, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_FinishSpawningActor_ReturnValue) == 0x000060, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_FilterArray_FilteredArray) == 0x000068, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_FilterArray_FilteredArray' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_Array_Length_ReturnValue_1) == 0x00007C, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_Greater_IntInt_ReturnValue) == 0x000080, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnImmediateActors, CallFunc_Array_AddUnique_ReturnValue) == 0x000084, "Member 'WBP_ActorSpawner_C_SpawnImmediateActors::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

// Function WBP_ActorSpawner.WBP_ActorSpawner_C.SpawnHeistStartActors
// 0x0080 (0x0080 - 0x0000)
struct WBP_ActorSpawner_C_SpawnHeistStartActors final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ClearNullObjectReferencesFromArray_bRemoved; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FUDS_ModActorStruct                    CallFunc_Array_Get_Item;                           // 0x0048(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EnsureActorSingletonPreSpawnExternal_bExists; // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AModActorBase_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ActorSpawner_C_SpawnHeistStartActors) == 0x000010, "Wrong alignment on WBP_ActorSpawner_C_SpawnHeistStartActors");
static_assert(sizeof(WBP_ActorSpawner_C_SpawnHeistStartActors) == 0x000080, "Wrong size on WBP_ActorSpawner_C_SpawnHeistStartActors");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_ClearNullObjectReferencesFromArray_bRemoved) == 0x000040, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_ClearNullObjectReferencesFromArray_bRemoved' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_Array_Length_ReturnValue) == 0x000044, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000060, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_EnsureActorSingletonPreSpawnExternal_bExists) == 0x000068, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_EnsureActorSingletonPreSpawnExternal_bExists' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ActorSpawner_C_SpawnHeistStartActors, CallFunc_Array_AddUnique_ReturnValue) == 0x000078, "Member 'WBP_ActorSpawner_C_SpawnHeistStartActors::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");

}

