#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_RemoteCameraWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_RemoteCameraWidget.WBP_UI_RemoteCameraWidget_C
// 0x0028 (0x02C0 - 0x0298)
class UWBP_UI_RemoteCameraWidget_C final : public USBZViewTargetWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_I;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outline_I;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RoutePing_I;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SecureLoop_I;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_RemoteCameraWidget(int32 EntryPoint);
	void SecurityCameraRuntimeStateChanged(uint8 NewState);
	void SecurityCameraStateChanged(ESBZCameraState CurrentState);
	void OnNewTarget();
	void OnFocusedChanged(bool bIsFocused);
	void SetFocusedWidget(bool bIsFocused);
	void SetCameraDestroyed(bool bIsCameraDestroyed);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_RemoteCameraWidget_C">();
	}
	static class UWBP_UI_RemoteCameraWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_RemoteCameraWidget_C>();
	}
};
static_assert(alignof(UWBP_UI_RemoteCameraWidget_C) == 0x000008, "Wrong alignment on UWBP_UI_RemoteCameraWidget_C");
static_assert(sizeof(UWBP_UI_RemoteCameraWidget_C) == 0x0002C0, "Wrong size on UWBP_UI_RemoteCameraWidget_C");
static_assert(offsetof(UWBP_UI_RemoteCameraWidget_C, UberGraphFrame) == 0x000298, "Member 'UWBP_UI_RemoteCameraWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RemoteCameraWidget_C, Background_I) == 0x0002A0, "Member 'UWBP_UI_RemoteCameraWidget_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RemoteCameraWidget_C, Outline_I) == 0x0002A8, "Member 'UWBP_UI_RemoteCameraWidget_C::Outline_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RemoteCameraWidget_C, RoutePing_I) == 0x0002B0, "Member 'UWBP_UI_RemoteCameraWidget_C::RoutePing_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_RemoteCameraWidget_C, SecureLoop_I) == 0x0002B8, "Member 'UWBP_UI_RemoteCameraWidget_C::SecureLoop_I' has a wrong offset!");

}

