#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_LoadoutWeaponCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_LoadoutWeaponCustomization.WBP_MainMenu_LoadoutWeaponCustomization_C
// 0x0098 (0x03D0 - 0x0338)
class UWBP_MainMenu_LoadoutWeaponCustomization_C final : public USBZGameStartMainMenuWeaponCustomizationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_Menu_ActionInputButton_C*       Button_Back;                                       // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CosmeticBox;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   DebugConfigButton;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxParts;                                    // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxWeapon;                                   // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_WeaponName;                              // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Local_Navbar_C*                    WBP_Local_Navbar;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WeaponCustomization_WeaponCosmetics_C* WBP_WeaponCustomization_WeaponCosmetics;       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           WeaponCustomizationPanel;                          // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ActionButton_C*                 Widget_ProgressionButton;                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_WeaponSlotDisplayPanel_C*       Widget_WeaponSlotDisplayPanel;                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASBZStandaloneWeaponDisplay*            ModularWeaponDisplay;                              // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        MenuScreens;                                       // 0x03A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	ESBZWeaponCustomizationSubScreen              LastSelectedScreen;                                // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B1[0x7];                                      // 0x03B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USBZModularPartSlotBase*>        BaseCosmeticSlotList;                              // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         StickerStartingIndex;                              // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization(int32 EntryPoint);
	void OpenNewModMenu();
	void OnBackPressed();
	void BndEvt__WBP_MainMenu_LoadoutWeaponCustomization_WBP_Local_Navbar_K2Node_ComponentBoundEvent_5_OnIndexChanged__DelegateSignature(int32 NewIndex);
	void BndEvt__WBP_MainMenu_LoadoutWeaponCustomization_WBP_UI_ActionButton_K2Node_ComponentBoundEvent_4_ButtonSelected__DelegateSignature();
	void OnInspectPressed();
	void BndEvt__WBP_MainMenu_LoadoutWeaponCustomization_DebugConfigButton_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void OnPressetCosmeticSlotButton(class USBZMenuButton* Button);
	void PreConstruct(bool IsDesignTime);
	void SetBoxVisible(ESBZWeaponCustomizationSubScreen Screen);
	void SetupWeaponMods();
	void SetWeaponPart(class USBZMenuButton* Button);
	void OnPressedWeaponSlotButton(class USBZMenuButton* Button);
	void Construct();
	void BndEvt__WBP_MainMenu_LoadoutWeaponCustomization_Button_Back_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void OnLostStackFocused();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void InitializeData();
	void CreatePartButton(class UPanelWidget* ParentWidget, const class USBZModularPartSlot* WeaponSlot, const class USBZModularPartDataAsset* Equippable_Part, const TDelegate<void(class USBZMenuButton* Button)>& OnClick, class USBZWeaponCustomiaztionPartButton_C** Button);
	void GetModularConfiguration(TMap<class USBZWeaponPartSlot*, struct FSBZModularPartSlotConfiguration>* Modular_Configuration);
	void InitializeWeaponSlotItems(const TDelegate<void(class USBZMenuButton* Button)>& OnSelectedEvent);
	void InitializeWeaponPartItems(class USBZWeaponCustomiaztionSlotButton_C* BoxReference, const TDelegate<void(class USBZMenuButton* Button)>& OnSelectedEvent);
	void RefreshEquippedStatus(const class USBZWeaponPartDataAsset* NewlyEquippedPart);
	void CreateSlotButton(class UPanelWidget* ParentWidget, const class USBZModularPartSlotBase* WeaponSlot, const class USBZEquippablePartDataAsset* Equippable_Part, const TDelegate<void(class USBZMenuButton* Button)>& OnClick, class USBZWeaponCustomiaztionSlotButton_C** Button);
	void GetEquippedPartInSlot(const class USBZModularPartSlotBase*& Key, class USBZModularPartDataAsset** Part);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_LoadoutWeaponCustomization_C">();
	}
	static class UWBP_MainMenu_LoadoutWeaponCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_LoadoutWeaponCustomization_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_LoadoutWeaponCustomization_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_LoadoutWeaponCustomization_C");
static_assert(sizeof(UWBP_MainMenu_LoadoutWeaponCustomization_C) == 0x0003D0, "Wrong size on UWBP_MainMenu_LoadoutWeaponCustomization_C");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, UberGraphFrame) == 0x000338, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, Button_Back) == 0x000340, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, CosmeticBox) == 0x000348, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::CosmeticBox' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, DebugConfigButton) == 0x000350, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::DebugConfigButton' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, ScrollBoxParts) == 0x000358, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::ScrollBoxParts' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, ScrollBoxWeapon) == 0x000360, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::ScrollBoxWeapon' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, TextBlock_WeaponName) == 0x000368, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::TextBlock_WeaponName' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, WBP_Local_Navbar) == 0x000370, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::WBP_Local_Navbar' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, WBP_WeaponCustomization_WeaponCosmetics) == 0x000378, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::WBP_WeaponCustomization_WeaponCosmetics' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, WeaponCustomizationPanel) == 0x000380, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::WeaponCustomizationPanel' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, Widget_ProgressionButton) == 0x000388, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::Widget_ProgressionButton' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, Widget_WeaponSlotDisplayPanel) == 0x000390, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::Widget_WeaponSlotDisplayPanel' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, ModularWeaponDisplay) == 0x000398, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::ModularWeaponDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, MenuScreens) == 0x0003A0, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::MenuScreens' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, LastSelectedScreen) == 0x0003B0, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::LastSelectedScreen' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, BaseCosmeticSlotList) == 0x0003B8, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::BaseCosmeticSlotList' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_LoadoutWeaponCustomization_C, StickerStartingIndex) == 0x0003C8, "Member 'UWBP_MainMenu_LoadoutWeaponCustomization_C::StickerStartingIndex' has a wrong offset!");

}

