#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_UnifiedButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_UnifiedButton.WBP_UI_UnifiedButton_C
// 0x0090 (0x03F0 - 0x0360)
class UWBP_UI_UnifiedButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_I;                                      // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Frame;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Button_Text;                                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ButtonSize_SB;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftBar_I;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0390(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           BackgroundHover;                                   // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundNormal;                                  // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BorderHover;                                       // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BorderNormal;                                      // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ButtonSize;                                        // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_UnifiedButton(int32 EntryPoint);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void ButtonFocusedChanged(bool bInHasFocus);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_UnifiedButton_C">();
	}
	static class UWBP_UI_UnifiedButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_UnifiedButton_C>();
	}
};
static_assert(alignof(UWBP_UI_UnifiedButton_C) == 0x000008, "Wrong alignment on UWBP_UI_UnifiedButton_C");
static_assert(sizeof(UWBP_UI_UnifiedButton_C) == 0x0003F0, "Wrong size on UWBP_UI_UnifiedButton_C");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_UnifiedButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, Background_I) == 0x000368, "Member 'UWBP_UI_UnifiedButton_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, Border_Frame) == 0x000370, "Member 'UWBP_UI_UnifiedButton_C::Border_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, Button_Text) == 0x000378, "Member 'UWBP_UI_UnifiedButton_C::Button_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, ButtonSize_SB) == 0x000380, "Member 'UWBP_UI_UnifiedButton_C::ButtonSize_SB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, LeftBar_I) == 0x000388, "Member 'UWBP_UI_UnifiedButton_C::LeftBar_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, ButtonText) == 0x000390, "Member 'UWBP_UI_UnifiedButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, BackgroundHover) == 0x0003A8, "Member 'UWBP_UI_UnifiedButton_C::BackgroundHover' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, BackgroundNormal) == 0x0003B8, "Member 'UWBP_UI_UnifiedButton_C::BackgroundNormal' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, BorderHover) == 0x0003C8, "Member 'UWBP_UI_UnifiedButton_C::BorderHover' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, BorderNormal) == 0x0003D8, "Member 'UWBP_UI_UnifiedButton_C::BorderNormal' has a wrong offset!");
static_assert(offsetof(UWBP_UI_UnifiedButton_C, ButtonSize) == 0x0003E8, "Member 'UWBP_UI_UnifiedButton_C::ButtonSize' has a wrong offset!");

}

