#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuStart

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_MenuStart.WBP_MenuStart_C.ExecuteUbergraph_WBP_MenuStart
// 0x0058 (0x0058 - 0x0000)
struct WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Selection;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Menu1;                          // 0x0010(0x0018)()
	class FText                                   K2Node_CustomEvent_Menu2;                          // 0x0028(0x0018)()
	class FText                                   K2Node_CustomEvent_Menu3;                          // 0x0040(0x0018)()
};
static_assert(alignof(WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart) == 0x000008, "Wrong alignment on WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart");
static_assert(sizeof(WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart) == 0x000058, "Wrong size on WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart");
static_assert(offsetof(WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart, EntryPoint) == 0x000000, "Member 'WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart, K2Node_CustomEvent_Selection) == 0x000004, "Member 'WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart::K2Node_CustomEvent_Selection' has a wrong offset!");
static_assert(offsetof(WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart, K2Node_CustomEvent_NewParam) == 0x000008, "Member 'WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart, K2Node_SwitchInteger_CmpSuccess) == 0x000009, "Member 'WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart, K2Node_CustomEvent_Menu1) == 0x000010, "Member 'WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart::K2Node_CustomEvent_Menu1' has a wrong offset!");
static_assert(offsetof(WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart, K2Node_CustomEvent_Menu2) == 0x000028, "Member 'WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart::K2Node_CustomEvent_Menu2' has a wrong offset!");
static_assert(offsetof(WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart, K2Node_CustomEvent_Menu3) == 0x000040, "Member 'WBP_MenuStart_C_ExecuteUbergraph_WBP_MenuStart::K2Node_CustomEvent_Menu3' has a wrong offset!");

// Function WBP_MenuStart.WBP_MenuStart_C.SetMenuText
// 0x0048 (0x0048 - 0x0000)
struct WBP_MenuStart_C_SetMenuText final
{
public:
	class FText                                   Menu1;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Menu2;                                             // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Menu3;                                             // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_MenuStart_C_SetMenuText) == 0x000008, "Wrong alignment on WBP_MenuStart_C_SetMenuText");
static_assert(sizeof(WBP_MenuStart_C_SetMenuText) == 0x000048, "Wrong size on WBP_MenuStart_C_SetMenuText");
static_assert(offsetof(WBP_MenuStart_C_SetMenuText, Menu1) == 0x000000, "Member 'WBP_MenuStart_C_SetMenuText::Menu1' has a wrong offset!");
static_assert(offsetof(WBP_MenuStart_C_SetMenuText, Menu2) == 0x000018, "Member 'WBP_MenuStart_C_SetMenuText::Menu2' has a wrong offset!");
static_assert(offsetof(WBP_MenuStart_C_SetMenuText, Menu3) == 0x000030, "Member 'WBP_MenuStart_C_SetMenuText::Menu3' has a wrong offset!");

// Function WBP_MenuStart.WBP_MenuStart_C.SetFocusOn
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuStart_C_SetFocusOn final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MenuStart_C_SetFocusOn) == 0x000004, "Wrong alignment on WBP_MenuStart_C_SetFocusOn");
static_assert(sizeof(WBP_MenuStart_C_SetFocusOn) == 0x000008, "Wrong size on WBP_MenuStart_C_SetFocusOn");
static_assert(offsetof(WBP_MenuStart_C_SetFocusOn, Selection) == 0x000000, "Member 'WBP_MenuStart_C_SetFocusOn::Selection' has a wrong offset!");
static_assert(offsetof(WBP_MenuStart_C_SetFocusOn, NewParam) == 0x000004, "Member 'WBP_MenuStart_C_SetFocusOn::NewParam' has a wrong offset!");

}

