#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_TextButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_TextButton.WBP_UI_TextButton_C
// 0x0090 (0x03F0 - 0x0360)
class UWBP_UI_TextButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnFocused;                                         // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Content_O;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EdgeBorder_I;                                      // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outline_I;                                         // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root_SB;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_DisplayText;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultTextValue;                                  // 0x03A0(0x0018)(Edit, BlueprintVisible)
	struct FSBZControlsReference                  NewVar_0;                                          // 0x03B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              InititalSize;                                      // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          GreenBorder;                                       // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_UI_TextButton(int32 EntryPoint);
	void ButtonFocusChanging(bool bInHasFocus);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void RefreshVisual();
	void SetButtonText(const class FText& InButtonText);
	void ResetToDefaultButtonText();
	void GetText(class FText* OutText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_TextButton_C">();
	}
	static class UWBP_UI_TextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_TextButton_C>();
	}
};
static_assert(alignof(UWBP_UI_TextButton_C) == 0x000008, "Wrong alignment on UWBP_UI_TextButton_C");
static_assert(sizeof(UWBP_UI_TextButton_C) == 0x0003F0, "Wrong size on UWBP_UI_TextButton_C");
static_assert(offsetof(UWBP_UI_TextButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_TextButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, OnFocused) == 0x000368, "Member 'UWBP_UI_TextButton_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, Background_I) == 0x000370, "Member 'UWBP_UI_TextButton_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, Content_O) == 0x000378, "Member 'UWBP_UI_TextButton_C::Content_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, EdgeBorder_I) == 0x000380, "Member 'UWBP_UI_TextButton_C::EdgeBorder_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, Outline_I) == 0x000388, "Member 'UWBP_UI_TextButton_C::Outline_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, Root_SB) == 0x000390, "Member 'UWBP_UI_TextButton_C::Root_SB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, Text_DisplayText) == 0x000398, "Member 'UWBP_UI_TextButton_C::Text_DisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, DefaultTextValue) == 0x0003A0, "Member 'UWBP_UI_TextButton_C::DefaultTextValue' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, NewVar_0) == 0x0003B8, "Member 'UWBP_UI_TextButton_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, InititalSize) == 0x0003E0, "Member 'UWBP_UI_TextButton_C::InititalSize' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_C, GreenBorder) == 0x0003E8, "Member 'UWBP_UI_TextButton_C::GreenBorder' has a wrong offset!");

}

