#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_CrimeNet_ServerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_CrimeNet_ServerButton.WBP_UI_MainMenu_CrimeNet_ServerButton_C
// 0x01E0 (0x0540 - 0x0360)
class UWBP_UI_MainMenu_CrimeNet_ServerButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Highlight;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LevelName;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Ping;                                         // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerCount;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ServerData;                                   // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ServerFull;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_UnableToJoin;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSBZOnlineSearchResult                 SBZSessionSearchResult;                            // 0x03A8(0x0198)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerButton(int32 EntryPoint);
	void ButtonSelected();
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetSessionInfo(const struct FSBZOnlineSearchResult& SBZOnlineSearchResult);
	class FText GetPartyTypeFromSessionParams(const struct FSBZOnlineSessionParams& SessionParams);
	void GetSessionInfo(struct FSBZOnlineSearchResult* SessionInfo);
	void IsJoinBlocked(bool* bIsJoinBlocked);
	void SetIsActive(bool bIsActive);
	void OnHover(bool bIsHovered);
	void OnFocus(bool bIsFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_CrimeNet_ServerButton_C">();
	}
	static class UWBP_UI_MainMenu_CrimeNet_ServerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_CrimeNet_ServerButton_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_CrimeNet_ServerButton_C");
static_assert(sizeof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C) == 0x000540, "Wrong size on UWBP_UI_MainMenu_CrimeNet_ServerButton_C");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, Image_Background) == 0x000368, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, Image_Highlight) == 0x000370, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::Image_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, Text_LevelName) == 0x000378, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::Text_LevelName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, Text_Ping) == 0x000380, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::Text_Ping' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, Text_PlayerCount) == 0x000388, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::Text_PlayerCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, Text_ServerData) == 0x000390, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::Text_ServerData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, Text_ServerFull) == 0x000398, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::Text_ServerFull' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, Text_UnableToJoin) == 0x0003A0, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::Text_UnableToJoin' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerButton_C, SBZSessionSearchResult) == 0x0003A8, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerButton_C::SBZSessionSearchResult' has a wrong offset!");

}

