#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_Replay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_SM_Replay.WBP_UI_SM_Replay_C
// 0x0088 (0x03C0 - 0x0338)
class UWBP_UI_SM_Replay_C final : public USBZReplayBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           Canvas_MetaData;                                   // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CurrentTime;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DecreaseTimeButton;                                // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                IncreaseTimeButton;                                // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PauseButton;                                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PlayButton;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                PlayerButton;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                QuitButton;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ReplayProgressBar;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ScrubBackwardButton;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ScrubForwardButton;                                // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                StopButton;                                        // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TimeDilation;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalTime;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ViewButton;                                        // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReplayEventImage;                                  // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_SM_Replay(int32 EntryPoint);
	void OnReplayStart();
	void BndEvt__StopButton_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PauseButton_K2Node_ComponentBoundEvent_10_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ScrubForwardButton_K2Node_ComponentBoundEvent_9_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ScrubBackwardButton_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PlayPauseButton_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ViewButton_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__PlayerButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__QuitButton_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TimeDownButton_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__TimeUpButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnReplayUpdate(const class FString& ReplayLength, const class FString& ReplayElapased, float ReplayElapsedPercent);
	float Get_ReplayProgressBar_Percent_0();
	class FText Get_TimeDilation_Text_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_SM_Replay_C">();
	}
	static class UWBP_UI_SM_Replay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_SM_Replay_C>();
	}
};
static_assert(alignof(UWBP_UI_SM_Replay_C) == 0x000008, "Wrong alignment on UWBP_UI_SM_Replay_C");
static_assert(sizeof(UWBP_UI_SM_Replay_C) == 0x0003C0, "Wrong size on UWBP_UI_SM_Replay_C");
static_assert(offsetof(UWBP_UI_SM_Replay_C, UberGraphFrame) == 0x000338, "Member 'UWBP_UI_SM_Replay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, Canvas_MetaData) == 0x000340, "Member 'UWBP_UI_SM_Replay_C::Canvas_MetaData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, CurrentTime) == 0x000348, "Member 'UWBP_UI_SM_Replay_C::CurrentTime' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, DecreaseTimeButton) == 0x000350, "Member 'UWBP_UI_SM_Replay_C::DecreaseTimeButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, IncreaseTimeButton) == 0x000358, "Member 'UWBP_UI_SM_Replay_C::IncreaseTimeButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, PauseButton) == 0x000360, "Member 'UWBP_UI_SM_Replay_C::PauseButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, PlayButton) == 0x000368, "Member 'UWBP_UI_SM_Replay_C::PlayButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, PlayerButton) == 0x000370, "Member 'UWBP_UI_SM_Replay_C::PlayerButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, QuitButton) == 0x000378, "Member 'UWBP_UI_SM_Replay_C::QuitButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, ReplayProgressBar) == 0x000380, "Member 'UWBP_UI_SM_Replay_C::ReplayProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, ScrubBackwardButton) == 0x000388, "Member 'UWBP_UI_SM_Replay_C::ScrubBackwardButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, ScrubForwardButton) == 0x000390, "Member 'UWBP_UI_SM_Replay_C::ScrubForwardButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, StopButton) == 0x000398, "Member 'UWBP_UI_SM_Replay_C::StopButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, TimeDilation) == 0x0003A0, "Member 'UWBP_UI_SM_Replay_C::TimeDilation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, TotalTime) == 0x0003A8, "Member 'UWBP_UI_SM_Replay_C::TotalTime' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, ViewButton) == 0x0003B0, "Member 'UWBP_UI_SM_Replay_C::ViewButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Replay_C, ReplayEventImage) == 0x0003B8, "Member 'UWBP_UI_SM_Replay_C::ReplayEventImage' has a wrong offset!");

}

