#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_FullscreenNotificationWidget

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_FullscreenNotificationWidget.WBP_UI_FullscreenNotificationWidget_C.ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget
// 0x0048 (0x0048 - 0x0000)
struct WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUIFullscreenNotificationData       K2Node_Event_NewNotificationData;                  // 0x0008(0x0038)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget) == 0x000008, "Wrong alignment on WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget");
static_assert(sizeof(WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget) == 0x000048, "Wrong size on WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget, EntryPoint) == 0x000000, "Member 'WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget, K2Node_Event_NewNotificationData) == 0x000008, "Member 'WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget::K2Node_Event_NewNotificationData' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget, CallFunc_PlayAnimationForward_ReturnValue) == 0x000040, "Member 'WBP_UI_FullscreenNotificationWidget_C_ExecuteUbergraph_WBP_UI_FullscreenNotificationWidget::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_UI_FullscreenNotificationWidget.WBP_UI_FullscreenNotificationWidget_C.OnDisplayedNewActiveNotification
// 0x0038 (0x0038 - 0x0000)
struct WBP_UI_FullscreenNotificationWidget_C_OnDisplayedNewActiveNotification final
{
public:
	struct FSBZUIFullscreenNotificationData       NewNotificationData;                               // 0x0000(0x0038)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_FullscreenNotificationWidget_C_OnDisplayedNewActiveNotification) == 0x000008, "Wrong alignment on WBP_UI_FullscreenNotificationWidget_C_OnDisplayedNewActiveNotification");
static_assert(sizeof(WBP_UI_FullscreenNotificationWidget_C_OnDisplayedNewActiveNotification) == 0x000038, "Wrong size on WBP_UI_FullscreenNotificationWidget_C_OnDisplayedNewActiveNotification");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_OnDisplayedNewActiveNotification, NewNotificationData) == 0x000000, "Member 'WBP_UI_FullscreenNotificationWidget_C_OnDisplayedNewActiveNotification::NewNotificationData' has a wrong offset!");

// Function WBP_UI_FullscreenNotificationWidget.WBP_UI_FullscreenNotificationWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_FullscreenNotificationWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_FullscreenNotificationWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_FullscreenNotificationWidget_C_PreConstruct");
static_assert(sizeof(WBP_UI_FullscreenNotificationWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_FullscreenNotificationWidget_C_PreConstruct");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_FullscreenNotificationWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_FullscreenNotificationWidget.WBP_UI_FullscreenNotificationWidget_C.SetDisplayQueue
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue final
{
public:
	int32                                         NormalCount;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         WarningCount;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ErrorCount;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
	int32                                         Temp_int_Variable_1;                               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0058(0x0018)()
	int32                                         Temp_int_Variable_2;                               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZUIFullscreenNotificationData> CallFunc_GetFullscreenNotificationQueue_ReturnValue; // 0x0088(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUIFullscreenNotificationData       CallFunc_Array_Get_Item;                           // 0x00A0(0x0038)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue) == 0x000008, "Wrong alignment on WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue");
static_assert(sizeof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue) == 0x0000E0, "Wrong size on WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, NormalCount) == 0x000000, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::NormalCount' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, WarningCount) == 0x000004, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::WarningCount' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, ErrorCount) == 0x000008, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::ErrorCount' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, Temp_int_Variable) == 0x000010, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Add_IntInt_ReturnValue) == 0x000030, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, Temp_int_Variable_1) == 0x000050, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000058, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, Temp_int_Variable_2) == 0x000070, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Add_IntInt_ReturnValue_1) == 0x000074, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Add_IntInt_ReturnValue_2) == 0x000078, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Add_IntInt_ReturnValue_3) == 0x00007C, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_GetUIManager_ReturnValue) == 0x000080, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_GetFullscreenNotificationQueue_ReturnValue) == 0x000088, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_GetFullscreenNotificationQueue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue, K2Node_SwitchEnum_CmpSuccess) == 0x0000D9, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetDisplayQueue::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_UI_FullscreenNotificationWidget.WBP_UI_FullscreenNotificationWidget_C.SetNotificationTypeVisuals
// 0x0188 (0x0188 - 0x0000)
struct WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals final
{
public:
	ESBZNotificationType                          InNotificationData;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZNotificationType                          Temp_byte_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZNotificationType                          Temp_byte_Variable_5;                              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0088(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0040)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_1;                           // 0x00E0(0x0018)()
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0108(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0158(0x0018)()
	ESBZNotificationType                          Temp_byte_Variable_6;                              // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_2;                           // 0x0174(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals) == 0x000008, "Wrong alignment on WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals");
static_assert(sizeof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals) == 0x000188, "Wrong size on WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, InNotificationData) == 0x000000, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::InNotificationData' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_struct_Variable) == 0x000004, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_struct_Variable_2) == 0x000024, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_byte_Variable) == 0x000034, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_byte_Variable_1) == 0x000035, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_byte_Variable_2) == 0x000036, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_byte_Variable_3) == 0x000037, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_byte_Variable_4) == 0x000038, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_byte_Variable_5) == 0x000039, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, K2Node_Select_Default) == 0x00003A, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_text_Variable) == 0x000040, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_text_Variable_1) == 0x000058, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_text_Variable_2) == 0x000070, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_text_Variable_3) == 0x000088, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, K2Node_Select_Default_1) == 0x0000E0, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_struct_Variable_3) == 0x0000F8, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, K2Node_MakeStruct_FormatArgumentData_1) == 0x000108, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, K2Node_MakeArray_Array) == 0x000148, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, CallFunc_Format_ReturnValue) == 0x000158, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, Temp_byte_Variable_6) == 0x000170, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals, K2Node_Select_Default_2) == 0x000174, "Member 'WBP_UI_FullscreenNotificationWidget_C_SetNotificationTypeVisuals::K2Node_Select_Default_2' has a wrong offset!");

}

