#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_WeaponInventoryScreen

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_WeaponInventoryScreen.WBP_UI_WeaponInventoryScreen_C.ExecuteUbergraph_WBP_UI_WeaponInventoryScreen
// 0x0358 (0x0358 - 0x0000)
struct WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0008(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_Event_SelectedButton;                       // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFocused;                           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZInventoryEquipmentType                    Temp_byte_Variable;                                // 0x0039(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuLoadoutWeaponSlotButton*    K2Node_DynamicCast_AsSBZMain_Menu_Loadout_Weapon_Slot_Button; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPresetWeaponSlot_ReturnValue;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanDiscardWeaponIndex_ReturnValue;        // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZEquippableLoadoutSlot                     CallFunc_GetEquippableSlot_ReturnValue;            // 0x004B(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InActionInput;                  // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0064(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZInventoryEquipmentType                    Temp_byte_Variable_1;                              // 0x0071(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZEquippableLoadoutSlot                     Temp_byte_Variable_2;                              // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0078(0x0018)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Inventory_WeaponSlotButton_C*   K2Node_DynamicCast_AsWBP_UI_Inventory_Weapon_Slot_Button; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponSlotIndex_ReturnValue;           // 0x00B0(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CustomizeWeaponInSlotTemp_ReturnValue;    // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x00D8(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0108(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0138(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_3;                 // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0170(0x0018)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_4;                 // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZEquippableLoadoutSlot                     Temp_byte_Variable_3;                              // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0198(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Inventory_WeaponSlotButton_C*   K2Node_DynamicCast_AsWBP_UI_Inventory_Weapon_Slot_Button_1; // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWeaponSlotIndex_ReturnValue_1;         // 0x01D4(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_2;                           // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryDiscardWeaponInIndex_ReturnValue;      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanDiscardWeaponIndex_ReturnValue_1;      // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZInventoryEquipmentType                    K2Node_Select_Default_3;                           // 0x01E2(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E3[0x5];                                      // 0x01E3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue_1;                   // 0x01F0(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_1;              // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_1;        // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Inventory_WeaponSlotButton_C*   K2Node_DynamicCast_AsWBP_UI_Inventory_Weapon_Slot_Button_2; // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_2;              // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetWeaponSlotIndex_ReturnValue_2;         // 0x0250(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_2;        // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsWeaponDiscarded;                   // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_5;                 // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_4;                           // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu;       // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZMainMenuState                             CallFunc_GetMainMenuState_ReturnValue;             // 0x0299(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29A[0x6];                                      // 0x029A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default_5;                           // 0x02A0(0x0010)(ReferenceParm)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x02B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B3[0x5];                                      // 0x02B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x02B8(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x02E8(0x0030)()
	class UWidget*                                K2Node_Select_Default_6;                           // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x0320(0x0010)(ReferenceParm)
	class USBZMenuButton*                         K2Node_DynamicCast_AsSBZMenu_Button;               // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default_7;                           // 0x0348(0x0010)(ReferenceParm)
};
static_assert(alignof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen) == 0x000008, "Wrong alignment on WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen");
static_assert(sizeof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen) == 0x000358, "Wrong size on WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_bool_Variable) == 0x000004, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Event_PreviousValue) == 0x000008, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_bool_Variable_1) == 0x000014, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetChildAt_ReturnValue_1) == 0x000020, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Event_SelectedButton) == 0x000030, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Event_SelectedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Event_bIsFocused) == 0x000038, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Event_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_byte_Variable) == 0x000039, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Loadout_Weapon_Slot_Button) == 0x000040, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Loadout_Weapon_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_IsPresetWeaponSlot_ReturnValue) == 0x000049, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_IsPresetWeaponSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_CanDiscardWeaponIndex_ReturnValue) == 0x00004A, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_CanDiscardWeaponIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetEquippableSlot_ReturnValue) == 0x00004B, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetEquippableSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_IsEmpty_ReturnValue) == 0x00004C, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetUIManager_ReturnValue) == 0x000050, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_CustomEvent_InActionInput) == 0x000058, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_CustomEvent_InActionInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_PopStack_ReturnValue) == 0x000064, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_SwitchName_CmpSuccess) == 0x000070, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_byte_Variable_1) == 0x000071, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_byte_Variable_2) == 0x000072, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_text_Variable) == 0x000078, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetUIManager_ReturnValue_1) == 0x000090, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Weapon_Slot_Button) == 0x000098, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Weapon_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetMenuWidget_ReturnValue) == 0x0000A8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetWeaponSlotIndex_ReturnValue) == 0x0000B0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetWeaponSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget) == 0x0000B8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_CustomizeWeaponInSlotTemp_ReturnValue) == 0x0000C1, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_CustomizeWeaponInSlotTemp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_IsValid_ReturnValue_1) == 0x0000C2, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_ComponentBoundEvent_Button) == 0x0000C8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled) == 0x0000D0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference) == 0x0000D8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000108, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_MakeArray_Array) == 0x000138, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetChildrenCount_ReturnValue) == 0x000148, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x00014C, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000150, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_Clamp_ReturnValue) == 0x000154, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetChildAt_ReturnValue_2) == 0x000158, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetChildAt_ReturnValue_3) == 0x000160, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetChildAt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_IsValid_ReturnValue_2) == 0x000168, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_text_Variable_1) == 0x000170, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetChildAt_ReturnValue_4) == 0x000188, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetChildAt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_IsValid_ReturnValue_3) == 0x000190, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_byte_Variable_3) == 0x000191, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Select_Default) == 0x000198, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_bool_Variable_2) == 0x0001B0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Select_Default_1) == 0x0001B8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_bool_Variable_3) == 0x0001C0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Weapon_Slot_Button_1) == 0x0001C8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Weapon_Slot_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_bSuccess_3) == 0x0001D0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetWeaponSlotIndex_ReturnValue_1) == 0x0001D4, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetWeaponSlotIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Select_Default_2) == 0x0001D8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_TryDiscardWeaponInIndex_ReturnValue) == 0x0001E0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_TryDiscardWeaponInIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_CanDiscardWeaponIndex_ReturnValue_1) == 0x0001E1, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_CanDiscardWeaponIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Select_Default_3) == 0x0001E2, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetUIManager_ReturnValue_2) == 0x0001E8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_PopStack_ReturnValue_1) == 0x0001F0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_PopStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetMenuWidget_ReturnValue_1) == 0x000200, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetMenuWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget_1) == 0x000208, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_bSuccess_4) == 0x000210, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000218, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x000220, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetUIManager_ReturnValue_3) == 0x000230, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Weapon_Slot_Button_2) == 0x000238, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Weapon_Slot_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_bSuccess_5) == 0x000240, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetMenuWidget_ReturnValue_2) == 0x000248, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetMenuWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetWeaponSlotIndex_ReturnValue_2) == 0x000250, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetWeaponSlotIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget_2) == 0x000258, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_bSuccess_6) == 0x000260, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Event_bIsWeaponDiscarded) == 0x000261, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Event_bIsWeaponDiscarded' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetChildAt_ReturnValue_5) == 0x000268, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetChildAt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_IsValid_ReturnValue_4) == 0x000270, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Select_Default_4) == 0x000278, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetGameMode_ReturnValue) == 0x000280, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_bool_Variable_4) == 0x000288, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu) == 0x000290, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_bSuccess_7) == 0x000298, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_GetMainMenuState_ReturnValue) == 0x000299, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_GetMainMenuState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Select_Default_5) == 0x0002A0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0002B0, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_BooleanOR_ReturnValue) == 0x0002B1, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, Temp_bool_Variable_5) == 0x0002B2, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x0002B8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x0002E8, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Select_Default_6) == 0x000318, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_MakeArray_Array_1) == 0x000320, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_AsSBZMenu_Button) == 0x000330, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_AsSBZMenu_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_DynamicCast_bSuccess_8) == 0x000338, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Event_IsDesignTime) == 0x000339, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, CallFunc_PlayAnimation_ReturnValue) == 0x000340, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen, K2Node_Select_Default_7) == 0x000348, "Member 'WBP_UI_WeaponInventoryScreen_C_ExecuteUbergraph_WBP_UI_WeaponInventoryScreen::K2Node_Select_Default_7' has a wrong offset!");

// Function WBP_UI_WeaponInventoryScreen.WBP_UI_WeaponInventoryScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_WeaponInventoryScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_WeaponInventoryScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_WeaponInventoryScreen_C_PreConstruct");
static_assert(sizeof(WBP_UI_WeaponInventoryScreen_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_WeaponInventoryScreen_C_PreConstruct");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_WeaponInventoryScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_WeaponInventoryScreen.WBP_UI_WeaponInventoryScreen_C.OnWeaponInSlotDiscarded
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_WeaponInventoryScreen_C_OnWeaponInSlotDiscarded final
{
public:
	bool                                          bIsWeaponDiscarded;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_WeaponInventoryScreen_C_OnWeaponInSlotDiscarded) == 0x000001, "Wrong alignment on WBP_UI_WeaponInventoryScreen_C_OnWeaponInSlotDiscarded");
static_assert(sizeof(WBP_UI_WeaponInventoryScreen_C_OnWeaponInSlotDiscarded) == 0x000001, "Wrong size on WBP_UI_WeaponInventoryScreen_C_OnWeaponInSlotDiscarded");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_OnWeaponInSlotDiscarded, bIsWeaponDiscarded) == 0x000000, "Member 'WBP_UI_WeaponInventoryScreen_C_OnWeaponInSlotDiscarded::bIsWeaponDiscarded' has a wrong offset!");

// Function WBP_UI_WeaponInventoryScreen.WBP_UI_WeaponInventoryScreen_C.BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_WeaponInventoryScreen_C_BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_WeaponInventoryScreen_C_BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_WeaponInventoryScreen_C_BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_WeaponInventoryScreen_C_BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_WeaponInventoryScreen_C_BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_WeaponInventoryScreen_C_BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_WeaponInventoryScreen_C_BndEvt__WBP_UI_WeaponInventoryScreen_Button_WeaponSlotStoreItem_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_WeaponInventoryScreen.WBP_UI_WeaponInventoryScreen_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_WeaponInventoryScreen_C_OnControlsReferenceClicked final
{
public:
	class FName                                   InActionInput;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponInventoryScreen_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_WeaponInventoryScreen_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_WeaponInventoryScreen_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_WeaponInventoryScreen_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_OnControlsReferenceClicked, InActionInput) == 0x000000, "Member 'WBP_UI_WeaponInventoryScreen_C_OnControlsReferenceClicked::InActionInput' has a wrong offset!");

// Function WBP_UI_WeaponInventoryScreen.WBP_UI_WeaponInventoryScreen_C.WeaponSlotButtonFocusedChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_WeaponInventoryScreen_C_WeaponSlotButtonFocusedChanged final
{
public:
	class USBZMenuButton*                         SelectedButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_WeaponInventoryScreen_C_WeaponSlotButtonFocusedChanged) == 0x000008, "Wrong alignment on WBP_UI_WeaponInventoryScreen_C_WeaponSlotButtonFocusedChanged");
static_assert(sizeof(WBP_UI_WeaponInventoryScreen_C_WeaponSlotButtonFocusedChanged) == 0x000010, "Wrong size on WBP_UI_WeaponInventoryScreen_C_WeaponSlotButtonFocusedChanged");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_WeaponSlotButtonFocusedChanged, SelectedButton) == 0x000000, "Member 'WBP_UI_WeaponInventoryScreen_C_WeaponSlotButtonFocusedChanged::SelectedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_WeaponSlotButtonFocusedChanged, bIsFocused) == 0x000008, "Member 'WBP_UI_WeaponInventoryScreen_C_WeaponSlotButtonFocusedChanged::bIsFocused' has a wrong offset!");

// Function WBP_UI_WeaponInventoryScreen.WBP_UI_WeaponInventoryScreen_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_WeaponInventoryScreen_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponInventoryScreen_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_WeaponInventoryScreen_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_WeaponInventoryScreen_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_WeaponInventoryScreen_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_WeaponInventoryScreen_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_WeaponInventoryScreen_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_WeaponInventoryScreen.WBP_UI_WeaponInventoryScreen_C.RegisterButtons
// 0x0120 (0x0120 - 0x0000)
struct WBP_UI_WeaponInventoryScreen_C_RegisterButtons final
{
public:
	TArray<struct FSBZButtonControlReference>     ActionList_0;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0040(0x0028)()
	struct FSBZButtonControlReference             CallFunc_Array_Get_Item;                           // 0x0068(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
