#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_More

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_More.WBP_Menu_More_C
// 0x00D8 (0x0378 - 0x02A0)
class UWBP_Menu_More_C final : public USBZMenuStackWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show;                                              // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           BottomButtons_VB;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ContentPanel_C*                    ContentPanel;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   CreditsButton;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   Debug_ChangeMatchmakingGroupButton;                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   Debug_OldHeistSelect;                              // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   Debug_SoloModeOldHeistSelect;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Debug_T;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DebugsButtons_VB;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Divider_I;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   EULAButton;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   LinkedNebulaButton;                                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_I;                                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   OldHeistSelectButton;                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   QuitGameButton;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenTitle_C*                     ScreenTitle;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   SettingsButton;                                    // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   SwitchUserButton;                                  // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           TopButtons_VB;                                     // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMenuButton*                         ActiveButton;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlsReference            ConfirmButtonControlsReference;                    // 0x0350(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_Menu_More(int32 EntryPoint);
	void BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_21_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_Menu_More_WBP_UI_TextButton_1_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_SettingsButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_Menu_More_SettingsButton_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_WBP_UI_TextButton_1_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_Menu_More_Debug_ChangeMatchmakingGroupButton_K2Node_ComponentBoundEvent_20_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_Debug_ChangeMatchmakingGroupButton_K2Node_ComponentBoundEvent_19_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_Menu_More_Button_HeistSelection_1_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_Button_HeistSelection_1_K2Node_ComponentBoundEvent_17_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void UpdateFocusedButton(class USBZMenuButton* InButton, bool Enabled);
	void BndEvt__WBP_Menu_More_ProfileButton_K2Node_ComponentBoundEvent_16_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_ProfileButton_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_Menu_More_EndUserButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_EndUserButton_K2Node_ComponentBoundEvent_13_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_Menu_More_LinkedNebulaButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_LinkedNebulaButton_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void OnControlReferencePressed(class FName ActionName);
	void OnRemovedFromStack();
	void OnInitialized();
	void OnQuitConfirmed(class FName ClosingActionName);
	void BndEvt__WBP_Menu_More_QuitGameButton_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_Menu_More_QuitGameButton_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void OnGainedStackFocused(const class FName& PreviousValue);
	void OnSuccess_D5F41EB84ACB2B95A6FF13B1BF87DAA8(class APlayerController* PlayerController);
	void OnFailure_D5F41EB84ACB2B95A6FF13B1BF87DAA8(class APlayerController* PlayerController);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_More_C">();
	}
	static class UWBP_Menu_More_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_More_C>();
	}
};
static_assert(alignof(UWBP_Menu_More_C) == 0x000008, "Wrong alignment on UWBP_Menu_More_C");
static_assert(sizeof(UWBP_Menu_More_C) == 0x000378, "Wrong size on UWBP_Menu_More_C");
static_assert(offsetof(UWBP_Menu_More_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_Menu_More_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, Show) == 0x0002A8, "Member 'UWBP_Menu_More_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, Background_I) == 0x0002B0, "Member 'UWBP_Menu_More_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, BottomButtons_VB) == 0x0002B8, "Member 'UWBP_Menu_More_C::BottomButtons_VB' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, ContentPanel) == 0x0002C0, "Member 'UWBP_Menu_More_C::ContentPanel' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, CreditsButton) == 0x0002C8, "Member 'UWBP_Menu_More_C::CreditsButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, Debug_ChangeMatchmakingGroupButton) == 0x0002D0, "Member 'UWBP_Menu_More_C::Debug_ChangeMatchmakingGroupButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, Debug_OldHeistSelect) == 0x0002D8, "Member 'UWBP_Menu_More_C::Debug_OldHeistSelect' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, Debug_SoloModeOldHeistSelect) == 0x0002E0, "Member 'UWBP_Menu_More_C::Debug_SoloModeOldHeistSelect' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, Debug_T) == 0x0002E8, "Member 'UWBP_Menu_More_C::Debug_T' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, DebugsButtons_VB) == 0x0002F0, "Member 'UWBP_Menu_More_C::DebugsButtons_VB' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, Divider_I) == 0x0002F8, "Member 'UWBP_Menu_More_C::Divider_I' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, EULAButton) == 0x000300, "Member 'UWBP_Menu_More_C::EULAButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, LinkedNebulaButton) == 0x000308, "Member 'UWBP_Menu_More_C::LinkedNebulaButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, Logo_I) == 0x000310, "Member 'UWBP_Menu_More_C::Logo_I' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, OldHeistSelectButton) == 0x000318, "Member 'UWBP_Menu_More_C::OldHeistSelectButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, QuitGameButton) == 0x000320, "Member 'UWBP_Menu_More_C::QuitGameButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, ScreenTitle) == 0x000328, "Member 'UWBP_Menu_More_C::ScreenTitle' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, SettingsButton) == 0x000330, "Member 'UWBP_Menu_More_C::SettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, SwitchUserButton) == 0x000338, "Member 'UWBP_Menu_More_C::SwitchUserButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, TopButtons_VB) == 0x000340, "Member 'UWBP_Menu_More_C::TopButtons_VB' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, ActiveButton) == 0x000348, "Member 'UWBP_Menu_More_C::ActiveButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_More_C, ConfirmButtonControlsReference) == 0x000350, "Member 'UWBP_Menu_More_C::ConfirmButtonControlsReference' has a wrong offset!");

}

