#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Overskill_LevelButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Overskill_LevelButton.WBP_UI_Overskill_LevelButton_C
// 0x0050 (0x03B0 - 0x0360)
class UWBP_UI_Overskill_LevelButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Locked_I;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Overskill_Level_C*              Overskill_Level;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   LevelText;                                         // 0x0380(0x0018)(Edit, BlueprintVisible)
	int32                                         NavBarIndex;                                       // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(int32 NavIndex)> LevelSelected;                                    // 0x03A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_UI_Overskill_LevelButton(int32 EntryPoint);
	void ButtonFocusedChanged(bool bInHasFocus);
	void PreConstruct(bool IsDesignTime);
	void OnFocused(bool IsFocused);
	void SetLockedState(bool IsLocked);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Overskill_LevelButton_C">();
	}
	static class UWBP_UI_Overskill_LevelButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Overskill_LevelButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Overskill_LevelButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Overskill_LevelButton_C");
static_assert(sizeof(UWBP_UI_Overskill_LevelButton_C) == 0x0003B0, "Wrong size on UWBP_UI_Overskill_LevelButton_C");
static_assert(offsetof(UWBP_UI_Overskill_LevelButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_Overskill_LevelButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_LevelButton_C, HoverAnim) == 0x000368, "Member 'UWBP_UI_Overskill_LevelButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_LevelButton_C, Locked_I) == 0x000370, "Member 'UWBP_UI_Overskill_LevelButton_C::Locked_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_LevelButton_C, Overskill_Level) == 0x000378, "Member 'UWBP_UI_Overskill_LevelButton_C::Overskill_Level' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_LevelButton_C, LevelText) == 0x000380, "Member 'UWBP_UI_Overskill_LevelButton_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_LevelButton_C, NavBarIndex) == 0x000398, "Member 'UWBP_UI_Overskill_LevelButton_C::NavBarIndex' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_LevelButton_C, LevelSelected) == 0x0003A0, "Member 'UWBP_UI_Overskill_LevelButton_C::LevelSelected' has a wrong offset!");

}

