#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_Replays

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_Replays.WBP_UI_MainMenu_Replays_C
// 0x0040 (0x02E0 - 0x02A0)
class UWBP_UI_MainMenu_Replays_C final : public USBZMenuStackWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_TextButton_C*                   Button_GoBack;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ReplaysBorder;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ReplaysScrollBox;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Root_Canvas;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_MainMenu_Replay_C*              WBP_UI_MainMenu_Replay;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FSBZReplayInfo>                 Replays;                                           // 0x02D0(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_Replays(int32 EntryPoint);
	void BndEvt__WBP_UI_MainMenu_Replays_Button_GoBack_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void OnControlsReferenceClicked(class FName InActionInput);
	void OnBackPressed();
	void On_Found_Replays(TArray<struct FSBZReplayInfo>& Replays_0);
	void OnLostStackFocused();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_Replays_C">();
	}
	static class UWBP_UI_MainMenu_Replays_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_Replays_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_Replays_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_Replays_C");
static_assert(sizeof(UWBP_UI_MainMenu_Replays_C) == 0x0002E0, "Wrong size on UWBP_UI_MainMenu_Replays_C");
static_assert(offsetof(UWBP_UI_MainMenu_Replays_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_UI_MainMenu_Replays_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_Replays_C, Button_GoBack) == 0x0002A8, "Member 'UWBP_UI_MainMenu_Replays_C::Button_GoBack' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_Replays_C, ReplaysBorder) == 0x0002B0, "Member 'UWBP_UI_MainMenu_Replays_C::ReplaysBorder' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_Replays_C, ReplaysScrollBox) == 0x0002B8, "Member 'UWBP_UI_MainMenu_Replays_C::ReplaysScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_Replays_C, Root_Canvas) == 0x0002C0, "Member 'UWBP_UI_MainMenu_Replays_C::Root_Canvas' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_Replays_C, WBP_UI_MainMenu_Replay) == 0x0002C8, "Member 'UWBP_UI_MainMenu_Replays_C::WBP_UI_MainMenu_Replay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_Replays_C, Replays) == 0x0002D0, "Member 'UWBP_UI_MainMenu_Replays_C::Replays' has a wrong offset!");

}

