#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewsItem

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_NewsItem.WBP_NewsItem_C.ExecuteUbergraph_WBP_NewsItem
// 0x0030 (0x0030 - 0x0000)
struct WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0014)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem) == 0x000008, "Wrong alignment on WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem");
static_assert(sizeof(WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem) == 0x000030, "Wrong size on WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem");
static_assert(offsetof(WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem, EntryPoint) == 0x000000, "Member 'WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem, Temp_object_Variable) == 0x000008, "Member 'WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'WBP_NewsItem_C_ExecuteUbergraph_WBP_NewsItem::K2Node_CustomEvent_Loaded' has a wrong offset!");

// Function WBP_NewsItem.WBP_NewsItem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_NewsItem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_NewsItem_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_NewsItem_C_PreConstruct");
static_assert(sizeof(WBP_NewsItem_C_PreConstruct) == 0x000001, "Wrong size on WBP_NewsItem_C_PreConstruct");
static_assert(offsetof(WBP_NewsItem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_NewsItem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_NewsItem.WBP_NewsItem_C.OnLoaded_8987B2184F552E80FB20EF8DDB9EA1ED
// 0x0008 (0x0008 - 0x0000)
struct WBP_NewsItem_C_OnLoaded_8987B2184F552E80FB20EF8DDB9EA1ED final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_NewsItem_C_OnLoaded_8987B2184F552E80FB20EF8DDB9EA1ED) == 0x000008, "Wrong alignment on WBP_NewsItem_C_OnLoaded_8987B2184F552E80FB20EF8DDB9EA1ED");
static_assert(sizeof(WBP_NewsItem_C_OnLoaded_8987B2184F552E80FB20EF8DDB9EA1ED) == 0x000008, "Wrong size on WBP_NewsItem_C_OnLoaded_8987B2184F552E80FB20EF8DDB9EA1ED");
static_assert(offsetof(WBP_NewsItem_C_OnLoaded_8987B2184F552E80FB20EF8DDB9EA1ED, Loaded) == 0x000000, "Member 'WBP_NewsItem_C_OnLoaded_8987B2184F552E80FB20EF8DDB9EA1ED::Loaded' has a wrong offset!");

}

