#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Menu_Debug_BackendErrorScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Menu_Debug_BackendErrorScreen.WBP_UI_Menu_Debug_BackendErrorScreen_C.ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen
// 0x0078 (0x0078 - 0x0000)
struct WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZPlatform                                  Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetErrorText_ReturnValue;                 // 0x0028(0x0018)()
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetErrorHeader_ReturnValue;               // 0x0048(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZPlatform                                  CallFunc_GetPlatform_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen) == 0x000008, "Wrong alignment on WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen");
static_assert(sizeof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen) == 0x000078, "Wrong size on WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000008, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, Temp_bool_Variable) == 0x000010, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, Temp_byte_Variable) == 0x000011, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, Temp_byte_Variable_2) == 0x000013, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, Temp_byte_Variable_3) == 0x000014, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, Temp_byte_Variable_4) == 0x000015, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, Temp_byte_Variable_5) == 0x000016, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, Temp_byte_Variable_6) == 0x000017, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, CallFunc_GetGameStateMachine_ReturnValue) == 0x000018, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000020, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, CallFunc_GetErrorText_ReturnValue) == 0x000028, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::CallFunc_GetErrorText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, CallFunc_IsShippingBuild_ReturnValue) == 0x000040, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, CallFunc_GetErrorHeader_ReturnValue) == 0x000048, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::CallFunc_GetErrorHeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, K2Node_Select_Default) == 0x000060, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, K2Node_ComponentBoundEvent_Button) == 0x000068, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, CallFunc_GetPlatform_ReturnValue) == 0x000070, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::CallFunc_GetPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen, K2Node_Select_Default_1) == 0x000071, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_ExecuteUbergraph_WBP_UI_Menu_Debug_BackendErrorScreen::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_UI_Menu_Debug_BackendErrorScreen.WBP_UI_Menu_Debug_BackendErrorScreen_C.BndEvt__WBP_UI_Menu_Debug_BackendErrorScreen_Button_Quit_1_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_BackendErrorScreen_Button_Quit_1_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_BackendErrorScreen_Button_Quit_1_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_BackendErrorScreen_Button_Quit_1_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_BackendErrorScreen_Button_Quit_1_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_BackendErrorScreen_Button_Quit_1_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_BackendErrorScreen_Button_Quit_1_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_BackendErrorScreen_Button_Quit_1_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Menu_Debug_BackendErrorScreen.WBP_UI_Menu_Debug_BackendErrorScreen_C.BndEvt__WBP_UI_Menu_Debug_NetworkErrorScreen_Button_ReturnToMainMenu_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_NetworkErrorScreen_Button_ReturnToMainMenu_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_NetworkErrorScreen_Button_ReturnToMainMenu_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_NetworkErrorScreen_Button_ReturnToMainMenu_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_NetworkErrorScreen_Button_ReturnToMainMenu_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_NetworkErrorScreen_Button_ReturnToMainMenu_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_NetworkErrorScreen_Button_ReturnToMainMenu_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_BndEvt__WBP_UI_Menu_Debug_NetworkErrorScreen_Button_ReturnToMainMenu_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Menu_Debug_BackendErrorScreen.WBP_UI_Menu_Debug_BackendErrorScreen_C.OnKeyDown
// 0x0138 (0x0138 - 0x0000)
struct WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00C0)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown) == 0x000008, "Wrong alignment on WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown");
static_assert(sizeof(WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown) == 0x000138, "Wrong size on WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown, MyGeometry) == 0x000000, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown, InKeyEvent) == 0x000038, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown::InKeyEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown, ReturnValue) == 0x000078, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_OnKeyDown::ReturnValue' has a wrong offset!");

// Function WBP_UI_Menu_Debug_BackendErrorScreen.WBP_UI_Menu_Debug_BackendErrorScreen_C.Fill Version String
// 0x0168 (0x0168 - 0x0000)
struct WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_2;                            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable_3;                            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetBuildVersion_ReturnValue;              // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNetworkVersion_ReturnValue;            // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0088(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00B0(0x0018)()
	class FString                                 CallFunc_GetEngineVersion_ReturnValue;             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShippingBuild_ReturnValue;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_2;          // 0x00F0(0x0018)()
	class FString                                 K2Node_Select_Default;                             // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_TestBuild_ReturnValue;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DevelopmentBuild_ReturnValue;             // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Select_Default_2;                           // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_3;          // 0x0150(0x0018)()
};
static_assert(alignof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String) == 0x000008, "Wrong alignment on WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String");
static_assert(sizeof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String) == 0x000168, "Wrong size on WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, Temp_string_Variable) == 0x000008, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, Temp_string_Variable_1) == 0x000018, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, Temp_bool_Variable_1) == 0x000028, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, Temp_string_Variable_2) == 0x000030, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::Temp_string_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, Temp_bool_Variable_2) == 0x000040, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, Temp_string_Variable_3) == 0x000048, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::Temp_string_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_GetBuildVersion_ReturnValue) == 0x000058, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_GetBuildVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_Concat_StrStr_ReturnValue) == 0x000068, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_GetNetworkVersion_ReturnValue) == 0x000078, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_GetNetworkVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_Conv_StringToText_ReturnValue) == 0x000088, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000A0, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000B0, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_GetEngineVersion_ReturnValue) == 0x0000C8, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_GetEngineVersion_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000D8, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_ShippingBuild_ReturnValue) == 0x0000E8, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_ShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_Conv_StringToText_ReturnValue_2) == 0x0000F0, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_Conv_StringToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, K2Node_Select_Default) == 0x000108, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_TestBuild_ReturnValue) == 0x000118, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_TestBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_DevelopmentBuild_ReturnValue) == 0x000119, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_DevelopmentBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, K2Node_Select_Default_1) == 0x000120, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, K2Node_Select_Default_2) == 0x000130, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000140, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String, CallFunc_Conv_StringToText_ReturnValue_3) == 0x000150, "Member 'WBP_UI_Menu_Debug_BackendErrorScreen_C_Fill_Version_String::CallFunc_Conv_StringToText_ReturnValue_3' has a wrong offset!");

}

