#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Overskill_NavBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Overskill_NavBar.WBP_UI_Overskill_NavBar_C
// 0x0060 (0x0310 - 0x02B0)
class UWBP_UI_Overskill_NavBar_C final : public USBZLocalNavBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_Overskill_LevelButton_C*        Base;                                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Overskill_LevelButton_C*        LevelFive;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Overskill_LevelButton_C*        LevelFour;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Overskill_LevelButton_C*        LevelOne;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Overskill_LevelButton_C*        LevelThree;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Overskill_LevelButton_C*        LevelTwo;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      OverskillLeft;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      OverskillRight;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWBP_UI_Overskill_LevelButton_C*> OverskillButtons;                                 // 0x02F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         ActiveIndex;                                       // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Overskill_NavBar(int32 EntryPoint);
	void Destruct();
	void OnTabUp();
	void OnTabDown();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void SetCurrentProgress(int32 UnlockedLevel);
	void UpdateIndex(int32 NewActiveIndex);
	void OnTabSelected(int32 SelectedIndex);
	void GetRomanNumeral(int32 Index_0, class FText* LevelText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Overskill_NavBar_C">();
	}
	static class UWBP_UI_Overskill_NavBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Overskill_NavBar_C>();
	}
};
static_assert(alignof(UWBP_UI_Overskill_NavBar_C) == 0x000008, "Wrong alignment on UWBP_UI_Overskill_NavBar_C");
static_assert(sizeof(UWBP_UI_Overskill_NavBar_C) == 0x000310, "Wrong size on UWBP_UI_Overskill_NavBar_C");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, UberGraphFrame) == 0x0002B0, "Member 'UWBP_UI_Overskill_NavBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, Base) == 0x0002B8, "Member 'UWBP_UI_Overskill_NavBar_C::Base' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, LevelFive) == 0x0002C0, "Member 'UWBP_UI_Overskill_NavBar_C::LevelFive' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, LevelFour) == 0x0002C8, "Member 'UWBP_UI_Overskill_NavBar_C::LevelFour' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, LevelOne) == 0x0002D0, "Member 'UWBP_UI_Overskill_NavBar_C::LevelOne' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, LevelThree) == 0x0002D8, "Member 'UWBP_UI_Overskill_NavBar_C::LevelThree' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, LevelTwo) == 0x0002E0, "Member 'UWBP_UI_Overskill_NavBar_C::LevelTwo' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, OverskillLeft) == 0x0002E8, "Member 'UWBP_UI_Overskill_NavBar_C::OverskillLeft' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, OverskillRight) == 0x0002F0, "Member 'UWBP_UI_Overskill_NavBar_C::OverskillRight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, OverskillButtons) == 0x0002F8, "Member 'UWBP_UI_Overskill_NavBar_C::OverskillButtons' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Overskill_NavBar_C, ActiveIndex) == 0x000308, "Member 'UWBP_UI_Overskill_NavBar_C::ActiveIndex' has a wrong offset!");

}

