#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_RinoHud_TopRightSide

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "ERinoHud_IconRow_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "ST_RinoHud_BagAdjustments_structs.hpp"
#include "RinoHud_SaveGame_Struct_structs.hpp"
#include "ST_RinoHud_CounterIcon_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_RinoHud_TopRightSide.WBP_UI_Widget_RinoHud_TopRightSide_C
// 0x0318 (0x05A8 - 0x0290)
class UWBP_UI_Widget_RinoHud_TopRightSide_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_Collectables;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_MissionSpecific;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_Units;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_PagerWidget_RinoHud_C*          PagerWidget_RinoHud;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Groups_Deployed_C*       WBP_UI_Widget_Groups_Deployed;                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Groups_Timed_C*          WBP_UI_Widget_Groups_Timed;                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Ping_RinoHud_C*          WBP_UI_Widget_Ping_RinoHud;                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_HUD_FPSCounter_C*               Widget_FPSCounter;                                 // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FRinoHud_SaveGame_Struct               Config;                                            // 0x02D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, bool>                     ConfigBoolMap;                                     // 0x0300(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class ABP_MethCookingStation_C*, ESBZCookingState> MethCookingStationTracker;               // 0x0350(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class USBZBagType*, class UWBP_UI_Widget_BaseBagCounter_RinoHud_C*> BagsWidgets;            // 0x03A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class USBZBagType*, int32>               BagsCount;                                         // 0x03F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class USBZBagType*, class USBZBagType*>  BagsAliases;                                       // 0x0440(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FTimerHandle>                   TimerHandles;                                      // 0x0490(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FST_RinoHud_CounterIcon> IconsConfig;                                 // 0x04A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, class UWBP_UI_Widget_BaseCounter_RinoHud_C*> IconWidgets;                    // 0x04F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         TempCount;                                         // 0x0540(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 LevelName;                                         // 0x0548(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FST_RinoHud_BagAdjustments             BagAdjustments;                                    // 0x0558(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_RinoHud_TopRightSide(int32 EntryPoint);
	void Destruct();
	void StealthAndPickups();
	void Deployables();
	void TimedHacking();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetAliveCount(TArray<class ACH_BaseCop_C*>& Array, class UWBP_UI_Widget_BaseCounter_RinoHud_C* Target);
	void SetCiviesCount(TArray<class ACH_BaseCivilian_C*>& Array, class UWBP_UI_Widget_BaseCounter_RinoHud_C* FreeCiviesCounter);
	void SetNonDestroyedCamerasCount(TArray<class ASBZSecurityCamera*>& Array, class UWBP_UI_Widget_BaseCounter_RinoHud_C* Target);
	void SetHostages(class UWBP_UI_Widget_BaseCounter_RinoHud_C* All_Hostages, class UWBP_UI_Widget_BaseCounter_RinoHud_C* Tied_Hostages);
	void SetGuards(class UWBP_UI_Widget_BaseCounter_RinoHud_C* Target);
	void Set_Binary_Actor_Count(TArray<class ASBZReplicatedBinaryStateActor*>& Array, class UWBP_UI_Widget_BaseCounter_RinoHud_C* Target, bool CountOn);
	void setArtworkCount();
	void getDyedPilesCount(TArray<class ABP_SingleBagGeneratorBase_C*>& High, TArray<class ABP_SingleBagGeneratorBase_C*>& Low, int32* Count);
	void getFakeBagsCount(TArray<class ABP_InteractableMoneyPile_C*>& Array, int32* CountFake);
	void Get_Is_Not_Looted_Count(TArray<class ASBZInstantLoot*>& Array, int32* Count);
	void LoadConfig();
	void SetSimpleCounterByClass(TSubclassOf<class AActor> ActorClass, class UWBP_UI_Widget_BaseCounter_RinoHud_C* Target);
	void MethCount();
	void CountMethComponent(TArray<class ABP_MethIngredientBase_C*>& Ingredients, class UWBP_UI_Widget_BaseCounter_RinoHud_C* Counter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_RinoHud_TopRightSide_C">();
	}
	static class UWBP_UI_Widget_RinoHud_TopRightSide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_RinoHud_TopRightSide_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_RinoHud_TopRightSide_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_RinoHud_TopRightSide_C");
static_assert(sizeof(UWBP_UI_Widget_RinoHud_TopRightSide_C) == 0x0005A8, "Wrong size on UWBP_UI_Widget_RinoHud_TopRightSide_C");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, HB_Collectables) == 0x000298, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::HB_Collectables' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, HB_MissionSpecific) == 0x0002A0, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::HB_MissionSpecific' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, HB_Units) == 0x0002A8, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::HB_Units' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, PagerWidget_RinoHud) == 0x0002B0, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::PagerWidget_RinoHud' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, WBP_UI_Widget_Groups_Deployed) == 0x0002B8, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::WBP_UI_Widget_Groups_Deployed' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, WBP_UI_Widget_Groups_Timed) == 0x0002C0, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::WBP_UI_Widget_Groups_Timed' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, WBP_UI_Widget_Ping_RinoHud) == 0x0002C8, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::WBP_UI_Widget_Ping_RinoHud' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, Widget_FPSCounter) == 0x0002D0, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::Widget_FPSCounter' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, Config) == 0x0002D8, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::Config' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, ConfigBoolMap) == 0x000300, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::ConfigBoolMap' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, MethCookingStationTracker) == 0x000350, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::MethCookingStationTracker' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, BagsWidgets) == 0x0003A0, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::BagsWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, BagsCount) == 0x0003F0, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::BagsCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, BagsAliases) == 0x000440, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::BagsAliases' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, TimerHandles) == 0x000490, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::TimerHandles' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, IconsConfig) == 0x0004A0, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::IconsConfig' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, IconWidgets) == 0x0004F0, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::IconWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, TempCount) == 0x000540, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::TempCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, LevelName) == 0x000548, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::LevelName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RinoHud_TopRightSide_C, BagAdjustments) == 0x000558, "Member 'UWBP_UI_Widget_RinoHud_TopRightSide_C::BagAdjustments' has a wrong offset!");

}

