#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConsumableStatusWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_ConsumableStatusWidget.WBP_ConsumableStatusWidget_C.ExecuteUbergraph_WBP_ConsumableStatusWidget
// 0x0128 (0x0128 - 0x0000)
struct WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0058(0x0028)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x00A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPaperSprite>            K2Node_Event_InIcon;                               // 0x00D8(0x0030)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InAmmoInventory;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0110(0x0018)()
};
static_assert(alignof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget) == 0x000008, "Wrong alignment on WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget");
static_assert(sizeof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget) == 0x000128, "Wrong size on WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, EntryPoint) == 0x000000, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_MakeStruct_SlateColor_2) == 0x000058, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_Event_IsDesignTime) == 0x000080, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, Temp_object_Variable) == 0x000088, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_CustomEvent_Loaded) == 0x000090, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_DynamicCast_AsPaper_Sprite) == 0x000098, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x0000A8, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000D0, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_Event_InIcon) == 0x0000D8, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_Event_InIcon' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000108, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, K2Node_Event_InAmmoInventory) == 0x00010C, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::K2Node_Event_InAmmoInventory' has a wrong offset!");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000110, "Member 'WBP_ConsumableStatusWidget_C_ExecuteUbergraph_WBP_ConsumableStatusWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_ConsumableStatusWidget.WBP_ConsumableStatusWidget_C.OnConsumableCountChanged
// 0x0004 (0x0004 - 0x0000)
struct WBP_ConsumableStatusWidget_C_OnConsumableCountChanged final
{
public:
	int32                                         InAmmoInventory;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConsumableStatusWidget_C_OnConsumableCountChanged) == 0x000004, "Wrong alignment on WBP_ConsumableStatusWidget_C_OnConsumableCountChanged");
static_assert(sizeof(WBP_ConsumableStatusWidget_C_OnConsumableCountChanged) == 0x000004, "Wrong size on WBP_ConsumableStatusWidget_C_OnConsumableCountChanged");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_OnConsumableCountChanged, InAmmoInventory) == 0x000000, "Member 'WBP_ConsumableStatusWidget_C_OnConsumableCountChanged::InAmmoInventory' has a wrong offset!");

// Function WBP_ConsumableStatusWidget.WBP_ConsumableStatusWidget_C.OnIconChanged
// 0x0030 (0x0030 - 0x0000)
struct WBP_ConsumableStatusWidget_C_OnIconChanged final
{
public:
	TSoftObjectPtr<class UPaperSprite>            InIcon;                                            // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConsumableStatusWidget_C_OnIconChanged) == 0x000008, "Wrong alignment on WBP_ConsumableStatusWidget_C_OnIconChanged");
static_assert(sizeof(WBP_ConsumableStatusWidget_C_OnIconChanged) == 0x000030, "Wrong size on WBP_ConsumableStatusWidget_C_OnIconChanged");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_OnIconChanged, InIcon) == 0x000000, "Member 'WBP_ConsumableStatusWidget_C_OnIconChanged::InIcon' has a wrong offset!");

// Function WBP_ConsumableStatusWidget.WBP_ConsumableStatusWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ConsumableStatusWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ConsumableStatusWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ConsumableStatusWidget_C_PreConstruct");
static_assert(sizeof(WBP_ConsumableStatusWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_ConsumableStatusWidget_C_PreConstruct");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ConsumableStatusWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ConsumableStatusWidget.WBP_ConsumableStatusWidget_C.OnLoaded_AC50E81B4B424534C6A1EBB9707D1E24
// 0x0008 (0x0008 - 0x0000)
struct WBP_ConsumableStatusWidget_C_OnLoaded_AC50E81B4B424534C6A1EBB9707D1E24 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConsumableStatusWidget_C_OnLoaded_AC50E81B4B424534C6A1EBB9707D1E24) == 0x000008, "Wrong alignment on WBP_ConsumableStatusWidget_C_OnLoaded_AC50E81B4B424534C6A1EBB9707D1E24");
static_assert(sizeof(WBP_ConsumableStatusWidget_C_OnLoaded_AC50E81B4B424534C6A1EBB9707D1E24) == 0x000008, "Wrong size on WBP_ConsumableStatusWidget_C_OnLoaded_AC50E81B4B424534C6A1EBB9707D1E24");
static_assert(offsetof(WBP_ConsumableStatusWidget_C_OnLoaded_AC50E81B4B424534C6A1EBB9707D1E24, Loaded) == 0x000000, "Member 'WBP_ConsumableStatusWidget_C_OnLoaded_AC50E81B4B424534C6A1EBB9707D1E24::Loaded' has a wrong offset!");

}

