#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ScreenTitle

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ScreenTitle.WBP_ScreenTitle_C.ExecuteUbergraph_WBP_ScreenTitle
// 0x0070 (0x0070 - 0x0000)
struct WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0008(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           CallFunc_GetParent_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FName OldStackValue)> K2Node_CreateDelegate_OutputDelegate;           // 0x0048(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuStackScreenWidget*              K2Node_DynamicCast_AsSBZMenu_Stack_Screen_Widget;  // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle) == 0x000008, "Wrong alignment on WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle");
static_assert(sizeof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle) == 0x000070, "Wrong size on WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, EntryPoint) == 0x000000, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_CustomEvent_InText) == 0x000008, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_bool_Variable) == 0x000020, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_byte_Variable) == 0x000021, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_byte_Variable_1) == 0x000022, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_bool_Variable_1) == 0x000023, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_byte_Variable_2) == 0x000024, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, Temp_byte_Variable_3) == 0x000025, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, CallFunc_TextIsEmpty_ReturnValue) == 0x000026, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_Select_Default) == 0x000027, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_Event_IsDesignTime) == 0x000028, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000029, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_Select_Default_1) == 0x00002A, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, CallFunc_GetParent_ReturnValue) == 0x000030, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::CallFunc_GetParent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, CallFunc_GetOuterObject_ReturnValue) == 0x000038, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, CallFunc_GetOuterObject_ReturnValue_1) == 0x000040, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::CallFunc_GetOuterObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_DynamicCast_AsSBZMenu_Stack_Screen_Widget) == 0x000060, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_DynamicCast_AsSBZMenu_Stack_Screen_Widget' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_ScreenTitle_C_ExecuteUbergraph_WBP_ScreenTitle::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ScreenTitle.WBP_ScreenTitle_C.UpdateTitle
// 0x0018 (0x0018 - 0x0000)
struct WBP_ScreenTitle_C_UpdateTitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_ScreenTitle_C_UpdateTitle) == 0x000008, "Wrong alignment on WBP_ScreenTitle_C_UpdateTitle");
static_assert(sizeof(WBP_ScreenTitle_C_UpdateTitle) == 0x000018, "Wrong size on WBP_ScreenTitle_C_UpdateTitle");
static_assert(offsetof(WBP_ScreenTitle_C_UpdateTitle, InText) == 0x000000, "Member 'WBP_ScreenTitle_C_UpdateTitle::InText' has a wrong offset!");

// Function WBP_ScreenTitle.WBP_ScreenTitle_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ScreenTitle_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ScreenTitle_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ScreenTitle_C_PreConstruct");
static_assert(sizeof(WBP_ScreenTitle_C_PreConstruct) == 0x000001, "Wrong size on WBP_ScreenTitle_C_PreConstruct");
static_assert(offsetof(WBP_ScreenTitle_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ScreenTitle_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ScreenTitle.WBP_ScreenTitle_C.OnOwningStackScreenGainedFocus
// 0x0018 (0x0018 - 0x0000)
struct WBP_ScreenTitle_C_OnOwningStackScreenGainedFocus final
{
public:
	class FName                                   OldStackValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ScreenTitle_C_OnOwningStackScreenGainedFocus) == 0x000008, "Wrong alignment on WBP_ScreenTitle_C_OnOwningStackScreenGainedFocus");
static_assert(sizeof(WBP_ScreenTitle_C_OnOwningStackScreenGainedFocus) == 0x000018, "Wrong size on WBP_ScreenTitle_C_OnOwningStackScreenGainedFocus");
static_assert(offsetof(WBP_ScreenTitle_C_OnOwningStackScreenGainedFocus, OldStackValue) == 0x000000, "Member 'WBP_ScreenTitle_C_OnOwningStackScreenGainedFocus::OldStackValue' has a wrong offset!");
static_assert(offsetof(WBP_ScreenTitle_C_OnOwningStackScreenGainedFocus, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_ScreenTitle_C_OnOwningStackScreenGainedFocus::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

