#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConsumableStatusWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ConsumableStatusWidget.WBP_ConsumableStatusWidget_C
// 0x0028 (0x0330 - 0x0308)
class UWBP_ConsumableStatusWidget_C final : public UPD3ConsumableStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_98;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ToolImage;                                   // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ToolImage_BG;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_AmmoInventory;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ConsumableStatusWidget(int32 EntryPoint);
	void OnLoadoutLoaded();
	void OnConsumableCountChanged(int32 InAmmoInventory);
	void OnIconChanged(const TSoftObjectPtr<class UPaperSprite>& InIcon);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	void OnLoaded_AC50E81B4B424534C6A1EBB9707D1E24(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ConsumableStatusWidget_C">();
	}
	static class UWBP_ConsumableStatusWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ConsumableStatusWidget_C>();
	}
};
static_assert(alignof(UWBP_ConsumableStatusWidget_C) == 0x000008, "Wrong alignment on UWBP_ConsumableStatusWidget_C");
static_assert(sizeof(UWBP_ConsumableStatusWidget_C) == 0x000330, "Wrong size on UWBP_ConsumableStatusWidget_C");
static_assert(offsetof(UWBP_ConsumableStatusWidget_C, UberGraphFrame) == 0x000308, "Member 'UWBP_ConsumableStatusWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ConsumableStatusWidget_C, Image_98) == 0x000310, "Member 'UWBP_ConsumableStatusWidget_C::Image_98' has a wrong offset!");
static_assert(offsetof(UWBP_ConsumableStatusWidget_C, Image_ToolImage) == 0x000318, "Member 'UWBP_ConsumableStatusWidget_C::Image_ToolImage' has a wrong offset!");
static_assert(offsetof(UWBP_ConsumableStatusWidget_C, Image_ToolImage_BG) == 0x000320, "Member 'UWBP_ConsumableStatusWidget_C::Image_ToolImage_BG' has a wrong offset!");
static_assert(offsetof(UWBP_ConsumableStatusWidget_C, Text_AmmoInventory) == 0x000328, "Member 'UWBP_ConsumableStatusWidget_C::Text_AmmoInventory' has a wrong offset!");

}

