#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_Gamestart_Debug

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_SM_Gamestart_Debug.WBP_UI_SM_Gamestart_Debug_C
// 0x0098 (0x0328 - 0x0290)
class UWBP_UI_SM_Gamestart_Debug_C final : public USBZMainMenuDebug
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_Branch;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CameraDetails;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_Configuration;                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_CurrentRequest;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_CurrentState;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_EngineVersion;                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_GameVersion;                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_HostingProvider;                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_MatchmakingGroup;                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_MatchmakingProvider;                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_Namespace;                               // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_NetVersion;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_Platform;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_PlayerUserName;                          // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_SaveVersion;                             // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_SettingsEnvironment;                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Debug_MainMenuVersionText__C* Text_Time;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MainMenu_NetInfo_C*                WMainMenu_NetInfo;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_SM_Gamestart_Debug(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnMatchmakingGroupChange(int32 MMakingGroup);
	void OnTick();
	void OnInitialized();
	void UpdateGameState();
	void InitVersionString();
	void InitMatchmakingGroup(int32 inMMakingGroup);
	void UpdateTime();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_SM_Gamestart_Debug_C">();
	}
	static class UWBP_UI_SM_Gamestart_Debug_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_SM_Gamestart_Debug_C>();
	}
};
static_assert(alignof(UWBP_UI_SM_Gamestart_Debug_C) == 0x000008, "Wrong alignment on UWBP_UI_SM_Gamestart_Debug_C");
static_assert(sizeof(UWBP_UI_SM_Gamestart_Debug_C) == 0x000328, "Wrong size on UWBP_UI_SM_Gamestart_Debug_C");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_SM_Gamestart_Debug_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_Branch) == 0x000298, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_Branch' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_CameraDetails) == 0x0002A0, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_CameraDetails' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_Configuration) == 0x0002A8, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_Configuration' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_CurrentRequest) == 0x0002B0, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_CurrentRequest' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_CurrentState) == 0x0002B8, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_CurrentState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_EngineVersion) == 0x0002C0, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_EngineVersion' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_GameVersion) == 0x0002C8, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_GameVersion' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_HostingProvider) == 0x0002D0, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_HostingProvider' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_MatchmakingGroup) == 0x0002D8, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_MatchmakingGroup' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_MatchmakingProvider) == 0x0002E0, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_MatchmakingProvider' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_Namespace) == 0x0002E8, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_Namespace' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_NetVersion) == 0x0002F0, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_NetVersion' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_Platform) == 0x0002F8, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_Platform' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_PlayerUserName) == 0x000300, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_PlayerUserName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_SaveVersion) == 0x000308, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_SaveVersion' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_SettingsEnvironment) == 0x000310, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_SettingsEnvironment' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, Text_Time) == 0x000318, "Member 'UWBP_UI_SM_Gamestart_Debug_C::Text_Time' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_Gamestart_Debug_C, WMainMenu_NetInfo) == 0x000320, "Member 'UWBP_UI_SM_Gamestart_Debug_C::WMainMenu_NetInfo' has a wrong offset!");

}

