#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DailyChallengeReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DailyChallengeReward.WBP_DailyChallengeReward_C
// 0x0058 (0x02E8 - 0x0290)
class UWBP_DailyChallengeReward_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZUITextBlock*                        Amount_T;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_I;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSBZChallengeRewardItem                In_Reward_Item;                                    // 0x02A8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPaperSprite*                           GoldIcon;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ImageSize;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_DailyChallengeReward(int32 EntryPoint);
	void InitializeReward(const struct FSBZChallengeRewardItem& InRewardItem);
	void PreConstruct(bool IsDesignTime);
	void InitializeInfamyReward(int32 InInfamy);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DailyChallengeReward_C">();
	}
	static class UWBP_DailyChallengeReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DailyChallengeReward_C>();
	}
};
static_assert(alignof(UWBP_DailyChallengeReward_C) == 0x000008, "Wrong alignment on UWBP_DailyChallengeReward_C");
static_assert(sizeof(UWBP_DailyChallengeReward_C) == 0x0002E8, "Wrong size on UWBP_DailyChallengeReward_C");
static_assert(offsetof(UWBP_DailyChallengeReward_C, UberGraphFrame) == 0x000290, "Member 'UWBP_DailyChallengeReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengeReward_C, Amount_T) == 0x000298, "Member 'UWBP_DailyChallengeReward_C::Amount_T' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengeReward_C, Icon_I) == 0x0002A0, "Member 'UWBP_DailyChallengeReward_C::Icon_I' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengeReward_C, In_Reward_Item) == 0x0002A8, "Member 'UWBP_DailyChallengeReward_C::In_Reward_Item' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengeReward_C, GoldIcon) == 0x0002D8, "Member 'UWBP_DailyChallengeReward_C::GoldIcon' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengeReward_C, ImageSize) == 0x0002E0, "Member 'UWBP_DailyChallengeReward_C::ImageSize' has a wrong offset!");

}

