#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SuitInventoryScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_SuitInventoryScreen.WBP_UI_SuitInventoryScreen_C
// 0x0060 (0x04F8 - 0x0498)
class UWBP_UI_SuitInventoryScreen_C final : public USBZMainMenuSuitInventoryScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0498(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_BuyingSlots;                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                DummyButton;                                       // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ItemScrollBox;                                     // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenTitle_C*                     ScreenTitle;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ContentBackground_C*            WBP_UI_ContentBackground;                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_WeaponSlotDisplayPanel_C*       WBP_UI_WeaponSlotDisplayPanel;                     // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMenuButton*                         RT_Focusedbutton;                                  // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BlackMarketStackValue;                             // 0x04E0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         Last_RT_Focusedbutton;                             // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_SuitInventoryScreen(int32 EntryPoint);
	void OnSlotPriceChanged(const struct FSBZInventorySlotStoreItem& Item);
	void BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void OnEmptySlotSelected();
	void OnItemDiscarded(bool bWasSuccessful);
	void OnDiscardPressed();
	void OnTryBuySuitSlot();
	void OnCustomizePressed();
	void BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void SuitSlotButtonFocusedChanged(class USBZMenuButton* InFocusedButton, bool bIsFocused);
	void OnControlsReferenceClicked(class FName ActionName);
	void OnLostStackFocused();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void OnSlotPurchaseComplete(bool bWasSuccessful);
	class UWidget* Do_Custom_Navigation(EUINavigation Navigation_0);
	void UpdateBuyButtonControls();
	void SetActiveButton(class USBZMenuButton* NewButton);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_SuitInventoryScreen_C">();
	}
	static class UWBP_UI_SuitInventoryScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_SuitInventoryScreen_C>();
	}
};
static_assert(alignof(UWBP_UI_SuitInventoryScreen_C) == 0x000008, "Wrong alignment on UWBP_UI_SuitInventoryScreen_C");
static_assert(sizeof(UWBP_UI_SuitInventoryScreen_C) == 0x0004F8, "Wrong size on UWBP_UI_SuitInventoryScreen_C");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, UberGraphFrame) == 0x000498, "Member 'UWBP_UI_SuitInventoryScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, Intro) == 0x0004A0, "Member 'UWBP_UI_SuitInventoryScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, CanvasPanel_BuyingSlots) == 0x0004A8, "Member 'UWBP_UI_SuitInventoryScreen_C::CanvasPanel_BuyingSlots' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, DummyButton) == 0x0004B0, "Member 'UWBP_UI_SuitInventoryScreen_C::DummyButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, ItemScrollBox) == 0x0004B8, "Member 'UWBP_UI_SuitInventoryScreen_C::ItemScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, ScreenTitle) == 0x0004C0, "Member 'UWBP_UI_SuitInventoryScreen_C::ScreenTitle' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, WBP_UI_ContentBackground) == 0x0004C8, "Member 'UWBP_UI_SuitInventoryScreen_C::WBP_UI_ContentBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, WBP_UI_WeaponSlotDisplayPanel) == 0x0004D0, "Member 'UWBP_UI_SuitInventoryScreen_C::WBP_UI_WeaponSlotDisplayPanel' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, RT_Focusedbutton) == 0x0004D8, "Member 'UWBP_UI_SuitInventoryScreen_C::RT_Focusedbutton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, BlackMarketStackValue) == 0x0004E0, "Member 'UWBP_UI_SuitInventoryScreen_C::BlackMarketStackValue' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SuitInventoryScreen_C, Last_RT_Focusedbutton) == 0x0004F0, "Member 'UWBP_UI_SuitInventoryScreen_C::Last_RT_Focusedbutton' has a wrong offset!");

}

