#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser_ContractorSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerBrowser_ContractorSelector.WBP_ServerBrowser_ContractorSelector_C
// 0x0090 (0x0408 - 0x0378)
class UWBP_ServerBrowser_ContractorSelector_C final : public USBZSelectorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DistortionAnim;                                    // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_ContractorIcon;                              // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text_1;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text_2;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text_3;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, TSoftObjectPtr<class UPaperSprite>> ContractorIconMap;                       // 0x03B8(0x0050)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_WBP_ServerBrowser_ContractorSelector(int32 EntryPoint);
	void SetContractorSprite(TSoftObjectPtr<class UPaperSprite> ContractorSprite);
	void PreConstruct(bool IsDesignTime);
	void UpdateSelectionCount();
	void OnSelectionOptionChanged(int32 InCurrentIndex, bool bOverrideReadOnly);
	void OnLoaded_0B3A176146937A1A5B15A0B11F535FAF(class UObject* Loaded);
	void OnLoaded_51F23A4943941A9E9DE1DBB426DE1827(class UObject* Loaded);
	class FText GetContractorName();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerBrowser_ContractorSelector_C">();
	}
	static class UWBP_ServerBrowser_ContractorSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerBrowser_ContractorSelector_C>();
	}
};
static_assert(alignof(UWBP_ServerBrowser_ContractorSelector_C) == 0x000008, "Wrong alignment on UWBP_ServerBrowser_ContractorSelector_C");
static_assert(sizeof(UWBP_ServerBrowser_ContractorSelector_C) == 0x000408, "Wrong size on UWBP_ServerBrowser_ContractorSelector_C");
static_assert(offsetof(UWBP_ServerBrowser_ContractorSelector_C, UberGraphFrame) == 0x000378, "Member 'UWBP_ServerBrowser_ContractorSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorSelector_C, DistortionAnim) == 0x000380, "Member 'UWBP_ServerBrowser_ContractorSelector_C::DistortionAnim' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorSelector_C, Intro) == 0x000388, "Member 'UWBP_ServerBrowser_ContractorSelector_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorSelector_C, Image_ContractorIcon) == 0x000390, "Member 'UWBP_ServerBrowser_ContractorSelector_C::Image_ContractorIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorSelector_C, TinyTop_Text) == 0x000398, "Member 'UWBP_ServerBrowser_ContractorSelector_C::TinyTop_Text' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorSelector_C, TinyTop_Text_1) == 0x0003A0, "Member 'UWBP_ServerBrowser_ContractorSelector_C::TinyTop_Text_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorSelector_C, TinyTop_Text_2) == 0x0003A8, "Member 'UWBP_ServerBrowser_ContractorSelector_C::TinyTop_Text_2' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorSelector_C, TinyTop_Text_3) == 0x0003B0, "Member 'UWBP_ServerBrowser_ContractorSelector_C::TinyTop_Text_3' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorSelector_C, ContractorIconMap) == 0x0003B8, "Member 'UWBP_ServerBrowser_ContractorSelector_C::ContractorIconMap' has a wrong offset!");

}

