#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_SuitSlotStoreItemButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_SuitSlotStoreItemButton.WBP_UI_Inventory_SuitSlotStoreItemButton_C
// 0x0068 (0x03C8 - 0x0360)
class UWBP_UI_Inventory_SuitSlotStoreItemButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_CurrencyWidget_C*           CurrencyWidget;                                    // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_lockicon;                                    // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Button;                                    // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TextBlock_Name;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESBZCurrencyCode                              Currency;                                          // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Inventory_SuitSlotStoreItemButton(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void UpdateHighlights(bool IsFocused);
	void Set_Price(int64 Price, ESBZCurrencyCode Currency_0);
	void Get_Color_by_Currency(ESBZCurrencyCode Currency_0, struct FLinearColor* CurrencyColor);
	void OnHover(bool IsHover);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_SuitSlotStoreItemButton_C">();
	}
	static class UWBP_UI_Inventory_SuitSlotStoreItemButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_SuitSlotStoreItemButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_SuitSlotStoreItemButton_C");
static_assert(sizeof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C) == 0x0003C8, "Wrong size on UWBP_UI_Inventory_SuitSlotStoreItemButton_C");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, HoverAnim) == 0x000368, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, Border_Highlight) == 0x000370, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, CurrencyWidget) == 0x000378, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::CurrencyWidget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, Image) == 0x000380, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, Image_1) == 0x000388, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, Image_2) == 0x000390, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, Image_511) == 0x000398, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, Image_Background) == 0x0003A0, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, Image_lockicon) == 0x0003A8, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::Image_lockicon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, Overlay_Button) == 0x0003B0, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::Overlay_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, TextBlock_Name) == 0x0003B8, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitSlotStoreItemButton_C, Currency) == 0x0003C0, "Member 'UWBP_UI_Inventory_SuitSlotStoreItemButton_C::Currency' has a wrong offset!");

}

