#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Crimenet_SecurityCompanyDisplayPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Crimenet_SecurityCompanyDisplayPanel.WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C.ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel) == 0x000004, "Wrong alignment on WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel");
static_assert(sizeof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel) == 0x00000C, "Wrong size on WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel, EntryPoint) == 0x000000, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel, CallFunc_IsShippingBuild_ReturnValue) == 0x000004, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel, Temp_bool_Variable) == 0x000005, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel, Temp_byte_Variable) == 0x000006, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel, Temp_byte_Variable_1) == 0x000007, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel, K2Node_Select_Default) == 0x000008, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_Crimenet_SecurityCompanyDisplayPanel.WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C.UpdateSecurityCompanies
// 0x0080 (0x0080 - 0x0000)
struct WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue_1;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetEnumeratorValueFromIndex_ReturnValue;  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Crimenet_SecurityCompanyDetails_C* CallFunc_Create_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeLiteralInt_ReturnValue;               // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZUIData*                       CallFunc_GetUIData_ReturnValue;                    // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UPD3SecurityCompanyDataAsset> CallFunc_GetSecurityCompanyData_ReturnValue;  // 0x0048(0x0030)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies) == 0x000008, "Wrong alignment on WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies");
static_assert(sizeof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies) == 0x000080, "Wrong size on WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, Temp_int_Variable) == 0x000000, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, Temp_int_Variable_1) == 0x000004, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_Conv_IntToByte_ReturnValue) == 0x000008, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_GetValidValue_ReturnValue) == 0x000010, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_Conv_IntToByte_ReturnValue_1) == 0x000011, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_Conv_IntToByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_GetEnumeratorValueFromIndex_ReturnValue) == 0x000012, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_GetEnumeratorValueFromIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000014, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_Create_ReturnValue) == 0x000018, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, K2Node_MakeStruct_Margin) == 0x000020, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000030, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_MakeLiteralInt_ReturnValue) == 0x000038, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_MakeLiteralInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_Less_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_GetUIData_ReturnValue) == 0x000040, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_GetSecurityCompanyData_ReturnValue) == 0x000048, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_GetSecurityCompanyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000078, "Member 'WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C_UpdateSecurityCompanies::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");

}

