#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_WidgetDebugPing

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_WidgetDebugPing.WBP_UI_WidgetDebugPing_C.ExecuteUbergraph_WBP_UI_WidgetDebugPing
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_PingValue;                            // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0090(0x0018)()
};
static_assert(alignof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing) == 0x000008, "Wrong alignment on WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing");
static_assert(sizeof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing) == 0x0000A8, "Wrong size on WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing");
static_assert(offsetof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing, EntryPoint) == 0x000000, "Member 'WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing, K2Node_Event_PingValue) == 0x000004, "Member 'WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing::K2Node_Event_PingValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000088, "Member 'WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000090, "Member 'WBP_UI_WidgetDebugPing_C_ExecuteUbergraph_WBP_UI_WidgetDebugPing::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_WidgetDebugPing.WBP_UI_WidgetDebugPing_C.OnPingValueChanged
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_WidgetDebugPing_C_OnPingValueChanged final
{
public:
	int32                                         PingValue;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WidgetDebugPing_C_OnPingValueChanged) == 0x000004, "Wrong alignment on WBP_UI_WidgetDebugPing_C_OnPingValueChanged");
static_assert(sizeof(WBP_UI_WidgetDebugPing_C_OnPingValueChanged) == 0x000004, "Wrong size on WBP_UI_WidgetDebugPing_C_OnPingValueChanged");
static_assert(offsetof(WBP_UI_WidgetDebugPing_C_OnPingValueChanged, PingValue) == 0x000000, "Member 'WBP_UI_WidgetDebugPing_C_OnPingValueChanged::PingValue' has a wrong offset!");

}

