#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_YesNoToggleButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_YesNoToggleButton.WBP_UI_YesNoToggleButton_C
// 0x0038 (0x0398 - 0x0360)
class UWBP_UI_YesNoToggleButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Button_Border;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                No_Border;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        No_Text;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Yes_Border;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Yes_Text;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsYes;                                             // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_YesNoToggleButton(int32 EntryPoint);
	void ButtonFocusedChanged(bool bInHasFocus);
	void PreConstruct(bool IsDesignTime);
	void SetState(bool NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_YesNoToggleButton_C">();
	}
	static class UWBP_UI_YesNoToggleButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_YesNoToggleButton_C>();
	}
};
static_assert(alignof(UWBP_UI_YesNoToggleButton_C) == 0x000008, "Wrong alignment on UWBP_UI_YesNoToggleButton_C");
static_assert(sizeof(UWBP_UI_YesNoToggleButton_C) == 0x000398, "Wrong size on UWBP_UI_YesNoToggleButton_C");
static_assert(offsetof(UWBP_UI_YesNoToggleButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_YesNoToggleButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_YesNoToggleButton_C, Button_Border) == 0x000368, "Member 'UWBP_UI_YesNoToggleButton_C::Button_Border' has a wrong offset!");
static_assert(offsetof(UWBP_UI_YesNoToggleButton_C, No_Border) == 0x000370, "Member 'UWBP_UI_YesNoToggleButton_C::No_Border' has a wrong offset!");
static_assert(offsetof(UWBP_UI_YesNoToggleButton_C, No_Text) == 0x000378, "Member 'UWBP_UI_YesNoToggleButton_C::No_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_YesNoToggleButton_C, Yes_Border) == 0x000380, "Member 'UWBP_UI_YesNoToggleButton_C::Yes_Border' has a wrong offset!");
static_assert(offsetof(UWBP_UI_YesNoToggleButton_C, Yes_Text) == 0x000388, "Member 'UWBP_UI_YesNoToggleButton_C::Yes_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_YesNoToggleButton_C, IsYes) == 0x000390, "Member 'UWBP_UI_YesNoToggleButton_C::IsYes' has a wrong offset!");

}

