#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Cosmetic_SummedCost

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Cosmetic_SummedCost.WBP_UI_Cosmetic_SummedCost_C
// 0x0040 (0x02D0 - 0x0290)
class UWBP_UI_Cosmetic_SummedCost_C final : public UUserWidget
{
public:
	class UWBP_Widget_CurrencyWidget_C*           CashCost;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_CurrencyWidget_C*           CreditCost;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_CurrencyWidget_C*           GoldCost;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         LevelBox;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LevelText;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SeparatorText1;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SeparatorText2;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsCashCost;                                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsGoldCost;                                        // 0x02C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCreditCost;                                      // 0x02CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnoughLevel;                                     // 0x02CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         MinLevel;                                          // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Setup();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Cosmetic_SummedCost_C">();
	}
	static class UWBP_UI_Cosmetic_SummedCost_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Cosmetic_SummedCost_C>();
	}
};
static_assert(alignof(UWBP_UI_Cosmetic_SummedCost_C) == 0x000008, "Wrong alignment on UWBP_UI_Cosmetic_SummedCost_C");
static_assert(sizeof(UWBP_UI_Cosmetic_SummedCost_C) == 0x0002D0, "Wrong size on UWBP_UI_Cosmetic_SummedCost_C");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, CashCost) == 0x000290, "Member 'UWBP_UI_Cosmetic_SummedCost_C::CashCost' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, CreditCost) == 0x000298, "Member 'UWBP_UI_Cosmetic_SummedCost_C::CreditCost' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, GoldCost) == 0x0002A0, "Member 'UWBP_UI_Cosmetic_SummedCost_C::GoldCost' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, LevelBox) == 0x0002A8, "Member 'UWBP_UI_Cosmetic_SummedCost_C::LevelBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, LevelText) == 0x0002B0, "Member 'UWBP_UI_Cosmetic_SummedCost_C::LevelText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, SeparatorText1) == 0x0002B8, "Member 'UWBP_UI_Cosmetic_SummedCost_C::SeparatorText1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, SeparatorText2) == 0x0002C0, "Member 'UWBP_UI_Cosmetic_SummedCost_C::SeparatorText2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, IsCashCost) == 0x0002C8, "Member 'UWBP_UI_Cosmetic_SummedCost_C::IsCashCost' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, IsGoldCost) == 0x0002C9, "Member 'UWBP_UI_Cosmetic_SummedCost_C::IsGoldCost' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, IsCreditCost) == 0x0002CA, "Member 'UWBP_UI_Cosmetic_SummedCost_C::IsCreditCost' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, IsEnoughLevel) == 0x0002CB, "Member 'UWBP_UI_Cosmetic_SummedCost_C::IsEnoughLevel' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Cosmetic_SummedCost_C, MinLevel) == 0x0002CC, "Member 'UWBP_UI_Cosmetic_SummedCost_C::MinLevel' has a wrong offset!");

}

