#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Social_ReportPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Social_ReportPopup.WBP_MainMenu_Social_ReportPopup_C
// 0x0030 (0x02C0 - 0x0290)
class UWBP_MainMenu_Social_ReportPopup_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMultiLineEditableText*                 ReportCommentTextField;                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ReportPlayerLabel;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBoxBackground;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 ReportText;                                        // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup(int32 EntryPoint);
	void BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void SetPlayerName(const class FText& PlayerName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Social_ReportPopup_C">();
	}
	static class UWBP_MainMenu_Social_ReportPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Social_ReportPopup_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Social_ReportPopup_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_Social_ReportPopup_C");
static_assert(sizeof(UWBP_MainMenu_Social_ReportPopup_C) == 0x0002C0, "Wrong size on UWBP_MainMenu_Social_ReportPopup_C");
static_assert(offsetof(UWBP_MainMenu_Social_ReportPopup_C, UberGraphFrame) == 0x000290, "Member 'UWBP_MainMenu_Social_ReportPopup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Social_ReportPopup_C, ReportCommentTextField) == 0x000298, "Member 'UWBP_MainMenu_Social_ReportPopup_C::ReportCommentTextField' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Social_ReportPopup_C, ReportPlayerLabel) == 0x0002A0, "Member 'UWBP_MainMenu_Social_ReportPopup_C::ReportPlayerLabel' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Social_ReportPopup_C, TextBoxBackground) == 0x0002A8, "Member 'UWBP_MainMenu_Social_ReportPopup_C::TextBoxBackground' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Social_ReportPopup_C, ReportText) == 0x0002B0, "Member 'UWBP_MainMenu_Social_ReportPopup_C::ReportText' has a wrong offset!");

}

