#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_Module

#include "Basic.hpp"

#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Inventory_Module.WBP_Inventory_Module_C
// 0x0020 (0x0348 - 0x0328)
class UWBP_Inventory_Module_C final : public USBZMainMenuCosmeticPanel
{
public:
	class UButton*                                Button;                                            // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_150;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_ButtonContainer;                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Inventory_Module_C">();
	}
	static class UWBP_Inventory_Module_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Inventory_Module_C>();
	}
};
static_assert(alignof(UWBP_Inventory_Module_C) == 0x000008, "Wrong alignment on UWBP_Inventory_Module_C");
static_assert(sizeof(UWBP_Inventory_Module_C) == 0x000348, "Wrong size on UWBP_Inventory_Module_C");
static_assert(offsetof(UWBP_Inventory_Module_C, Button) == 0x000328, "Member 'UWBP_Inventory_Module_C::Button' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Module_C, Button_1) == 0x000330, "Member 'UWBP_Inventory_Module_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Module_C, Button_150) == 0x000338, "Member 'UWBP_Inventory_Module_C::Button_150' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Module_C, ScrollBox_ButtonContainer) == 0x000340, "Member 'UWBP_Inventory_Module_C::ScrollBox_ButtonContainer' has a wrong offset!");

}

