#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CompleteKeyCodes

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CompleteKeyCodes.WBP_CompleteKeyCodes_C
// 0x0060 (0x02F0 - 0x0290)
class UWBP_CompleteKeyCodes_C final : public UUserWidget
{
public:
	class UImage*                                 Image_59;                                          // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_372;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderBottom;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderLeft;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderRight;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderTop;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Border;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBlockBody;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeypadUVLightPossibleCode_C*       WBP_KeypadUVLightPossibleCode;                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeypadUVLightPossibleCode_C*       WBP_KeypadUVLightPossibleCode_1;                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeypadUVLightPossibleCode_C*       WBP_KeypadUVLightPossibleCode_2;                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_KeypadUVLightPossibleCode_C*       WBP_KeypadUVLightPossibleCode_3;                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnRep_CodePacket();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CompleteKeyCodes_C">();
	}
	static class UWBP_CompleteKeyCodes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CompleteKeyCodes_C>();
	}
};
static_assert(alignof(UWBP_CompleteKeyCodes_C) == 0x000008, "Wrong alignment on UWBP_CompleteKeyCodes_C");
static_assert(sizeof(UWBP_CompleteKeyCodes_C) == 0x0002F0, "Wrong size on UWBP_CompleteKeyCodes_C");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, Image_59) == 0x000290, "Member 'UWBP_CompleteKeyCodes_C::Image_59' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, Image_372) == 0x000298, "Member 'UWBP_CompleteKeyCodes_C::Image_372' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, Image_BorderBottom) == 0x0002A0, "Member 'UWBP_CompleteKeyCodes_C::Image_BorderBottom' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, Image_BorderLeft) == 0x0002A8, "Member 'UWBP_CompleteKeyCodes_C::Image_BorderLeft' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, Image_BorderRight) == 0x0002B0, "Member 'UWBP_CompleteKeyCodes_C::Image_BorderRight' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, Image_BorderTop) == 0x0002B8, "Member 'UWBP_CompleteKeyCodes_C::Image_BorderTop' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, Overlay_Border) == 0x0002C0, "Member 'UWBP_CompleteKeyCodes_C::Overlay_Border' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, TextBlockBody) == 0x0002C8, "Member 'UWBP_CompleteKeyCodes_C::TextBlockBody' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, WBP_KeypadUVLightPossibleCode) == 0x0002D0, "Member 'UWBP_CompleteKeyCodes_C::WBP_KeypadUVLightPossibleCode' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, WBP_KeypadUVLightPossibleCode_1) == 0x0002D8, "Member 'UWBP_CompleteKeyCodes_C::WBP_KeypadUVLightPossibleCode_1' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, WBP_KeypadUVLightPossibleCode_2) == 0x0002E0, "Member 'UWBP_CompleteKeyCodes_C::WBP_KeypadUVLightPossibleCode_2' has a wrong offset!");
static_assert(offsetof(UWBP_CompleteKeyCodes_C, WBP_KeypadUVLightPossibleCode_3) == 0x0002E8, "Member 'UWBP_CompleteKeyCodes_C::WBP_KeypadUVLightPossibleCode_3' has a wrong offset!");

}

