#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_WeaponStats

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_WeaponStats.WBP_UI_Widget_WeaponStats_C
// 0x0090 (0x0458 - 0x03C8)
class UWBP_UI_Widget_WeaponStats_C final : public USBZMainMenuWeaponStatsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           ProgressBar_WeaponStat_Accuracy_A;                 // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_Accuracy_B;                 // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_Damage_A;                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_Damage_B;                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_FireRate_A;                 // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_FireRate_B;                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_Handling_A;                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_Handling_B;                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_Recoil_A;                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_Recoil_B;                   // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_Stability_A;                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_WeaponStat_Stability_B;                // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_WeaponStat_Ammo_Divider;                      // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_WeaponStat_Ammo_Inventory;                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_WeaponStat_Ammo_Mag;                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_WeaponStat_FireMode;                          // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bFlipCompare;                                      // 0x0450(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_Widget_WeaponStats(int32 EntryPoint);
	void OnUpdateVisuals();
	void SetWeaponStat(class UProgressBar* ProgressBarA, class UProgressBar* ProgressBarB, float BaseStat, float CompareStat);
	void SetAmmoStat();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_WeaponStats_C">();
	}
	static class UWBP_UI_Widget_WeaponStats_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_WeaponStats_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_WeaponStats_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_WeaponStats_C");
static_assert(sizeof(UWBP_UI_Widget_WeaponStats_C) == 0x000458, "Wrong size on UWBP_UI_Widget_WeaponStats_C");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, UberGraphFrame) == 0x0003C8, "Member 'UWBP_UI_Widget_WeaponStats_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Accuracy_A) == 0x0003D0, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Accuracy_A' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Accuracy_B) == 0x0003D8, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Accuracy_B' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Damage_A) == 0x0003E0, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Damage_A' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Damage_B) == 0x0003E8, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Damage_B' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_FireRate_A) == 0x0003F0, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_FireRate_A' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_FireRate_B) == 0x0003F8, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_FireRate_B' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Handling_A) == 0x000400, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Handling_A' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Handling_B) == 0x000408, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Handling_B' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Recoil_A) == 0x000410, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Recoil_A' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Recoil_B) == 0x000418, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Recoil_B' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Stability_A) == 0x000420, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Stability_A' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, ProgressBar_WeaponStat_Stability_B) == 0x000428, "Member 'UWBP_UI_Widget_WeaponStats_C::ProgressBar_WeaponStat_Stability_B' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, Text_WeaponStat_Ammo_Divider) == 0x000430, "Member 'UWBP_UI_Widget_WeaponStats_C::Text_WeaponStat_Ammo_Divider' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, Text_WeaponStat_Ammo_Inventory) == 0x000438, "Member 'UWBP_UI_Widget_WeaponStats_C::Text_WeaponStat_Ammo_Inventory' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, Text_WeaponStat_Ammo_Mag) == 0x000440, "Member 'UWBP_UI_Widget_WeaponStats_C::Text_WeaponStat_Ammo_Mag' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, Text_WeaponStat_FireMode) == 0x000448, "Member 'UWBP_UI_Widget_WeaponStats_C::Text_WeaponStat_FireMode' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_WeaponStats_C, bFlipCompare) == 0x000450, "Member 'UWBP_UI_Widget_WeaponStats_C::bFlipCompare' has a wrong offset!");

}

