#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_WeaponStats

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_WeaponStats.WBP_UI_Widget_WeaponStats_C.ExecuteUbergraph_WBP_UI_Widget_WeaponStats
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	ESBZFireType                                  Temp_byte_Variable;                                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0088(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats) == 0x000008, "Wrong alignment on WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats");
static_assert(sizeof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats) == 0x0000A0, "Wrong size on WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats, Temp_text_Variable) == 0x000008, "Member 'WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats, Temp_text_Variable_1) == 0x000020, "Member 'WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats, Temp_text_Variable_2) == 0x000038, "Member 'WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats, Temp_text_Variable_3) == 0x000050, "Member 'WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats, Temp_text_Variable_4) == 0x000068, "Member 'WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats, Temp_byte_Variable) == 0x000080, "Member 'WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats, K2Node_Select_Default) == 0x000088, "Member 'WBP_UI_Widget_WeaponStats_C_ExecuteUbergraph_WBP_UI_Widget_WeaponStats::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_Widget_WeaponStats.WBP_UI_Widget_WeaponStats_C.SetWeaponStat
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Widget_WeaponStats_C_SetWeaponStat final
{
public:
	class UProgressBar*                           ProgressBarA;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBarB;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BaseStat;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CompareStat;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompare_ReturnValue;                   // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default_1;                           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat) == 0x000008, "Wrong alignment on WBP_UI_Widget_WeaponStats_C_SetWeaponStat");
static_assert(sizeof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat) == 0x000030, "Wrong size on WBP_UI_Widget_WeaponStats_C_SetWeaponStat");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, ProgressBarA) == 0x000000, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::ProgressBarA' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, ProgressBarB) == 0x000008, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::ProgressBarB' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, BaseStat) == 0x000010, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::BaseStat' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, CompareStat) == 0x000014, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::CompareStat' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, Temp_bool_Variable) == 0x000018, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, CallFunc_HasCompare_ReturnValue) == 0x000019, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::CallFunc_HasCompare_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, K2Node_Select_Default) == 0x00001C, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, Temp_bool_Variable_1) == 0x000020, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, K2Node_Select_Default_1) == 0x000024, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetWeaponStat, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_WeaponStats_C_SetWeaponStat::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_WeaponStats.WBP_UI_Widget_WeaponStats_C.SetAmmoStat
// 0x0218 (0x0218 - 0x0000)
struct WBP_UI_Widget_WeaponStats_C_SetAmmoStat final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          Temp_bool_Variable_1;                              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33[0x5];                                       // 0x0033(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0060(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0088(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_4;                    // 0x00B0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_5;                    // 0x00D8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_6;                    // 0x0100(0x0028)()
	int32                                         K2Node_Select_Default;                             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_1;                           // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0130(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0148(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0168(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x3];                                      // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_3;                           // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_3;             // 0x0190(0x0018)()
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AA[0x6];                                      // 0x01AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_4;             // 0x01B0(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_5;             // 0x01C8(0x0018)()
	bool                                          CallFunc_HasCompare_ReturnValue;                   // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_6;             // 0x01E8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_7;             // 0x0200(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat) == 0x000008, "Wrong alignment on WBP_UI_Widget_WeaponStats_C_SetAmmoStat");
static_assert(sizeof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat) == 0x000218, "Wrong size on WBP_UI_Widget_WeaponStats_C_SetAmmoStat");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, Temp_bool_Variable_1) == 0x000030, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, Temp_bool_Variable_2) == 0x000031, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, Temp_bool_Variable_3) == 0x000032, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_MakeStruct_SlateColor_2) == 0x000060, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_MakeStruct_SlateColor_3) == 0x000088, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_MakeStruct_SlateColor_4) == 0x0000B0, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_MakeStruct_SlateColor_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_MakeStruct_SlateColor_5) == 0x0000D8, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_MakeStruct_SlateColor_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_MakeStruct_SlateColor_6) == 0x000100, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_MakeStruct_SlateColor_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_Select_Default) == 0x000128, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_Select_Default_1) == 0x00012C, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Conv_IntToText_ReturnValue) == 0x000130, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000148, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000160, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000168, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Greater_IntInt_ReturnValue) == 0x000180, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_Select_Default_2) == 0x000184, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, K2Node_Select_Default_3) == 0x000188, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Conv_IntToText_ReturnValue_3) == 0x000190, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Conv_IntToText_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0001A8, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001A9, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Conv_IntToText_ReturnValue_4) == 0x0001B0, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Conv_IntToText_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Conv_IntToText_ReturnValue_5) == 0x0001C8, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Conv_IntToText_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_HasCompare_ReturnValue) == 0x0001E0, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_HasCompare_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Conv_IntToText_ReturnValue_6) == 0x0001E8, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Conv_IntToText_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_WeaponStats_C_SetAmmoStat, CallFunc_Conv_IntToText_ReturnValue_7) == 0x000200, "Member 'WBP_UI_Widget_WeaponStats_C_SetAmmoStat::CallFunc_Conv_IntToText_ReturnValue_7' has a wrong offset!");

}

