#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_BlackMarketVendors

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_BlackMarketVendors.WBP_UI_MainMenu_BlackMarketVendors_C
// 0x0098 (0x0630 - 0x0598)
class UWBP_UI_MainMenu_BlackMarketVendors_C final : public USBZBlackMarketVendorsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0598(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Tab_Change;                                        // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DisplayWelcome;                                    // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FetchingDataAnimation;                             // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_VendorInitialized;                     // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_VendorNotInitialized;                  // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenTitle_C*                     ScreenTitle;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_SettingsItems;                           // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_VendorMessage;                                // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Transaction_Overlay;                               // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ContentBackground_C*            WBP_UI_ContentBackground;                          // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_WeaponSlotDisplayPanel_C*       Widget_ItemDescription;                            // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMenuButton*                         ActiveButton;                                      // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZVendorData*                         CurrentVendorData;                                 // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumOfShopItemsPerRow;                              // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_614[0x4];                                      // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         LastActiveButton;                                  // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZBlackMarketVendorType                     OpenedFromLocation;                                // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x3];                                      // 0x0621(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   PreviousStack;                                     // 0x0624(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_BlackMarketVendors(int32 EntryPoint);
	void OnInitialized();
	void OnTransactionProgressChanged(bool bInIsTransactionInProgress, bool bIsTransactionSuccessful);
	void OnInspectPressed();
	void OnLostStackFocused();
	void OnVendorButtonFocused(class USBZMenuButton* InButton, bool bIsFocused);
	void OnVendorItemButtonFocused(class USBZMenuButton* InButton, bool bIsFocused);
	void OnControlsReferenceClicked(class FName InActionInput);
	void OnVendorItemTransactionComplete(ESBZMetaRequestResult MetaResult, const class USBZInventoryBaseData* InventoryItemData);
	void OnGainedStackFocused(const class FName& PreviousValue);
	void OnVendorChanged(const struct FSBZBlackMarketUIVendorData& NewVendor, bool bIsRefresh);
	void InitializeVendorData(class USBZVendorData* InVendorData);
	void InitializeIsFetchingData(bool bIsFetchingData);
	void DisplayVendorWelcomeMessage();
	void DisplayVendorMessage(const class FText& TextToDisplay);
	void SetButtonFocus();
	void OnPaydayStoreReferencePressed(class FName ActionName);
	void OpenPaydayStore();
	class UWidget* CustomBoundryNavigation(EUINavigation Navigation_0);
	void SetActiveButton(class USBZMenuButton* NewButton);
	void NavToPreviousScreen();
	void OpenInventoryScreen();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_BlackMarketVendors_C">();
	}
	static class UWBP_UI_MainMenu_BlackMarketVendors_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_BlackMarketVendors_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_BlackMarketVendors_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_BlackMarketVendors_C");
static_assert(sizeof(UWBP_UI_MainMenu_BlackMarketVendors_C) == 0x000630, "Wrong size on UWBP_UI_MainMenu_BlackMarketVendors_C");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, UberGraphFrame) == 0x000598, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, Tab_Change) == 0x0005A0, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::Tab_Change' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, Intro) == 0x0005A8, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, DisplayWelcome) == 0x0005B0, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::DisplayWelcome' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, FetchingDataAnimation) == 0x0005B8, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::FetchingDataAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, CanvasPanel_VendorInitialized) == 0x0005C0, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::CanvasPanel_VendorInitialized' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, CanvasPanel_VendorNotInitialized) == 0x0005C8, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::CanvasPanel_VendorNotInitialized' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, ScreenTitle) == 0x0005D0, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::ScreenTitle' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, ScrollBox_SettingsItems) == 0x0005D8, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::ScrollBox_SettingsItems' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, Text_VendorMessage) == 0x0005E0, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::Text_VendorMessage' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, Transaction_Overlay) == 0x0005E8, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::Transaction_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, WBP_UI_ContentBackground) == 0x0005F0, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::WBP_UI_ContentBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, Widget_ItemDescription) == 0x0005F8, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::Widget_ItemDescription' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, ActiveButton) == 0x000600, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::ActiveButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, CurrentVendorData) == 0x000608, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::CurrentVendorData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, NumOfShopItemsPerRow) == 0x000610, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::NumOfShopItemsPerRow' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, LastActiveButton) == 0x000618, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::LastActiveButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, OpenedFromLocation) == 0x000620, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::OpenedFromLocation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendors_C, PreviousStack) == 0x000624, "Member 'UWBP_UI_MainMenu_BlackMarketVendors_C::PreviousStack' has a wrong offset!");

}

