#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PlayerCarryStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_PlayerCarryStatus.WBP_UI_Widget_PlayerCarryStatus_C
// 0x0038 (0x0320 - 0x02E8)
class UWBP_UI_Widget_PlayerCarryStatus_C final : public UPD3HUDPlayerCarryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       VisibleFadeOut;                                    // 0x02F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       VisibleFadeIn;                                     // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BackgroundImage;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ItemBox;                                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text;                                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_PlayerCarryStatus(int32 EntryPoint);
	void OnCarryTypeDropped(const class USBZCarryType* DroppedCarryType);
	void OnCarryTypePickedUp(const class USBZCarryType* PickedUpCarryType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_PlayerCarryStatus_C">();
	}
	static class UWBP_UI_Widget_PlayerCarryStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_PlayerCarryStatus_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_PlayerCarryStatus_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_PlayerCarryStatus_C");
static_assert(sizeof(UWBP_UI_Widget_PlayerCarryStatus_C) == 0x000320, "Wrong size on UWBP_UI_Widget_PlayerCarryStatus_C");
static_assert(offsetof(UWBP_UI_Widget_PlayerCarryStatus_C, UberGraphFrame) == 0x0002E8, "Member 'UWBP_UI_Widget_PlayerCarryStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerCarryStatus_C, VisibleFadeOut) == 0x0002F0, "Member 'UWBP_UI_Widget_PlayerCarryStatus_C::VisibleFadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerCarryStatus_C, VisibleFadeIn) == 0x0002F8, "Member 'UWBP_UI_Widget_PlayerCarryStatus_C::VisibleFadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerCarryStatus_C, Image_BackgroundImage) == 0x000300, "Member 'UWBP_UI_Widget_PlayerCarryStatus_C::Image_BackgroundImage' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerCarryStatus_C, ItemBox) == 0x000308, "Member 'UWBP_UI_Widget_PlayerCarryStatus_C::ItemBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerCarryStatus_C, Text) == 0x000310, "Member 'UWBP_UI_Widget_PlayerCarryStatus_C::Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerCarryStatus_C, Count) == 0x000318, "Member 'UWBP_UI_Widget_PlayerCarryStatus_C::Count' has a wrong offset!");

}

