#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_PreplanningItemVisuals

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_PreplanningItemVisuals.WBP_UI_PreplanningItemVisuals_C
// 0x0068 (0x0320 - 0x02B8)
class UWBP_UI_PreplanningItemVisuals_C final : public USBZBaseInventoryItemVisualsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_I;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Add;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LeftBar_I;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PPAIcon_I;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_EmptyState;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_PrePlanningName;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              Image_size;                                        // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSelectedOptions;                                 // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_PreplanningItemVisuals(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SpriteLoaded(class UPaperSprite* OutLoadedSprite);
	void EmptySet();
	void ItemInitialized(const class USBZInventoryBaseData* NewItem);
	void SetDisplayName(class USBZPreplanningAssetData* InPrePlanningAsset);
	void SetIcon(class UPaperSprite* InDisplayIcon);
	void InitializeItemVisuals(class USBZPreplanningAssetData* InPreplanningItem);
	void InitializeEmptyVisuals();
	void OnFocus(bool IsFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_PreplanningItemVisuals_C">();
	}
	static class UWBP_UI_PreplanningItemVisuals_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_PreplanningItemVisuals_C>();
	}
};
static_assert(alignof(UWBP_UI_PreplanningItemVisuals_C) == 0x000008, "Wrong alignment on UWBP_UI_PreplanningItemVisuals_C");
static_assert(sizeof(UWBP_UI_PreplanningItemVisuals_C) == 0x000320, "Wrong size on UWBP_UI_PreplanningItemVisuals_C");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_UI_PreplanningItemVisuals_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, Background_I) == 0x0002C0, "Member 'UWBP_UI_PreplanningItemVisuals_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, Image_3) == 0x0002C8, "Member 'UWBP_UI_PreplanningItemVisuals_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, Image_4) == 0x0002D0, "Member 'UWBP_UI_PreplanningItemVisuals_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, Image_5) == 0x0002D8, "Member 'UWBP_UI_PreplanningItemVisuals_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, Image_6) == 0x0002E0, "Member 'UWBP_UI_PreplanningItemVisuals_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, Image_Add) == 0x0002E8, "Member 'UWBP_UI_PreplanningItemVisuals_C::Image_Add' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, LeftBar_I) == 0x0002F0, "Member 'UWBP_UI_PreplanningItemVisuals_C::LeftBar_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, PPAIcon_I) == 0x0002F8, "Member 'UWBP_UI_PreplanningItemVisuals_C::PPAIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, Text_EmptyState) == 0x000300, "Member 'UWBP_UI_PreplanningItemVisuals_C::Text_EmptyState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, Text_PrePlanningName) == 0x000308, "Member 'UWBP_UI_PreplanningItemVisuals_C::Text_PrePlanningName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, Image_size) == 0x000310, "Member 'UWBP_UI_PreplanningItemVisuals_C::Image_size' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemVisuals_C, IsSelectedOptions) == 0x000318, "Member 'UWBP_UI_PreplanningItemVisuals_C::IsSelectedOptions' has a wrong offset!");

}

