#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_Overlay_SubObjective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_Overlay_SubObjective.WBP_UI_Widget_Overlay_SubObjective_C
// 0x0048 (0x0340 - 0x02F8)
class UWBP_UI_Widget_Overlay_SubObjective_C final : public USBZObjectiveWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CompletedAnimation;                                // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FailedAnimation;                                   // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_CheckBox;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Crossout;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OnComplete;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Failed;                                       // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ObjectiveIntel;                               // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_Overlay_SubObjective(int32 EntryPoint);
	void WidgetAnimationEvt_CompletedAnimation_K2Node_WidgetAnimationEvent_1();
	void WidgetAnimationEvt_FailedAnimation_K2Node_WidgetAnimationEvent_0();
	void ObjectiveDisabled(class ASBZObjective* Param_ObjectiveDisabled_0);
	void ObjectiveFailed(class ASBZObjective* Param_ObjectiveFailed_0);
	void ObjectiveCompleted(class ASBZObjective* Param_ObjectiveCompleted_0);
	void ObjectiveActivated(class ASBZObjective* Param_ObjectiveActivated_0);
	void OnObjectiveInitialized(class ASBZObjective* ObjectiveInit, bool bIsSubObjective);
	void SetObjectiveIntel(class ASBZObjective* Objective_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_Overlay_SubObjective_C">();
	}
	static class UWBP_UI_Widget_Overlay_SubObjective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_Overlay_SubObjective_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_Overlay_SubObjective_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_Overlay_SubObjective_C");
static_assert(sizeof(UWBP_UI_Widget_Overlay_SubObjective_C) == 0x000340, "Wrong size on UWBP_UI_Widget_Overlay_SubObjective_C");
static_assert(offsetof(UWBP_UI_Widget_Overlay_SubObjective_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_UI_Widget_Overlay_SubObjective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Overlay_SubObjective_C, CompletedAnimation) == 0x000300, "Member 'UWBP_UI_Widget_Overlay_SubObjective_C::CompletedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Overlay_SubObjective_C, FailedAnimation) == 0x000308, "Member 'UWBP_UI_Widget_Overlay_SubObjective_C::FailedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Overlay_SubObjective_C, Image_Background) == 0x000310, "Member 'UWBP_UI_Widget_Overlay_SubObjective_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Overlay_SubObjective_C, Image_CheckBox) == 0x000318, "Member 'UWBP_UI_Widget_Overlay_SubObjective_C::Image_CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Overlay_SubObjective_C, Image_Crossout) == 0x000320, "Member 'UWBP_UI_Widget_Overlay_SubObjective_C::Image_Crossout' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Overlay_SubObjective_C, Image_OnComplete) == 0x000328, "Member 'UWBP_UI_Widget_Overlay_SubObjective_C::Image_OnComplete' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Overlay_SubObjective_C, Text_Failed) == 0x000330, "Member 'UWBP_UI_Widget_Overlay_SubObjective_C::Text_Failed' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Overlay_SubObjective_C, Text_ObjectiveIntel) == 0x000338, "Member 'UWBP_UI_Widget_Overlay_SubObjective_C::Text_ObjectiveIntel' has a wrong offset!");

}

