#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser_ContractorOptions

#include "Basic.hpp"

#include "S_ContractorHeists_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C
// 0x0138 (0x03C8 - 0x0290)
class UWBP_ServerBrowser_ContractorOptions_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Applied;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Intro;                                             // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TabChange;                                         // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_ServerBrowser_InspectButton_C*     ApplyButton;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ContractorOptions_Ws;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerBrowser_ContractorSelector_C* ContractorSelector;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerBrowser_DifficultyFilter_C*  DifficultyFilter;                                  // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZScrollBox*                          Heists_Sb;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerBrowser_DifficultyFilter_C*  TacticFilter;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Title_T;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_YesNo_LineItem_MenuButton_C*       WBP_All_Default;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ServerBrowser_Navbar_C*            WBP_ServerBrowser_Navbar;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FString, struct FS_ContractorHeists> ContractorOwnedHeistMap;                         // 0x02F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FSBZServerBrowserHeistCollection> OwnedHeists;                                     // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsConstructed;                                     // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, bool>                     ActiveHeists;                                      // 0x0360(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(TArray<struct FSBZServerBrowserHeistLevel>& HeistDataFilters, int32 DifficultyFilterIndex, int32 TacticFilterIndex)> SendFiltersToApply; // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          AllButtonState;                                    // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions(int32 EntryPoint);
	void BndEvt__WBP_ServerBrowser_ContractorOptions_TacticFilter_K2Node_ComponentBoundEvent_3_SBZOnSelectorOptionChanged__DelegateSignature(int32 NewIndex);
	void ResetAllFilters();
	void BndEvt__WBP_ServerBrowser_ContractorOptions_DifficultyFilter_K2Node_ComponentBoundEvent_0_SBZOnSelectorOptionChanged__DelegateSignature(int32 NewIndex);
	void BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_InspectButton_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_Navbar_K2Node_ComponentBoundEvent_1_OnIndexChanged__DelegateSignature(int32 NewIndex);
	void PreConstruct(bool IsDesignTime);
	void AllHeistsUpdated(const class FText& HeistTitle, bool IsHeistActive);
	void HeistLineItemUpdated(const class FText& HeistTitle, bool IsHeistActive);
	void UpdateOwnedHeistMap();
	void PopulateOwnedHeistMap(bool* FoundHeists);
	void AddDataToSelector();
	void SetOwnedHeists(TArray<struct FSBZServerBrowserHeistCollection>& InOwnedHeists);
	void CheckOwnedHeists(const class FString& InHeistToFind, bool* Found, struct FSBZServerBrowserHeistLevel* HeistData);
	void AddOwnedHeistsToScrollBox();
	void RevealHeistsForContractor(const class FString& Key);
	void FindHeistInScrollBox(const class FText& HeistNameToFind, bool* Found, class UWBP_YesNo_LineItem_MenuButton_C** ItemRef);
	void ResetAllHeistsInScrollBox();
	void UpdateAllDefaultState();
	void GetHeistDataForActiveHeists(TArray<struct FSBZServerBrowserHeistLevel>* ActiveHeistData);
	class UWidget* CustomUpNav_ForItemsBelowScrollbox(EUINavigation Navigation_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerBrowser_ContractorOptions_C">();
	}
	static class UWBP_ServerBrowser_ContractorOptions_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerBrowser_ContractorOptions_C>();
	}
};
static_assert(alignof(UWBP_ServerBrowser_ContractorOptions_C) == 0x000008, "Wrong alignment on UWBP_ServerBrowser_ContractorOptions_C");
static_assert(sizeof(UWBP_ServerBrowser_ContractorOptions_C) == 0x0003C8, "Wrong size on UWBP_ServerBrowser_ContractorOptions_C");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, UberGraphFrame) == 0x000290, "Member 'UWBP_ServerBrowser_ContractorOptions_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, Applied) == 0x000298, "Member 'UWBP_ServerBrowser_ContractorOptions_C::Applied' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, Intro) == 0x0002A0, "Member 'UWBP_ServerBrowser_ContractorOptions_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, TabChange) == 0x0002A8, "Member 'UWBP_ServerBrowser_ContractorOptions_C::TabChange' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, ApplyButton) == 0x0002B0, "Member 'UWBP_ServerBrowser_ContractorOptions_C::ApplyButton' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, ContractorOptions_Ws) == 0x0002B8, "Member 'UWBP_ServerBrowser_ContractorOptions_C::ContractorOptions_Ws' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, ContractorSelector) == 0x0002C0, "Member 'UWBP_ServerBrowser_ContractorOptions_C::ContractorSelector' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, DifficultyFilter) == 0x0002C8, "Member 'UWBP_ServerBrowser_ContractorOptions_C::DifficultyFilter' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, Heists_Sb) == 0x0002D0, "Member 'UWBP_ServerBrowser_ContractorOptions_C::Heists_Sb' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, TacticFilter) == 0x0002D8, "Member 'UWBP_ServerBrowser_ContractorOptions_C::TacticFilter' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, Title_T) == 0x0002E0, "Member 'UWBP_ServerBrowser_ContractorOptions_C::Title_T' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, WBP_All_Default) == 0x0002E8, "Member 'UWBP_ServerBrowser_ContractorOptions_C::WBP_All_Default' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, WBP_ServerBrowser_Navbar) == 0x0002F0, "Member 'UWBP_ServerBrowser_ContractorOptions_C::WBP_ServerBrowser_Navbar' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, ContractorOwnedHeistMap) == 0x0002F8, "Member 'UWBP_ServerBrowser_ContractorOptions_C::ContractorOwnedHeistMap' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, OwnedHeists) == 0x000348, "Member 'UWBP_ServerBrowser_ContractorOptions_C::OwnedHeists' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, IsConstructed) == 0x000358, "Member 'UWBP_ServerBrowser_ContractorOptions_C::IsConstructed' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, ActiveHeists) == 0x000360, "Member 'UWBP_ServerBrowser_ContractorOptions_C::ActiveHeists' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, SendFiltersToApply) == 0x0003B0, "Member 'UWBP_ServerBrowser_ContractorOptions_C::SendFiltersToApply' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_ContractorOptions_C, AllButtonState) == 0x0003C0, "Member 'UWBP_ServerBrowser_ContractorOptions_C::AllButtonState' has a wrong offset!");

}

