#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SafehouseMainMenu

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_SafehouseMainMenu.WBP_UI_SafehouseMainMenu_C
// 0x0048 (0x02E8 - 0x02A0)
class UWBP_UI_SafehouseMainMenu_C final : public USBZMenuStackWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_NavBar_C*                       WBP_UI_NavBar;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_MainMenu_CrimeNet_C*            Widget_CrimeNet;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_MainMenu_CrimeNet_HeistSelection_C* Widget_HeistSelection;                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_SM_Lobby_C*                     Widget_Lobby;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_SafehouseMenu_More_C*           Widget_More;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_MainMenu_Replay_C*              Widget_Replay;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C* Widget_ServerBrowser;                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_SafehouseMainMenu(int32 EntryPoint);
	void OnLobbyEntered();
	void OnRemovedFromStack();
	void OnAddedToStack();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_SafehouseMainMenu_C">();
	}
	static class UWBP_UI_SafehouseMainMenu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_SafehouseMainMenu_C>();
	}
};
static_assert(alignof(UWBP_UI_SafehouseMainMenu_C) == 0x000008, "Wrong alignment on UWBP_UI_SafehouseMainMenu_C");
static_assert(sizeof(UWBP_UI_SafehouseMainMenu_C) == 0x0002E8, "Wrong size on UWBP_UI_SafehouseMainMenu_C");
static_assert(offsetof(UWBP_UI_SafehouseMainMenu_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_UI_SafehouseMainMenu_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SafehouseMainMenu_C, Image_Background) == 0x0002A8, "Member 'UWBP_UI_SafehouseMainMenu_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SafehouseMainMenu_C, WBP_UI_NavBar) == 0x0002B0, "Member 'UWBP_UI_SafehouseMainMenu_C::WBP_UI_NavBar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SafehouseMainMenu_C, Widget_CrimeNet) == 0x0002B8, "Member 'UWBP_UI_SafehouseMainMenu_C::Widget_CrimeNet' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SafehouseMainMenu_C, Widget_HeistSelection) == 0x0002C0, "Member 'UWBP_UI_SafehouseMainMenu_C::Widget_HeistSelection' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SafehouseMainMenu_C, Widget_Lobby) == 0x0002C8, "Member 'UWBP_UI_SafehouseMainMenu_C::Widget_Lobby' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SafehouseMainMenu_C, Widget_More) == 0x0002D0, "Member 'UWBP_UI_SafehouseMainMenu_C::Widget_More' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SafehouseMainMenu_C, Widget_Replay) == 0x0002D8, "Member 'UWBP_UI_SafehouseMainMenu_C::Widget_Replay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SafehouseMainMenu_C, Widget_ServerBrowser) == 0x0002E0, "Member 'UWBP_UI_SafehouseMainMenu_C::Widget_ServerBrowser' has a wrong offset!");

}

