#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser_Popup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerBrowser_Popup.WBP_ServerBrowser_Popup_C
// 0x00A0 (0x0330 - 0x0290)
class UWBP_ServerBrowser_Popup_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       AppearAnim;                                        // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Brackets_O;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        FailReason_T;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Title_T;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 FailReason;                                        // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FSlateFontInfo                         In_Font_Info;                                      // 0x02C8(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          ShowFailReason;                                    // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_ServerBrowser_Popup(int32 EntryPoint);
	void Construct();
	void RemoveFontMaterial();
	void SequenceEvent__ENTRYPOINTWBP_ServerBrowser_Popup_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerBrowser_Popup_C">();
	}
	static class UWBP_ServerBrowser_Popup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerBrowser_Popup_C>();
	}
};
static_assert(alignof(UWBP_ServerBrowser_Popup_C) == 0x000008, "Wrong alignment on UWBP_ServerBrowser_Popup_C");
static_assert(sizeof(UWBP_ServerBrowser_Popup_C) == 0x000330, "Wrong size on UWBP_ServerBrowser_Popup_C");
static_assert(offsetof(UWBP_ServerBrowser_Popup_C, UberGraphFrame) == 0x000290, "Member 'UWBP_ServerBrowser_Popup_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_Popup_C, AppearAnim) == 0x000298, "Member 'UWBP_ServerBrowser_Popup_C::AppearAnim' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_Popup_C, Brackets_O) == 0x0002A0, "Member 'UWBP_ServerBrowser_Popup_C::Brackets_O' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_Popup_C, FailReason_T) == 0x0002A8, "Member 'UWBP_ServerBrowser_Popup_C::FailReason_T' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_Popup_C, Title_T) == 0x0002B0, "Member 'UWBP_ServerBrowser_Popup_C::Title_T' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_Popup_C, FailReason) == 0x0002B8, "Member 'UWBP_ServerBrowser_Popup_C::FailReason' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_Popup_C, In_Font_Info) == 0x0002C8, "Member 'UWBP_ServerBrowser_Popup_C::In_Font_Info' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_Popup_C, ShowFailReason) == 0x000328, "Member 'UWBP_ServerBrowser_Popup_C::ShowFailReason' has a wrong offset!");

}

