#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_2.WBP_Menu_2_C
// 0x00F0 (0x0380 - 0x0290)
class UWBP_Menu_2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               BackButton;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Button1_1;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Button1_2;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_304;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_349;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_372;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_685;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderBottom;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderLeft;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderRight;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderTop;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ovelay;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ovelay_Button;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ovelay_NoUse;                                  // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_78;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Border;                                    // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_71;                                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_119;                                     // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Normal;                                            // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hover;                                             // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_2(int32 EntryPoint);
	void SetButton_Text(const class FString& ButtonInfoText, const class FString& ButtonText);
	void SetButtonFocus(bool Condition);
	void SetButtonGreyedOut();
	void SetBackFocus(bool NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_2_C">();
	}
	static class UWBP_Menu_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_2_C>();
	}
};
static_assert(alignof(UWBP_Menu_2_C) == 0x000008, "Wrong alignment on UWBP_Menu_2_C");
static_assert(sizeof(UWBP_Menu_2_C) == 0x000380, "Wrong size on UWBP_Menu_2_C");
static_assert(offsetof(UWBP_Menu_2_C, UberGraphFrame) == 0x000290, "Member 'UWBP_Menu_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, BackButton) == 0x000298, "Member 'UWBP_Menu_2_C::BackButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Button1_1) == 0x0002A0, "Member 'UWBP_Menu_2_C::Button1_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Button1_2) == 0x0002A8, "Member 'UWBP_Menu_2_C::Button1_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image) == 0x0002B0, "Member 'UWBP_Menu_2_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_2) == 0x0002B8, "Member 'UWBP_Menu_2_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_3) == 0x0002C0, "Member 'UWBP_Menu_2_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_4) == 0x0002C8, "Member 'UWBP_Menu_2_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_5) == 0x0002D0, "Member 'UWBP_Menu_2_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_304) == 0x0002D8, "Member 'UWBP_Menu_2_C::Image_304' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_349) == 0x0002E0, "Member 'UWBP_Menu_2_C::Image_349' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_372) == 0x0002E8, "Member 'UWBP_Menu_2_C::Image_372' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_685) == 0x0002F0, "Member 'UWBP_Menu_2_C::Image_685' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_BorderBottom) == 0x0002F8, "Member 'UWBP_Menu_2_C::Image_BorderBottom' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_BorderLeft) == 0x000300, "Member 'UWBP_Menu_2_C::Image_BorderLeft' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_BorderRight) == 0x000308, "Member 'UWBP_Menu_2_C::Image_BorderRight' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Image_BorderTop) == 0x000310, "Member 'UWBP_Menu_2_C::Image_BorderTop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Img_ovelay) == 0x000318, "Member 'UWBP_Menu_2_C::Img_ovelay' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Img_ovelay_Button) == 0x000320, "Member 'UWBP_Menu_2_C::Img_ovelay_Button' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Img_ovelay_NoUse) == 0x000328, "Member 'UWBP_Menu_2_C::Img_ovelay_NoUse' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Logo) == 0x000330, "Member 'UWBP_Menu_2_C::Logo' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Overlay) == 0x000338, "Member 'UWBP_Menu_2_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Overlay_78) == 0x000340, "Member 'UWBP_Menu_2_C::Overlay_78' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Overlay_Border) == 0x000348, "Member 'UWBP_Menu_2_C::Overlay_Border' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, TextBlock_71) == 0x000350, "Member 'UWBP_Menu_2_C::TextBlock_71' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, TextBlock_119) == 0x000358, "Member 'UWBP_Menu_2_C::TextBlock_119' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Normal) == 0x000360, "Member 'UWBP_Menu_2_C::Normal' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_2_C, Hover) == 0x000370, "Member 'UWBP_Menu_2_C::Hover' has a wrong offset!");

}

