#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_CrosshairVisuals

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_CrosshairVisuals.WBP_UI_Widget_CrosshairVisuals_C
// 0x0078 (0x0308 - 0x0290)
class UWBP_UI_Widget_CrosshairVisuals_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Bottom;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Left;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Reticle;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Right;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Top;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Crosshair;                                 // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Right;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           CrosshairBarColour;                                // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CrosshairDotColour;                                // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BarWidth;                                          // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BarLength;                                         // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DotSize;                                           // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMaxSpreadEnabled;                                // 0x02FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NewVar_0;                                          // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_CrosshairVisuals(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetBarSize(float Length, float Width);
	void SetDotSize(float DotSize_0);
	void SetCrosshairColour(const struct FLinearColor& InNewBarColour, const struct FLinearColor& InNewDotColor);
	void UpdateScale(float CurrentScale);
	void UpdateSettings(const struct FSBZCrosshairSettings& InCrosshairSettings);
	void UpdateVisibility(bool IsVisible_0);
	void OnGeometeryUpdated();
	void GetCurrentCrosshairSettings(struct FSBZCrosshairSettings* CrosshairSettings);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_CrosshairVisuals_C">();
	}
	static class UWBP_UI_Widget_CrosshairVisuals_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_CrosshairVisuals_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_CrosshairVisuals_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_CrosshairVisuals_C");
static_assert(sizeof(UWBP_UI_Widget_CrosshairVisuals_C) == 0x000308, "Wrong size on UWBP_UI_Widget_CrosshairVisuals_C");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, Image_Bottom) == 0x000298, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::Image_Bottom' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, Image_Left) == 0x0002A0, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::Image_Left' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, Image_Reticle) == 0x0002A8, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::Image_Reticle' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, Image_Right) == 0x0002B0, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::Image_Right' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, Image_Top) == 0x0002B8, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::Image_Top' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, Overlay_Crosshair) == 0x0002C0, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::Overlay_Crosshair' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, Right) == 0x0002C8, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::Right' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, CrosshairBarColour) == 0x0002D0, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::CrosshairBarColour' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, CrosshairDotColour) == 0x0002E0, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::CrosshairDotColour' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, BarWidth) == 0x0002F0, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::BarWidth' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, BarLength) == 0x0002F4, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::BarLength' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, DotSize) == 0x0002F8, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::DotSize' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, IsMaxSpreadEnabled) == 0x0002FC, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::IsMaxSpreadEnabled' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CrosshairVisuals_C, NewVar_0) == 0x000300, "Member 'UWBP_UI_Widget_CrosshairVisuals_C::NewVar_0' has a wrong offset!");

}

