#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_GloveInventoryScreen

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.ExecuteUbergraph_WBP_UI_GloveInventoryScreen
// 0x0608 (0x0608 - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu;       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0068(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue_1;                   // 0x00A8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x00B8(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x00E8(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0118(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x0130(0x0030)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0170(0x0010)(ReferenceParm)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x0180(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_4;     // 0x01B0(0x0030)()
	class FName                                   K2Node_Event_PreviousValue;                        // 0x01E0(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_5;     // 0x01F0(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_6;     // 0x0220(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0250(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x0268(0x0010)(ReferenceParm)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_7;     // 0x0278(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_8;     // 0x02A8(0x0030)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_2;                          // 0x02E0(0x0010)(ReferenceParm)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_9;     // 0x02F0(0x0030)()
	class USBZMenuButton*                         K2Node_Event_InFocusedButton;                      // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFocused;                           // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_3;                          // 0x0330(0x0010)(ReferenceParm)
	class UWBP_UI_Inventory_GloveSlotButton_C*    K2Node_DynamicCast_AsWBP_UI_Inventory_Glove_Slot_Button; // 0x0340(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGloveSlotIndex_ReturnValue;            // 0x034C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasSuccessful_1;                     // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0352(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasSuccessful;                       // 0x0353(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Inventory_SuitSlotStoreItemButton_C* K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button; // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_10;    // 0x0378(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_11;    // 0x03A8(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x03D8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_4;                          // 0x03F0(0x0010)(ReferenceParm)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0408(0x0028)()
	class ASBZMainMenuPlayerCharacter*            CallFunc_GetMainMenuMannequin_ReturnValue;         // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1;     // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_2;                              // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZInventorySlotStoreItem             K2Node_Event_Item;                                 // 0x0450(0x00E0)(ConstParm)
	class UWBP_UI_Inventory_SuitSlotStoreItemButton_C* K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button_1; // 0x0530(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Inventory_GloveSlotButton_C*    K2Node_DynamicCast_AsWBP_UI_Inventory_Glove_Slot_Button_1; // 0x0540(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCustomize_bCanCustomize;               // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_54A[0x2];                                      // 0x054A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetGloveSlotIndex_ReturnValue_1;          // 0x054C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0550(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanDiscardGloveInSlot_ReturnValue;        // 0x0551(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0552(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_553[0x5];                                      // 0x0553(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default;                             // 0x0558(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x0568(0x0028)()
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default_1;                           // 0x0590(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_2;    // 0x05A0(0x0028)()
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZGloveData*                    CallFunc_GetGloveInSlot_ReturnValue;               // 0x05D0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x05DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x05E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x05E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x05F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x05F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x05F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_3;                           // 0x0600(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen) == 0x000008, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen) == 0x000608, "Wrong size on WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000008, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetCustomizationManager_ReturnValue) == 0x000028, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetGameMode_ReturnValue) == 0x000048, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu) == 0x000050, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetUIManager_ReturnValue) == 0x000060, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_PopStack_ReturnValue) == 0x000068, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetMenuWidget_ReturnValue) == 0x000078, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget) == 0x000080, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_CustomEvent_ActionName) == 0x00008C, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_SwitchName_CmpSuccess) == 0x000098, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetUIManager_ReturnValue_1) == 0x0000A0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_PopStack_ReturnValue_1) == 0x0000A8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_PopStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, Temp_bool_Variable) == 0x0000B4, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference) == 0x0000B8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x0000E8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000118, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x000130, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000160, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000168, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeArray_Array) == 0x000170, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x000180, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_4) == 0x0001B0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Event_PreviousValue) == 0x0001E0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_5) == 0x0001F0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_6) == 0x000220, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000250, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeArray_Array_1) == 0x000268, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_7) == 0x000278, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_8) == 0x0002A8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, Temp_byte_Variable) == 0x0002D8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeArray_Array_2) == 0x0002E0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_9) == 0x0002F0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Event_InFocusedButton) == 0x000320, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Event_InFocusedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Event_bIsFocused) == 0x000328, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Event_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeArray_Array_3) == 0x000330, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Glove_Slot_Button) == 0x000340, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Glove_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_bSuccess_2) == 0x000348, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetGloveSlotIndex_ReturnValue) == 0x00034C, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetGloveSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_IsValid_ReturnValue) == 0x000350, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Event_bWasSuccessful_1) == 0x000351, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Event_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_BooleanAND_ReturnValue) == 0x000352, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Event_bWasSuccessful) == 0x000353, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Event_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button) == 0x000358, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_bSuccess_3) == 0x000360, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_ComponentBoundEvent_Button) == 0x000368, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000370, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_10) == 0x000378, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_11) == 0x0003A8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_11' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x0003D8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeArray_Array_4) == 0x0003F0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, Temp_byte_Variable_1) == 0x000400, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000408, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetMainMenuMannequin_ReturnValue) == 0x000430, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetMainMenuMannequin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetGameMode_ReturnValue_1) == 0x000438, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1) == 0x000440, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_bSuccess_4) == 0x000448, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, Temp_bool_Variable_1) == 0x000449, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, Temp_bool_Variable_2) == 0x00044A, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_IsVisible_ReturnValue) == 0x00044B, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, Temp_bool_Variable_3) == 0x00044C, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Event_Item) == 0x000450, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button_1) == 0x000530, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_bSuccess_5) == 0x000538, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Glove_Slot_Button_1) == 0x000540, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Glove_Slot_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_DynamicCast_bSuccess_6) == 0x000548, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_CanCustomize_bCanCustomize) == 0x000549, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_CanCustomize_bCanCustomize' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetGloveSlotIndex_ReturnValue_1) == 0x00054C, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetGloveSlotIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000550, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_CanDiscardGloveInSlot_ReturnValue) == 0x000551, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_CanDiscardGloveInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_Not_PreBool_ReturnValue_1) == 0x000552, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Select_Default) == 0x000558, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference_1) == 0x000568, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Select_Default_1) == 0x000590, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference_2) == 0x0005A0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_IsEmpty_ReturnValue) == 0x0005C8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetGloveInSlot_ReturnValue) == 0x0005D0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetGloveInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Select_Default_2) == 0x0005D8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetChildrenCount_ReturnValue) == 0x0005DC, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x0005E0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetChildAt_ReturnValue) == 0x0005E8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0005F0, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_Clamp_ReturnValue) == 0x0005F4, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, CallFunc_GetChildAt_ReturnValue_1) == 0x0005F8, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen, K2Node_Select_Default_3) == 0x000600, "Member 'WBP_UI_GloveInventoryScreen_C_ExecuteUbergraph_WBP_UI_GloveInventoryScreen::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.OnSlotPriceChanged
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_OnSlotPriceChanged final
{
public:
	struct FSBZInventorySlotStoreItem             Item;                                              // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_OnSlotPriceChanged) == 0x000008, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_OnSlotPriceChanged");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_OnSlotPriceChanged) == 0x0000E0, "Wrong size on WBP_UI_GloveInventoryScreen_C_OnSlotPriceChanged");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_OnSlotPriceChanged, Item) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_OnSlotPriceChanged::Item' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_GloveInventoryScreen_Button_DefaultGlove_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.OnSlotPurchaseComplete
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_OnSlotPurchaseComplete final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_OnSlotPurchaseComplete) == 0x000001, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_OnSlotPurchaseComplete");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_OnSlotPurchaseComplete) == 0x000001, "Wrong size on WBP_UI_GloveInventoryScreen_C_OnSlotPurchaseComplete");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_OnSlotPurchaseComplete, bWasSuccessful) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_OnSlotPurchaseComplete::bWasSuccessful' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.OnItemDiscarded
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_OnItemDiscarded final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_OnItemDiscarded) == 0x000001, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_OnItemDiscarded");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_OnItemDiscarded) == 0x000001, "Wrong size on WBP_UI_GloveInventoryScreen_C_OnItemDiscarded");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_OnItemDiscarded, bWasSuccessful) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_OnItemDiscarded::bWasSuccessful' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.GloveSlotButtonFocusedChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_GloveSlotButtonFocusedChanged final
{
public:
	class USBZMenuButton*                         InFocusedButton;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_GloveSlotButtonFocusedChanged) == 0x000008, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_GloveSlotButtonFocusedChanged");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_GloveSlotButtonFocusedChanged) == 0x000010, "Wrong size on WBP_UI_GloveInventoryScreen_C_GloveSlotButtonFocusedChanged");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_GloveSlotButtonFocusedChanged, InFocusedButton) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_GloveSlotButtonFocusedChanged::InFocusedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_GloveSlotButtonFocusedChanged, bIsFocused) == 0x000008, "Member 'WBP_UI_GloveInventoryScreen_C_GloveSlotButtonFocusedChanged::bIsFocused' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_GloveInventoryScreen_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_GloveInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_OnControlsReferenceClicked final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_GloveInventoryScreen_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_OnControlsReferenceClicked, ActionName) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_OnControlsReferenceClicked::ActionName' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.Do Custom Navigation
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_Do_Custom_Navigation final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_GloveInventoryScreen_C_Do_Custom_Navigation) == 0x000008, "Wrong alignment on WBP_UI_GloveInventoryScreen_C_Do_Custom_Navigation");
static_assert(sizeof(WBP_UI_GloveInventoryScreen_C_Do_Custom_Navigation) == 0x000010, "Wrong size on WBP_UI_GloveInventoryScreen_C_Do_Custom_Navigation");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_Do_Custom_Navigation, Navigation_0) == 0x000000, "Member 'WBP_UI_GloveInventoryScreen_C_Do_Custom_Navigation::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_GloveInventoryScreen_C_Do_Custom_Navigation, ReturnValue) == 0x000008, "Member 'WBP_UI_GloveInventoryScreen_C_Do_Custom_Navigation::ReturnValue' has a wrong offset!");

// Function WBP_UI_GloveInventoryScreen.WBP_UI_GloveInventoryScreen_C.UpdateBuyButtonControls
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_UI_GloveInventoryScreen_C_UpdateBuyButtonControls final
{
public:
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0018(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0048(0x0030)()
