#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Blackmarket_Category

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Blackmarket_Category.WBP_Blackmarket_Category_C
// 0x0020 (0x02B8 - 0x0298)
class UWBP_Blackmarket_Category_C final : public USBZBlackMarketCategoryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZUITextBlock*                        CatergoryName_T;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_134;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_188;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Blackmarket_Category(int32 EntryPoint);
	void SetStoreCategoryName(const class FText& InCategoryName);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Blackmarket_Category_C">();
	}
	static class UWBP_Blackmarket_Category_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Blackmarket_Category_C>();
	}
};
static_assert(alignof(UWBP_Blackmarket_Category_C) == 0x000008, "Wrong alignment on UWBP_Blackmarket_Category_C");
static_assert(sizeof(UWBP_Blackmarket_Category_C) == 0x0002B8, "Wrong size on UWBP_Blackmarket_Category_C");
static_assert(offsetof(UWBP_Blackmarket_Category_C, UberGraphFrame) == 0x000298, "Member 'UWBP_Blackmarket_Category_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Blackmarket_Category_C, CatergoryName_T) == 0x0002A0, "Member 'UWBP_Blackmarket_Category_C::CatergoryName_T' has a wrong offset!");
static_assert(offsetof(UWBP_Blackmarket_Category_C, Image_134) == 0x0002A8, "Member 'UWBP_Blackmarket_Category_C::Image_134' has a wrong offset!");
static_assert(offsetof(UWBP_Blackmarket_Category_C, Image_188) == 0x0002B0, "Member 'UWBP_Blackmarket_Category_C::Image_188' has a wrong offset!");

}

