#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_CrimeNet_HeistButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_CrimeNet_HeistButton.WBP_UI_MainMenu_CrimeNet_HeistButton_C
// 0x0068 (0x03C8 - 0x0360)
class UWBP_UI_MainMenu_CrimeNet_HeistButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Highlight;                                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                Spacer_ForceButtonSize;                            // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ButtonValue;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              MinimumButtonSize;                                 // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        LevelPath;                                         // 0x0390(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UPD3HeistDataAsset*                     HeistData;                                         // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           NeutralColour;                                     // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_HeistButton(int32 EntryPoint);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void InitializeLevelData(const struct FSoftObjectPath& InLevelPath);
	void Get_Level_Name(class FText* OutLevelName);
	void GetHeistData(class UPD3HeistDataAsset** NewParam);
	void RefreshVisual();
	void OnHoverVisuals(bool bIsHovered);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_CrimeNet_HeistButton_C">();
	}
	static class UWBP_UI_MainMenu_CrimeNet_HeistButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_CrimeNet_HeistButton_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_CrimeNet_HeistButton_C");
static_assert(sizeof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C) == 0x0003C8, "Wrong size on UWBP_UI_MainMenu_CrimeNet_HeistButton_C");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_MainMenu_CrimeNet_HeistButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C, Image_Background) == 0x000368, "Member 'UWBP_UI_MainMenu_CrimeNet_HeistButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C, Image_Highlight) == 0x000370, "Member 'UWBP_UI_MainMenu_CrimeNet_HeistButton_C::Image_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C, Spacer_ForceButtonSize) == 0x000378, "Member 'UWBP_UI_MainMenu_CrimeNet_HeistButton_C::Spacer_ForceButtonSize' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C, Text_ButtonValue) == 0x000380, "Member 'UWBP_UI_MainMenu_CrimeNet_HeistButton_C::Text_ButtonValue' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C, MinimumButtonSize) == 0x000388, "Member 'UWBP_UI_MainMenu_CrimeNet_HeistButton_C::MinimumButtonSize' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C, LevelPath) == 0x000390, "Member 'UWBP_UI_MainMenu_CrimeNet_HeistButton_C::LevelPath' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C, HeistData) == 0x0003B0, "Member 'UWBP_UI_MainMenu_CrimeNet_HeistButton_C::HeistData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_HeistButton_C, NeutralColour) == 0x0003B8, "Member 'UWBP_UI_MainMenu_CrimeNet_HeistButton_C::NeutralColour' has a wrong offset!");

}

