#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuRoot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuRoot.WBP_MenuRoot_C
// 0x0120 (0x03C0 - 0x02A0)
class UWBP_MenuRoot_C final : public USBZMainMenuCrimeNetStackWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_MenuRoot_PrimaryTextButton_C*      Blackmarket_LargetTextButton;                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuRoot_SecondaryTextButton_C*    ChallengesButton;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ContentPanel_C*                    ContentPanel;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DailyChallengesPreview_C*          DailyChallengesPreview;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuRoot_PrimaryTextButton_C*      Loadout_LargetTextButton;                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo_I;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MaskOfTheWeek_C*                   MaskOfTheWeek;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NewsBanner_C*                      NewsBanner;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_PartyInviteInfo_C*                 PartyInviteInfo;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuRoot_PrimaryTextButton_C*      Play_LargeTextButton;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuRoot_SecondaryTextButton_C*    QuitButton;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuRoot_SecondaryTextButton_C*    SettingsButton;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuRoot_SecondaryTextButton_C*    SocialsButton;                                     // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   BlackMarketStackName;                              // 0x0318(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   LoadoutStackName;                                  // 0x0324(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocialsStackName;                                  // 0x0330(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   MoreMenuStackValue;                                // 0x033C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ChallengeStackName;                                // 0x0348(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_354[0x4];                                      // 0x0354(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            ConfirmButtonControlsReference;                    // 0x0358(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   SettingsStackName;                                 // 0x0380(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_38C[0x4];                                      // 0x038C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         FocusedButton;                                     // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlsReference            MenuControlReference;                              // 0x0398(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_MenuRoot(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnQuitConfirmed(class FName ClosingActionName);
	void BndEvt__WBP_MenuRoot_QuitButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_MainMenu_CrimeNet_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void OnPlayerJoinedParty(const class FString& PlayerId);
	void OnPlayerLeftParty(const class FString& PlayerId);
	void OnPlayerKickedFromParty(const class FString& PlayerId);
	void BndEvt__WBP_UI_MainMenu_CrimeNet_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void OnControlReferencePressed(class FName ActionName);
	void BndEvt__WBP_UI_MainMenu_CrimeNet_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_MainMenu_CrimeNet_ChallengesButton_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_MainMenu_CrimeNet_SocialsButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_MainMenu_CrimeNet_SettingsButton_K2Node_ComponentBoundEvent_15_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_MenuRoot_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_MenuRoot_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_MenuRoot_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_MenuRoot_SettingsButton_K2Node_ComponentBoundEvent_18_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_MenuRoot_SocialsButton_K2Node_ComponentBoundEvent_17_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void UpdateFocusedButton(class USBZMenuButton* InButton, bool Enabled);
	void OnMatchmakingStarted();
	void OnPrivilegeQueried(ESBZUserPrivilegesProxy Privilege, bool bPrivilegeAllowed);
	void OnInstallStateChanged(bool bIsGameInstallPending);
	void OnInitialized();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void OnLostStackFocused();
	void SetNoneState();
	void SetMatchMakingState();
	void UpdateAccessBasedOnPrivilege(bool CanPlayOnline, bool InstallPending);
	class UWidget* NavigateToMaskOfTheWeek(EUINavigation Navigation_0);
	class UWidget* NavigateToPlay(EUINavigation Navigation_0);
	void SetInputEnabled(bool bIsEnabled_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MenuRoot_C">();
	}
	static class UWBP_MenuRoot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuRoot_C>();
	}
};
static_assert(alignof(UWBP_MenuRoot_C) == 0x000008, "Wrong alignment on UWBP_MenuRoot_C");
static_assert(sizeof(UWBP_MenuRoot_C) == 0x0003C0, "Wrong size on UWBP_MenuRoot_C");
static_assert(offsetof(UWBP_MenuRoot_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_MenuRoot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, Intro) == 0x0002A8, "Member 'UWBP_MenuRoot_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, Blackmarket_LargetTextButton) == 0x0002B0, "Member 'UWBP_MenuRoot_C::Blackmarket_LargetTextButton' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, ChallengesButton) == 0x0002B8, "Member 'UWBP_MenuRoot_C::ChallengesButton' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, ContentPanel) == 0x0002C0, "Member 'UWBP_MenuRoot_C::ContentPanel' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, DailyChallengesPreview) == 0x0002C8, "Member 'UWBP_MenuRoot_C::DailyChallengesPreview' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, Loadout_LargetTextButton) == 0x0002D0, "Member 'UWBP_MenuRoot_C::Loadout_LargetTextButton' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, Logo_I) == 0x0002D8, "Member 'UWBP_MenuRoot_C::Logo_I' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, MaskOfTheWeek) == 0x0002E0, "Member 'UWBP_MenuRoot_C::MaskOfTheWeek' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, NewsBanner) == 0x0002E8, "Member 'UWBP_MenuRoot_C::NewsBanner' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, PartyInviteInfo) == 0x0002F0, "Member 'UWBP_MenuRoot_C::PartyInviteInfo' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, Play_LargeTextButton) == 0x0002F8, "Member 'UWBP_MenuRoot_C::Play_LargeTextButton' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, QuitButton) == 0x000300, "Member 'UWBP_MenuRoot_C::QuitButton' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, SettingsButton) == 0x000308, "Member 'UWBP_MenuRoot_C::SettingsButton' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, SocialsButton) == 0x000310, "Member 'UWBP_MenuRoot_C::SocialsButton' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, BlackMarketStackName) == 0x000318, "Member 'UWBP_MenuRoot_C::BlackMarketStackName' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, LoadoutStackName) == 0x000324, "Member 'UWBP_MenuRoot_C::LoadoutStackName' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, SocialsStackName) == 0x000330, "Member 'UWBP_MenuRoot_C::SocialsStackName' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, MoreMenuStackValue) == 0x00033C, "Member 'UWBP_MenuRoot_C::MoreMenuStackValue' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, ChallengeStackName) == 0x000348, "Member 'UWBP_MenuRoot_C::ChallengeStackName' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, ConfirmButtonControlsReference) == 0x000358, "Member 'UWBP_MenuRoot_C::ConfirmButtonControlsReference' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, SettingsStackName) == 0x000380, "Member 'UWBP_MenuRoot_C::SettingsStackName' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, FocusedButton) == 0x000390, "Member 'UWBP_MenuRoot_C::FocusedButton' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_C, MenuControlReference) == 0x000398, "Member 'UWBP_MenuRoot_C::MenuControlReference' has a wrong offset!");

}

