#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrimeNet_HeistInspectScreen

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_CrimeNet_HeistInspectScreen.WBP_CrimeNet_HeistInspectScreen_C.ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen
// 0x06E8 (0x06E8 - 0x0000)
struct WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_1;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable_1;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite_1;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x004C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0058(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0088(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_3;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x00B0(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x00E0(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_1;        // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchmakingInProgress_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_LevelPathToIdx_ReturnValue;               // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_2;        // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_2;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_3;        // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_4;        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_5;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZOnlineMatchmakingParams            CallFunc_GetMatchMakingParameters_ReturnValue;     // 0x0158(0x0028)()
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x0198(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x01C8(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x01F8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0210(0x0018)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0228(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_4;     // 0x0238(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_5;     // 0x0268(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0298(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x02B0(0x0018)()
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameUserSettings*                   K2Node_DynamicCast_AsSBZGame_User_Settings;        // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x02D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsContractorAudioBriefingEnabled_ReturnValue; // 0x02DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsContractorAudioBriefingEnabled_ReturnValue_1; // 0x02DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_6;     // 0x0300(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0330(0x0010)(ReferenceParm)
	int32                                         CallFunc_Play2DSound_ReturnValue_3;                // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0348(0x0028)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0370(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_7;     // 0x0390(0x0030)()
	class USBZGameUserSettings*                   K2Node_DynamicCast_AsSBZGame_User_Settings_1;      // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C9[0x7];                                      // 0x03C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x03D0(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsContractorAudioBriefingEnabled_ReturnValue_2; // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x03E8(0x0028)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_8;     // 0x0410(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_2;                          // 0x0440(0x0010)(ReferenceParm)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_9;     // 0x0450(0x0030)()
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_2;    // 0x0480(0x0028)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_3;                          // 0x04A8(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_3;    // 0x04B8(0x0028)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x04E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x04E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E9[0x7];                                      // 0x04E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_10;    // 0x04F8(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_11;    // 0x0528(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0558(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_12;    // 0x0570(0x0030)()
	bool                                          CallFunc_IsSoloGameEnabled_ReturnValue;            // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x7];                                      // 0x05A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_4;                          // 0x05A8(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_4;    // 0x05B8(0x0028)()
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_6;        // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelPathToIdx_ReturnValue_1;             // 0x05E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZOnlineMatchmakingParams            CallFunc_GetMatchMakingParameters_ReturnValue_1;   // 0x05F0(0x0028)()
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_7;        // 0x0618(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0620(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_624[0x4];                                      // 0x0624(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_8;        // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanRequestSoloGame_ReturnValue;           // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0631(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_632[0x6];                                      // 0x0632(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0638(0x0018)()
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue;                 // 0x0650(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0658(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_ContractorSpeak;                // 0x066C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66D[0x3];                                      // 0x066D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameUserSettings*                   CallFunc_GetSBZGameUserSettings_ReturnValue;       // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_9;        // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZDifficulty                                CallFunc_GetMatchmakingDifficulty_ReturnValue;     // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0682(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_683[0x5];                                      // 0x0683(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0688(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_7;            // 0x0698(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x06AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6AD[0x3];                                      // 0x06AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 K2Node_Select_Default_1;                           // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x06B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B9[0x3];                                      // 0x06B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_8;            // 0x06BC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D1[0x7];                                      // 0x06D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1; // 0x06D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen) == 0x000008, "Wrong alignment on WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen");
static_assert(sizeof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen) == 0x0006E8, "Wrong size on WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, EntryPoint) == 0x000000, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, Temp_object_Variable) == 0x000008, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_DynamicCast_AsPaper_Sprite) == 0x000010, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CustomEvent_Loaded) == 0x000020, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_Play2DSound_ReturnValue) == 0x000028, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_Play2DSound_ReturnValue_1) == 0x00002C, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_Play2DSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, Temp_object_Variable_1) == 0x000030, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_Button_7) == 0x000038, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_DynamicCast_AsPaper_Sprite_1) == 0x000040, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_DynamicCast_AsPaper_Sprite_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_Event_PreviousValue) == 0x00004C, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference) == 0x000058, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000088, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_Button_6) == 0x0000A0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_bIsEnabled_3) == 0x0000A8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_bIsEnabled_3' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x0000B0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000E0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_NewIndex) == 0x0000F4, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000F8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetValidValue_ReturnValue) == 0x0000F9, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue) == 0x000100, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue_1) == 0x000108, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_IsMatchmakingInProgress_ReturnValue) == 0x000110, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_IsMatchmakingInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_LevelPathToIdx_ReturnValue) == 0x000114, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_LevelPathToIdx_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue_2) == 0x000118, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000120, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_Button_5) == 0x000128, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_Play2DSound_ReturnValue_2) == 0x000130, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_Play2DSound_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_Button_4) == 0x000138, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue_3) == 0x000140, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue_4) == 0x000148, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue_5) == 0x000150, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetMatchMakingParameters_ReturnValue) == 0x000158, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetMatchMakingParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CustomEvent_Loaded_1) == 0x000180, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_Button_3) == 0x000188, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x000190, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x000198, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x0001C8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001F8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, Temp_text_Variable) == 0x000210, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_Button_2) == 0x000228, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000230, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_4) == 0x000238, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_4' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_5) == 0x000268, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_5' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x000298, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, Temp_text_Variable_1) == 0x0002B0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameUserSettings_ReturnValue) == 0x0002C8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_DynamicCast_AsSBZGame_User_Settings) == 0x0002D0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_DynamicCast_AsSBZGame_User_Settings' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_DynamicCast_bSuccess_2) == 0x0002D8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, Temp_bool_Variable) == 0x0002D9, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_IsContractorAudioBriefingEnabled_ReturnValue) == 0x0002DA, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_IsContractorAudioBriefingEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_IsContractorAudioBriefingEnabled_ReturnValue_1) == 0x0002DB, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_IsContractorAudioBriefingEnabled_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0002E0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_Not_PreBool_ReturnValue) == 0x0002E8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0002F0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_SelectFloat_ReturnValue) == 0x0002F8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_6) == 0x000300, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_6' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeArray_Array) == 0x000330, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_Play2DSound_ReturnValue_3) == 0x000340, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_Play2DSound_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000348, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x000370, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000388, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_7) == 0x000390, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_7' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_DynamicCast_AsSBZGame_User_Settings_1) == 0x0003C0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_DynamicCast_AsSBZGame_User_Settings_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_DynamicCast_bSuccess_3) == 0x0003C8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeArray_Array_1) == 0x0003D0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_IsContractorAudioBriefingEnabled_ReturnValue_2) == 0x0003E0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_IsContractorAudioBriefingEnabled_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlsReference_1) == 0x0003E8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_8) == 0x000410, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_8' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeArray_Array_2) == 0x000440, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_9) == 0x000450, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_9' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlsReference_2) == 0x000480, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlsReference_2' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeArray_Array_3) == 0x0004A8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlsReference_3) == 0x0004B8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlsReference_3' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_Button_1) == 0x0004E0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_bIsEnabled) == 0x0004E8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_ComponentBoundEvent_Button) == 0x0004F0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_10) == 0x0004F8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_10' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_11) == 0x000528, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_11' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CreateDelegate_OutputDelegate_5) == 0x000558, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlReference_12) == 0x000570, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlReference_12' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_IsSoloGameEnabled_ReturnValue) == 0x0005A0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_IsSoloGameEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeArray_Array_4) == 0x0005A8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_MakeStruct_SBZButtonControlsReference_4) == 0x0005B8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_MakeStruct_SBZButtonControlsReference_4' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue_6) == 0x0005E0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_LevelPathToIdx_ReturnValue_1) == 0x0005E8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_LevelPathToIdx_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetMatchMakingParameters_ReturnValue_1) == 0x0005F0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetMatchMakingParameters_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue_7) == 0x000618, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000620, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue_8) == 0x000628, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_CanRequestSoloGame_ReturnValue) == 0x000630, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_CanRequestSoloGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_Not_PreBool_ReturnValue_1) == 0x000631, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_Select_Default) == 0x000638, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetSBZOnline_ReturnValue) == 0x000650, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetSBZOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CreateDelegate_OutputDelegate_6) == 0x000658, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CustomEvent_ContractorSpeak) == 0x00066C, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CustomEvent_ContractorSpeak' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetSBZGameUserSettings_ReturnValue) == 0x000670, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetSBZGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetGameStateMachine_ReturnValue_9) == 0x000678, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetGameStateMachine_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_GetMatchmakingDifficulty_ReturnValue) == 0x000680, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_GetMatchmakingDifficulty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000681, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_IsValid_ReturnValue) == 0x000682, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000688, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CreateDelegate_OutputDelegate_7) == 0x000698, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, Temp_bool_Variable_1) == 0x0006AC, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_Select_Default_1) == 0x0006B0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_IsValid_ReturnValue_1) == 0x0006B8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, K2Node_CreateDelegate_OutputDelegate_8) == 0x0006BC, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x0006D0, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1) == 0x0006D8, "Member 'WBP_CrimeNet_HeistInspectScreen_C_ExecuteUbergraph_WBP_CrimeNet_HeistInspectScreen::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1' has a wrong offset!");

// Function WBP_CrimeNet_HeistInspectScreen.WBP_CrimeNet_HeistInspectScreen_C.SetSpeak
// 0x0001 (0x0001 - 0x0000)
struct WBP_CrimeNet_HeistInspectScreen_C_SetSpeak final
{
public:
	bool                                          ContractorSpeak;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CrimeNet_HeistInspectScreen_C_SetSpeak) == 0x000001, "Wrong alignment on WBP_CrimeNet_HeistInspectScreen_C_SetSpeak");
static_assert(sizeof(WBP_CrimeNet_HeistInspectScreen_C_SetSpeak) == 0x000001, "Wrong size on WBP_CrimeNet_HeistInspectScreen_C_SetSpeak");
static_assert(offsetof(WBP_CrimeNet_HeistInspectScreen_C_SetSpeak, ContractorSpeak) == 0x000000, "Member 'WBP_CrimeNet_HeistInspectScreen_C_SetSpeak::ContractorSpeak' has a wrong offset!");

// Function WBP_CrimeNet_HeistInspectScreen.WBP_CrimeNet_HeistInspectScreen_C.BndEvt__WBP_CrimeNet_HeistInspectScreen_WBP_UI_ProceedSoloButton_InspectScreen_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_CrimeNet_HeistInspectScreen_C_BndEvt__WBP_CrimeNet_HeistInspectScreen_WBP_UI_ProceedSoloButton_InspectScreen_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature final
{
public:
