#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Preplanning_MainMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.ExecuteUbergraph_WBP_UI_Preplanning_MainMenu
// 0x0398 (0x0398 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0004(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InActionInput;                  // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue;  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAsyncLoadingDone_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetTimerRemainingNonPausableTimeByHandle_ReturnValue; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ClosingActionName;              // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_9;               // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_7;           // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData;                  // 0x00A0(0x0060)(ContainsInstancedReference)
	bool                                          CallFunc_IsLobbyInGame_bInGame;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu;       // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FSBZAsyncLoadingProgress& AsyncLoadingProgressData)> K2Node_CreateDelegate_OutputDelegate; // 0x011C(0x0014)(ZeroConstructor, NoDestructor)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZMainMenuState                             CallFunc_GetMainMenuState_ReturnValue;             // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_153[0x5];                                      // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_8;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_6;           // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_5;           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_4;           // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_3;           // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanOpenPlayerProfile_ReturnValue;         // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInReadyStatus;                       // 0x01A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A3[0x1];                                      // 0x01A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x01A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLoadoutManager*                     CallFunc_GetLoadoutManager_ReturnValue;            // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveLoadoutIndex_ReturnValue;        // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSoloGameEnabled_ReturnValue;            // 0x01C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C7[0x1];                                      // 0x01C7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x01C8(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x01F8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_20C[0x4];                                      // 0x020C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0210(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0220(0x0028)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue;              // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_1;            // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_2;            // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerLoadoutConfig                K2Node_ComponentBoundEvent_PlayerLoadout;          // 0x02A0(0x0098)(ConstParm)
	int32                                         K2Node_ComponentBoundEvent_PlayerLoadoutIndex;     // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x033C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_3;            // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_4;            // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_5;            // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetActiveWidget_ReturnValue_6;            // 0x0368(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputTypeController_ReturnValue;        // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsActive_IsActive;                     // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0373(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate_2;           // 0x0374(0x0014)(ZeroConstructor, NoDestructor)
	class USBZGameEventBroker*                    CallFunc_GetGameEventBroker_ReturnValue;           // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZAsyncLoadingProgress               K2Node_CustomEvent_AsyncLoadingProgressData;       // 0x0390(0x0004)(ConstParm, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu) == 0x000398, "Wrong size on WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, EntryPoint) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_Event_PreviousValue) == 0x000004, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_CustomEvent_InActionInput) == 0x000010, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_CustomEvent_InActionInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_SwitchName_CmpSuccess) == 0x00001C, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue) == 0x00001D, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_Event_MyGeometry) == 0x000020, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_Event_InDeltaTime) == 0x000058, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetSBZOnline_ReturnValue) == 0x000060, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetSBZOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_IsAsyncLoadingDone_ReturnValue) == 0x000068, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_IsAsyncLoadingDone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetTimerRemainingNonPausableTimeByHandle_ReturnValue) == 0x00006C, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetTimerRemainingNonPausableTimeByHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000070, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_CustomEvent_ClosingActionName) == 0x000074, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_CustomEvent_ClosingActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetUIManager_ReturnValue) == 0x000080, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_SwitchName_CmpSuccess_1) == 0x000088, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button_9) == 0x000090, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_bIsEnabled_7) == 0x000098, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_bIsEnabled_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_MakeStruct_SBZUIPopupData) == 0x0000A0, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_MakeStruct_SBZUIPopupData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_IsLobbyInGame_bInGame) == 0x000100, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_IsLobbyInGame_bInGame' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_Not_PreBool_ReturnValue) == 0x000101, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetGameMode_ReturnValue) == 0x000108, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu) == 0x000110, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00011C, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetGameMode_ReturnValue_1) == 0x000130, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, Temp_struct_Variable) == 0x000138, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1) == 0x000148, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetMainMenuState_ReturnValue) == 0x000151, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetMainMenuState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000152, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetGameStateMachine_ReturnValue) == 0x000158, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_Play2DSound_ReturnValue) == 0x000160, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button_8) == 0x000168, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_bIsEnabled_6) == 0x000170, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_bIsEnabled_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button_7) == 0x000178, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_bIsEnabled_5) == 0x000180, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_bIsEnabled_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button_6) == 0x000188, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_bIsEnabled_4) == 0x000190, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_bIsEnabled_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button_5) == 0x000198, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_bIsEnabled_3) == 0x0001A0, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_bIsEnabled_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_CanOpenPlayerProfile_ReturnValue) == 0x0001A1, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_CanOpenPlayerProfile_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_Event_bInReadyStatus) == 0x0001A2, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_Event_bInReadyStatus' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_SelectInt_ReturnValue) == 0x0001A4, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, Temp_struct_Variable_1) == 0x0001A8, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetLoadoutManager_ReturnValue) == 0x0001B8, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetLoadoutManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetActiveLoadoutIndex_ReturnValue) == 0x0001C0, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetActiveLoadoutIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_Event_IsDesignTime) == 0x0001C4, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_IsSoloGameEnabled_ReturnValue) == 0x0001C5, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_IsSoloGameEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, Temp_bool_Variable) == 0x0001C6, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_MakeStruct_SBZButtonControlReference) == 0x0001C8, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001F8, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_MakeArray_Array) == 0x000210, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000220, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button_4) == 0x000248, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button_3) == 0x000250, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x000258, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button_2) == 0x000260, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button_1) == 0x000268, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000270, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetActiveWidget_ReturnValue) == 0x000278, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetActiveWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetActiveWidget_ReturnValue_1) == 0x000280, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetActiveWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetActiveWidget_ReturnValue_2) == 0x000288, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetActiveWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_Button) == 0x000290, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000298, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_PlayerLoadout) == 0x0002A0, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_PlayerLoadout' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_ComponentBoundEvent_PlayerLoadoutIndex) == 0x000338, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_ComponentBoundEvent_PlayerLoadoutIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_Select_Default) == 0x00033C, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetActiveWidget_ReturnValue_3) == 0x000350, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetActiveWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetActiveWidget_ReturnValue_4) == 0x000358, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetActiveWidget_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetActiveWidget_ReturnValue_5) == 0x000360, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetActiveWidget_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetActiveWidget_ReturnValue_6) == 0x000368, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetActiveWidget_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_IsInputTypeController_ReturnValue) == 0x000370, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_IsInputTypeController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetIsActive_IsActive) == 0x000371, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetIsActive_IsActive' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_Not_PreBool_ReturnValue_1) == 0x000372, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_BooleanAND_ReturnValue) == 0x000373, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_CreateDelegate_OutputDelegate_2) == 0x000374, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, CallFunc_GetGameEventBroker_ReturnValue) == 0x000388, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::CallFunc_GetGameEventBroker_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu, K2Node_CustomEvent_AsyncLoadingProgressData) == 0x000390, "Member 'WBP_UI_Preplanning_MainMenu_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu::K2Node_CustomEvent_AsyncLoadingProgressData' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.ShowLoadProgress
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_ShowLoadProgress final
{
public:
	struct FSBZAsyncLoadingProgress               AsyncLoadingProgressData;                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_ShowLoadProgress) == 0x000004, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_ShowLoadProgress");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_ShowLoadProgress) == 0x000004, "Wrong size on WBP_UI_Preplanning_MainMenu_C_ShowLoadProgress");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_ShowLoadProgress, AsyncLoadingProgressData) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_ShowLoadProgress::AsyncLoadingProgressData' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature final
{
public:
	struct FSBZPlayerLoadoutConfig                PlayerLoadout;                                     // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         PlayerLoadoutIndex;                                // 0x0098(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature) == 0x0000A0, "Wrong size on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature, PlayerLoadout) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature::PlayerLoadout' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature, PlayerLoadoutIndex) == 0x000098, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutSelectionButton_K2Node_ComponentBoundEvent_6_OnPlayerLoadoutConfigChanged__DelegateSignature::PlayerLoadoutIndex' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadingButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewUnready_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_NewReady_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_PreConstruct");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Preplanning_MainMenu_C_PreConstruct");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.OnLobbyPlayerReadyStatusUpdatedEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_OnLobbyPlayerReadyStatusUpdatedEvent final
{
public:
	bool                                          bInReadyStatus;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_OnLobbyPlayerReadyStatusUpdatedEvent) == 0x000001, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_OnLobbyPlayerReadyStatusUpdatedEvent");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_OnLobbyPlayerReadyStatusUpdatedEvent) == 0x000001, "Wrong size on WBP_UI_Preplanning_MainMenu_C_OnLobbyPlayerReadyStatusUpdatedEvent");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_OnLobbyPlayerReadyStatusUpdatedEvent, bInReadyStatus) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_OnLobbyPlayerReadyStatusUpdatedEvent::bInReadyStatus' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player4ReadyStatus_K2Node_ComponentBoundEvent_11_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu.WBP_UI_Preplanning_MainMenu_C.BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player3ReadyStatus_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player3ReadyStatus_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player3ReadyStatus_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_C_BndEvt__WBP_UI_Preplanning_MainMenu_Widget_Player3ReadyStatus_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature");
