#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_ObjectiveContainer

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_ObjectiveContainer.WBP_UI_Widget_ObjectiveContainer_C.ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer
// 0x0038 (0x0038 - 0x0000)
struct WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          K2Node_Event_Objective;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          K2Node_Event_Objective_1;                          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer) == 0x000008, "Wrong alignment on WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer");
static_assert(sizeof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer) == 0x000038, "Wrong size on WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer, K2Node_Event_Objective) == 0x000010, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer::K2Node_Event_Objective' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer, K2Node_Event_Objective_1) == 0x000018, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer::K2Node_Event_Objective_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer, CallFunc_Array_AddUnique_ReturnValue) == 0x000020, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer, CallFunc_PlayAnimationForward_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000030, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_Widget_ObjectiveContainer.WBP_UI_Widget_ObjectiveContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_ObjectiveContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_ObjectiveContainer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_ObjectiveContainer_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_ObjectiveContainer_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_ObjectiveContainer_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_ObjectiveContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_ObjectiveContainer.WBP_UI_Widget_ObjectiveContainer_C.ObjectiveAdded
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_ObjectiveContainer_C_ObjectiveAdded final
{
public:
	class ASBZObjective*                          Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_ObjectiveContainer_C_ObjectiveAdded) == 0x000008, "Wrong alignment on WBP_UI_Widget_ObjectiveContainer_C_ObjectiveAdded");
static_assert(sizeof(WBP_UI_Widget_ObjectiveContainer_C_ObjectiveAdded) == 0x000008, "Wrong size on WBP_UI_Widget_ObjectiveContainer_C_ObjectiveAdded");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ObjectiveAdded, Objective) == 0x000000, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ObjectiveAdded::Objective' has a wrong offset!");

// Function WBP_UI_Widget_ObjectiveContainer.WBP_UI_Widget_ObjectiveContainer_C.ObjectiveRemove
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_ObjectiveContainer_C_ObjectiveRemove final
{
public:
	class ASBZObjective*                          Objective;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_ObjectiveContainer_C_ObjectiveRemove) == 0x000008, "Wrong alignment on WBP_UI_Widget_ObjectiveContainer_C_ObjectiveRemove");
static_assert(sizeof(WBP_UI_Widget_ObjectiveContainer_C_ObjectiveRemove) == 0x000008, "Wrong size on WBP_UI_Widget_ObjectiveContainer_C_ObjectiveRemove");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_ObjectiveRemove, Objective) == 0x000000, "Member 'WBP_UI_Widget_ObjectiveContainer_C_ObjectiveRemove::Objective' has a wrong offset!");

// Function WBP_UI_Widget_ObjectiveContainer.WBP_UI_Widget_ObjectiveContainer_C.TryPlayAnimation
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation final
{
public:
	bool                                          bPlayActivationSound;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0070(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZObjectiveState                            Temp_byte_Variable;                                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB[0x5];                                       // 0x00AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00B0(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation) == 0x000008, "Wrong alignment on WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation");
static_assert(sizeof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation) == 0x0000C8, "Wrong size on WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, bPlayActivationSound) == 0x000000, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::bPlayActivationSound' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, Temp_text_Variable) == 0x000008, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, Temp_text_Variable_1) == 0x000020, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, Temp_text_Variable_2) == 0x000038, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, CallFunc_Play2DSound_ReturnValue) == 0x000050, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, Temp_text_Variable_3) == 0x000058, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, Temp_text_Variable_4) == 0x000070, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, CallFunc_Not_PreBool_ReturnValue) == 0x000088, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, CallFunc_PlayAnimationForward_ReturnValue) == 0x000090, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, Temp_byte_Variable) == 0x000098, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, CallFunc_Array_Length_ReturnValue) == 0x00009C, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, CallFunc_Array_Get_Item) == 0x0000A0, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, CallFunc_Greater_IntInt_ReturnValue) == 0x0000A8, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, CallFunc_BooleanAND_ReturnValue) == 0x0000A9, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000AA, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_UI_Widget_ObjectiveContainer_C_TryPlayAnimation::K2Node_Select_Default' has a wrong offset!");

}

