#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_Chat

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.ExecuteUbergraph_WBP_UI_HUD_Chat
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0038(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasFocus;                            // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsDisabled;                          // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerChatEvent                    K2Node_Event_ChatEventData_3;                      // 0x0078(0x0018)(ConstParm)
	struct FSBZVotingChatEvent                    K2Node_Event_ChatEventData_2;                      // 0x0090(0x0010)(ConstParm)
	struct FSBZPlayerDefeatStateChangedData       K2Node_Event_InData_1;                             // 0x00A0(0x0010)(ConstParm, NoDestructor)
	struct FSBZAICrewDefeatStateChangedData       K2Node_Event_InData;                               // 0x00B0(0x0010)(ConstParm, NoDestructor)
	struct FSBZPlayerPingEvent                    K2Node_Event_PingEventData;                        // 0x00C0(0x0010)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FSBZAICrewChatEvent                    K2Node_Event_ChatEventData_1;                      // 0x00D0(0x0018)(ConstParm)
	struct FSBZSystemChatEvent                    K2Node_Event_ChatEventData;                        // 0x00E8(0x0010)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZKeyItemCountChangedEvent           K2Node_Event_KeyItemCountChangedEventData;         // 0x0100(0x0030)(ConstParm, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_132[0x6];                                      // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerCallEvent                    K2Node_Event_CallEventData;                        // 0x0138(0x0010)(ConstParm, NoDestructor)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x014D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14E[0x2];                                      // 0x014E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0150(0x0018)()
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_1;                // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_2;                // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_3;                // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_4;                // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_5;                // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_6;                // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0188(0x0018)(ConstParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x01B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x01D0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat");
static_assert(sizeof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat) == 0x0001F0, "Wrong size on WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, EntryPoint) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, Temp_text_Variable) == 0x000008, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, Temp_text_Variable_1) == 0x000020, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_MyGeometry) == 0x000038, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_InDeltaTime) == 0x000070, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_bHasFocus) == 0x000074, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_bHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_bIsDisabled) == 0x000075, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_bIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_ChatEventData_3) == 0x000078, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_ChatEventData_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_ChatEventData_2) == 0x000090, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_ChatEventData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_InData_1) == 0x0000A0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_InData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_InData) == 0x0000B0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_PingEventData) == 0x0000C0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_PingEventData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_ChatEventData_1) == 0x0000D0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_ChatEventData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_ChatEventData) == 0x0000E8, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_ChatEventData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_TextIsEmpty_ReturnValue) == 0x0000F8, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_KeyItemCountChangedEventData) == 0x000100, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_KeyItemCountChangedEventData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000130, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_BooleanAND_ReturnValue) == 0x000131, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_CallEventData) == 0x000138, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_CallEventData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000148, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00014C, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, Temp_bool_Variable) == 0x00014D, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Select_Default) == 0x000150, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue) == 0x000168, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_1) == 0x00016C, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_2) == 0x000170, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_3) == 0x000174, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_4) == 0x000178, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_5) == 0x00017C, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_6) == 0x000180, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_ComponentBoundEvent_Text) == 0x000188, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Conv_TextToString_ReturnValue) == 0x0001A0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001B0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Len_ReturnValue) == 0x0001B4, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Greater_IntInt_ReturnValue) == 0x0001B8, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_GetSubstring_ReturnValue) == 0x0001C0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Conv_StringToText_ReturnValue) == 0x0001D0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001E8, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.CallReceived
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_CallReceived final
{
public:
	struct FSBZPlayerCallEvent                    CallEventData;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_CallReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_CallReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_CallReceived) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_CallReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_CallReceived, CallEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_CallReceived::CallEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.KeyItemCountChanged
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_HUD_Chat_C_KeyItemCountChanged final
{
public:
	struct FSBZKeyItemCountChangedEvent           KeyItemCountChangedEventData;                      // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_KeyItemCountChanged) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_KeyItemCountChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_KeyItemCountChanged) == 0x000030, "Wrong size on WBP_UI_HUD_Chat_C_KeyItemCountChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_KeyItemCountChanged, KeyItemCountChangedEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_KeyItemCountChanged::KeyItemCountChangedEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.SystemMessageReceived
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_SystemMessageReceived final
{
public:
	struct FSBZSystemChatEvent                    ChatEventData;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_SystemMessageReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_SystemMessageReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_SystemMessageReceived) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_SystemMessageReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_SystemMessageReceived, ChatEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_SystemMessageReceived::ChatEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.CrewAIMessageReceived
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_Chat_C_CrewAIMessageReceived final
{
public:
	struct FSBZAICrewChatEvent                    ChatEventData;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_CrewAIMessageReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_CrewAIMessageReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_CrewAIMessageReceived) == 0x000018, "Wrong size on WBP_UI_HUD_Chat_C_CrewAIMessageReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_CrewAIMessageReceived, ChatEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_CrewAIMessageReceived::ChatEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.PingReceived
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_PingReceived final
{
public:
	struct FSBZPlayerPingEvent                    PingEventData;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_PingReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_PingReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_PingReceived) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_PingReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_PingReceived, PingEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_PingReceived::PingEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnAICrewDefeatStateChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged final
{
public:
	struct FSBZAICrewDefeatStateChangedData       InData;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged, InData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged::InData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnPlayerDefeatStateChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged final
{
public:
	struct FSBZPlayerDefeatStateChangedData       InData;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged, InData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged::InData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.VotingMessageReceived
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_VotingMessageReceived final
{
public:
	struct FSBZVotingChatEvent                    ChatEventData;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_VotingMessageReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_VotingMessageReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_VotingMessageReceived) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_VotingMessageReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_VotingMessageReceived, ChatEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_VotingMessageReceived::ChatEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.PlayerMessageReceived
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_Chat_C_PlayerMessageReceived final
{
public:
	struct FSBZPlayerChatEvent                    ChatEventData;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_PlayerMessageReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_PlayerMessageReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_PlayerMessageReceived) == 0x000018, "Wrong size on WBP_UI_HUD_Chat_C_PlayerMessageReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_PlayerMessageReceived, ChatEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_PlayerMessageReceived::ChatEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnChatDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnChatDisabledChanged final
{
public:
	bool                                          bIsDisabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnChatDisabledChanged) == 0x000001, "Wrong alignment on WBP_UI_HUD_Chat_C_OnChatDisabledChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnChatDisabledChanged) == 0x000001, "Wrong size on WBP_UI_HUD_Chat_C_OnChatDisabledChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnChatDisabledChanged, bIsDisabled) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnChatDisabledChanged::bIsDisabled' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnChatFocusChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnChatFocusChanged final
{
public:
	bool                                          bHasFocus;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnChatFocusChanged) == 0x000001, "Wrong alignment on WBP_UI_HUD_Chat_C_OnChatFocusChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnChatFocusChanged) == 0x000001, "Wrong size on WBP_UI_HUD_Chat_C_OnChatFocusChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnChatFocusChanged, bHasFocus) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnChatFocusChanged::bHasFocus' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_UI_HUD_Chat_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_Tick) == 0x000004, "Wrong alignment on WBP_UI_HUD_Chat_C_Tick");
static_assert(sizeof(WBP_UI_HUD_Chat_C_Tick) == 0x00003C, "Wrong size on WBP_UI_HUD_Chat_C_Tick");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_UI_HUD_Chat_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.ProcessDefeatChange
// 0x0410 (0x0410 - 0x0000)
struct WBP_UI_HUD_Chat_C_ProcessDefeatChange final
{
public:
	class APlayerState*                           PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAICrewState*                        AICrewState;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               OldDefeatState;                                    // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               NewDefeatState;                                    // 0x0011(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitialStateChange;                              // 0x0012(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetCharacterName_ReturnValue;             // 0x0038(0x0018)()
	class ASBZPlayerState*                        K2Node_DynamicCast_AsSBZPlayer_State;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x00A0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0110(0x0010)(ReferenceParm)
	class FText                                   Temp_text_Variable_1;                              // 0x0120(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0168(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0180(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0198(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_7;                              // 0x01B8(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_8;                              // 0x01D8(0x0018)()
	bool                                          Temp_bool_Variable_2;                              // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_9;                              // 0x01F8(0x0018)()
	bool                                          Temp_bool_Variable_3;                              // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_10;                             // 0x0218(0x0018)()
	EPD3DefeatState                               Temp_byte_Variable;                                // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_11;                             // 0x0238(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0250(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0268(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0280(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0298(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x02B0(0x0018)()
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               Temp_byte_Variable_1;                              // 0x02CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CD[0x3];                                      // 0x02CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x02D0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x02E8(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0300(0x0018)()
	class FText                                   K2Node_Select_Default_2;                           // 0x0318(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0330(0x0018)()
	class APlayerState*                           CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_3;                           // 0x0350(0x0018)()
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_4;                           // 0x0370(0x0018)()
	class FText                                   K2Node_Select_Default_5;                           // 0x0388(0x0018)()
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x03A8(0x0018)()
	class FText                                   CallFunc_GetMoodText_OutText;                      // 0x03C0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x03D8(0x0018)()
	class FText                                   CallFunc_GetMoodText_OutText_1;                    // 0x03F0(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_ProcessDefeatChange) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_ProcessDefeatChange");
static_assert(sizeof(WBP_UI_HUD_Chat_C_ProcessDefeatChange) == 0x000410, "Wrong size on WBP_UI_HUD_Chat_C_ProcessDefeatChange");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, PlayerState) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, AICrewState) == 0x000008, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::AICrewState' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, OldDefeatState) == 0x000010, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::OldDefeatState' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, NewDefeatState) == 0x000011, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::NewDefeatState' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, IsInitialStateChange) == 0x000012, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::IsInitialStateChange' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable) == 0x000018, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000031, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000032, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000033, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000034, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_GetCharacterName_ReturnValue) == 0x000038, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_GetCharacterName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_DynamicCast_AsSBZPlayer_State) == 0x000050, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_DynamicCast_AsSBZPlayer_State' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_MakeStruct_FormatArgumentData) == 0x000060, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x0000A0, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_MakeArray_Array_1) == 0x000110, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_1) == 0x000120, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_2) == 0x000138, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_3) == 0x000150, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_4) == 0x000168, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_5) == 0x000180, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_6) == 0x000198, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_bool_Variable) == 0x0001B0, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_7) == 0x0001B8, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_bool_Variable_1) == 0x0001D0, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_8) == 0x0001D8, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_bool_Variable_2) == 0x0001F0, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_9) == 0x0001F8, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_bool_Variable_3) == 0x000210, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_10) == 0x000218, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_byte_Variable) == 0x000230, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_11) == 0x000238, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_12) == 0x000250, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_13) == 0x000268, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_14) == 0x000280, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_14' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_15) == 0x000298, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_15' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_text_Variable_16) == 0x0002B0, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_text_Variable_16' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_Play2DSound_ReturnValue) == 0x0002C8, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, Temp_byte_Variable_1) == 0x0002CC, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_MakeLiteralText_ReturnValue) == 0x0002D0, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_Select_Default) == 0x0002E8, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_Select_Default_1) == 0x000300, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_Select_Default_2) == 0x000318, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000330, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000348, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_Select_Default_3) == 0x000350, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000368, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_Select_Default_4) == 0x000370, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, K2Node_Select_Default_5) == 0x000388, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_IsDedicatedServer_ReturnValue) == 0x0003A0, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_Format_ReturnValue) == 0x0003A8, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_GetMoodText_OutText) == 0x0003C0, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_GetMoodText_OutText' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_Format_ReturnValue_1) == 0x0003D8, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_GetMoodText_OutText_1) == 0x0003F0, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_GetMoodText_OutText_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessDefeatChange, CallFunc_TextIsEmpty_ReturnValue) == 0x000408, "Member 'WBP_UI_HUD_Chat_C_ProcessDefeatChange::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.AddText
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_UI_HUD_Chat_C_AddText final
{
public:
	class FText                                   NewMessage;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00C0(0x0018)()
};
static_assert(alignof(WBP_UI_HUD_Chat_C_AddText) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_AddText");
static_assert(sizeof(WBP_UI_HUD_Chat_C_AddText) == 0x0000D8, "Wrong size on WBP_UI_HUD_Chat_C_AddText");
static_assert(offsetof(WBP_UI_HUD_Chat_C_AddText, NewMessage) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_AddText::NewMessage' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_AddText, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_UI_HUD_Chat_C_AddText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_AddText, CallFunc_GetText_ReturnValue) == 0x000058, "Member 'WBP_UI_HUD_Chat_C_AddText::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_AddText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'WBP_UI_HUD_Chat_C_AddText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_AddText, K2Node_MakeArray_Array) == 0x0000B0, "Member 'WBP_UI_HUD_Chat_C_AddText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_AddText, CallFunc_Format_ReturnValue) == 0x0000C0, "Member 'WBP_UI_HUD_Chat_C_AddText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.GetMoodText
// 0x0128 (0x0128 - 0x0000)
struct WBP_UI_HUD_Chat_C_GetMoodText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          IsGood;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutText;                                           // 0x0020(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00F8(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0110(0x0018)()
};
static_assert(alignof(WBP_UI_HUD_Chat_C_GetMoodText) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_GetMoodText");
static_assert(sizeof(WBP_UI_HUD_Chat_C_GetMoodText) == 0x000128, "Wrong size on WBP_UI_HUD_Chat_C_GetMoodText");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, InText) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::InText' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, IsGood) == 0x000018, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::IsGood' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, OutText) == 0x000020, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::OutText' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, Temp_bool_Variable) == 0x000038, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, CallFunc_Format_ReturnValue) == 0x0000D0, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, K2Node_MakeArray_Array_1) == 0x0000E8, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, CallFunc_Format_ReturnValue_1) == 0x0000F8, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_GetMoodText, K2Node_Select_Default) == 0x000110, "Member 'WBP_UI_HUD_Chat_C_GetMoodText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.ProcessVotingMessage
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_UI_HUD_Chat_C_ProcessVotingMessage final
{
public:
	struct FSBZVotingChatEvent                    InMessageChat;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D0(0x0018)()
};
static_assert(alignof(WBP_UI_HUD_Chat_C_ProcessVotingMessage) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_ProcessVotingMessage");
static_assert(sizeof(WBP_UI_HUD_Chat_C_ProcessVotingMessage) == 0x0000E8, "Wrong size on WBP_UI_HUD_Chat_C_ProcessVotingMessage");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessVotingMessage, InMessageChat) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_ProcessVotingMessage::InMessageChat' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessVotingMessage, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'WBP_UI_HUD_Chat_C_ProcessVotingMessage::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessVotingMessage, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_UI_HUD_Chat_C_ProcessVotingMessage::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessVotingMessage, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_UI_HUD_Chat_C_ProcessVotingMessage::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessVotingMessage, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_UI_HUD_Chat_C_ProcessVotingMessage::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
