#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SecondaryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SecondaryButton.WBP_SecondaryButton_C
// 0x0068 (0x03C8 - 0x0360)
class UWBP_SecondaryButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FocusedAnimation;                                  // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background_1;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderButton;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Name_T;                                            // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Button;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root_SB;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultTextValue;                                  // 0x03A0(0x0018)(Edit, BlueprintVisible)
	struct FVector2D                              InititalSize;                                      // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseSecondaryColor;                                 // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_SecondaryButton(int32 EntryPoint);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void DisabledButtonSelected();
	void ButtonSelected();
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnHoverVisuals(bool bIsHovered);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void RefreshVisual();
	void SetButtonText(const class FText& InButtonText);
	void ResetToDefaultButtonText();
	void GetText(class FText* OutText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_SecondaryButton_C">();
	}
	static class UWBP_SecondaryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SecondaryButton_C>();
	}
};
static_assert(alignof(UWBP_SecondaryButton_C) == 0x000008, "Wrong alignment on UWBP_SecondaryButton_C");
static_assert(sizeof(UWBP_SecondaryButton_C) == 0x0003C8, "Wrong size on UWBP_SecondaryButton_C");
static_assert(offsetof(UWBP_SecondaryButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_SecondaryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, FocusedAnimation) == 0x000368, "Member 'UWBP_SecondaryButton_C::FocusedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, Image_Background) == 0x000370, "Member 'UWBP_SecondaryButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, Image_Background_1) == 0x000378, "Member 'UWBP_SecondaryButton_C::Image_Background_1' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, Image_BorderButton) == 0x000380, "Member 'UWBP_SecondaryButton_C::Image_BorderButton' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, Name_T) == 0x000388, "Member 'UWBP_SecondaryButton_C::Name_T' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, Overlay_Button) == 0x000390, "Member 'UWBP_SecondaryButton_C::Overlay_Button' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, Root_SB) == 0x000398, "Member 'UWBP_SecondaryButton_C::Root_SB' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, DefaultTextValue) == 0x0003A0, "Member 'UWBP_SecondaryButton_C::DefaultTextValue' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, InititalSize) == 0x0003B8, "Member 'UWBP_SecondaryButton_C::InititalSize' has a wrong offset!");
static_assert(offsetof(UWBP_SecondaryButton_C, UseSecondaryColor) == 0x0003C0, "Member 'UWBP_SecondaryButton_C::UseSecondaryColor' has a wrong offset!");

}

