#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyMember_ConsumableStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyMember_ConsumableStatus.WBP_PartyMember_ConsumableStatus_C
// 0x00B0 (0x03B8 - 0x0308)
class UWBP_PartyMember_ConsumableStatus_C final : public UPD3ConsumableStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnPickUpAnimation;                                 // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_I;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Value_T;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            NormalTextColor;                                   // 0x0330(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FSlateColor                            LowTextColor;                                      // 0x0358(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FSlateColor                            CriticalTextColor;                                 // 0x0380(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	float                                         HasAmmoOpacity;                                    // 0x03A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NoAmmoOpacity;                                     // 0x03AC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           DesignerToolIcon;                                  // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PartyMember_ConsumableStatus(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnIconChanged(const TSoftObjectPtr<class UPaperSprite>& InIcon);
	void OnConsumableCountChanged(int32 InAmmoInventory);
	void OnLoaded_534139B347CE697207941FBEC708B992(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyMember_ConsumableStatus_C">();
	}
	static class UWBP_PartyMember_ConsumableStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyMember_ConsumableStatus_C>();
	}
};
static_assert(alignof(UWBP_PartyMember_ConsumableStatus_C) == 0x000008, "Wrong alignment on UWBP_PartyMember_ConsumableStatus_C");
static_assert(sizeof(UWBP_PartyMember_ConsumableStatus_C) == 0x0003B8, "Wrong size on UWBP_PartyMember_ConsumableStatus_C");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, UberGraphFrame) == 0x000308, "Member 'UWBP_PartyMember_ConsumableStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, OnPickUpAnimation) == 0x000310, "Member 'UWBP_PartyMember_ConsumableStatus_C::OnPickUpAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, Background_I) == 0x000318, "Member 'UWBP_PartyMember_ConsumableStatus_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, Icon_I) == 0x000320, "Member 'UWBP_PartyMember_ConsumableStatus_C::Icon_I' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, Value_T) == 0x000328, "Member 'UWBP_PartyMember_ConsumableStatus_C::Value_T' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, NormalTextColor) == 0x000330, "Member 'UWBP_PartyMember_ConsumableStatus_C::NormalTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, LowTextColor) == 0x000358, "Member 'UWBP_PartyMember_ConsumableStatus_C::LowTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, CriticalTextColor) == 0x000380, "Member 'UWBP_PartyMember_ConsumableStatus_C::CriticalTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, HasAmmoOpacity) == 0x0003A8, "Member 'UWBP_PartyMember_ConsumableStatus_C::HasAmmoOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, NoAmmoOpacity) == 0x0003AC, "Member 'UWBP_PartyMember_ConsumableStatus_C::NoAmmoOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_PartyMember_ConsumableStatus_C, DesignerToolIcon) == 0x0003B0, "Member 'UWBP_PartyMember_ConsumableStatus_C::DesignerToolIcon' has a wrong offset!");

}

