#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Local_Navbar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Local_Navbar.WBP_Local_Navbar_C
// 0x0050 (0x0300 - 0x02B0)
class UWBP_Local_Navbar_C final : public USBZLocalNavBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_2;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_end_line;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Panel_ButtonContainer;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_end_line;                                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      Widget_TabBackward;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      Widget_TabForward;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ActiveIndex;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, HasGetValueTypeHash)
	float                                         MinButtonWidth;                                    // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsSecondLayer;                                     // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_Local_Navbar(int32 EntryPoint);
	void RebuildNavbar();
	void RefreshButtons();
	void OnTabBackward();
	void OnTabForward();
	void OnInitialized();
	void NavBarButtonClicked(int32 OutNavBarIndex);
	void PreConstruct(bool IsDesignTime);
	void UpdateIndex(int32 NewActiveIndex, bool IsInitial);
	void SetMaxCount(int32 InMaxCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Local_Navbar_C">();
	}
	static class UWBP_Local_Navbar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Local_Navbar_C>();
	}
};
static_assert(alignof(UWBP_Local_Navbar_C) == 0x000008, "Wrong alignment on UWBP_Local_Navbar_C");
static_assert(sizeof(UWBP_Local_Navbar_C) == 0x000300, "Wrong size on UWBP_Local_Navbar_C");
static_assert(offsetof(UWBP_Local_Navbar_C, UberGraphFrame) == 0x0002B0, "Member 'UWBP_Local_Navbar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, Background_2) == 0x0002B8, "Member 'UWBP_Local_Navbar_C::Background_2' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, Background_I) == 0x0002C0, "Member 'UWBP_Local_Navbar_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, Left_end_line) == 0x0002C8, "Member 'UWBP_Local_Navbar_C::Left_end_line' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, Panel_ButtonContainer) == 0x0002D0, "Member 'UWBP_Local_Navbar_C::Panel_ButtonContainer' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, Right_end_line) == 0x0002D8, "Member 'UWBP_Local_Navbar_C::Right_end_line' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, Widget_TabBackward) == 0x0002E0, "Member 'UWBP_Local_Navbar_C::Widget_TabBackward' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, Widget_TabForward) == 0x0002E8, "Member 'UWBP_Local_Navbar_C::Widget_TabForward' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, ActiveIndex) == 0x0002F0, "Member 'UWBP_Local_Navbar_C::ActiveIndex' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, MinButtonWidth) == 0x0002F4, "Member 'UWBP_Local_Navbar_C::MinButtonWidth' has a wrong offset!");
static_assert(offsetof(UWBP_Local_Navbar_C, IsSecondLayer) == 0x0002F8, "Member 'UWBP_Local_Navbar_C::IsSecondLayer' has a wrong offset!");

}

