#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Lobby_Player

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Lobby_Player.WBP_UI_Lobby_Player_C.ExecuteUbergraph_WBP_UI_Lobby_Player
// 0x0628 (0x0628 - 0x0000)
struct WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0014)(ZeroConstructor, NoDestructor)
	ESBZOnlineCode                                K2Node_CustomEvent_ErrorCode_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESBZOnlineCode ErrorCode)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0014)(ZeroConstructor, NoDestructor)
	ESBZOnlineCode                                K2Node_CustomEvent_ErrorCode;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESBZOnlineCode ErrorCode)>     K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZLobbyCharacterInfoUi               CallFunc_GetLobbyInfo_CharacterUIInfo;             // 0x0068(0x02D8)()
	bool                                          CallFunc_GetLobbyInfo_IsValid;                     // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZLobbyCharacterInfoUi               CallFunc_GetLobbyInfo_CharacterUIInfo_1;           // 0x0348(0x02D8)()
	bool                                          CallFunc_GetLobbyInfo_IsValid_1;                   // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player) == 0x000008, "Wrong alignment on WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player");
static_assert(sizeof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player) == 0x000628, "Wrong size on WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, EntryPoint) == 0x000000, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, CallFunc_GetSBZOnline_ReturnValue) == 0x000008, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::CallFunc_GetSBZOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, K2Node_CustomEvent_ErrorCode_1) == 0x000038, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::K2Node_CustomEvent_ErrorCode_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, K2Node_CustomEvent_ErrorCode) == 0x000050, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, CallFunc_GetLobbyInfo_CharacterUIInfo) == 0x000068, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::CallFunc_GetLobbyInfo_CharacterUIInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, CallFunc_GetLobbyInfo_IsValid) == 0x000340, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::CallFunc_GetLobbyInfo_IsValid' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, CallFunc_GetLobbyInfo_CharacterUIInfo_1) == 0x000348, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::CallFunc_GetLobbyInfo_CharacterUIInfo_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player, CallFunc_GetLobbyInfo_IsValid_1) == 0x000620, "Member 'WBP_UI_Lobby_Player_C_ExecuteUbergraph_WBP_UI_Lobby_Player::CallFunc_GetLobbyInfo_IsValid_1' has a wrong offset!");

// Function WBP_UI_Lobby_Player.WBP_UI_Lobby_Player_C.OnMMStopped
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Lobby_Player_C_OnMMStopped final
{
public:
	ESBZOnlineCode                                ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Lobby_Player_C_OnMMStopped) == 0x000001, "Wrong alignment on WBP_UI_Lobby_Player_C_OnMMStopped");
static_assert(sizeof(WBP_UI_Lobby_Player_C_OnMMStopped) == 0x000001, "Wrong size on WBP_UI_Lobby_Player_C_OnMMStopped");
static_assert(offsetof(WBP_UI_Lobby_Player_C_OnMMStopped, ErrorCode) == 0x000000, "Member 'WBP_UI_Lobby_Player_C_OnMMStopped::ErrorCode' has a wrong offset!");

// Function WBP_UI_Lobby_Player.WBP_UI_Lobby_Player_C.OnLobbyUpdate
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Lobby_Player_C_OnLobbyUpdate final
{
public:
	ESBZOnlineCode                                ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Lobby_Player_C_OnLobbyUpdate) == 0x000001, "Wrong alignment on WBP_UI_Lobby_Player_C_OnLobbyUpdate");
static_assert(sizeof(WBP_UI_Lobby_Player_C_OnLobbyUpdate) == 0x000001, "Wrong size on WBP_UI_Lobby_Player_C_OnLobbyUpdate");
static_assert(offsetof(WBP_UI_Lobby_Player_C_OnLobbyUpdate, ErrorCode) == 0x000000, "Member 'WBP_UI_Lobby_Player_C_OnLobbyUpdate::ErrorCode' has a wrong offset!");

// Function WBP_UI_Lobby_Player.WBP_UI_Lobby_Player_C.GetLobbyInfo
// 0x02F8 (0x02F8 - 0x0000)
struct WBP_UI_Lobby_Player_C_GetLobbyInfo final
{
public:
	struct FSBZLobbyCharacterInfoUi               CharacterUIInfo;                                   // 0x0000(0x02D8)(Parm, OutParm)
	bool                                          IsValid;                                           // 0x02D8(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZLobbyCharacterInfoUi>       CallFunc_GetUiLobbyInfo_OutInfo;                   // 0x02E0(0x0010)(ReferenceParm)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Lobby_Player_C_GetLobbyInfo) == 0x000008, "Wrong alignment on WBP_UI_Lobby_Player_C_GetLobbyInfo");
static_assert(sizeof(WBP_UI_Lobby_Player_C_GetLobbyInfo) == 0x0002F8, "Wrong size on WBP_UI_Lobby_Player_C_GetLobbyInfo");
static_assert(offsetof(WBP_UI_Lobby_Player_C_GetLobbyInfo, CharacterUIInfo) == 0x000000, "Member 'WBP_UI_Lobby_Player_C_GetLobbyInfo::CharacterUIInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_GetLobbyInfo, IsValid) == 0x0002D8, "Member 'WBP_UI_Lobby_Player_C_GetLobbyInfo::IsValid' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_GetLobbyInfo, CallFunc_GetUiLobbyInfo_OutInfo) == 0x0002E0, "Member 'WBP_UI_Lobby_Player_C_GetLobbyInfo::CallFunc_GetUiLobbyInfo_OutInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_GetLobbyInfo, CallFunc_Array_IsValidIndex_ReturnValue) == 0x0002F0, "Member 'WBP_UI_Lobby_Player_C_GetLobbyInfo::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");

// Function WBP_UI_Lobby_Player.WBP_UI_Lobby_Player_C.SetPlayerUIInfo
// 0x0340 (0x0340 - 0x0000)
struct WBP_UI_Lobby_Player_C_SetPlayerUIInfo final
{
public:
	struct FSBZLobbyCharacterInfoUi               InCharacter;                                       // 0x0000(0x02D8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          Temp_bool_Variable;                                // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x02E0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x02F8(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0310(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0328(0x0018)()
};
static_assert(alignof(WBP_UI_Lobby_Player_C_SetPlayerUIInfo) == 0x000008, "Wrong alignment on WBP_UI_Lobby_Player_C_SetPlayerUIInfo");
static_assert(sizeof(WBP_UI_Lobby_Player_C_SetPlayerUIInfo) == 0x000340, "Wrong size on WBP_UI_Lobby_Player_C_SetPlayerUIInfo");
static_assert(offsetof(WBP_UI_Lobby_Player_C_SetPlayerUIInfo, InCharacter) == 0x000000, "Member 'WBP_UI_Lobby_Player_C_SetPlayerUIInfo::InCharacter' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_SetPlayerUIInfo, Temp_bool_Variable) == 0x0002D8, "Member 'WBP_UI_Lobby_Player_C_SetPlayerUIInfo::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_SetPlayerUIInfo, Temp_text_Variable) == 0x0002E0, "Member 'WBP_UI_Lobby_Player_C_SetPlayerUIInfo::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_SetPlayerUIInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x0002F8, "Member 'WBP_UI_Lobby_Player_C_SetPlayerUIInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_SetPlayerUIInfo, Temp_text_Variable_1) == 0x000310, "Member 'WBP_UI_Lobby_Player_C_SetPlayerUIInfo::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Lobby_Player_C_SetPlayerUIInfo, K2Node_Select_Default) == 0x000328, "Member 'WBP_UI_Lobby_Player_C_SetPlayerUIInfo::K2Node_Select_Default' has a wrong offset!");

}

