#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_FrameInterpolatorChoiceButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton
// 0x0040 (0x0040 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsDisabled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuMouseButton*                    K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuMouseButton*                    K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton) == 0x000008, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton) == 0x000040, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, EntryPoint) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, K2Node_Event_bInIsDisabled) == 0x000004, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::K2Node_Event_bInIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, K2Node_Event_bInHasFocus) == 0x000005, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, K2Node_Event_bInIsHovered) == 0x000006, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000024, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, CallFunc_Less_IntInt_ReturnValue) == 0x000029, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, CallFunc_HasKeyboardFocus_ReturnValue) == 0x00002A, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000030, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ExecuteUbergraph_WBP_Settings_FrameInterpolatorChoiceButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_2_OnMenuMouseButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_2_OnMenuMouseButtonSelected__DelegateSignature final
{
public:
	class USBZMenuMouseButton*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_2_OnMenuMouseButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_2_OnMenuMouseButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_2_OnMenuMouseButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_2_OnMenuMouseButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_2_OnMenuMouseButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_2_OnMenuMouseButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature final
{
public:
	class USBZMenuMouseButton*                    Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.ButtonDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonDisabledChanged final
{
public:
	bool                                          bInIsDisabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonDisabledChanged) == 0x000001, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonDisabledChanged");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonDisabledChanged) == 0x000001, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonDisabledChanged");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonDisabledChanged, bInIsDisabled) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ButtonDisabledChanged::bInIsDisabled' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_PreConstruct");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_PreConstruct");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.RefreshVisuals
// 0x0002 (0x0002 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_RefreshVisuals final
{
public:
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_RefreshVisuals) == 0x000001, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_RefreshVisuals");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_RefreshVisuals) == 0x000002, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_RefreshVisuals");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_RefreshVisuals, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_RefreshVisuals::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_RefreshVisuals, CallFunc_IsHovered_ReturnValue) == 0x000001, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_RefreshVisuals::CallFunc_IsHovered_ReturnValue' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.OnHoverVisuals
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_OnHoverVisuals final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnHoverVisuals) == 0x000001, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_OnHoverVisuals");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnHoverVisuals) == 0x000001, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_OnHoverVisuals");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnHoverVisuals, bIsHovered) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnHoverVisuals::bIsHovered' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.OnFocusedVisuals
// 0x0088 (0x0088 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue;               // 0x0028(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue_1;             // 0x0038(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SettingIsDirty_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals) == 0x000008, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals) == 0x000088, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, bIsFocused) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x000010, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000020, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, CallFunc_GetGlobalColor_ReturnValue) == 0x000028, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::CallFunc_GetGlobalColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, CallFunc_GetGlobalColor_ReturnValue_1) == 0x000038, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::CallFunc_GetGlobalColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, CallFunc_SettingIsDirty_ReturnValue) == 0x000048, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::CallFunc_SettingIsDirty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, CallFunc_SelectColor_ReturnValue) == 0x00004C, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnFocusedVisuals::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.OnDisabledVisuals
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_OnDisabledVisuals final
{
public:
	bool                                          bIsDisabled_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnDisabledVisuals) == 0x000001, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_OnDisabledVisuals");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnDisabledVisuals) == 0x000001, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_OnDisabledVisuals");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_OnDisabledVisuals, bIsDisabled_0) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_OnDisabledVisuals::bIsDisabled_0' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.ChoiceIndexVisuals
// 0x0014 (0x0014 - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals final
{
public:
	int32                                         ChoiceIndex_0;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals) == 0x000004, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals) == 0x000014, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals, ChoiceIndex_0) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals::ChoiceIndex_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals, CallFunc_Subtract_IntInt_ReturnValue) == 0x000008, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals, CallFunc_Clamp_ReturnValue) == 0x00000C, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals, CallFunc_Greater_IntInt_ReturnValue) == 0x000011, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_ChoiceIndexVisuals::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Settings_FrameInterpolatorChoiceButton.WBP_Settings_FrameInterpolatorChoiceButton_C.UpdateOptionsText
// 0x000C (0x000C - 0x0000)
struct WBP_Settings_FrameInterpolatorChoiceButton_C_UpdateOptionsText final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_FrameInterpolatorChoiceButton_C_UpdateOptionsText) == 0x000004, "Wrong alignment on WBP_Settings_FrameInterpolatorChoiceButton_C_UpdateOptionsText");
static_assert(sizeof(WBP_Settings_FrameInterpolatorChoiceButton_C_UpdateOptionsText) == 0x00000C, "Wrong size on WBP_Settings_FrameInterpolatorChoiceButton_C_UpdateOptionsText");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_UpdateOptionsText, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_UpdateOptionsText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_FrameInterpolatorChoiceButton_C_UpdateOptionsText, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_Settings_FrameInterpolatorChoiceButton_C_UpdateOptionsText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
