#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_CategorySelectionScreen

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_CategorySelectionScreen.WBP_MainMenu_CategorySelectionScreen_C.ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_DailyChallengeItem_C*              K2Node_DynamicCast_AsWBP_Daily_Challenge_Item;     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZChallengeManager*                   CallFunc_GetChallengeManager_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4E[0x2];                                       // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Challenges_Screen_C*            K2Node_DynamicCast_AsWBP_UI_Challenges_Screen;     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Challenges_Screen_C*            K2Node_DynamicCast_AsWBP_UI_Challenges_Screen_1;   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Challenges_Screen_C*            K2Node_DynamicCast_AsWBP_UI_Challenges_Screen_2;   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_DailyChallengeItem_C*              K2Node_DynamicCast_AsWBP_Daily_Challenge_Item_1;   // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x2];                                       // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x00AC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZChallengeManager*                   CallFunc_GetChallengeManager_ReturnValue_1;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetRerollAvailable_ReturnValue;           // 0x00C9(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CB[0x5];                                       // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZChallengeManager*                   CallFunc_GetChallengeManager_ReturnValue_2;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRerollAvailable_ReturnValue_1;         // 0x00D8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputTypeController_ReturnValue;        // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZChallengeManager*                   CallFunc_GetChallengeManager_ReturnValue_3;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRerollAvailable_ReturnValue_2;         // 0x00E8(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen) == 0x000008, "Wrong alignment on WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen");
static_assert(sizeof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen) == 0x0000F0, "Wrong size on WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, Temp_bool_Variable) == 0x000004, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, Temp_byte_Variable) == 0x000005, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetChildAt_ReturnValue) == 0x000008, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_AsWBP_Daily_Challenge_Item) == 0x000010, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_AsWBP_Daily_Challenge_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000020, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x000028, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetChallengeManager_ReturnValue) == 0x000038, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetChallengeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_CustomEvent_ActionName) == 0x000040, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_SwitchName_CmpSuccess) == 0x00004C, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_IsValid_ReturnValue) == 0x00004D, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetUIManager_ReturnValue) == 0x000050, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000058, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, Temp_byte_Variable_2) == 0x000064, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_AsWBP_UI_Challenges_Screen) == 0x000068, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_AsWBP_UI_Challenges_Screen' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_AsWBP_UI_Challenges_Screen_1) == 0x000078, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_AsWBP_UI_Challenges_Screen_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000081, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetChildAt_ReturnValue_1) == 0x000088, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_AsWBP_UI_Challenges_Screen_2) == 0x000090, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_AsWBP_UI_Challenges_Screen_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_AsWBP_Daily_Challenge_Item_1) == 0x0000A0, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_AsWBP_Daily_Challenge_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_DynamicCast_bSuccess_4) == 0x0000A8, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, Temp_byte_Variable_3) == 0x0000A9, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_Event_PreviousValue) == 0x0000AC, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x0000B8, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetChallengeManager_ReturnValue_1) == 0x0000C0, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetChallengeManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, Temp_bool_Variable_1) == 0x0000C8, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetRerollAvailable_ReturnValue) == 0x0000C9, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetRerollAvailable_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_Event_IsDesignTime) == 0x0000CA, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetChallengeManager_ReturnValue_2) == 0x0000D0, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetChallengeManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetRerollAvailable_ReturnValue_1) == 0x0000D8, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetRerollAvailable_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_IsInputTypeController_ReturnValue) == 0x0000D9, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_IsInputTypeController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_BooleanAND_ReturnValue) == 0x0000DA, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_Select_Default) == 0x0000DB, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetChallengeManager_ReturnValue_3) == 0x0000E0, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetChallengeManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, CallFunc_GetRerollAvailable_ReturnValue_2) == 0x0000E8, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::CallFunc_GetRerollAvailable_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen, K2Node_Select_Default_1) == 0x0000E9, "Member 'WBP_MainMenu_CategorySelectionScreen_C_ExecuteUbergraph_WBP_MainMenu_CategorySelectionScreen::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_MainMenu_CategorySelectionScreen.WBP_MainMenu_CategorySelectionScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MainMenu_CategorySelectionScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MainMenu_CategorySelectionScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MainMenu_CategorySelectionScreen_C_PreConstruct");
static_assert(sizeof(WBP_MainMenu_CategorySelectionScreen_C_PreConstruct) == 0x000001, "Wrong size on WBP_MainMenu_CategorySelectionScreen_C_PreConstruct");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MainMenu_CategorySelectionScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MainMenu_CategorySelectionScreen.WBP_MainMenu_CategorySelectionScreen_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_MainMenu_CategorySelectionScreen_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_CategorySelectionScreen_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_MainMenu_CategorySelectionScreen_C_OnGainedStackFocused");
static_assert(sizeof(WBP_MainMenu_CategorySelectionScreen_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_MainMenu_CategorySelectionScreen_C_OnGainedStackFocused");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_MainMenu_CategorySelectionScreen_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_MainMenu_CategorySelectionScreen.WBP_MainMenu_CategorySelectionScreen_C.OnControlsReferencePressed
// 0x000C (0x000C - 0x0000)
struct WBP_MainMenu_CategorySelectionScreen_C_OnControlsReferencePressed final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_CategorySelectionScreen_C_OnControlsReferencePressed) == 0x000004, "Wrong alignment on WBP_MainMenu_CategorySelectionScreen_C_OnControlsReferencePressed");
static_assert(sizeof(WBP_MainMenu_CategorySelectionScreen_C_OnControlsReferencePressed) == 0x00000C, "Wrong size on WBP_MainMenu_CategorySelectionScreen_C_OnControlsReferencePressed");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_OnControlsReferencePressed, ActionName) == 0x000000, "Member 'WBP_MainMenu_CategorySelectionScreen_C_OnControlsReferencePressed::ActionName' has a wrong offset!");

// Function WBP_MainMenu_CategorySelectionScreen.WBP_MainMenu_CategorySelectionScreen_C.SetControlReference
// 0x0108 (0x0108 - 0x0000)
struct WBP_MainMenu_CategorySelectionScreen_C_SetControlReference final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0038(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0080(0x0018)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x00A0(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x00E0(0x0028)()
};
static_assert(alignof(WBP_MainMenu_CategorySelectionScreen_C_SetControlReference) == 0x000008, "Wrong alignment on WBP_MainMenu_CategorySelectionScreen_C_SetControlReference");
static_assert(sizeof(WBP_MainMenu_CategorySelectionScreen_C_SetControlReference) == 0x000108, "Wrong size on WBP_MainMenu_CategorySelectionScreen_C_SetControlReference");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_SetControlReference, Temp_bool_Variable) == 0x000000, "Member 'WBP_MainMenu_CategorySelectionScreen_C_SetControlReference::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_CategorySelectionScreen_C_SetControlReference, Temp_text_Variable) == 0x000008, "Member 'WBP_MainMenu_CategorySelectionScreen_C_SetControlReference::Temp_text_Variable' has a wrong offset!");
