#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_BaseDistanceCount_RinoHud

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_BaseDistanceCount_RinoHud.WBP_UI_Widget_BaseDistanceCount_RinoHud_C.ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud");
static_assert(sizeof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud) == 0x000010, "Wrong size on WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistanceCount_RinoHud::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_BaseDistanceCount_RinoHud.WBP_UI_Widget_BaseDistanceCount_RinoHud_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_BaseDistanceCount_RinoHud_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_BaseDistanceCount_RinoHud_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_BaseDistanceCount_RinoHud_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_BaseDistanceCount_RinoHud.WBP_UI_Widget_BaseDistanceCount_RinoHud_C.SetValues
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_BaseDistanceCount_RinoHud_C_SetValues final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Count;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_SetValues) == 0x000004, "Wrong alignment on WBP_UI_Widget_BaseDistanceCount_RinoHud_C_SetValues");
static_assert(sizeof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_SetValues) == 0x000008, "Wrong size on WBP_UI_Widget_BaseDistanceCount_RinoHud_C_SetValues");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_SetValues, Distance) == 0x000000, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C_SetValues::Distance' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C_SetValues, Count) == 0x000004, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C_SetValues::Count' has a wrong offset!");

// Function WBP_UI_Widget_BaseDistanceCount_RinoHud.WBP_UI_Widget_BaseDistanceCount_RinoHud_C._Update
// 0x0078 (0x0078 - 0x0000)
struct WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update final
{
public:
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0000(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_FFloor64_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0028(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update");
static_assert(sizeof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update) == 0x000078, "Wrong size on WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update, CallFunc_Conv_IntToText_ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000018, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update, CallFunc_FFloor64_ReturnValue) == 0x000020, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update::CallFunc_FFloor64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update, CallFunc_Conv_TextToString_ReturnValue) == 0x000040, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WBP_UI_Widget_BaseDistanceCount_RinoHud_C__Update::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

