#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuRoot_SecondaryTextButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MenuRoot_SecondaryTextButton.WBP_MenuRoot_SecondaryTextButton_C
// 0x0040 (0x03A0 - 0x0360)
class UWBP_MenuRoot_SecondaryTextButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Focused;                                           // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 EdgeBorder_I;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FadedGradient_I;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Title_T;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   InTitle;                                           // 0x0388(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_MenuRoot_SecondaryTextButton(int32 EntryPoint);
	void ButtonFocusChanging(bool bInHasFocus);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MenuRoot_SecondaryTextButton_C">();
	}
	static class UWBP_MenuRoot_SecondaryTextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MenuRoot_SecondaryTextButton_C>();
	}
};
static_assert(alignof(UWBP_MenuRoot_SecondaryTextButton_C) == 0x000008, "Wrong alignment on UWBP_MenuRoot_SecondaryTextButton_C");
static_assert(sizeof(UWBP_MenuRoot_SecondaryTextButton_C) == 0x0003A0, "Wrong size on UWBP_MenuRoot_SecondaryTextButton_C");
static_assert(offsetof(UWBP_MenuRoot_SecondaryTextButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_MenuRoot_SecondaryTextButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_SecondaryTextButton_C, Focused) == 0x000368, "Member 'UWBP_MenuRoot_SecondaryTextButton_C::Focused' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_SecondaryTextButton_C, EdgeBorder_I) == 0x000370, "Member 'UWBP_MenuRoot_SecondaryTextButton_C::EdgeBorder_I' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_SecondaryTextButton_C, FadedGradient_I) == 0x000378, "Member 'UWBP_MenuRoot_SecondaryTextButton_C::FadedGradient_I' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_SecondaryTextButton_C, Title_T) == 0x000380, "Member 'UWBP_MenuRoot_SecondaryTextButton_C::Title_T' has a wrong offset!");
static_assert(offsetof(UWBP_MenuRoot_SecondaryTextButton_C, InTitle) == 0x000388, "Member 'UWBP_MenuRoot_SecondaryTextButton_C::InTitle' has a wrong offset!");

}

