#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Loadout_WeaponCustomizationNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Loadout_WeaponCustomizationNew.WBP_MainMenu_Loadout_WeaponCustomizationNew_C
// 0x0068 (0x03E8 - 0x0380)
class UWBP_MainMenu_Loadout_WeaponCustomizationNew_C final : public USBZMainMenuLoadoutWeaponModCategoryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0380(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_306;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_tittle;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenTitle_C*                     ScreenTitle;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Menu_ActionInputButton_C*       TutorialPopup_Button;                              // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_WeaponStats_C*           WBP_UI_Widget_WeaponStats;                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        WeaponHeader_T;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Inventory_ItemDescription_C*    Widget_WeaponDescription;                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_WeaponProgressionWidget_C*      Widget_WeaponProgressionDisplay;                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMenuButton*                         FocusedButton;                                     // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MainMenu_Loadout_WeaponCustomizationNew(int32 EntryPoint);
	void OnAddedToStack();
	void OnRemovedFromStack();
	void BndEvt__WBP_MainMenu_Loadout_WeaponCustomizationNew_TutorialPopup_Button_K2Node_ComponentBoundEvent_0_OnButtonClicked__DelegateSignature();
	void OnTutorialHidden();
	void OnBackPressed();
	void OnCategoryButtonFocused(class USBZMenuButton* InButton, bool bIsFocused);
	void OnControlsReferenceClicked(class FName InActionInput);
	void OnLostStackFocused();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void UpdateControlsReference();
	void SetCategoryPadding();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Loadout_WeaponCustomizationNew_C">();
	}
	static class UWBP_MainMenu_Loadout_WeaponCustomizationNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Loadout_WeaponCustomizationNew_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_Loadout_WeaponCustomizationNew_C");
static_assert(sizeof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C) == 0x0003E8, "Wrong size on UWBP_MainMenu_Loadout_WeaponCustomizationNew_C");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, UberGraphFrame) == 0x000380, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, Intro) == 0x000388, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, Image) == 0x000390, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, Image_1) == 0x000398, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, Image_306) == 0x0003A0, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::Image_306' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, Image_tittle) == 0x0003A8, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::Image_tittle' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, ScreenTitle) == 0x0003B0, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::ScreenTitle' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, TutorialPopup_Button) == 0x0003B8, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::TutorialPopup_Button' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, WBP_UI_Widget_WeaponStats) == 0x0003C0, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::WBP_UI_Widget_WeaponStats' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, WeaponHeader_T) == 0x0003C8, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::WeaponHeader_T' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, Widget_WeaponDescription) == 0x0003D0, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::Widget_WeaponDescription' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, Widget_WeaponProgressionDisplay) == 0x0003D8, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::Widget_WeaponProgressionDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_WeaponCustomizationNew_C, FocusedButton) == 0x0003E0, "Member 'UWBP_MainMenu_Loadout_WeaponCustomizationNew_C::FocusedButton' has a wrong offset!");

}

