#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ButtonCheckBox

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_ButtonCheckBox.WBP_UI_ButtonCheckBox_C.ExecuteUbergraph_WBP_UI_ButtonCheckBox
// 0x001C (0x001C - 0x0000)
struct WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue;               // 0x0008(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox) == 0x000004, "Wrong alignment on WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox");
static_assert(sizeof(WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox) == 0x00001C, "Wrong size on WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox, EntryPoint) == 0x000000, "Member 'WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox, K2Node_Event_bInIsHovered) == 0x000004, "Member 'WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox, K2Node_Event_bInHasFocus) == 0x000005, "Member 'WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox, K2Node_Event_IsDesignTime) == 0x000006, "Member 'WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox, CallFunc_GetGlobalColor_ReturnValue) == 0x000008, "Member 'WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox::CallFunc_GetGlobalColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'WBP_UI_ButtonCheckBox_C_ExecuteUbergraph_WBP_UI_ButtonCheckBox::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_UI_ButtonCheckBox.WBP_UI_ButtonCheckBox_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_ButtonCheckBox_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ButtonCheckBox_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_ButtonCheckBox_C_PreConstruct");
static_assert(sizeof(WBP_UI_ButtonCheckBox_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_ButtonCheckBox_C_PreConstruct");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_ButtonCheckBox_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_ButtonCheckBox.WBP_UI_ButtonCheckBox_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_ButtonCheckBox_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ButtonCheckBox_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_UI_ButtonCheckBox_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_UI_ButtonCheckBox_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_UI_ButtonCheckBox_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_UI_ButtonCheckBox_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_UI_ButtonCheckBox.WBP_UI_ButtonCheckBox_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_ButtonCheckBox_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ButtonCheckBox_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_UI_ButtonCheckBox_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_UI_ButtonCheckBox_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_UI_ButtonCheckBox_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_UI_ButtonCheckBox_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_UI_ButtonCheckBox.WBP_UI_ButtonCheckBox_C.SetCheckBox
// 0x0006 (0x0006 - 0x0000)
struct WBP_UI_ButtonCheckBox_C_SetCheckBox final
{
public:
	bool                                          bNewIsChecked;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ButtonCheckBox_C_SetCheckBox) == 0x000001, "Wrong alignment on WBP_UI_ButtonCheckBox_C_SetCheckBox");
static_assert(sizeof(WBP_UI_ButtonCheckBox_C_SetCheckBox) == 0x000006, "Wrong size on WBP_UI_ButtonCheckBox_C_SetCheckBox");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_SetCheckBox, bNewIsChecked) == 0x000000, "Member 'WBP_UI_ButtonCheckBox_C_SetCheckBox::bNewIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_SetCheckBox, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_ButtonCheckBox_C_SetCheckBox::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_SetCheckBox, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UI_ButtonCheckBox_C_SetCheckBox::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_SetCheckBox, Temp_bool_Variable) == 0x000003, "Member 'WBP_UI_ButtonCheckBox_C_SetCheckBox::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_SetCheckBox, K2Node_Select_Default) == 0x000004, "Member 'WBP_UI_ButtonCheckBox_C_SetCheckBox::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_SetCheckBox, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'WBP_UI_ButtonCheckBox_C_SetCheckBox::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_UI_ButtonCheckBox.WBP_UI_ButtonCheckBox_C.OnFocusChanged
// 0x0024 (0x0024 - 0x0000)
struct WBP_UI_ButtonCheckBox_C_OnFocusChanged final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ButtonCheckBox_C_OnFocusChanged) == 0x000004, "Wrong alignment on WBP_UI_ButtonCheckBox_C_OnFocusChanged");
static_assert(sizeof(WBP_UI_ButtonCheckBox_C_OnFocusChanged) == 0x000024, "Wrong size on WBP_UI_ButtonCheckBox_C_OnFocusChanged");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_OnFocusChanged, bIsFocused) == 0x000000, "Member 'WBP_UI_ButtonCheckBox_C_OnFocusChanged::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_OnFocusChanged, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_UI_ButtonCheckBox_C_OnFocusChanged::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_OnFocusChanged, CallFunc_SelectColor_ReturnValue_1) == 0x000014, "Member 'WBP_UI_ButtonCheckBox_C_OnFocusChanged::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_ButtonCheckBox.WBP_UI_ButtonCheckBox_C.OnHoverChanged
// 0x0005 (0x0005 - 0x0000)
struct WBP_UI_ButtonCheckBox_C_OnHoverChanged final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ButtonCheckBox_C_OnHoverChanged) == 0x000001, "Wrong alignment on WBP_UI_ButtonCheckBox_C_OnHoverChanged");
static_assert(sizeof(WBP_UI_ButtonCheckBox_C_OnHoverChanged) == 0x000005, "Wrong size on WBP_UI_ButtonCheckBox_C_OnHoverChanged");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_OnHoverChanged, bIsHovered) == 0x000000, "Member 'WBP_UI_ButtonCheckBox_C_OnHoverChanged::bIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_OnHoverChanged, Temp_bool_Variable) == 0x000001, "Member 'WBP_UI_ButtonCheckBox_C_OnHoverChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_OnHoverChanged, Temp_byte_Variable) == 0x000002, "Member 'WBP_UI_ButtonCheckBox_C_OnHoverChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_OnHoverChanged, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_UI_ButtonCheckBox_C_OnHoverChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ButtonCheckBox_C_OnHoverChanged, K2Node_Select_Default) == 0x000004, "Member 'WBP_UI_ButtonCheckBox_C_OnHoverChanged::K2Node_Select_Default' has a wrong offset!");

}

