#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CrimeNet_HeistDescriptionPanel_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CrimeNet_HeistDescriptionPanel_2.WBP_CrimeNet_HeistDescriptionPanel_2_C
// 0x0090 (0x0320 - 0x0290)
class UWBP_CrimeNet_HeistDescriptionPanel_2_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_LevelIcon;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_Hard;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_Normal;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_Overkill;                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_VeryHard;                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_HeistDescription;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Tex_Pattern_Dots;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_BestTime_Loud;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_BestTime_Stealth;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Desc_LevelDescription;                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Desc_LevelName;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Difficulty;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_SecurityCompanies;                     // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperSprite*                           TWK_DefaultHeistImage;                             // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPD3HeistDataAsset*                     RT_HeistData;                                      // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZDifficulty                                RT_Difficulty;                                     // 0x0318(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_CrimeNet_HeistDescriptionPanel_2(int32 EntryPoint);
	void InitializeHeistData(class UPD3HeistDataAsset* InHeistData);
	void OnInitialized();
	void OnLoaded_60A324174F38BA985051939D434488B5(class UObject* Loaded);
	void UpdatePanelTimer(float Timer, bool bIsStealth);
	void SetNoHeistData();
	void UpdateDifficultyVisuals(ESBZDifficulty InDifficulty);
	void SetDifficulty(ESBZDifficulty InDifficulty);
	void UpdateTimers();
	void UpdateSecuirtyCompanies();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CrimeNet_HeistDescriptionPanel_2_C">();
	}
	static class UWBP_CrimeNet_HeistDescriptionPanel_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CrimeNet_HeistDescriptionPanel_2_C>();
	}
};
static_assert(alignof(UWBP_CrimeNet_HeistDescriptionPanel_2_C) == 0x000008, "Wrong alignment on UWBP_CrimeNet_HeistDescriptionPanel_2_C");
static_assert(sizeof(UWBP_CrimeNet_HeistDescriptionPanel_2_C) == 0x000320, "Wrong size on UWBP_CrimeNet_HeistDescriptionPanel_2_C");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, UberGraphFrame) == 0x000290, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Image_LevelIcon) == 0x000298, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Image_LevelIcon' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Image_RiskLevel_Hard) == 0x0002A0, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Image_RiskLevel_Hard' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Image_RiskLevel_Normal) == 0x0002A8, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Image_RiskLevel_Normal' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Image_RiskLevel_Overkill) == 0x0002B0, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Image_RiskLevel_Overkill' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Image_RiskLevel_VeryHard) == 0x0002B8, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Image_RiskLevel_VeryHard' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Overlay_0) == 0x0002C0, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Overlay_0' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Overlay_HeistDescription) == 0x0002C8, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Overlay_HeistDescription' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Tex_Pattern_Dots) == 0x0002D0, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Tex_Pattern_Dots' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Text_BestTime_Loud) == 0x0002D8, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Text_BestTime_Loud' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Text_BestTime_Stealth) == 0x0002E0, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Text_BestTime_Stealth' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Text_Desc_LevelDescription) == 0x0002E8, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Text_Desc_LevelDescription' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Text_Desc_LevelName) == 0x0002F0, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Text_Desc_LevelName' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, Text_Difficulty) == 0x0002F8, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::Text_Difficulty' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, VerticalBox_SecurityCompanies) == 0x000300, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::VerticalBox_SecurityCompanies' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, TWK_DefaultHeistImage) == 0x000308, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::TWK_DefaultHeistImage' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, RT_HeistData) == 0x000310, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::RT_HeistData' has a wrong offset!");
static_assert(offsetof(UWBP_CrimeNet_HeistDescriptionPanel_2_C, RT_Difficulty) == 0x000318, "Member 'UWBP_CrimeNet_HeistDescriptionPanel_2_C::RT_Difficulty' has a wrong offset!");

}

