#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_ActionPhaseMenu

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SM_ActionPhaseMenu.WBP_UI_SM_ActionPhaseMenu_C.ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu
// 0x0060 (0x0060 - 0x0000)
struct WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsShown;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsPaused;                          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_1;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0038(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PeekStack_ReturnValue;                    // 0x0044(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu) == 0x000008, "Wrong alignment on WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu");
static_assert(sizeof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu) == 0x000060, "Wrong size on WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, EntryPoint) == 0x000000, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, K2Node_Event_bIsShown) == 0x000006, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::K2Node_Event_bIsShown' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, Temp_bool_Variable) == 0x000007, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, K2Node_Select_Default) == 0x000008, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, K2Node_Event_bInIsPaused) == 0x000009, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::K2Node_Event_bInIsPaused' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, CallFunc_Play2DSound_ReturnValue) == 0x000020, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, CallFunc_Play2DSound_ReturnValue_1) == 0x000024, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::CallFunc_Play2DSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, CallFunc_GetUIManager_ReturnValue) == 0x000028, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, CallFunc_GetUIManager_ReturnValue_1) == 0x000030, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, CallFunc_PopStack_ReturnValue) == 0x000038, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, CallFunc_PeekStack_ReturnValue) == 0x000044, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::CallFunc_PeekStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, CallFunc_MakeLiteralName_ReturnValue) == 0x000050, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00005C, "Member 'WBP_UI_SM_ActionPhaseMenu_C_ExecuteUbergraph_WBP_UI_SM_ActionPhaseMenu::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_UI_SM_ActionPhaseMenu.WBP_UI_SM_ActionPhaseMenu_C.BP_OnPausedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_SM_ActionPhaseMenu_C_BP_OnPausedChanged final
{
public:
	bool                                          bInIsPaused;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_ActionPhaseMenu_C_BP_OnPausedChanged) == 0x000001, "Wrong alignment on WBP_UI_SM_ActionPhaseMenu_C_BP_OnPausedChanged");
static_assert(sizeof(WBP_UI_SM_ActionPhaseMenu_C_BP_OnPausedChanged) == 0x000001, "Wrong size on WBP_UI_SM_ActionPhaseMenu_C_BP_OnPausedChanged");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_BP_OnPausedChanged, bInIsPaused) == 0x000000, "Member 'WBP_UI_SM_ActionPhaseMenu_C_BP_OnPausedChanged::bInIsPaused' has a wrong offset!");

// Function WBP_UI_SM_ActionPhaseMenu.WBP_UI_SM_ActionPhaseMenu_C.OnMenuShown
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_SM_ActionPhaseMenu_C_OnMenuShown final
{
public:
	bool                                          bIsShown;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_ActionPhaseMenu_C_OnMenuShown) == 0x000001, "Wrong alignment on WBP_UI_SM_ActionPhaseMenu_C_OnMenuShown");
static_assert(sizeof(WBP_UI_SM_ActionPhaseMenu_C_OnMenuShown) == 0x000001, "Wrong size on WBP_UI_SM_ActionPhaseMenu_C_OnMenuShown");
static_assert(offsetof(WBP_UI_SM_ActionPhaseMenu_C_OnMenuShown, bIsShown) == 0x000000, "Member 'WBP_UI_SM_ActionPhaseMenu_C_OnMenuShown::bIsShown' has a wrong offset!");

}

