#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MenuPlayerStatus

#include "Basic.hpp"

#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MenuPlayerStatus.WBP_UI_MenuPlayerStatus_C
// 0x0028 (0x02B8 - 0x0290)
class UWBP_UI_MenuPlayerStatus_C final : public USBZWidgetBase
{
public:
	class UWBP_Widget_CurrencyWidget_C*           CashCurrency;                                      // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_CurrencyWidget_C*           CStacksCurrency;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LocalPlayerInfo_C*                 LocalPlayerInfo;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SocialButton_C*                    SocialIconButton;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZWidgetBase*                         FocusedWidget;                                     // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MenuPlayerStatus_C">();
	}
	static class UWBP_UI_MenuPlayerStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MenuPlayerStatus_C>();
	}
};
static_assert(alignof(UWBP_UI_MenuPlayerStatus_C) == 0x000008, "Wrong alignment on UWBP_UI_MenuPlayerStatus_C");
static_assert(sizeof(UWBP_UI_MenuPlayerStatus_C) == 0x0002B8, "Wrong size on UWBP_UI_MenuPlayerStatus_C");
static_assert(offsetof(UWBP_UI_MenuPlayerStatus_C, CashCurrency) == 0x000290, "Member 'UWBP_UI_MenuPlayerStatus_C::CashCurrency' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MenuPlayerStatus_C, CStacksCurrency) == 0x000298, "Member 'UWBP_UI_MenuPlayerStatus_C::CStacksCurrency' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MenuPlayerStatus_C, LocalPlayerInfo) == 0x0002A0, "Member 'UWBP_UI_MenuPlayerStatus_C::LocalPlayerInfo' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MenuPlayerStatus_C, SocialIconButton) == 0x0002A8, "Member 'UWBP_UI_MenuPlayerStatus_C::SocialIconButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MenuPlayerStatus_C, FocusedWidget) == 0x0002B0, "Member 'UWBP_UI_MenuPlayerStatus_C::FocusedWidget' has a wrong offset!");

}

