#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_CrimeNet_ServerBrowser

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_CrimeNet_ServerBrowser.WBP_UI_MainMenu_CrimeNet_ServerBrowser_C
// 0x0048 (0x0308 - 0x02C0)
class UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C final : public USBZMenuStackScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UScrollBox*                             ScrollBox_ServerList;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_HeistHeader;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LookingForSessions;                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NoServers;                                    // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PingHeader;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlayerCount;                                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bCanRefresh;                                       // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_MainMenu_CrimeNet_ServerButton_C* ActiveButton;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_CrimeNet_ServerBrowser(int32 EntryPoint);
	void OnButtonFocusedChanged(class USBZMenuButton* Button, bool bIsEnabled_0);
	void OnControlsReferenceClicked(class FName InActionInput);
	void OnInviteFinished(ESBZOnlineCode ErrorCode);
	void OnJoinStarted(const struct FSBZOnlineSearchResult& RemoteSessionInfo);
	void ReloadButtons();
	void OnInitialized();
	void OnLostStackFocused();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void OnComplete_EB7A1BA74C1C1AA3C504FCA022A4D55A(ESBZOnlineCode ErrorCode, const TArray<struct FSBZOnlineSearchResult>& Results);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_CrimeNet_ServerBrowser_C">();
	}
	static class UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C");
static_assert(sizeof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C) == 0x000308, "Wrong size on UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C, ScrollBox_ServerList) == 0x0002C8, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C::ScrollBox_ServerList' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C, Text_HeistHeader) == 0x0002D0, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C::Text_HeistHeader' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C, Text_LookingForSessions) == 0x0002D8, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C::Text_LookingForSessions' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C, Text_NoServers) == 0x0002E0, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C::Text_NoServers' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C, Text_PingHeader) == 0x0002E8, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C::Text_PingHeader' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C, Text_PlayerCount) == 0x0002F0, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C::Text_PlayerCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C, bCanRefresh) == 0x0002F8, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C::bCanRefresh' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C, ActiveButton) == 0x000300, "Member 'UWBP_UI_MainMenu_CrimeNet_ServerBrowser_C::ActiveButton' has a wrong offset!");

}

