#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_LoadingScreen

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_LoadingScreen.WBP_UI_Widget_LoadingScreen_C.ExecuteUbergraph_WBP_UI_Widget_LoadingScreen
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen) == 0x000008, "Wrong alignment on WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen");
static_assert(sizeof(WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen) == 0x000010, "Wrong size on WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen");
static_assert(offsetof(WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen, CallFunc_Play_ReturnValue) == 0x000004, "Member 'WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_LoadingScreen_C_ExecuteUbergraph_WBP_UI_Widget_LoadingScreen::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

}

