#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_SuitComseticCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_SuitComseticCustomization.WBP_UI_Inventory_SuitComseticCustomization_C
// 0x0040 (0x03D0 - 0x0390)
class UWBP_UI_Inventory_SuitComseticCustomization_C final : public USBZMainMenuSuitCosmeticCustomizationScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_Body;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CosmeticType;                                 // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_EquippedItemName;                             // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Inventory_ItemDescription_C*    Widget_FocusedDescription;                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_ImageIcon;                                  // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMenuButton*                         RT_FocusedButton;                                  // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                RT_WidgetPopUp;                                    // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization(int32 EntryPoint);
	void OnControlsReferenceClicked(class FName ActionName);
	void OnInitialized();
	void BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature(class USBZMainMenuCosmeticItemButton* CosmeticButton, bool bIsEnabled_0);
	void EquippedItemChanged(const class USBZCosmeticsDataAsset* InEquippedItem);
	void OnLostStackFocused();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void InitializeVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_SuitComseticCustomization_C">();
	}
	static class UWBP_UI_Inventory_SuitComseticCustomization_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_SuitComseticCustomization_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_SuitComseticCustomization_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_SuitComseticCustomization_C");
static_assert(sizeof(UWBP_UI_Inventory_SuitComseticCustomization_C) == 0x0003D0, "Wrong size on UWBP_UI_Inventory_SuitComseticCustomization_C");
static_assert(offsetof(UWBP_UI_Inventory_SuitComseticCustomization_C, UberGraphFrame) == 0x000390, "Member 'UWBP_UI_Inventory_SuitComseticCustomization_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitComseticCustomization_C, CanvasPanel_Body) == 0x000398, "Member 'UWBP_UI_Inventory_SuitComseticCustomization_C::CanvasPanel_Body' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitComseticCustomization_C, Text_CosmeticType) == 0x0003A0, "Member 'UWBP_UI_Inventory_SuitComseticCustomization_C::Text_CosmeticType' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitComseticCustomization_C, Text_EquippedItemName) == 0x0003A8, "Member 'UWBP_UI_Inventory_SuitComseticCustomization_C::Text_EquippedItemName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitComseticCustomization_C, Widget_FocusedDescription) == 0x0003B0, "Member 'UWBP_UI_Inventory_SuitComseticCustomization_C::Widget_FocusedDescription' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitComseticCustomization_C, Widget_ImageIcon) == 0x0003B8, "Member 'UWBP_UI_Inventory_SuitComseticCustomization_C::Widget_ImageIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitComseticCustomization_C, RT_FocusedButton) == 0x0003C0, "Member 'UWBP_UI_Inventory_SuitComseticCustomization_C::RT_FocusedButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_SuitComseticCustomization_C, RT_WidgetPopUp) == 0x0003C8, "Member 'UWBP_UI_Inventory_SuitComseticCustomization_C::RT_WidgetPopUp' has a wrong offset!");

}

