#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_PreplanningItemSelection

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_PreplanningItemSelection.WBP_UI_PreplanningItemSelection_C
// 0x0070 (0x0388 - 0x0318)
class UWBP_UI_PreplanningItemSelection_C final : public USBZMainMenuPrePlanningItemSelectionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_3;                                           // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_193;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Overlay;                                     // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_FocusedAssetDescription;                      // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_PreplanningItemVisuals_C*       Widget_SelectedAssetPlayer1;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_PreplanningItemVisuals_C*       Widget_SelectedAssetPlayer2;                       // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_PreplanningItemVisuals_C*       Widget_SelectedAssetPlayer3;                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_PreplanningItemVisuals_C*       Widget_SelectedAssetPlayer4;                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMenuButton*                         ActiveButton;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Preplanning_MainMenu_C*         PreplanningMenuParent;                             // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_PreplanningItemSelection(int32 EntryPoint);
	void Destruct();
	void OnPreplanningSelectionEnabledChanged(bool bEnabled);
	void PreConstruct(bool IsDesignTime);
	void OnPreplanningAssetDeclinedByServer();
	void OnControlsReferenceClicked(class FName InActionInput);
	void OnPrePlanningItemButtonFocused(class USBZMenuButton* InButton, bool bIsFocused);
	void OnInitialized();
	void OnPreplanningAssetRemovedByPlayer(const struct FUniqueNetIdRepl& PlayerID);
	void OnPreplanningAssetAddedByPlayer(const struct FUniqueNetIdRepl& PlayerID, const class USBZPreplanningAssetData* PreplanningAsset);
	void GetPlayerIndex(const struct FUniqueNetIdRepl& InPlayerID, int32* Index_0);
	void UpdatePreplanningDescription(class USBZPreplanningAssetData* InPreplanning);
	void ResetPreplanningSelection();
	void SetSoloModeVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_PreplanningItemSelection_C">();
	}
	static class UWBP_UI_PreplanningItemSelection_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_PreplanningItemSelection_C>();
	}
};
static_assert(alignof(UWBP_UI_PreplanningItemSelection_C) == 0x000008, "Wrong alignment on UWBP_UI_PreplanningItemSelection_C");
static_assert(sizeof(UWBP_UI_PreplanningItemSelection_C) == 0x000388, "Wrong size on UWBP_UI_PreplanningItemSelection_C");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, UberGraphFrame) == 0x000318, "Member 'UWBP_UI_PreplanningItemSelection_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Image_3) == 0x000320, "Member 'UWBP_UI_PreplanningItemSelection_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Image_4) == 0x000328, "Member 'UWBP_UI_PreplanningItemSelection_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Image_5) == 0x000330, "Member 'UWBP_UI_PreplanningItemSelection_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Image_6) == 0x000338, "Member 'UWBP_UI_PreplanningItemSelection_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Image_193) == 0x000340, "Member 'UWBP_UI_PreplanningItemSelection_C::Image_193' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Image_Overlay) == 0x000348, "Member 'UWBP_UI_PreplanningItemSelection_C::Image_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Text_FocusedAssetDescription) == 0x000350, "Member 'UWBP_UI_PreplanningItemSelection_C::Text_FocusedAssetDescription' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Widget_SelectedAssetPlayer1) == 0x000358, "Member 'UWBP_UI_PreplanningItemSelection_C::Widget_SelectedAssetPlayer1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Widget_SelectedAssetPlayer2) == 0x000360, "Member 'UWBP_UI_PreplanningItemSelection_C::Widget_SelectedAssetPlayer2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Widget_SelectedAssetPlayer3) == 0x000368, "Member 'UWBP_UI_PreplanningItemSelection_C::Widget_SelectedAssetPlayer3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, Widget_SelectedAssetPlayer4) == 0x000370, "Member 'UWBP_UI_PreplanningItemSelection_C::Widget_SelectedAssetPlayer4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, ActiveButton) == 0x000378, "Member 'UWBP_UI_PreplanningItemSelection_C::ActiveButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PreplanningItemSelection_C, PreplanningMenuParent) == 0x000380, "Member 'UWBP_UI_PreplanningItemSelection_C::PreplanningMenuParent' has a wrong offset!");

}

