#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_More

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_More.WBP_Menu_More_C.ExecuteUbergraph_WBP_Menu_More
// 0x0460 (0x0460 - 0x0000)
struct WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCurrentPlatform                           Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ClosingActionName)> Temp_delegate_Variable;                           // 0x0014(0x0014)(ConstParm, ZeroConstructor, NoDestructor)
	class APlayerController*                      K2Node_CustomEvent_PlayerController_1;             // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate; // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_CustomEvent_PlayerController;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APlayerController* PlayerController)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0050(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      Temp_object_Variable;                              // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0080(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B0(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x00C4(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_19;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_9;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_18;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ClosingActionName;              // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData;                  // 0x0108(0x0060)(ContainsInstancedReference)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate_3;           // 0x0168(0x0014)(ZeroConstructor, NoDestructor)
	ESBZCurrentPlatform                           CallFunc_GetCurrentPlatform_ReturnValue;           // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCurrentPlatform                           CallFunc_GetCurrentPlatform_ReturnValue_1;         // 0x017D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x017E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17F[0x1];                                      // 0x017F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_17;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_8;           // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_16;              // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_15;              // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_7;           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_14;              // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_13;              // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_6;           // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_12;              // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCurrentPlatform                           Temp_byte_Variable_13;                             // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu;       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetAccelByteLinkedAccountsUrl_ReturnValue; // 0x0218(0x0010)(ConstParm, ZeroConstructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZShowLoginUICallbackProxy*           CallFunc_SBZShowExternalLoginUI_ReturnValue;       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_CustomEvent_InButton;                       // 0x0238(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShippingBuild_ReturnValue;              // 0x0242(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_243[0x5];                                      // 0x0243(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_11;              // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_5;           // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_10;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_9;               // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_4;           // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_8;               // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_3;           // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_4;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x02C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_5;               // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_6;               // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x02F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0308(0x0030)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_7;               // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0340(0x0010)(ReferenceParm)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0350(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0360(0x0028)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_8;               // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue_1;                   // 0x0390(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39C[0x4];                                      // 0x039C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_9;               // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_10;              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue_2;                   // 0x03B0(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_5;            // 0x03BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_11;              // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_6;            // 0x03F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_12;              // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue_3;                   // 0x0408(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_414[0x4];                                      // 0x0414(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_13;              // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_7;            // 0x0420(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_14;              // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue_4;                   // 0x0438(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0458(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More) == 0x000008, "Wrong alignment on WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More");
static_assert(sizeof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More) == 0x000460, "Wrong size on WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, EntryPoint) == 0x000000, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable) == 0x000004, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_6) == 0x00000A, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_7) == 0x00000B, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_8) == 0x00000C, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_9) == 0x00000D, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_10) == 0x00000E, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_11) == 0x00000F, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_12) == 0x000010, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_delegate_Variable) == 0x000014, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CustomEvent_PlayerController_1) == 0x000028, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CustomEvent_PlayerController_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CustomEvent_PlayerController) == 0x000048, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CustomEvent_PlayerController' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_object_Variable) == 0x000068, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue) == 0x000078, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_MakeStruct_SBZButtonControlReference) == 0x000080, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000B0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_Event_PreviousValue) == 0x0000C4, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_BooleanAND_ReturnValue) == 0x0000D0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_19) == 0x0000D8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_19' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled_9) == 0x0000E0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled_9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_18) == 0x0000E8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_18' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_1) == 0x0000F0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CustomEvent_ClosingActionName) == 0x0000F8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CustomEvent_ClosingActionName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_SwitchName_CmpSuccess) == 0x000104, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_MakeStruct_SBZUIPopupData) == 0x000108, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_MakeStruct_SBZUIPopupData' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CreateDelegate_OutputDelegate_3) == 0x000168, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetCurrentPlatform_ReturnValue) == 0x00017C, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetCurrentPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetCurrentPlatform_ReturnValue_1) == 0x00017D, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetCurrentPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_Select_Default) == 0x00017E, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CustomEvent_ActionName) == 0x000180, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_17) == 0x000190, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_17' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled_8) == 0x000198, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled_8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_SwitchName_CmpSuccess_1) == 0x000199, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_16) == 0x0001A0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_16' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_15) == 0x0001A8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_15' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled_7) == 0x0001B0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled_7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_14) == 0x0001B8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_13) == 0x0001C0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled_6) == 0x0001C8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_12) == 0x0001D0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, Temp_byte_Variable_13) == 0x0001D8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x0001E0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_Select_Default_1) == 0x0001E8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_MakeLiteralName_ReturnValue) == 0x0001EC, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetGameMode_ReturnValue) == 0x0001F8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_2) == 0x000200, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu) == 0x000208, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_DynamicCast_bSuccess) == 0x000210, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetAccelByteLinkedAccountsUrl_ReturnValue) == 0x000218, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetAccelByteLinkedAccountsUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000228, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_SBZShowExternalLoginUI_ReturnValue) == 0x000230, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_SBZShowExternalLoginUI_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CustomEvent_InButton) == 0x000238, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CustomEvent_InButton' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_CustomEvent_Enabled) == 0x000240, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_IsValid_ReturnValue_1) == 0x000241, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_IsShippingBuild_ReturnValue) == 0x000242, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_IsShippingBuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_11) == 0x000248, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled_5) == 0x000250, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_10) == 0x000258, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_9) == 0x000260, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled_4) == 0x000268, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_8) == 0x000270, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000278, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_3) == 0x000288, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000290, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_7) == 0x0002A0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled_3) == 0x0002A8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_4) == 0x0002B0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_6) == 0x0002B8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_MakeLiteralName_ReturnValue_3) == 0x0002C0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_5) == 0x0002D0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x0002D8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_4) == 0x0002E0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_5) == 0x0002E8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_6) == 0x0002F0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_MakeLiteralName_ReturnValue_4) == 0x0002F8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_MakeLiteralName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000308, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_7) == 0x000338, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_MakeArray_Array) == 0x000340, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_PopStack_ReturnValue) == 0x000350, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000360, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_8) == 0x000388, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_PopStack_ReturnValue_1) == 0x000390, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_PopStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_9) == 0x0003A0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_10) == 0x0003A8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_PopStack_ReturnValue_2) == 0x0003B0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_PopStack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_MakeLiteralName_ReturnValue_5) == 0x0003BC, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_MakeLiteralName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_PlayAnimation_ReturnValue) == 0x0003C8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_3) == 0x0003D0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x0003D8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_2) == 0x0003E0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_11) == 0x0003E8, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_MakeLiteralName_ReturnValue_6) == 0x0003F0, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_MakeLiteralName_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_12) == 0x000400, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_PopStack_ReturnValue_3) == 0x000408, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_PopStack_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_13) == 0x000418, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_MakeLiteralName_ReturnValue_7) == 0x000420, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_MakeLiteralName_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_GetUIManager_ReturnValue_14) == 0x000430, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_GetUIManager_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, CallFunc_PopStack_ReturnValue_4) == 0x000438, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::CallFunc_PopStack_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button_1) == 0x000448, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000450, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More, K2Node_ComponentBoundEvent_Button) == 0x000458, "Member 'WBP_Menu_More_C_ExecuteUbergraph_WBP_Menu_More::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_Menu_More.WBP_Menu_More_C.BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Menu_More.WBP_Menu_More_C.BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_SoloModeOldHeistSelect_K2Node_ComponentBoundEvent_22_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_Menu_More.WBP_Menu_More_C.BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_21_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_21_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_21_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_21_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_21_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_21_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_21_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_21_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Menu_More.WBP_Menu_More_C.BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_Menu_More_C_BndEvt__WBP_Menu_More_Debug_NewServerBrowserButton_K2Node_ComponentBoundEvent_12_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_Menu_More.WBP_Menu_More_C.BndEvt__WBP_Menu_More_WBP_UI_TextButton_1_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Menu_More_C_BndEvt__WBP_Menu_More_WBP_UI_TextButton_1_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_More_C_BndEvt__WBP_Menu_More_WBP_UI_TextButton_1_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Menu_More_C_BndEvt__WBP_Menu_More_WBP_UI_TextButton_1_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature");
