#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_TextButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_TextButton.WBP_UI_Inventory_TextButton_C
// 0x00D8 (0x0438 - 0x0360)
class UWBP_UI_Inventory_TextButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DisabledSelectedAnimation;                         // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectedAnimation;                                 // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          EquippedItemIcon;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_DefaultIcon;                                 // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Button;                                    // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root_Size;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Default;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_DisplayText;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TextBlock_Name;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultTextValue;                                  // 0x03E8(0x0018)(Edit, BlueprintVisible)
	struct FSBZControlsReference                  NewVar_0;                                          // 0x0400(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector2D                              InititalSize;                                      // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZAppearanceType                            Appearance_Type;                                   // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Inventory_TextButton(int32 EntryPoint);
	void UpdateButton();
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void DisabledButtonSelected();
	void ButtonSelected();
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnHoverVisuals(bool bIsHovered);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void RefreshVisual();
	void SetButtonText(const class FText& InButtonText);
	void ResetToDefaultButtonText();
	void GetText(class FText* OutText);
	void Set_Appearance_Type_Icon(int32 SelectedLoudoutIndex);
	void GetCharacterData(bool* bIsValid, class USBZInventoryBaseData** CharacterData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_TextButton_C">();
	}
	static class UWBP_UI_Inventory_TextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_TextButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_TextButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_TextButton_C");
static_assert(sizeof(UWBP_UI_Inventory_TextButton_C) == 0x000438, "Wrong size on UWBP_UI_Inventory_TextButton_C");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_Inventory_TextButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, HoverAnim) == 0x000368, "Member 'UWBP_UI_Inventory_TextButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, DisabledSelectedAnimation) == 0x000370, "Member 'UWBP_UI_Inventory_TextButton_C::DisabledSelectedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, SelectedAnimation) == 0x000378, "Member 'UWBP_UI_Inventory_TextButton_C::SelectedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Border_Highlight) == 0x000380, "Member 'UWBP_UI_Inventory_TextButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, EquippedItemIcon) == 0x000388, "Member 'UWBP_UI_Inventory_TextButton_C::EquippedItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Image) == 0x000390, "Member 'UWBP_UI_Inventory_TextButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Image_1) == 0x000398, "Member 'UWBP_UI_Inventory_TextButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Image_2) == 0x0003A0, "Member 'UWBP_UI_Inventory_TextButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Image_511) == 0x0003A8, "Member 'UWBP_UI_Inventory_TextButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Image_Background) == 0x0003B0, "Member 'UWBP_UI_Inventory_TextButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Image_DefaultIcon) == 0x0003B8, "Member 'UWBP_UI_Inventory_TextButton_C::Image_DefaultIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Overlay_Button) == 0x0003C0, "Member 'UWBP_UI_Inventory_TextButton_C::Overlay_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Root_Size) == 0x0003C8, "Member 'UWBP_UI_Inventory_TextButton_C::Root_Size' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Text_Default) == 0x0003D0, "Member 'UWBP_UI_Inventory_TextButton_C::Text_Default' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Text_DisplayText) == 0x0003D8, "Member 'UWBP_UI_Inventory_TextButton_C::Text_DisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, TextBlock_Name) == 0x0003E0, "Member 'UWBP_UI_Inventory_TextButton_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, DefaultTextValue) == 0x0003E8, "Member 'UWBP_UI_Inventory_TextButton_C::DefaultTextValue' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, NewVar_0) == 0x000400, "Member 'UWBP_UI_Inventory_TextButton_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, InititalSize) == 0x000428, "Member 'UWBP_UI_Inventory_TextButton_C::InititalSize' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_TextButton_C, Appearance_Type) == 0x000430, "Member 'UWBP_UI_Inventory_TextButton_C::Appearance_Type' has a wrong offset!");

}

