#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MenuRoot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_MenuRoot.WBP_MenuRoot_C.ExecuteUbergraph_WBP_MenuRoot
// 0x0330 (0x0330 - 0x0000)
struct WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCurrentPlatform                           Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x000C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsGameInstallPending)>   K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsGameInstallPending;          // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameEventBroker*                    CallFunc_GetGameEventBroker_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBZUserPrivilegesProxy Privilege, bool bPrivilegeAllowed)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	ESBZUserPrivilegesProxy                       K2Node_CustomEvent_Privilege;                      // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPrivilegeAllowed;              // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0056(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPrivilege_ReturnValue;                 // 0x0057(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasPrivilege_ReturnValue_1;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameInstallPending_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGameInstallPending_ReturnValue_1;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_4;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_5;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_6;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_7;               // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_CustomEvent_InButton;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Enabled;                        // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_12;              // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_5;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_11;              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_4;           // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_10;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_3;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_9;               // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_8;               // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_8;               // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x0130(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0140(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu;       // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_9;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_10;              // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x018C(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x01A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_11;              // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZPartyManager*                       CallFunc_GetPartyManager_ReturnValue;              // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZPartyManager*                       CallFunc_GetPartyManager_ReturnValue_1;            // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZPartyManager*                       CallFunc_GetPartyManager_ReturnValue_2;            // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& PlayerId)> K2Node_CreateDelegate_OutputDelegate_3;           // 0x01D8(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& PlayerId)> K2Node_CreateDelegate_OutputDelegate_4;           // 0x01EC(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(const class FString& PlayerId)> K2Node_CreateDelegate_OutputDelegate_5;           // 0x0200(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlayerId_2;                     // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_PlayerId_1;                     // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_PlayerId;                       // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0248(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_12;              // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_13;              // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x0260(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_14;              // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate_7;           // 0x0290(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData;                  // 0x02A8(0x0060)(ContainsInstancedReference)
	class FName                                   K2Node_CustomEvent_ClosingActionName;              // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0314(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZCurrentPlatform                           CallFunc_GetCurrentPlatform_ReturnValue;           // 0x0315(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0316(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_317[0x1];                                      // 0x0317(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_15;              // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameInstallPending_ReturnValue_2;       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0328(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot");
static_assert(sizeof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot) == 0x000330, "Wrong size on WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, EntryPoint) == 0x000000, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, Temp_byte_Variable) == 0x000004, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, Temp_byte_Variable_4) == 0x000008, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, Temp_byte_Variable_5) == 0x000009, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, Temp_byte_Variable_6) == 0x00000A, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_Event_PreviousValue) == 0x00000C, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue) == 0x000018, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_bIsGameInstallPending) == 0x000034, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_bIsGameInstallPending' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetGameEventBroker_ReturnValue) == 0x000038, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetGameEventBroker_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_Privilege) == 0x000054, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_Privilege' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_bPrivilegeAllowed) == 0x000055, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_bPrivilegeAllowed' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_SwitchEnum_CmpSuccess) == 0x000056, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_HasPrivilege_ReturnValue) == 0x000057, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_HasPrivilege_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_HasPrivilege_ReturnValue_1) == 0x000058, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_HasPrivilege_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_1) == 0x000060, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_2) == 0x000068, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_IsGameInstallPending_ReturnValue) == 0x000070, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_IsGameInstallPending_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_IsGameInstallPending_ReturnValue_1) == 0x000071, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_IsGameInstallPending_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_3) == 0x000078, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_MakeLiteralName_ReturnValue) == 0x000080, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_4) == 0x000090, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_5) == 0x000098, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_6) == 0x0000A0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_7) == 0x0000A8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_InButton) == 0x0000B0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_InButton' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_Enabled) == 0x0000B8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_Enabled' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_12) == 0x0000C0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_12' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_bIsEnabled_5) == 0x0000C8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_bIsEnabled_5' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_11) == 0x0000D0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_11' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_bIsEnabled_4) == 0x0000D8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_bIsEnabled_4' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_10) == 0x0000E0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_10' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_bIsEnabled_3) == 0x0000E8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_bIsEnabled_3' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_9) == 0x0000F0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_9' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x0000F8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_8) == 0x000100, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_8) == 0x000108, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_8' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000110, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_7) == 0x000118, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_6) == 0x000120, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000128, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_5) == 0x000130, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_4) == 0x000138, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_3) == 0x000140, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000148, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetGameMode_ReturnValue) == 0x000150, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu) == 0x000158, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_DynamicCast_bSuccess) == 0x000160, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_9) == 0x000168, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetMenuWidget_ReturnValue) == 0x000170, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_10) == 0x000178, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_DynamicCast_AsSBZMain_Menu_Widget) == 0x000180, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_DynamicCast_AsSBZMain_Menu_Widget' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_DynamicCast_bSuccess_1) == 0x000188, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CreateDelegate_OutputDelegate_2) == 0x00018C, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_ActionName) == 0x0001A0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_SwitchName_CmpSuccess) == 0x0001AC, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_11) == 0x0001B0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_2) == 0x0001B8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetPartyManager_ReturnValue) == 0x0001C0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetPartyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetPartyManager_ReturnValue_1) == 0x0001C8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetPartyManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetPartyManager_ReturnValue_2) == 0x0001D0, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetPartyManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001D8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001EC, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CreateDelegate_OutputDelegate_5) == 0x000200, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_PlayerId_2) == 0x000218, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_PlayerId_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_PlayerId_1) == 0x000228, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_PlayerId_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_PlayerId) == 0x000238, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_PlayerId' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button_1) == 0x000248, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_12) == 0x000250, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_13) == 0x000258, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CreateDelegate_OutputDelegate_6) == 0x000260, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000278, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_ComponentBoundEvent_Button) == 0x000280, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_14) == 0x000288, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CreateDelegate_OutputDelegate_7) == 0x000290, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_MakeStruct_SBZUIPopupData) == 0x0002A8, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_MakeStruct_SBZUIPopupData' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_CustomEvent_ClosingActionName) == 0x000308, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_CustomEvent_ClosingActionName' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_SwitchName_CmpSuccess_1) == 0x000314, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetCurrentPlatform_ReturnValue) == 0x000315, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetCurrentPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_Select_Default) == 0x000316, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_GetUIManager_ReturnValue_15) == 0x000318, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_GetUIManager_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_IsGameInstallPending_ReturnValue_2) == 0x000320, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_IsGameInstallPending_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, K2Node_Event_IsDesignTime) == 0x000321, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot, CallFunc_PlayAnimation_ReturnValue) == 0x000328, "Member 'WBP_MenuRoot_C_ExecuteUbergraph_WBP_MenuRoot::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_MenuRoot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MenuRoot_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_MenuRoot_C_PreConstruct");
static_assert(sizeof(WBP_MenuRoot_C_PreConstruct) == 0x000001, "Wrong size on WBP_MenuRoot_C_PreConstruct");
static_assert(offsetof(WBP_MenuRoot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_MenuRoot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.OnQuitConfirmed
// 0x000C (0x000C - 0x0000)
struct WBP_MenuRoot_C_OnQuitConfirmed final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_OnQuitConfirmed) == 0x000004, "Wrong alignment on WBP_MenuRoot_C_OnQuitConfirmed");
static_assert(sizeof(WBP_MenuRoot_C_OnQuitConfirmed) == 0x00000C, "Wrong size on WBP_MenuRoot_C_OnQuitConfirmed");
static_assert(offsetof(WBP_MenuRoot_C_OnQuitConfirmed, ClosingActionName) == 0x000000, "Member 'WBP_MenuRoot_C_OnQuitConfirmed::ClosingActionName' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.BndEvt__WBP_MenuRoot_QuitButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_QuitButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_QuitButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_QuitButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_QuitButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_QuitButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_QuitButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_QuitButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.BndEvt__WBP_UI_MainMenu_CrimeNet_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_HeistOnline_LargetTextButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.OnPlayerJoinedParty
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuRoot_C_OnPlayerJoinedParty final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_OnPlayerJoinedParty) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_OnPlayerJoinedParty");
static_assert(sizeof(WBP_MenuRoot_C_OnPlayerJoinedParty) == 0x000010, "Wrong size on WBP_MenuRoot_C_OnPlayerJoinedParty");
static_assert(offsetof(WBP_MenuRoot_C_OnPlayerJoinedParty, PlayerId) == 0x000000, "Member 'WBP_MenuRoot_C_OnPlayerJoinedParty::PlayerId' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.OnPlayerLeftParty
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuRoot_C_OnPlayerLeftParty final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_OnPlayerLeftParty) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_OnPlayerLeftParty");
static_assert(sizeof(WBP_MenuRoot_C_OnPlayerLeftParty) == 0x000010, "Wrong size on WBP_MenuRoot_C_OnPlayerLeftParty");
static_assert(offsetof(WBP_MenuRoot_C_OnPlayerLeftParty, PlayerId) == 0x000000, "Member 'WBP_MenuRoot_C_OnPlayerLeftParty::PlayerId' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.OnPlayerKickedFromParty
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuRoot_C_OnPlayerKickedFromParty final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_OnPlayerKickedFromParty) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_OnPlayerKickedFromParty");
static_assert(sizeof(WBP_MenuRoot_C_OnPlayerKickedFromParty) == 0x000010, "Wrong size on WBP_MenuRoot_C_OnPlayerKickedFromParty");
static_assert(offsetof(WBP_MenuRoot_C_OnPlayerKickedFromParty, PlayerId) == 0x000000, "Member 'WBP_MenuRoot_C_OnPlayerKickedFromParty::PlayerId' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.BndEvt__WBP_UI_MainMenu_CrimeNet_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Blackmarket_LargetTextButton_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.OnControlReferencePressed
// 0x000C (0x000C - 0x0000)
struct WBP_MenuRoot_C_OnControlReferencePressed final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_OnControlReferencePressed) == 0x000004, "Wrong alignment on WBP_MenuRoot_C_OnControlReferencePressed");
static_assert(sizeof(WBP_MenuRoot_C_OnControlReferencePressed) == 0x00000C, "Wrong size on WBP_MenuRoot_C_OnControlReferencePressed");
static_assert(offsetof(WBP_MenuRoot_C_OnControlReferencePressed, ActionName) == 0x000000, "Member 'WBP_MenuRoot_C_OnControlReferencePressed::ActionName' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.BndEvt__WBP_UI_MainMenu_CrimeNet_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.BndEvt__WBP_UI_MainMenu_CrimeNet_ChallengesButton_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_ChallengesButton_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_ChallengesButton_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_ChallengesButton_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_ChallengesButton_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_ChallengesButton_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_ChallengesButton_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_ChallengesButton_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.BndEvt__WBP_UI_MainMenu_CrimeNet_SocialsButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SocialsButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SocialsButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SocialsButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SocialsButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SocialsButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SocialsButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SocialsButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_ChallengesButton_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.BndEvt__WBP_UI_MainMenu_CrimeNet_SettingsButton_K2Node_ComponentBoundEvent_15_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SettingsButton_K2Node_ComponentBoundEvent_15_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SettingsButton_K2Node_ComponentBoundEvent_15_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SettingsButton_K2Node_ComponentBoundEvent_15_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SettingsButton_K2Node_ComponentBoundEvent_15_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SettingsButton_K2Node_ComponentBoundEvent_15_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SettingsButton_K2Node_ComponentBoundEvent_15_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuRoot_C_BndEvt__WBP_UI_MainMenu_CrimeNet_SettingsButton_K2Node_ComponentBoundEvent_15_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MenuRoot.WBP_MenuRoot_C.BndEvt__WBP_MenuRoot_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_MenuRoot_C_BndEvt__WBP_MenuRoot_Loadout_LargetTextButton_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
