#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_LoadoutSkillsButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C
// 0x0138 (0x04A8 - 0x0370)
class UWBP_UI_Inventory_LoadoutSkillsButton_C final : public USBZLoadoutSkillsButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnHoverSkills;                                     // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_148;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SkillPointsRemaining;                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Button;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Skill_points_HB;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkillCount;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkillCount_1;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkillCount_2;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkillCount_3;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkillCount_4;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkillCount_5;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SkillIcon1_Overlay;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SkillIcon2_Overlay;                                // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SkillIcon3_Overlay;                                // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SkillIcon4_Overlay;                                // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SkillIcon5_Overlay;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               SkillIcon_Overlay;                                 // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_Header;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_SkillsWarning;                                // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_SkillsIcon;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_SkillsIcon_1;                               // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_SkillsIcon_2;                               // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_SkillsIcon_3;                               // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_SkillsIcon_4;                               // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_SkillsIcon_5;                               // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UObject* FocusedButton)> ButtonFocusedEvent;                 // 0x0490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          RT_SkillPointsRemaining;                           // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton(int32 EntryPoint);
	void InitializeSkills(int32 EquippedSkillCount);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	void OnHover(bool bIsHovered);
	void OnFocused(bool bIsFocused);
	void RefreshVisuals();
	void InitializeSkillPointsVisual(int32 SkillPointsRemaining);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_LoadoutSkillsButton_C">();
	}
	static class UWBP_UI_Inventory_LoadoutSkillsButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_LoadoutSkillsButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_LoadoutSkillsButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_LoadoutSkillsButton_C");
static_assert(sizeof(UWBP_UI_Inventory_LoadoutSkillsButton_C) == 0x0004A8, "Wrong size on UWBP_UI_Inventory_LoadoutSkillsButton_C");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, UberGraphFrame) == 0x000370, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, OnHoverSkills) == 0x000378, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::OnHoverSkills' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Border_Highlight) == 0x000380, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image) == 0x000388, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_1) == 0x000390, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_2) == 0x000398, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_3) == 0x0003A0, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_4) == 0x0003A8, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_9) == 0x0003B0, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_9' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_10) == 0x0003B8, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_11) == 0x0003C0, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_11' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_148) == 0x0003C8, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_148' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_511) == 0x0003D0, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Image_SkillPointsRemaining) == 0x0003D8, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Image_SkillPointsRemaining' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Overlay_Button) == 0x0003E0, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Overlay_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Skill_points_HB) == 0x0003E8, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Skill_points_HB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillCount) == 0x0003F0, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillCount_1) == 0x0003F8, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillCount_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillCount_2) == 0x000400, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillCount_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillCount_3) == 0x000408, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillCount_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillCount_4) == 0x000410, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillCount_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillCount_5) == 0x000418, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillCount_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillIcon1_Overlay) == 0x000420, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillIcon1_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillIcon2_Overlay) == 0x000428, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillIcon2_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillIcon3_Overlay) == 0x000430, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillIcon3_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillIcon4_Overlay) == 0x000438, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillIcon4_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillIcon5_Overlay) == 0x000440, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillIcon5_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, SkillIcon_Overlay) == 0x000448, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::SkillIcon_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Text_Header) == 0x000450, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Text_SkillsWarning) == 0x000458, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Text_SkillsWarning' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Widget_SkillsIcon) == 0x000460, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Widget_SkillsIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Widget_SkillsIcon_1) == 0x000468, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Widget_SkillsIcon_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Widget_SkillsIcon_2) == 0x000470, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Widget_SkillsIcon_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Widget_SkillsIcon_3) == 0x000478, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Widget_SkillsIcon_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Widget_SkillsIcon_4) == 0x000480, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Widget_SkillsIcon_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, Widget_SkillsIcon_5) == 0x000488, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::Widget_SkillsIcon_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, ButtonFocusedEvent) == 0x000490, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::ButtonFocusedEvent' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_LoadoutSkillsButton_C, RT_SkillPointsRemaining) == 0x0004A0, "Member 'UWBP_UI_Inventory_LoadoutSkillsButton_C::RT_SkillPointsRemaining' has a wrong offset!");

}

