#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Blackmarket_ConfirmationPopupBody

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Blackmarket_ConfirmationPopupBody.WBP_Blackmarket_ConfirmationPopupBody_C
// 0x0038 (0x03D0 - 0x0398)
class UWBP_Blackmarket_ConfirmationPopupBody_C final : public USBZBlackMarketConfirmationPopupBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             CostText;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Currency_Icon_C*                   CurrencyIcon;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          ItemIcon;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ConfirmationPopup_InventoryItemDisplay_C* WBP_ConfirmationPopup_InventoryItemDisplay; // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESBZItemCurrencyType                          Currency_Type;                                     // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Blackmarket_ConfirmationPopupBody(int32 EntryPoint);
	void OnItemDataInitialized();
	void SetCurrencyType(ESBZCurrencyCode Currency);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Blackmarket_ConfirmationPopupBody_C">();
	}
	static class UWBP_Blackmarket_ConfirmationPopupBody_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Blackmarket_ConfirmationPopupBody_C>();
	}
};
static_assert(alignof(UWBP_Blackmarket_ConfirmationPopupBody_C) == 0x000008, "Wrong alignment on UWBP_Blackmarket_ConfirmationPopupBody_C");
static_assert(sizeof(UWBP_Blackmarket_ConfirmationPopupBody_C) == 0x0003D0, "Wrong size on UWBP_Blackmarket_ConfirmationPopupBody_C");
static_assert(offsetof(UWBP_Blackmarket_ConfirmationPopupBody_C, UberGraphFrame) == 0x000398, "Member 'UWBP_Blackmarket_ConfirmationPopupBody_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Blackmarket_ConfirmationPopupBody_C, CostText) == 0x0003A0, "Member 'UWBP_Blackmarket_ConfirmationPopupBody_C::CostText' has a wrong offset!");
static_assert(offsetof(UWBP_Blackmarket_ConfirmationPopupBody_C, CurrencyIcon) == 0x0003A8, "Member 'UWBP_Blackmarket_ConfirmationPopupBody_C::CurrencyIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Blackmarket_ConfirmationPopupBody_C, ItemIcon) == 0x0003B0, "Member 'UWBP_Blackmarket_ConfirmationPopupBody_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Blackmarket_ConfirmationPopupBody_C, NameText) == 0x0003B8, "Member 'UWBP_Blackmarket_ConfirmationPopupBody_C::NameText' has a wrong offset!");
static_assert(offsetof(UWBP_Blackmarket_ConfirmationPopupBody_C, WBP_ConfirmationPopup_InventoryItemDisplay) == 0x0003C0, "Member 'UWBP_Blackmarket_ConfirmationPopupBody_C::WBP_ConfirmationPopup_InventoryItemDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_Blackmarket_ConfirmationPopupBody_C, Currency_Type) == 0x0003C8, "Member 'UWBP_Blackmarket_ConfirmationPopupBody_C::Currency_Type' has a wrong offset!");

}

