#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Challenge_InfamyProgress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Challenge_InfamyProgress.WBP_UI_Challenge_InfamyProgress_C.ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress) == 0x000008, "Wrong alignment on WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress");
static_assert(sizeof(WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress) == 0x000020, "Wrong size on WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress, EntryPoint) == 0x000000, "Member 'WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000010, "Member 'WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress, K2Node_Event_IsDesignTime) == 0x000018, "Member 'WBP_UI_Challenge_InfamyProgress_C_ExecuteUbergraph_WBP_UI_Challenge_InfamyProgress::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_Challenge_InfamyProgress.WBP_UI_Challenge_InfamyProgress_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Challenge_InfamyProgress_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Challenge_InfamyProgress_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Challenge_InfamyProgress_C_PreConstruct");
static_assert(sizeof(WBP_UI_Challenge_InfamyProgress_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Challenge_InfamyProgress_C_PreConstruct");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Challenge_InfamyProgress_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Challenge_InfamyProgress.WBP_UI_Challenge_InfamyProgress_C.Set Infamy Visuals
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals final
{
public:
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0000(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0040(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0090(0x0018)()
};
static_assert(alignof(WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals) == 0x000008, "Wrong alignment on WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals");
static_assert(sizeof(WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals) == 0x0000A8, "Wrong size on WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals, K2Node_MakeStruct_FormatArgumentData) == 0x000000, "Member 'WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals, K2Node_MakeStruct_FormatArgumentData_1) == 0x000040, "Member 'WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals, CallFunc_Format_ReturnValue) == 0x000090, "Member 'WBP_UI_Challenge_InfamyProgress_C_Set_Infamy_Visuals::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_UI_Challenge_InfamyProgress.WBP_UI_Challenge_InfamyProgress_C.Get_Image_ProgressBar_Brush_0
// 0x0090 (0x0090 - 0x0000)
struct WBP_UI_Challenge_InfamyProgress_C_Get_Image_ProgressBar_Brush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0090)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_UI_Challenge_InfamyProgress_C_Get_Image_ProgressBar_Brush_0) == 0x000008, "Wrong alignment on WBP_UI_Challenge_InfamyProgress_C_Get_Image_ProgressBar_Brush_0");
static_assert(sizeof(WBP_UI_Challenge_InfamyProgress_C_Get_Image_ProgressBar_Brush_0) == 0x000090, "Wrong size on WBP_UI_Challenge_InfamyProgress_C_Get_Image_ProgressBar_Brush_0");
static_assert(offsetof(WBP_UI_Challenge_InfamyProgress_C_Get_Image_ProgressBar_Brush_0, ReturnValue) == 0x000000, "Member 'WBP_UI_Challenge_InfamyProgress_C_Get_Image_ProgressBar_Brush_0::ReturnValue' has a wrong offset!");

}

