#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_InteractionMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_InteractionMode.WBP_UI_InteractionMode_C
// 0x0038 (0x02C8 - 0x0290)
class UWBP_UI_InteractionMode_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalBox_InteractionData;                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_QuickInteractionIllegal;                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_IllegalInteraction;                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Interaction;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      Widget_InteractionMode;                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsIllegal;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsDisplayingInteraction;                          // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_InteractionMode(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void SetNewInteractionModeData(const struct FSBZInteractModeDisplayData& InInteractionModeData, bool bIsCasing);
	void UpdateProgress(float InNewProgress);
	void OnActionReleased();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_InteractionMode_C">();
	}
	static class UWBP_UI_InteractionMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_InteractionMode_C>();
	}
};
static_assert(alignof(UWBP_UI_InteractionMode_C) == 0x000008, "Wrong alignment on UWBP_UI_InteractionMode_C");
static_assert(sizeof(UWBP_UI_InteractionMode_C) == 0x0002C8, "Wrong size on UWBP_UI_InteractionMode_C");
static_assert(offsetof(UWBP_UI_InteractionMode_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_InteractionMode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionMode_C, HorizontalBox_InteractionData) == 0x000298, "Member 'UWBP_UI_InteractionMode_C::HorizontalBox_InteractionData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionMode_C, Image_QuickInteractionIllegal) == 0x0002A0, "Member 'UWBP_UI_InteractionMode_C::Image_QuickInteractionIllegal' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionMode_C, Overlay_IllegalInteraction) == 0x0002A8, "Member 'UWBP_UI_InteractionMode_C::Overlay_IllegalInteraction' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionMode_C, Text_Interaction) == 0x0002B0, "Member 'UWBP_UI_InteractionMode_C::Text_Interaction' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionMode_C, Widget_InteractionMode) == 0x0002B8, "Member 'UWBP_UI_InteractionMode_C::Widget_InteractionMode' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionMode_C, bIsIllegal) == 0x0002C0, "Member 'UWBP_UI_InteractionMode_C::bIsIllegal' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionMode_C, bIsDisplayingInteraction) == 0x0002C1, "Member 'UWBP_UI_InteractionMode_C::bIsDisplayingInteraction' has a wrong offset!");

}

