#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ActionButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_ActionButton.WBP_UI_ActionButton_C
// 0x00B8 (0x0348 - 0x0290)
class UWBP_UI_ActionButton_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Highlight;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ButtonText;                                   // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_C*           Widget_ActionInput;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x02B0(0x0018)(Edit, BlueprintVisible)
	class FName                                   ActionInput;                                       // 0x02C8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         ButtonFont;                                        // 0x02D8(0x0060)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ButtonSelected;                                    // 0x0338(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_UI_ActionButton(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void InitializeWidgetVisuals();
	void UpdateHover(bool bIsMouseOver);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_ActionButton_C">();
	}
	static class UWBP_UI_ActionButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_ActionButton_C>();
	}
};
static_assert(alignof(UWBP_UI_ActionButton_C) == 0x000008, "Wrong alignment on UWBP_UI_ActionButton_C");
static_assert(sizeof(UWBP_UI_ActionButton_C) == 0x000348, "Wrong size on UWBP_UI_ActionButton_C");
static_assert(offsetof(UWBP_UI_ActionButton_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_ActionButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ActionButton_C, Image_Highlight) == 0x000298, "Member 'UWBP_UI_ActionButton_C::Image_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ActionButton_C, Text_ButtonText) == 0x0002A0, "Member 'UWBP_UI_ActionButton_C::Text_ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ActionButton_C, Widget_ActionInput) == 0x0002A8, "Member 'UWBP_UI_ActionButton_C::Widget_ActionInput' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ActionButton_C, ButtonText) == 0x0002B0, "Member 'UWBP_UI_ActionButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ActionButton_C, ActionInput) == 0x0002C8, "Member 'UWBP_UI_ActionButton_C::ActionInput' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ActionButton_C, ButtonFont) == 0x0002D8, "Member 'UWBP_UI_ActionButton_C::ButtonFont' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ActionButton_C, ButtonSelected) == 0x000338, "Member 'UWBP_UI_ActionButton_C::ButtonSelected' has a wrong offset!");

}

