#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_3

#include "Basic.hpp"

#include "S_EmailStructure_structs.hpp"


namespace SDK::Params
{

// Function WBP_Menu_3.WBP_Menu_3_C.ExecuteUbergraph_WBP_Menu_3
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam_2;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_NewParam_1;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Code;                           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_EmailStructure                      K2Node_CustomEvent_CodeEmail;                      // 0x0030(0x0048)(HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00A0(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0100(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_7;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_8;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0158(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0170(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0188(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_9;              // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3) == 0x000008, "Wrong alignment on WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3");
static_assert(sizeof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3) == 0x0001A8, "Wrong size on WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, EntryPoint) == 0x000000, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue) == 0x000008, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000018, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, K2Node_CustomEvent_NewParam_2) == 0x000028, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::K2Node_CustomEvent_NewParam_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, K2Node_CustomEvent_NewParam_1) == 0x000029, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::K2Node_CustomEvent_NewParam_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, K2Node_CustomEvent_Code) == 0x00002C, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::K2Node_CustomEvent_Code' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, K2Node_CustomEvent_CodeEmail) == 0x000030, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::K2Node_CustomEvent_CodeEmail' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, K2Node_CustomEvent_NewParam) == 0x000078, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_TextIsEmpty_ReturnValue) == 0x000079, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Conv_TextToString_ReturnValue) == 0x000080, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000090, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Conv_IntToText_ReturnValue) == 0x0000A0, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000B8, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000C8, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000D8, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000E8, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Less_IntInt_ReturnValue) == 0x0000F8, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F9, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000100, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000118, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000128, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue_7) == 0x000138, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue_8) == 0x000148, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000158, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Conv_StringToText_ReturnValue) == 0x000170, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000188, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3, CallFunc_Concat_StrStr_ReturnValue_9) == 0x000198, "Member 'WBP_Menu_3_C_ExecuteUbergraph_WBP_Menu_3::CallFunc_Concat_StrStr_ReturnValue_9' has a wrong offset!");

// Function WBP_Menu_3.WBP_Menu_3_C.SetBackFocus
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_3_C_SetBackFocus final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_3_C_SetBackFocus) == 0x000001, "Wrong alignment on WBP_Menu_3_C_SetBackFocus");
static_assert(sizeof(WBP_Menu_3_C_SetBackFocus) == 0x000001, "Wrong size on WBP_Menu_3_C_SetBackFocus");
static_assert(offsetof(WBP_Menu_3_C_SetBackFocus, NewParam) == 0x000000, "Member 'WBP_Menu_3_C_SetBackFocus::NewParam' has a wrong offset!");

// Function WBP_Menu_3.WBP_Menu_3_C.Email Test
// 0x0050 (0x0050 - 0x0000)
struct WBP_Menu_3_C_Email_Test final
{
public:
	int32                                         Code;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EmailStructure                      CodeEmail;                                         // 0x0008(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_3_C_Email_Test) == 0x000008, "Wrong alignment on WBP_Menu_3_C_Email_Test");
static_assert(sizeof(WBP_Menu_3_C_Email_Test) == 0x000050, "Wrong size on WBP_Menu_3_C_Email_Test");
static_assert(offsetof(WBP_Menu_3_C_Email_Test, Code) == 0x000000, "Member 'WBP_Menu_3_C_Email_Test::Code' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_Email_Test, CodeEmail) == 0x000008, "Member 'WBP_Menu_3_C_Email_Test::CodeEmail' has a wrong offset!");

// Function WBP_Menu_3.WBP_Menu_3_C.Set FocusUp
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_3_C_Set_FocusUp final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_3_C_Set_FocusUp) == 0x000001, "Wrong alignment on WBP_Menu_3_C_Set_FocusUp");
static_assert(sizeof(WBP_Menu_3_C_Set_FocusUp) == 0x000001, "Wrong size on WBP_Menu_3_C_Set_FocusUp");
static_assert(offsetof(WBP_Menu_3_C_Set_FocusUp, NewParam) == 0x000000, "Member 'WBP_Menu_3_C_Set_FocusUp::NewParam' has a wrong offset!");

// Function WBP_Menu_3.WBP_Menu_3_C.SetFocusDown
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_3_C_SetFocusDown final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_3_C_SetFocusDown) == 0x000001, "Wrong alignment on WBP_Menu_3_C_SetFocusDown");
static_assert(sizeof(WBP_Menu_3_C_SetFocusDown) == 0x000001, "Wrong size on WBP_Menu_3_C_SetFocusDown");
static_assert(offsetof(WBP_Menu_3_C_SetFocusDown, NewParam) == 0x000000, "Member 'WBP_Menu_3_C_SetFocusDown::NewParam' has a wrong offset!");

// Function WBP_Menu_3.WBP_Menu_3_C.Scroll Down Func
// 0x001C (0x001C - 0x0000)
struct WBP_Menu_3_C_Scroll_Down_Func final
{
public:
	float                                         A;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Scroll_Offset_0;                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffsetOfEnd_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_3_C_Scroll_Down_Func) == 0x000004, "Wrong alignment on WBP_Menu_3_C_Scroll_Down_Func");
static_assert(sizeof(WBP_Menu_3_C_Scroll_Down_Func) == 0x00001C, "Wrong size on WBP_Menu_3_C_Scroll_Down_Func");
static_assert(offsetof(WBP_Menu_3_C_Scroll_Down_Func, A) == 0x000000, "Member 'WBP_Menu_3_C_Scroll_Down_Func::A' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_Scroll_Down_Func, New_Scroll_Offset_0) == 0x000004, "Member 'WBP_Menu_3_C_Scroll_Down_Func::New_Scroll_Offset_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_Scroll_Down_Func, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_Menu_3_C_Scroll_Down_Func::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_Scroll_Down_Func, CallFunc_GetScrollOffset_ReturnValue) == 0x00000C, "Member 'WBP_Menu_3_C_Scroll_Down_Func::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_Scroll_Down_Func, CallFunc_GetScrollOffsetOfEnd_ReturnValue) == 0x000010, "Member 'WBP_Menu_3_C_Scroll_Down_Func::CallFunc_GetScrollOffsetOfEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_Scroll_Down_Func, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000014, "Member 'WBP_Menu_3_C_Scroll_Down_Func::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_Scroll_Down_Func, CallFunc_Less_FloatFloat_ReturnValue) == 0x000018, "Member 'WBP_Menu_3_C_Scroll_Down_Func::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_Menu_3.WBP_Menu_3_C.ScrollUpFunc
// 0x0018 (0x0018 - 0x0000)
struct WBP_Menu_3_C_ScrollUpFunc final
{
public:
	float                                         A;                                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Scroll_Offset_0;                               // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_3_C_ScrollUpFunc) == 0x000004, "Wrong alignment on WBP_Menu_3_C_ScrollUpFunc");
static_assert(sizeof(WBP_Menu_3_C_ScrollUpFunc) == 0x000018, "Wrong size on WBP_Menu_3_C_ScrollUpFunc");
static_assert(offsetof(WBP_Menu_3_C_ScrollUpFunc, A) == 0x000000, "Member 'WBP_Menu_3_C_ScrollUpFunc::A' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ScrollUpFunc, New_Scroll_Offset_0) == 0x000004, "Member 'WBP_Menu_3_C_ScrollUpFunc::New_Scroll_Offset_0' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ScrollUpFunc, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_Menu_3_C_ScrollUpFunc::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ScrollUpFunc, CallFunc_Less_FloatFloat_ReturnValue) == 0x00000C, "Member 'WBP_Menu_3_C_ScrollUpFunc::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ScrollUpFunc, CallFunc_GetScrollOffset_ReturnValue) == 0x000010, "Member 'WBP_Menu_3_C_ScrollUpFunc::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_ScrollUpFunc, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000014, "Member 'WBP_Menu_3_C_ScrollUpFunc::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function WBP_Menu_3.WBP_Menu_3_C.SetEmails
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Menu_3_C_SetEmails final
{
public:
	TArray<struct FS_EmailStructure>              Emails;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_EmailStructure                      CallFunc_Array_Get_Item;                           // 0x0020(0x0048)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         CallFunc_Array_Get_Item_1;                         // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class URichTextBlock*>                 K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ReferenceParm, ContainsInstancedReference)
	class URichTextBlock*                         CallFunc_Array_Get_Item_2;                         // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URichTextBlock*                         CallFunc_Array_Get_Item_3;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class URichTextBlock*>                 K2Node_MakeArray_Array_1;                          // 0x00A0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class URichTextBlock*>                 K2Node_MakeArray_Array_2;                          // 0x00B0(0x0010)(ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_Menu_3_C_SetEmails) == 0x000008, "Wrong alignment on WBP_Menu_3_C_SetEmails");
static_assert(sizeof(WBP_Menu_3_C_SetEmails) == 0x0000C0, "Wrong size on WBP_Menu_3_C_SetEmails");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, Emails) == 0x000000, "Member 'WBP_Menu_3_C_SetEmails::Emails' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_Menu_3_C_SetEmails::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_Menu_3_C_SetEmails::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'WBP_Menu_3_C_SetEmails::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_Menu_3_C_SetEmails::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, CallFunc_Less_IntInt_ReturnValue) == 0x000068, "Member 'WBP_Menu_3_C_SetEmails::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, CallFunc_Add_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_Menu_3_C_SetEmails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, CallFunc_Array_Get_Item_1) == 0x000070, "Member 'WBP_Menu_3_C_SetEmails::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, K2Node_MakeArray_Array) == 0x000078, "Member 'WBP_Menu_3_C_SetEmails::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, CallFunc_Array_Get_Item_2) == 0x000088, "Member 'WBP_Menu_3_C_SetEmails::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, CallFunc_Array_Get_Item_3) == 0x000090, "Member 'WBP_Menu_3_C_SetEmails::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'WBP_Menu_3_C_SetEmails::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, K2Node_MakeArray_Array_1) == 0x0000A0, "Member 'WBP_Menu_3_C_SetEmails::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_3_C_SetEmails, K2Node_MakeArray_Array_2) == 0x0000B0, "Member 'WBP_Menu_3_C_SetEmails::K2Node_MakeArray_Array_2' has a wrong offset!");

}

