#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_InteractionWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.ExecuteUbergraph_WBP_UI_InteractionWidget
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZPlayerInteractorComponent*    K2Node_Event_Interactor;                           // 0x0008(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsInteracting;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCurrentInstant_ReturnValue;             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSeenByAI;                          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZPlayerInteractorComponent*    K2Node_Event_Interactor_1;                         // 0x0018(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZInteractDisplayData                K2Node_Event_NewInteractionData;                   // 0x0020(0x0030)(ConstParm, ContainsInstancedReference)
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue;               // 0x0050(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0060(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsCasing;                            // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_ActionInput_Hold_C*      K2Node_Select_Default;                             // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget) == 0x000008, "Wrong alignment on WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget");
static_assert(sizeof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget) == 0x0000A8, "Wrong size on WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, EntryPoint) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Event_Interactor) == 0x000008, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Event_Interactor' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Event_bIsInteracting) == 0x000010, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Event_bIsInteracting' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, CallFunc_IsCurrentInstant_ReturnValue) == 0x000011, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::CallFunc_IsCurrentInstant_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Event_bIsSeenByAI) == 0x000012, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Event_bIsSeenByAI' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Event_Interactor_1) == 0x000018, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Event_Interactor_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Event_NewInteractionData) == 0x000020, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Event_NewInteractionData' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, CallFunc_GetGlobalColor_ReturnValue) == 0x000050, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::CallFunc_GetGlobalColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Event_MyGeometry) == 0x000060, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Event_InDeltaTime) == 0x000098, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, Temp_bool_Variable) == 0x00009C, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Event_bIsCasing) == 0x00009D, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Event_bIsCasing' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget, K2Node_Select_Default) == 0x0000A0, "Member 'WBP_UI_InteractionWidget_C_ExecuteUbergraph_WBP_UI_InteractionWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.OnCasingChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_InteractionWidget_C_OnCasingChanged final
{
public:
	bool                                          bIsCasing;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_OnCasingChanged) == 0x000001, "Wrong alignment on WBP_UI_InteractionWidget_C_OnCasingChanged");
static_assert(sizeof(WBP_UI_InteractionWidget_C_OnCasingChanged) == 0x000001, "Wrong size on WBP_UI_InteractionWidget_C_OnCasingChanged");
static_assert(offsetof(WBP_UI_InteractionWidget_C_OnCasingChanged, bIsCasing) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_OnCasingChanged::bIsCasing' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.OnAISeenPlayer
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_InteractionWidget_C_OnAISeenPlayer final
{
public:
	bool                                          bIsSeenByAI;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_OnAISeenPlayer) == 0x000001, "Wrong alignment on WBP_UI_InteractionWidget_C_OnAISeenPlayer");
static_assert(sizeof(WBP_UI_InteractionWidget_C_OnAISeenPlayer) == 0x000001, "Wrong size on WBP_UI_InteractionWidget_C_OnAISeenPlayer");
static_assert(offsetof(WBP_UI_InteractionWidget_C_OnAISeenPlayer, bIsSeenByAI) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_OnAISeenPlayer::bIsSeenByAI' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.OnPlayerIsInteracting
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_InteractionWidget_C_OnPlayerIsInteracting final
{
public:
	const class USBZPlayerInteractorComponent*    Interactor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInteracting;                                    // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_OnPlayerIsInteracting) == 0x000008, "Wrong alignment on WBP_UI_InteractionWidget_C_OnPlayerIsInteracting");
static_assert(sizeof(WBP_UI_InteractionWidget_C_OnPlayerIsInteracting) == 0x000010, "Wrong size on WBP_UI_InteractionWidget_C_OnPlayerIsInteracting");
static_assert(offsetof(WBP_UI_InteractionWidget_C_OnPlayerIsInteracting, Interactor) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_OnPlayerIsInteracting::Interactor' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_OnPlayerIsInteracting, bIsInteracting) == 0x000008, "Member 'WBP_UI_InteractionWidget_C_OnPlayerIsInteracting::bIsInteracting' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_InteractionWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_InteractionWidget_C_PreConstruct");
static_assert(sizeof(WBP_UI_InteractionWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_InteractionWidget_C_PreConstruct");
static_assert(offsetof(WBP_UI_InteractionWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.OnNewInteractionData
// 0x0038 (0x0038 - 0x0000)
struct WBP_UI_InteractionWidget_C_OnNewInteractionData final
{
public:
	const class USBZPlayerInteractorComponent*    Interactor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZInteractDisplayData                NewInteractionData;                                // 0x0008(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_OnNewInteractionData) == 0x000008, "Wrong alignment on WBP_UI_InteractionWidget_C_OnNewInteractionData");
static_assert(sizeof(WBP_UI_InteractionWidget_C_OnNewInteractionData) == 0x000038, "Wrong size on WBP_UI_InteractionWidget_C_OnNewInteractionData");
static_assert(offsetof(WBP_UI_InteractionWidget_C_OnNewInteractionData, Interactor) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_OnNewInteractionData::Interactor' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_OnNewInteractionData, NewInteractionData) == 0x000008, "Member 'WBP_UI_InteractionWidget_C_OnNewInteractionData::NewInteractionData' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_UI_InteractionWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_Tick) == 0x000004, "Wrong alignment on WBP_UI_InteractionWidget_C_Tick");
static_assert(sizeof(WBP_UI_InteractionWidget_C_Tick) == 0x00003C, "Wrong size on WBP_UI_InteractionWidget_C_Tick");
static_assert(offsetof(WBP_UI_InteractionWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_UI_InteractionWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.ProcessNewInteraction
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_UI_InteractionWidget_C_ProcessNewInteraction final
{
public:
	struct FSBZInteractDisplayData                InInteractData;                                    // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	ESBZStealthBranch                             CallFunc_StealthBranch_OutputPins;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                CallFunc_StealthBranch_ReturnValue;                // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZInteractModeDisplayData            CallFunc_Array_Get_Item;                           // 0x0040(0x0020)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetProgress_CurrentProgress;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue;               // 0x0074(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             K2Node_Select_Default_1;                           // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_ActionInput_Hold_C*      K2Node_Select_Default_2;                           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_ProcessNewInteraction) == 0x000008, "Wrong alignment on WBP_UI_InteractionWidget_C_ProcessNewInteraction");
static_assert(sizeof(WBP_UI_InteractionWidget_C_ProcessNewInteraction) == 0x0000A8, "Wrong size on WBP_UI_InteractionWidget_C_ProcessNewInteraction");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, InInteractData) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::InInteractData' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_StealthBranch_OutputPins) == 0x000030, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_StealthBranch_OutputPins' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_StealthBranch_ReturnValue) == 0x000031, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_StealthBranch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, Temp_int_Array_Index_Variable) == 0x00003C, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_BooleanAND_ReturnValue) == 0x000060, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_BooleanOR_ReturnValue) == 0x000061, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, Temp_bool_Variable) == 0x000062, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, Temp_bool_Variable_1) == 0x000063, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_GetProgress_CurrentProgress) == 0x000064, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_GetProgress_CurrentProgress' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, K2Node_Select_Default) == 0x000068, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, Temp_bool_Variable_2) == 0x000070, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_GetGlobalColor_ReturnValue) == 0x000074, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_GetGlobalColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, K2Node_Select_Default_1) == 0x000088, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, Temp_int_Loop_Counter_Variable) == 0x000090, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, K2Node_Select_Default_2) == 0x000098, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_ProcessNewInteraction, CallFunc_Add_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_UI_InteractionWidget_C_ProcessNewInteraction::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.GetProgress
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_InteractionWidget_C_GetProgress final
{
public:
	float                                         CurrentProgress;                                   // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZPlayerInteractorComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BP_GetProgress_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_GetProgress) == 0x000008, "Wrong alignment on WBP_UI_InteractionWidget_C_GetProgress");
static_assert(sizeof(WBP_UI_InteractionWidget_C_GetProgress) == 0x000028, "Wrong size on WBP_UI_InteractionWidget_C_GetProgress");
static_assert(offsetof(WBP_UI_InteractionWidget_C_GetProgress, CurrentProgress) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_GetProgress::CurrentProgress' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_GetProgress, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x000008, "Member 'WBP_UI_InteractionWidget_C_GetProgress::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_GetProgress, CallFunc_GetComponentByClass_ReturnValue) == 0x000010, "Member 'WBP_UI_InteractionWidget_C_GetProgress::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_GetProgress, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_UI_InteractionWidget_C_GetProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_GetProgress, CallFunc_BP_GetProgress_ReturnValue) == 0x00001C, "Member 'WBP_UI_InteractionWidget_C_GetProgress::CallFunc_BP_GetProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_GetProgress, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_UI_InteractionWidget_C_GetProgress::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_GetProgress, CallFunc_BooleanAND_ReturnValue) == 0x000021, "Member 'WBP_UI_InteractionWidget_C_GetProgress::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.UpdateProgress
// 0x000C (0x000C - 0x0000)
struct WBP_UI_InteractionWidget_C_UpdateProgress final
{
public:
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue_1;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetProgress_CurrentProgress;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_UpdateProgress) == 0x000004, "Wrong alignment on WBP_UI_InteractionWidget_C_UpdateProgress");
static_assert(sizeof(WBP_UI_InteractionWidget_C_UpdateProgress) == 0x00000C, "Wrong size on WBP_UI_InteractionWidget_C_UpdateProgress");
static_assert(offsetof(WBP_UI_InteractionWidget_C_UpdateProgress, CallFunc_GetVisibility_ReturnValue) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_UpdateProgress::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_UpdateProgress, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_UI_InteractionWidget_C_UpdateProgress::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_UpdateProgress, CallFunc_GetVisibility_ReturnValue_1) == 0x000002, "Member 'WBP_UI_InteractionWidget_C_UpdateProgress::CallFunc_GetVisibility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_UpdateProgress, CallFunc_GetProgress_CurrentProgress) == 0x000004, "Member 'WBP_UI_InteractionWidget_C_UpdateProgress::CallFunc_GetProgress_CurrentProgress' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_UpdateProgress, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000008, "Member 'WBP_UI_InteractionWidget_C_UpdateProgress::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_UpdateProgress, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000009, "Member 'WBP_UI_InteractionWidget_C_UpdateProgress::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_UpdateProgress, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'WBP_UI_InteractionWidget_C_UpdateProgress::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_UI_InteractionWidget.WBP_UI_InteractionWidget_C.UpdateObserved
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_InteractionWidget_C_UpdateObserved final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_InteractionWidget_C_UpdateObserved) == 0x000008, "Wrong alignment on WBP_UI_InteractionWidget_C_UpdateObserved");
static_assert(sizeof(WBP_UI_InteractionWidget_C_UpdateObserved) == 0x000010, "Wrong size on WBP_UI_InteractionWidget_C_UpdateObserved");
static_assert(offsetof(WBP_UI_InteractionWidget_C_UpdateObserved, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_UI_InteractionWidget_C_UpdateObserved::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_InteractionWidget_C_UpdateObserved, CallFunc_BooleanAND_ReturnValue) == 0x000008, "Member 'WBP_UI_InteractionWidget_C_UpdateObserved::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
