#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_HelperPanel_ButtonDescription

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_HelperPanel_ButtonDescription.WBP_Settings_HelperPanel_ButtonDescription_C
// 0x0020 (0x02C8 - 0x02A8)
class UWBP_Settings_HelperPanel_ButtonDescription_C final : public USBZSettingHelperPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Description;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SecondaryDescription;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZSettingsButton*                     CurrentButton;                                     // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Settings_HelperPanel_ButtonDescription(int32 EntryPoint);
	void RefreshPanelState();
	void UpdatePanelDescriptions();
	void ButtonFocusChanged(class USBZSettingsButton* Button, bool IsFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_HelperPanel_ButtonDescription_C">();
	}
	static class UWBP_Settings_HelperPanel_ButtonDescription_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_HelperPanel_ButtonDescription_C>();
	}
};
static_assert(alignof(UWBP_Settings_HelperPanel_ButtonDescription_C) == 0x000008, "Wrong alignment on UWBP_Settings_HelperPanel_ButtonDescription_C");
static_assert(sizeof(UWBP_Settings_HelperPanel_ButtonDescription_C) == 0x0002C8, "Wrong size on UWBP_Settings_HelperPanel_ButtonDescription_C");
static_assert(offsetof(UWBP_Settings_HelperPanel_ButtonDescription_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_Settings_HelperPanel_ButtonDescription_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_HelperPanel_ButtonDescription_C, Description) == 0x0002B0, "Member 'UWBP_Settings_HelperPanel_ButtonDescription_C::Description' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_HelperPanel_ButtonDescription_C, SecondaryDescription) == 0x0002B8, "Member 'UWBP_Settings_HelperPanel_ButtonDescription_C::SecondaryDescription' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_HelperPanel_ButtonDescription_C, CurrentButton) == 0x0002C0, "Member 'UWBP_Settings_HelperPanel_ButtonDescription_C::CurrentButton' has a wrong offset!");

}

