#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PartyContainerWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_PartyContainerWidget.WBP_UI_Widget_PartyContainerWidget_C
// 0x0028 (0x02E0 - 0x02B8)
class UWBP_UI_Widget_PartyContainerWidget_C final : public UPD3HUDPartyContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               SharedKeyItemContiainerOverlay;                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           PartyStrings;                                      // 0x02C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsDisplayingPartyString;                          // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget(int32 EntryPoint);
	void OnKeyItemCountChanged(class UPD3KeyItemContainer* InContainer);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_PartyContainerWidget_C">();
	}
	static class UWBP_UI_Widget_PartyContainerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_PartyContainerWidget_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_PartyContainerWidget_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_PartyContainerWidget_C");
static_assert(sizeof(UWBP_UI_Widget_PartyContainerWidget_C) == 0x0002E0, "Wrong size on UWBP_UI_Widget_PartyContainerWidget_C");
static_assert(offsetof(UWBP_UI_Widget_PartyContainerWidget_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_UI_Widget_PartyContainerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyContainerWidget_C, SharedKeyItemContiainerOverlay) == 0x0002C0, "Member 'UWBP_UI_Widget_PartyContainerWidget_C::SharedKeyItemContiainerOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyContainerWidget_C, PartyStrings) == 0x0002C8, "Member 'UWBP_UI_Widget_PartyContainerWidget_C::PartyStrings' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyContainerWidget_C, bIsDisplayingPartyString) == 0x0002D8, "Member 'UWBP_UI_Widget_PartyContainerWidget_C::bIsDisplayingPartyString' has a wrong offset!");

}

