#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_Overlay_Objective

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_HUD_Overlay_Objective.WBP_UI_HUD_Overlay_Objective_C.ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          K2Node_Event_ObjectiveActivated;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective");
static_assert(sizeof(WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective) == 0x000020, "Wrong size on WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective");
static_assert(offsetof(WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective, EntryPoint) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective, K2Node_Event_Animation) == 0x000008, "Member 'WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective, K2Node_Event_ObjectiveActivated) == 0x000018, "Member 'WBP_UI_HUD_Overlay_Objective_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective::K2Node_Event_ObjectiveActivated' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Objective.WBP_UI_HUD_Overlay_Objective_C.ObjectiveActivated
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_Overlay_Objective_C_ObjectiveActivated final
{
public:
	class ASBZObjective*                          Param_ObjectiveActivated_0;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Objective_C_ObjectiveActivated) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Objective_C_ObjectiveActivated");
static_assert(sizeof(WBP_UI_HUD_Overlay_Objective_C_ObjectiveActivated) == 0x000008, "Wrong size on WBP_UI_HUD_Overlay_Objective_C_ObjectiveActivated");
static_assert(offsetof(WBP_UI_HUD_Overlay_Objective_C_ObjectiveActivated, Param_ObjectiveActivated_0) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Objective_C_ObjectiveActivated::Param_ObjectiveActivated_0' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Objective.WBP_UI_HUD_Overlay_Objective_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_Overlay_Objective_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Objective_C_OnAnimationFinished) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Objective_C_OnAnimationFinished");
static_assert(sizeof(WBP_UI_HUD_Overlay_Objective_C_OnAnimationFinished) == 0x000008, "Wrong size on WBP_UI_HUD_Overlay_Objective_C_OnAnimationFinished");
static_assert(offsetof(WBP_UI_HUD_Overlay_Objective_C_OnAnimationFinished, Animation) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Objective_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Objective.WBP_UI_HUD_Overlay_Objective_C.SetObjectiveIntel
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel final
{
public:
	class ASBZObjective*                          Objective_0;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel");
static_assert(sizeof(WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel) == 0x000010, "Wrong size on WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel");
static_assert(offsetof(WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel, Objective_0) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel::Objective_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel, CallFunc_TextIsEmpty_ReturnValue) == 0x000008, "Member 'WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel, CallFunc_Not_PreBool_ReturnValue) == 0x000009, "Member 'WBP_UI_HUD_Overlay_Objective_C_SetObjectiveIntel::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

