#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_InfamyPoints

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_InfamyPoints.WBP_InfamyPoints_C
// 0x0090 (0x0320 - 0x0290)
class UWBP_InfamyPoints_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_Frame;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Image;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_403;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        PointsAmount_T;                                    // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Title_T;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   InTitle;                                           // 0x0300(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             IconTexture;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_InfamyPoints(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetValue(int32 InValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_InfamyPoints_C">();
	}
	static class UWBP_InfamyPoints_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_InfamyPoints_C>();
	}
};
static_assert(alignof(UWBP_InfamyPoints_C) == 0x000008, "Wrong alignment on UWBP_InfamyPoints_C");
static_assert(sizeof(UWBP_InfamyPoints_C) == 0x000320, "Wrong size on UWBP_InfamyPoints_C");
static_assert(offsetof(UWBP_InfamyPoints_C, UberGraphFrame) == 0x000290, "Member 'UWBP_InfamyPoints_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Border_Frame) == 0x000298, "Member 'UWBP_InfamyPoints_C::Border_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Icon_Image) == 0x0002A0, "Member 'UWBP_InfamyPoints_C::Icon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Image) == 0x0002A8, "Member 'UWBP_InfamyPoints_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Image_1) == 0x0002B0, "Member 'UWBP_InfamyPoints_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Image_2) == 0x0002B8, "Member 'UWBP_InfamyPoints_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Image_3) == 0x0002C0, "Member 'UWBP_InfamyPoints_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Image_4) == 0x0002C8, "Member 'UWBP_InfamyPoints_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Image_5) == 0x0002D0, "Member 'UWBP_InfamyPoints_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Image_6) == 0x0002D8, "Member 'UWBP_InfamyPoints_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Image_403) == 0x0002E0, "Member 'UWBP_InfamyPoints_C::Image_403' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Image_511) == 0x0002E8, "Member 'UWBP_InfamyPoints_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, PointsAmount_T) == 0x0002F0, "Member 'UWBP_InfamyPoints_C::PointsAmount_T' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, Title_T) == 0x0002F8, "Member 'UWBP_InfamyPoints_C::Title_T' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, InTitle) == 0x000300, "Member 'UWBP_InfamyPoints_C::InTitle' has a wrong offset!");
static_assert(offsetof(UWBP_InfamyPoints_C, IconTexture) == 0x000318, "Member 'UWBP_InfamyPoints_C::IconTexture' has a wrong offset!");

}

