#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Menu_3.WBP_Menu_3_C
// 0x01B8 (0x0448 - 0x0290)
class UWBP_Menu_3_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UOverlay*                               BackButton;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Body_Email;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Body_Email_1;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Body_Email_2;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Button_1;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Button1;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Button1_1;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Button1_2;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Button1_3;                                         // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Button1_4;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Button1_6;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Greetings;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Greetings_1;                                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Greetings_2;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Header_Email;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Header_Email_1;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Header_Email_2;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_15;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_16;                                          // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_165;                                         // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_349;                                         // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_372;                                         // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_685;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderBottom;                                // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderLeft;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderRight;                                 // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderTop;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ovelay;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ovelay_Down;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_ovelay_Up;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Logo;                                              // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_1;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_2;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_3;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_78;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Border;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_1121;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Normal;                                            // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Hover;                                             // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Scroll_Offset;                                 // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FC[0x4];                                      // 0x03FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NewVar_0;                                          // 0x0400(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class URichTextBlock*>                 EmailBodyArray;                                    // 0x0410(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class URichTextBlock*>                 EmailHeaderArray;                                  // 0x0420(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class URichTextBlock*>                 EmailGreetingsArray;                               // 0x0430(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         ScrollLength;                                      // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Menu_3(int32 EntryPoint);
	void SetBackFocus(bool NewParam);
	void Email_Test(int32 Code, const struct FS_EmailStructure& CodeEmail);
	void Set_FocusUp(bool NewParam);
	void SetFocusDown(bool NewParam);
	void Scroll_Down_Func(float A, float* New_Scroll_Offset_0);
	void ScrollUpFunc(float A, float* New_Scroll_Offset_0);
	void SetEmails(TArray<struct FS_EmailStructure>& Emails);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Menu_3_C">();
	}
	static class UWBP_Menu_3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Menu_3_C>();
	}
};
static_assert(alignof(UWBP_Menu_3_C) == 0x000008, "Wrong alignment on UWBP_Menu_3_C");
static_assert(sizeof(UWBP_Menu_3_C) == 0x000448, "Wrong size on UWBP_Menu_3_C");
static_assert(offsetof(UWBP_Menu_3_C, UberGraphFrame) == 0x000290, "Member 'UWBP_Menu_3_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, BackButton) == 0x000298, "Member 'UWBP_Menu_3_C::BackButton' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Body_Email) == 0x0002A0, "Member 'UWBP_Menu_3_C::Body_Email' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Body_Email_1) == 0x0002A8, "Member 'UWBP_Menu_3_C::Body_Email_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Body_Email_2) == 0x0002B0, "Member 'UWBP_Menu_3_C::Body_Email_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Button_1) == 0x0002B8, "Member 'UWBP_Menu_3_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Button1) == 0x0002C0, "Member 'UWBP_Menu_3_C::Button1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Button1_1) == 0x0002C8, "Member 'UWBP_Menu_3_C::Button1_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Button1_2) == 0x0002D0, "Member 'UWBP_Menu_3_C::Button1_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Button1_3) == 0x0002D8, "Member 'UWBP_Menu_3_C::Button1_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Button1_4) == 0x0002E0, "Member 'UWBP_Menu_3_C::Button1_4' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Button1_6) == 0x0002E8, "Member 'UWBP_Menu_3_C::Button1_6' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Greetings) == 0x0002F0, "Member 'UWBP_Menu_3_C::Greetings' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Greetings_1) == 0x0002F8, "Member 'UWBP_Menu_3_C::Greetings_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Greetings_2) == 0x000300, "Member 'UWBP_Menu_3_C::Greetings_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Header_Email) == 0x000308, "Member 'UWBP_Menu_3_C::Header_Email' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Header_Email_1) == 0x000310, "Member 'UWBP_Menu_3_C::Header_Email_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Header_Email_2) == 0x000318, "Member 'UWBP_Menu_3_C::Header_Email_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_11) == 0x000320, "Member 'UWBP_Menu_3_C::Image_11' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_14) == 0x000328, "Member 'UWBP_Menu_3_C::Image_14' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_15) == 0x000330, "Member 'UWBP_Menu_3_C::Image_15' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_16) == 0x000338, "Member 'UWBP_Menu_3_C::Image_16' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_165) == 0x000340, "Member 'UWBP_Menu_3_C::Image_165' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_349) == 0x000348, "Member 'UWBP_Menu_3_C::Image_349' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_372) == 0x000350, "Member 'UWBP_Menu_3_C::Image_372' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_685) == 0x000358, "Member 'UWBP_Menu_3_C::Image_685' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_BorderBottom) == 0x000360, "Member 'UWBP_Menu_3_C::Image_BorderBottom' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_BorderLeft) == 0x000368, "Member 'UWBP_Menu_3_C::Image_BorderLeft' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_BorderRight) == 0x000370, "Member 'UWBP_Menu_3_C::Image_BorderRight' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Image_BorderTop) == 0x000378, "Member 'UWBP_Menu_3_C::Image_BorderTop' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Img_ovelay) == 0x000380, "Member 'UWBP_Menu_3_C::Img_ovelay' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Img_ovelay_Down) == 0x000388, "Member 'UWBP_Menu_3_C::Img_ovelay_Down' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Img_ovelay_Up) == 0x000390, "Member 'UWBP_Menu_3_C::Img_ovelay_Up' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Logo) == 0x000398, "Member 'UWBP_Menu_3_C::Logo' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Overlay) == 0x0003A0, "Member 'UWBP_Menu_3_C::Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Overlay_1) == 0x0003A8, "Member 'UWBP_Menu_3_C::Overlay_1' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Overlay_2) == 0x0003B0, "Member 'UWBP_Menu_3_C::Overlay_2' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Overlay_3) == 0x0003B8, "Member 'UWBP_Menu_3_C::Overlay_3' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Overlay_78) == 0x0003C0, "Member 'UWBP_Menu_3_C::Overlay_78' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Overlay_Border) == 0x0003C8, "Member 'UWBP_Menu_3_C::Overlay_Border' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, ScrollBox_1121) == 0x0003D0, "Member 'UWBP_Menu_3_C::ScrollBox_1121' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Normal) == 0x0003D8, "Member 'UWBP_Menu_3_C::Normal' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, Hover) == 0x0003E8, "Member 'UWBP_Menu_3_C::Hover' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, New_Scroll_Offset) == 0x0003F8, "Member 'UWBP_Menu_3_C::New_Scroll_Offset' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, NewVar_0) == 0x000400, "Member 'UWBP_Menu_3_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, EmailBodyArray) == 0x000410, "Member 'UWBP_Menu_3_C::EmailBodyArray' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, EmailHeaderArray) == 0x000420, "Member 'UWBP_Menu_3_C::EmailHeaderArray' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, EmailGreetingsArray) == 0x000430, "Member 'UWBP_Menu_3_C::EmailGreetingsArray' has a wrong offset!");
static_assert(offsetof(UWBP_Menu_3_C, ScrollLength) == 0x000440, "Member 'UWBP_Menu_3_C::ScrollLength' has a wrong offset!");

}

