#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Results_AICrewStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Results_AICrewStatus.WBP_UI_Results_AICrewStatus_C
// 0x0030 (0x02C0 - 0x0290)
class UWBP_UI_Results_AICrewStatus_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Ai_Border;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        AICrewNameText;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CharacterIcon;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ASBZAICrewState*                        AICrewState;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Results_AICrewStatus(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void PlayAddedAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Results_AICrewStatus_C">();
	}
	static class UWBP_UI_Results_AICrewStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Results_AICrewStatus_C>();
	}
};
static_assert(alignof(UWBP_UI_Results_AICrewStatus_C) == 0x000008, "Wrong alignment on UWBP_UI_Results_AICrewStatus_C");
static_assert(sizeof(UWBP_UI_Results_AICrewStatus_C) == 0x0002C0, "Wrong size on UWBP_UI_Results_AICrewStatus_C");
static_assert(offsetof(UWBP_UI_Results_AICrewStatus_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Results_AICrewStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_AICrewStatus_C, FadeIn) == 0x000298, "Member 'UWBP_UI_Results_AICrewStatus_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_AICrewStatus_C, Ai_Border) == 0x0002A0, "Member 'UWBP_UI_Results_AICrewStatus_C::Ai_Border' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_AICrewStatus_C, AICrewNameText) == 0x0002A8, "Member 'UWBP_UI_Results_AICrewStatus_C::AICrewNameText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_AICrewStatus_C, CharacterIcon) == 0x0002B0, "Member 'UWBP_UI_Results_AICrewStatus_C::CharacterIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_AICrewStatus_C, AICrewState) == 0x0002B8, "Member 'UWBP_UI_Results_AICrewStatus_C::AICrewState' has a wrong offset!");

}

