#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Crimenet_SecurityCompanyDisplayPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Crimenet_SecurityCompanyDisplayPanel.WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C
// 0x0038 (0x02C8 - 0x0290)
class UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextDebugSelection;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_CompanyContainer;                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Crimenet_SecurityCompanyDetails_C* Widget_SecurityCompany_Amguard;                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Crimenet_SecurityCompanyDetails_C* Widget_SecurityCompany_GenSec;                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Crimenet_SecurityCompanyDetails_C* Widget_SecurityCompany_Psc;                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Crimenet_SecurityCompanyDetails_C* Widget_SecurityCompany_Senturian;               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Crimenet_SecurityCompanyDisplayPanel(int32 EntryPoint);
	void OnInitialized();
	void UpdateSecurityCompanies();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Crimenet_SecurityCompanyDisplayPanel_C">();
	}
	static class UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C>();
	}
};
static_assert(alignof(UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C) == 0x000008, "Wrong alignment on UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C");
static_assert(sizeof(UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C) == 0x0002C8, "Wrong size on UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C, TextDebugSelection) == 0x000298, "Member 'UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C::TextDebugSelection' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C, VerticalBox_CompanyContainer) == 0x0002A0, "Member 'UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C::VerticalBox_CompanyContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C, Widget_SecurityCompany_Amguard) == 0x0002A8, "Member 'UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C::Widget_SecurityCompany_Amguard' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C, Widget_SecurityCompany_GenSec) == 0x0002B0, "Member 'UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C::Widget_SecurityCompany_GenSec' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C, Widget_SecurityCompany_Psc) == 0x0002B8, "Member 'UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C::Widget_SecurityCompany_Psc' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C, Widget_SecurityCompany_Senturian) == 0x0002C0, "Member 'UWBP_UI_Crimenet_SecurityCompanyDisplayPanel_C::Widget_SecurityCompany_Senturian' has a wrong offset!");

}

