#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_ColorSelector_RinoHud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_ColorSelector_RinoHud.WBP_Settings_ColorSelector_RinoHud_C
// 0x0078 (0x0460 - 0x03E8)
class UWBP_Settings_ColorSelector_RinoHud_C final : public USBZSettingsButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Border_Image;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Color;                                       // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Value_B;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Value_G;                                    // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Value_R;                                    // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SettingName;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SettingTextValue_B;                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SettingTextValue_G;                           // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SettingTextValue_R;                           // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FColor                                 ColorSliderValue;                                  // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44C[0x4];                                      // 0x044C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class FName SettingsCategoryName, class FName SettingsName, const struct FColor& ColorValue)> ColorValueChanged; // 0x0450(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_Settings_ColorSelector_RinoHud(int32 EntryPoint);
	void RValueChanged(float Value);
	void GValueChanged(float Value);
	void BValueChanged(float Value);
	void SettingChanged();
	void SelectionNameChanged();
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void UpdateSliderValue();
	void UpdateSettingNameText();
	void InitializeVisuals();
	void OnDisabledVisuals(bool bIsDisabled_0);
	void OnFocusedVisuals(bool bIsFocused);
	void OnHoverVisuals(bool bIsHovered);
	void RefreshVisuals();
	void SetColorValue(const struct FColor& ColorSliderValue_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_ColorSelector_RinoHud_C">();
	}
	static class UWBP_Settings_ColorSelector_RinoHud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_ColorSelector_RinoHud_C>();
	}
};
static_assert(alignof(UWBP_Settings_ColorSelector_RinoHud_C) == 0x000008, "Wrong alignment on UWBP_Settings_ColorSelector_RinoHud_C");
static_assert(sizeof(UWBP_Settings_ColorSelector_RinoHud_C) == 0x000460, "Wrong size on UWBP_Settings_ColorSelector_RinoHud_C");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, UberGraphFrame) == 0x0003E8, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Border_Image) == 0x0003F0, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Border_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Image_Background) == 0x0003F8, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Image_BG) == 0x000400, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Image_Color) == 0x000408, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Image_Color' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Slider_Value_B) == 0x000410, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Slider_Value_B' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Slider_Value_G) == 0x000418, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Slider_Value_G' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Slider_Value_R) == 0x000420, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Slider_Value_R' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Text_SettingName) == 0x000428, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Text_SettingName' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Text_SettingTextValue_B) == 0x000430, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Text_SettingTextValue_B' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Text_SettingTextValue_G) == 0x000438, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Text_SettingTextValue_G' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, Text_SettingTextValue_R) == 0x000440, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::Text_SettingTextValue_R' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, ColorSliderValue) == 0x000448, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::ColorSliderValue' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_ColorSelector_RinoHud_C, ColorValueChanged) == 0x000450, "Member 'UWBP_Settings_ColorSelector_RinoHud_C::ColorValueChanged' has a wrong offset!");

}

