#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_ControlsReference

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Inventory_ControlsReference.WBP_UI_Inventory_ControlsReference_C.InitControlsReference
// 0x0098 (0x0098 - 0x0000)
struct WBP_UI_Inventory_ControlsReference_C_InitControlsReference final
{
public:
	struct FSBZControlsReference                  InControlsReference;                               // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZActionControlReference             CallFunc_Array_Get_Item;                           // 0x0058(0x0030)()
	class UWBP_UI_Inventory_Action_C*             CallFunc_Create_ReturnValue;                       // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference) == 0x000008, "Wrong alignment on WBP_UI_Inventory_ControlsReference_C_InitControlsReference");
static_assert(sizeof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference) == 0x000098, "Wrong size on WBP_UI_Inventory_ControlsReference_C_InitControlsReference");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, InControlsReference) == 0x000000, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::InControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, K2Node_MakeStruct_Margin) == 0x000028, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, CallFunc_Array_Length_ReturnValue_1) == 0x000048, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, Temp_int_Array_Index_Variable) == 0x00004C, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, CallFunc_Create_ReturnValue) == 0x000088, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_ControlsReference_C_InitControlsReference, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000090, "Member 'WBP_UI_Inventory_ControlsReference_C_InitControlsReference::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");

}

