#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_InputKeyActionBindings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C
// 0x0050 (0x03B0 - 0x0360)
class UWBP_Settings_InputKeyActionBindings_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputKeySelector*                      InputKeySelector_PrimaryKey;                       // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_ActionNames;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_InputKey_C*                     WBP_UI_InputKey;                                   // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FKey                                   InputKey;                                          // 0x0390(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Settings_InputKeyActionBindings(int32 EntryPoint);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RefreshVisuals();
	void OnHoverVisuals(bool bIsHovered);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void InitializeVisuals();
	void OnFocusedVisuals(bool bIsFocused);
	void GetJoinedActionNames(TArray<class FText>& Action_Names, class FString* Result);
	void ActionNamesVisuals();
	void InputKeyVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_InputKeyActionBindings_C">();
	}
	static class UWBP_Settings_InputKeyActionBindings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_InputKeyActionBindings_C>();
	}
};
static_assert(alignof(UWBP_Settings_InputKeyActionBindings_C) == 0x000008, "Wrong alignment on UWBP_Settings_InputKeyActionBindings_C");
static_assert(sizeof(UWBP_Settings_InputKeyActionBindings_C) == 0x0003B0, "Wrong size on UWBP_Settings_InputKeyActionBindings_C");
static_assert(offsetof(UWBP_Settings_InputKeyActionBindings_C, UberGraphFrame) == 0x000360, "Member 'UWBP_Settings_InputKeyActionBindings_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputKeyActionBindings_C, Image_Background) == 0x000368, "Member 'UWBP_Settings_InputKeyActionBindings_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputKeyActionBindings_C, Image_Hover) == 0x000370, "Member 'UWBP_Settings_InputKeyActionBindings_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputKeyActionBindings_C, InputKeySelector_PrimaryKey) == 0x000378, "Member 'UWBP_Settings_InputKeyActionBindings_C::InputKeySelector_PrimaryKey' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputKeyActionBindings_C, Text_ActionNames) == 0x000380, "Member 'UWBP_Settings_InputKeyActionBindings_C::Text_ActionNames' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputKeyActionBindings_C, WBP_UI_InputKey) == 0x000388, "Member 'UWBP_Settings_InputKeyActionBindings_C::WBP_UI_InputKey' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_InputKeyActionBindings_C, InputKey) == 0x000390, "Member 'UWBP_Settings_InputKeyActionBindings_C::InputKey' has a wrong offset!");

}

