#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PartyMemberWeaponStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_PartyMemberWeaponStatus.WBP_UI_Widget_PartyMemberWeaponStatus_C
// 0x00A8 (0x0368 - 0x02C0)
class UWBP_UI_Widget_PartyMemberWeaponStatus_C final : public UPD3WeaponStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnPickUpAnimation;                                 // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_AmmoBag;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_AmmoBagBackground;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            NormalTextColor;                                   // 0x02E8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FSlateColor                            LowTextColor;                                      // 0x0310(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FSlateColor                            CriticalTextColor;                                 // 0x0338(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	float                                         EquippedOpacity;                                   // 0x0360(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnequippedOpacity;                                 // 0x0364(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_PartyMemberWeaponStatus(int32 EntryPoint);
	void OnAmmoAdded(int32 AmmoAddedCount);
	void OnInitialized();
	void OnAmmoTotalStateChanged(EPD3AmmoState NewState);
	void OnAmmoTotalChanged(int32 AmmoTotalChanged);
	void OnEquippedChanged(bool bIsEquippedNewValue);
	void SetEquipped(bool IsEquipped);
	void SetAmmoState(class UTextBlock* TextBlock, EPD3AmmoState Index_0);
	void SetText(int32 AmmoValue);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_PartyMemberWeaponStatus_C">();
	}
	static class UWBP_UI_Widget_PartyMemberWeaponStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_PartyMemberWeaponStatus_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_PartyMemberWeaponStatus_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_PartyMemberWeaponStatus_C");
static_assert(sizeof(UWBP_UI_Widget_PartyMemberWeaponStatus_C) == 0x000368, "Wrong size on UWBP_UI_Widget_PartyMemberWeaponStatus_C");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, OnPickUpAnimation) == 0x0002C8, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::OnPickUpAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, Background_I) == 0x0002D0, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, Text_AmmoBag) == 0x0002D8, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::Text_AmmoBag' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, Text_AmmoBagBackground) == 0x0002E0, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::Text_AmmoBagBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, NormalTextColor) == 0x0002E8, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::NormalTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, LowTextColor) == 0x000310, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::LowTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, CriticalTextColor) == 0x000338, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::CriticalTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, EquippedOpacity) == 0x000360, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::EquippedOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PartyMemberWeaponStatus_C, UnequippedOpacity) == 0x000364, "Member 'UWBP_UI_Widget_PartyMemberWeaponStatus_C::UnequippedOpacity' has a wrong offset!");

}

