#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_CrimeNetHeistButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_CrimeNetHeistButton.WBP_UI_CrimeNetHeistButton_C
// 0x0050 (0x03F0 - 0x03A0)
class UWBP_UI_CrimeNetHeistButton_C final : public USBZMainMenuCrimeNetHeistButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LockedPressed;                                     // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnFocused;                                         // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URetainerBox*                           BWEffect_RB;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Disable_T;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Disabled_O;                                        // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_HeistBackground;                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Name_T;                                            // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SelectedOutline_B;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterials;                                  // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_CrimeNetHeistButton(int32 EntryPoint);
	void OnFocusChanged(bool bIsFocused);
	void DisabledButtonSelected();
	void ButtonDisabledChanged(bool bInIsDisabled);
	void Construct();
	void OnHeistDataInitialized();
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void OnLoaded_652D1BEC4F78339E65381AB1B712EDE5(class UObject* Loaded);
	void OnHoverChanged(bool bIsHovered);
	void OnFocusedChanged(bool bIsFocused);
	void InitializeButtonVisuals();
	void OnDisabledChanged(bool InDisabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_CrimeNetHeistButton_C">();
	}
	static class UWBP_UI_CrimeNetHeistButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_CrimeNetHeistButton_C>();
	}
};
static_assert(alignof(UWBP_UI_CrimeNetHeistButton_C) == 0x000008, "Wrong alignment on UWBP_UI_CrimeNetHeistButton_C");
static_assert(sizeof(UWBP_UI_CrimeNetHeistButton_C) == 0x0003F0, "Wrong size on UWBP_UI_CrimeNetHeistButton_C");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, UberGraphFrame) == 0x0003A0, "Member 'UWBP_UI_CrimeNetHeistButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, LockedPressed) == 0x0003A8, "Member 'UWBP_UI_CrimeNetHeistButton_C::LockedPressed' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, OnFocused) == 0x0003B0, "Member 'UWBP_UI_CrimeNetHeistButton_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, BWEffect_RB) == 0x0003B8, "Member 'UWBP_UI_CrimeNetHeistButton_C::BWEffect_RB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, Disable_T) == 0x0003C0, "Member 'UWBP_UI_CrimeNetHeistButton_C::Disable_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, Disabled_O) == 0x0003C8, "Member 'UWBP_UI_CrimeNetHeistButton_C::Disabled_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, Image_HeistBackground) == 0x0003D0, "Member 'UWBP_UI_CrimeNetHeistButton_C::Image_HeistBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, Name_T) == 0x0003D8, "Member 'UWBP_UI_CrimeNetHeistButton_C::Name_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, SelectedOutline_B) == 0x0003E0, "Member 'UWBP_UI_CrimeNetHeistButton_C::SelectedOutline_B' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetHeistButton_C, DynamicMaterials) == 0x0003E8, "Member 'UWBP_UI_CrimeNetHeistButton_C::DynamicMaterials' has a wrong offset!");

}

