#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_MaskOnNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_MaskOnNotification.WBP_UI_Widget_MaskOnNotification_C
// 0x0020 (0x02C8 - 0x02A8)
class UWBP_UI_Widget_MaskOnNotification_C final : public UPD3MaskOnNotificationWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_250;                                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Prompt;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      Widget_HoldInteraction;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification(int32 EntryPoint);
	void OnProgressChanged(float InProgress);
	void MaskOnChanged(bool bInIsPuttingOnMask);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_MaskOnNotification_C">();
	}
	static class UWBP_UI_Widget_MaskOnNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_MaskOnNotification_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_MaskOnNotification_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_MaskOnNotification_C");
static_assert(sizeof(UWBP_UI_Widget_MaskOnNotification_C) == 0x0002C8, "Wrong size on UWBP_UI_Widget_MaskOnNotification_C");
static_assert(offsetof(UWBP_UI_Widget_MaskOnNotification_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_UI_Widget_MaskOnNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_MaskOnNotification_C, Image_250) == 0x0002B0, "Member 'UWBP_UI_Widget_MaskOnNotification_C::Image_250' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_MaskOnNotification_C, Text_Prompt) == 0x0002B8, "Member 'UWBP_UI_Widget_MaskOnNotification_C::Text_Prompt' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_MaskOnNotification_C, Widget_HoldInteraction) == 0x0002C0, "Member 'UWBP_UI_Widget_MaskOnNotification_C::Widget_HoldInteraction' has a wrong offset!");

}

