#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_LoginSceen_InfoPopUp

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_LoginSceen_InfoPopUp.WBP_UI_LoginSceen_InfoPopUp_C.ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp) == 0x000008, "Wrong alignment on WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp");
static_assert(sizeof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp) == 0x000030, "Wrong size on WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, EntryPoint) == 0x000000, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, Temp_bool_Variable) == 0x000010, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, Temp_byte_Variable) == 0x000011, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, K2Node_Event_IsDesignTime) == 0x000013, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000020, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, K2Node_Select_Default) == 0x000021, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000028, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_ExecuteUbergraph_WBP_UI_LoginSceen_InfoPopUp::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");

// Function WBP_UI_LoginSceen_InfoPopUp.WBP_UI_LoginSceen_InfoPopUp_C.BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_LoginSceen_InfoPopUp.WBP_UI_LoginSceen_InfoPopUp_C.BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_BndEvt__WBP_UI_LoginSceen_InfoPopUp_WBP_MenuButton_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_LoginSceen_InfoPopUp.WBP_UI_LoginSceen_InfoPopUp_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_LoginSceen_InfoPopUp_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_LoginSceen_InfoPopUp_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_LoginSceen_InfoPopUp_C_PreConstruct");
static_assert(sizeof(WBP_UI_LoginSceen_InfoPopUp_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_LoginSceen_InfoPopUp_C_PreConstruct");
static_assert(offsetof(WBP_UI_LoginSceen_InfoPopUp_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_LoginSceen_InfoPopUp_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

