#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_TutorialPopUpBody

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_TutorialPopUpBody.WBP_UI_TutorialPopUpBody_C.ExecuteUbergraph_WBP_UI_TutorialPopUpBody
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZTutorialPopUpDataAsset*       K2Node_Event_InPopUpDataAsset;                     // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody) == 0x000008, "Wrong alignment on WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody");
static_assert(sizeof(WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody) == 0x000028, "Wrong size on WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody");
static_assert(offsetof(WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody, EntryPoint) == 0x000000, "Member 'WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody, K2Node_Event_InPopUpDataAsset) == 0x000008, "Member 'WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody::K2Node_Event_InPopUpDataAsset' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000018, "Member 'WBP_UI_TutorialPopUpBody_C_ExecuteUbergraph_WBP_UI_TutorialPopUpBody::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");

// Function WBP_UI_TutorialPopUpBody.WBP_UI_TutorialPopUpBody_C.OnTutorialPopUpInitialized
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_TutorialPopUpBody_C_OnTutorialPopUpInitialized final
{
public:
	const class USBZTutorialPopUpDataAsset*       InPopUpDataAsset;                                  // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_TutorialPopUpBody_C_OnTutorialPopUpInitialized) == 0x000008, "Wrong alignment on WBP_UI_TutorialPopUpBody_C_OnTutorialPopUpInitialized");
static_assert(sizeof(WBP_UI_TutorialPopUpBody_C_OnTutorialPopUpInitialized) == 0x000008, "Wrong size on WBP_UI_TutorialPopUpBody_C_OnTutorialPopUpInitialized");
static_assert(offsetof(WBP_UI_TutorialPopUpBody_C_OnTutorialPopUpInitialized, InPopUpDataAsset) == 0x000000, "Member 'WBP_UI_TutorialPopUpBody_C_OnTutorialPopUpInitialized::InPopUpDataAsset' has a wrong offset!");

}

