#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_ActionPhase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_SM_ActionPhase.WBP_UI_SM_ActionPhase_C
// 0x0020 (0x04E0 - 0x04C0)
class UWBP_UI_SM_ActionPhase_C final : public USBZActionPhaseBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZUITextBlock*                        SoloModeBetaTag_T;                                 // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_SM_ActionPhaseMenu_C*           Widget_PauseMenu;                                  // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ViewTargetContainer_C*          Widget_ViewTargets;                                // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_SM_ActionPhase(int32 EntryPoint);
	void BP_CloseHUDOverlay();
	void BP_OpenHUDOverlay();
	void Destruct();
	void OnInitialized();
	void OnHUDContextChanged(const struct FSBZUIHUDContext& OnHUDContextChanged_0);
	void SetPlayerHUDDisplayed(bool bIsFullHUD);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_SM_ActionPhase_C">();
	}
	static class UWBP_UI_SM_ActionPhase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_SM_ActionPhase_C>();
	}
};
static_assert(alignof(UWBP_UI_SM_ActionPhase_C) == 0x000008, "Wrong alignment on UWBP_UI_SM_ActionPhase_C");
static_assert(sizeof(UWBP_UI_SM_ActionPhase_C) == 0x0004E0, "Wrong size on UWBP_UI_SM_ActionPhase_C");
static_assert(offsetof(UWBP_UI_SM_ActionPhase_C, UberGraphFrame) == 0x0004C0, "Member 'UWBP_UI_SM_ActionPhase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_ActionPhase_C, SoloModeBetaTag_T) == 0x0004C8, "Member 'UWBP_UI_SM_ActionPhase_C::SoloModeBetaTag_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_ActionPhase_C, Widget_PauseMenu) == 0x0004D0, "Member 'UWBP_UI_SM_ActionPhase_C::Widget_PauseMenu' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SM_ActionPhase_C, Widget_ViewTargets) == 0x0004D8, "Member 'UWBP_UI_SM_ActionPhase_C::Widget_ViewTargets' has a wrong offset!");

}

