#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SM_CrimeNetHeistSelection

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection
// 0x0438 (0x0438 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_1;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0018(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMatchmakingInProgress_ReturnValue;      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_2;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_3;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZOnlineMatchmakingParams            CallFunc_GetMatchMakingParameters_ReturnValue;     // 0x0038(0x0028)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_GetHeistLevelPath_ReturnValue;            // 0x0068(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex_1;             // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_LevelPathToIdx_ReturnValue;               // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x00B0(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x00E0(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0110(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x0128(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0158(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0168(0x0028)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0198(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuCrimeNetHeistButton*        K2Node_Event_SelectedButton;                       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UPD3HeistDataAsset*               CallFunc_GetHeistData_ReturnValue;                 // 0x01B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_CrimeNetHeistButton_C*          K2Node_DynamicCast_AsWBP_UI_Crime_Net_Heist_Button; // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C2[0x6];                                      // 0x01C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_SM_GameStart_C*                 K2Node_DynamicCast_AsWBP_UI_SM_Game_Start;         // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_Event_MenuButton;                           // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFocused;                           // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuCrimeNetHeistButton*        K2Node_DynamicCast_AsSBZMain_Menu_Crime_Net_Heist_Button; // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_CrimeNetHeistButton_C*          K2Node_DynamicCast_AsWBP_UI_Crime_Net_Heist_Button_1; // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ToggleStoryModeFilter_ReturnValue;        // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_233[0x1];                                      // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0248(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZHeistCollection>            CallFunc_GetHeistCollections_ReturnValue;          // 0x0258(0x0010)(ConstParm, ReferenceParm)
	struct FSBZHeistCollection                    CallFunc_Array_Get_Item;                           // 0x0268(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZHeistCollectionWithOwnership       K2Node_Event_ActiveHeistCollection;                // 0x02A8(0x0030)(ConstParm)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x02E0(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_ClosingActionName;              // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x0300(0x0030)()
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_4;     // 0x0338(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x0368(0x0010)(ReferenceParm)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x0380(0x0028)()
	class FName                                   CallFunc_PopStack_ReturnValue_1;                   // 0x03A8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData;                  // 0x03B8(0x0060)(ContainsInstancedReference)
	bool                                          CallFunc_IsSoloGameEnabled_ReturnValue;            // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameUserSettings*                   CallFunc_Get_ReturnValue;                          // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameUserSettings*                   CallFunc_Get_ReturnValue_1;                        // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPopupShown_ReturnValue;                 // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0431(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0432(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0433(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection) == 0x000008, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection) == 0x000438, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, EntryPoint) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetGameStateMachine_ReturnValue) == 0x000008, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetGameStateMachine_ReturnValue_1) == 0x000010, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetGameStateMachine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_Event_PreviousValue) == 0x000018, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_IsMatchmakingInProgress_ReturnValue) == 0x000024, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_IsMatchmakingInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_NotEqual_NameName_ReturnValue) == 0x000025, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetGameStateMachine_ReturnValue_2) == 0x000028, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetGameStateMachine_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetGameStateMachine_ReturnValue_3) == 0x000030, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetGameStateMachine_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetMatchMakingParameters_ReturnValue) == 0x000038, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetMatchMakingParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_ComponentBoundEvent_Button_2) == 0x000060, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetHeistLevelPath_ReturnValue) == 0x000068, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetHeistLevelPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_ComponentBoundEvent_NewIndex_1) == 0x000088, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_ComponentBoundEvent_NewIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_LevelPathToIdx_ReturnValue) == 0x00008C, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_LevelPathToIdx_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000090, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_CustomEvent_ActionName) == 0x000094, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_ComponentBoundEvent_Button_1) == 0x0000A0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_ComponentBoundEvent_bIsEnabled) == 0x0000A8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_SwitchName_CmpSuccess) == 0x0000A9, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeStruct_SBZButtonControlReference) == 0x0000B0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x0000E0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_CreateDelegate_OutputDelegate) == 0x000110, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x000128, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeArray_Array) == 0x000158, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000168, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetUIManager_ReturnValue) == 0x000190, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_PopStack_ReturnValue) == 0x000198, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_Event_SelectedButton) == 0x0001A8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_Event_SelectedButton' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetHeistData_ReturnValue) == 0x0001B0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetHeistData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_DynamicCast_AsWBP_UI_Crime_Net_Heist_Button) == 0x0001B8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_DynamicCast_AsWBP_UI_Crime_Net_Heist_Button' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_DynamicCast_bSuccess) == 0x0001C0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_IsValid_ReturnValue) == 0x0001C1, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_ComponentBoundEvent_Button) == 0x0001C8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, Temp_int_Array_Index_Variable) == 0x0001D0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetUIManager_ReturnValue_1) == 0x0001D8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetMenuWidget_ReturnValue) == 0x0001E0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_DynamicCast_AsWBP_UI_SM_Game_Start) == 0x0001E8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_DynamicCast_AsWBP_UI_SM_Game_Start' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_Event_MenuButton) == 0x0001F8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_Event_MenuButton' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_Event_bIsFocused) == 0x000200, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_Event_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_DynamicCast_AsSBZMain_Menu_Crime_Net_Heist_Button) == 0x000208, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_DynamicCast_AsSBZMain_Menu_Crime_Net_Heist_Button' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_DynamicCast_bSuccess_2) == 0x000210, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_Play2DSound_ReturnValue) == 0x000214, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_DynamicCast_AsWBP_UI_Crime_Net_Heist_Button_1) == 0x000218, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_DynamicCast_AsWBP_UI_Crime_Net_Heist_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_DynamicCast_bSuccess_3) == 0x000220, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_PlayAnimationForward_ReturnValue) == 0x000228, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000230, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_BooleanAND_ReturnValue) == 0x000231, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_ToggleStoryModeFilter_ReturnValue) == 0x000232, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_ToggleStoryModeFilter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, Temp_int_Loop_Counter_Variable) == 0x000234, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_Add_IntInt_ReturnValue) == 0x000238, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000240, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_MakeLiteralName_ReturnValue) == 0x000248, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_BooleanAND_ReturnValue_1) == 0x000254, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetHeistCollections_ReturnValue) == 0x000258, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetHeistCollections_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_Array_Get_Item) == 0x000268, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_Array_Length_ReturnValue) == 0x000298, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_ComponentBoundEvent_NewIndex) == 0x00029C, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_Less_IntInt_ReturnValue) == 0x0002A0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_Array_Add_ReturnValue) == 0x0002A4, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_Event_ActiveHeistCollection) == 0x0002A8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_Event_ActiveHeistCollection' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetUIManager_ReturnValue_2) == 0x0002D8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002E0, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_CustomEvent_ClosingActionName) == 0x0002F4, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_CustomEvent_ClosingActionName' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x000300, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000330, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeStruct_SBZButtonControlReference_4) == 0x000338, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeStruct_SBZButtonControlReference_4' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeArray_Array_1) == 0x000368, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_GetUIManager_ReturnValue_3) == 0x000378, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeStruct_SBZButtonControlsReference_1) == 0x000380, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeStruct_SBZButtonControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_PopStack_ReturnValue_1) == 0x0003A8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_PopStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, K2Node_MakeStruct_SBZUIPopupData) == 0x0003B8, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::K2Node_MakeStruct_SBZUIPopupData' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_IsSoloGameEnabled_ReturnValue) == 0x000418, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_IsSoloGameEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_Get_ReturnValue) == 0x000420, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_Get_ReturnValue_1) == 0x000428, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_IsPopupShown_ReturnValue) == 0x000430, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_IsPopupShown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_Not_PreBool_ReturnValue) == 0x000431, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_BooleanAND_ReturnValue_2) == 0x000432, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection, CallFunc_BooleanAND_ReturnValue_3) == 0x000433, "Member 'WBP_SM_CrimeNetHeistSelection_C_ExecuteUbergraph_WBP_SM_CrimeNetHeistSelection::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.OnSoloModePopupClosed
// 0x000C (0x000C - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_OnSoloModePopupClosed final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_OnSoloModePopupClosed) == 0x000004, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_OnSoloModePopupClosed");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_OnSoloModePopupClosed) == 0x00000C, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_OnSoloModePopupClosed");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_OnSoloModePopupClosed, ClosingActionName) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_OnSoloModePopupClosed::ClosingActionName' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.BndEvt__WBP_SM_CrimeNetHeistSelection_WBP_Local_Navbar_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_WBP_Local_Navbar_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_WBP_Local_Navbar_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_WBP_Local_Navbar_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_WBP_Local_Navbar_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_WBP_Local_Navbar_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_WBP_Local_Navbar_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_WBP_Local_Navbar_K2Node_ComponentBoundEvent_4_OnIndexChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.BndEvt__WBP_SM_CrimeNetHeistSelection_Button_CancelMatchmaking_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Button_CancelMatchmaking_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Button_CancelMatchmaking_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Button_CancelMatchmaking_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Button_CancelMatchmaking_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Button_CancelMatchmaking_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Button_CancelMatchmaking_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Button_CancelMatchmaking_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_OnControlsReferenceClicked final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_OnControlsReferenceClicked, ActionName) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_OnControlsReferenceClicked::ActionName' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_2_SBZOnSelectorOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_2_SBZOnSelectorOptionChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_2_SBZOnSelectorOptionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_2_SBZOnSelectorOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_2_SBZOnSelectorOptionChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_2_SBZOnSelectorOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_2_SBZOnSelectorOptionChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_2_SBZOnSelectorOptionChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_BndEvt__WBP_SM_CrimeNetHeistSelection_Widget_DifficultySelection_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_OnGainedStackFocused");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_OnGainedStackFocused");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.OnHeistButtonSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonSelected final
{
public:
	class USBZMainMenuCrimeNetHeistButton*        SelectedButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonSelected) == 0x000008, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonSelected");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonSelected) == 0x000008, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonSelected");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonSelected, SelectedButton) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonSelected::SelectedButton' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.OnHeistButtonFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonFocused final
{
public:
	class USBZMenuButton*                         MenuButton;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonFocused) == 0x000008, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonFocused");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonFocused) == 0x000010, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonFocused");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonFocused, MenuButton) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonFocused::MenuButton' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonFocused, bIsFocused) == 0x000008, "Member 'WBP_SM_CrimeNetHeistSelection_C_OnHeistButtonFocused::bIsFocused' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.OnHeistCollectionChanged
// 0x0030 (0x0030 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_OnHeistCollectionChanged final
{
public:
	struct FSBZHeistCollectionWithOwnership       ActiveHeistCollection;                             // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_OnHeistCollectionChanged) == 0x000008, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_OnHeistCollectionChanged");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_OnHeistCollectionChanged) == 0x000030, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_OnHeistCollectionChanged");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_OnHeistCollectionChanged, ActiveHeistCollection) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_OnHeistCollectionChanged::ActiveHeistCollection' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.TryDisplayPopUp
// 0x0002 (0x0002 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_TryDisplayPopUp final
{
public:
	bool                                          bInPopUp;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_SM_CrimeNetHeistSelection_C_TryDisplayPopUp) == 0x000001, "Wrong alignment on WBP_SM_CrimeNetHeistSelection_C_TryDisplayPopUp");
static_assert(sizeof(WBP_SM_CrimeNetHeistSelection_C_TryDisplayPopUp) == 0x000002, "Wrong size on WBP_SM_CrimeNetHeistSelection_C_TryDisplayPopUp");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_TryDisplayPopUp, bInPopUp) == 0x000000, "Member 'WBP_SM_CrimeNetHeistSelection_C_TryDisplayPopUp::bInPopUp' has a wrong offset!");
static_assert(offsetof(WBP_SM_CrimeNetHeistSelection_C_TryDisplayPopUp, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WBP_SM_CrimeNetHeistSelection_C_TryDisplayPopUp::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

// Function WBP_SM_CrimeNetHeistSelection.WBP_SM_CrimeNetHeistSelection_C.RefreshVisuals
// 0x0020 (0x0020 - 0x0000)
struct WBP_SM_CrimeNetHeistSelection_C_RefreshVisuals final
{
public:
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameUserSettings*                   CallFunc_GetSBZGameUserSettings_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZDifficulty                                CallFunc_GetMatchmakingDifficulty_ReturnValue;     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
