#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_Blackbackground

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_Blackbackground.WBP_UI_MainMenu_Blackbackground_C
// 0x0020 (0x02B0 - 0x0290)
class UWBP_UI_MainMenu_Blackbackground_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LoadingAnimation;                                  // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_Loading;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_Blackbackground(int32 EntryPoint);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_Blackbackground_C">();
	}
	static class UWBP_UI_MainMenu_Blackbackground_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_Blackbackground_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_Blackbackground_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_Blackbackground_C");
static_assert(sizeof(UWBP_UI_MainMenu_Blackbackground_C) == 0x0002B0, "Wrong size on UWBP_UI_MainMenu_Blackbackground_C");
static_assert(offsetof(UWBP_UI_MainMenu_Blackbackground_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_MainMenu_Blackbackground_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_Blackbackground_C, LoadingAnimation) == 0x000298, "Member 'UWBP_UI_MainMenu_Blackbackground_C::LoadingAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_Blackbackground_C, Image_Background) == 0x0002A0, "Member 'UWBP_UI_MainMenu_Blackbackground_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_Blackbackground_C, ProgressBar_Loading) == 0x0002A8, "Member 'UWBP_UI_MainMenu_Blackbackground_C::ProgressBar_Loading' has a wrong offset!");

}

