#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_LoadoutWeaponCustomization

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_LoadoutWeaponCustomization.WBP_MainMenu_LoadoutWeaponCustomization_C.ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization
// 0x0390 (0x0390 - 0x0000)
struct WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USBZMenuButton* Button)> K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0044(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZStandaloneWeaponDisplay*            CallFunc_GetActorOfClass_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x005C(0x0014)(ZeroConstructor, NoDestructor)
	ESBZInventoryEquipmentType                    Temp_byte_Variable;                                // 0x0070(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_CustomEvent_Button_2;                       // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_CustomEvent_Button_1;                       // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZWeaponCustomiaztionSlotButton_C*    K2Node_DynamicCast_AsSBZWeapon_Customiaztion_Slot_Button; // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZWeaponCustomiaztionPartButton_C*    K2Node_DynamicCast_AsSBZWeapon_Customiaztion_Part_Button; // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZWeaponPartSlot*               K2Node_DynamicCast_AsSBZWeapon_Part_Slot;          // 0x00A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZEquippablePartDataAsset*      K2Node_DynamicCast_AsSBZEquippable_Part_Data_Asset; // 0x00B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZInventoryEquipmentType                    Temp_byte_Variable_1;                              // 0x00C1(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZEquippableLoadoutSlot                     Temp_byte_Variable_2;                              // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZWeaponCustomizationSubScreen              K2Node_CustomEvent_Screen;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_CustomEvent_Button;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZWeaponCustomiaztionSlotButton_C*    K2Node_DynamicCast_AsSBZWeapon_Customiaztion_Slot_Button_1; // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZCosmeticsPartSlot*            K2Node_DynamicCast_AsSBZCosmetics_Part_Slot;       // 0x00F8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USBZModularPartSlotBase*>        CallFunc_Map_Keys_Keys;                            // 0x0128(0x0010)(ReferenceParm)
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZModularPartSlotBase*          CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSBZEquippablePartConfigGroup          CallFunc_Map_Find_Value;                           // 0x0158(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x01A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x01C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x01D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_1;    // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZEquippableLoadoutSlot                     CallFunc_GetCurrentWeaponSlotData_OutEquippableSlot; // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCurrentWeaponSlotData_OutWeaponSlotIndex; // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget;          // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisplayWeaponModiferScreen_ReturnValue;   // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_223[0x5];                                      // 0x0223(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0238(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_1;              // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_1;        // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisplayWeaponProgressionScreen_ReturnValue; // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26A[0x2];                                      // 0x026A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZModularPartSlotBase*          CallFunc_Array_Get_Item_2;                         // 0x0278(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseWeaponData*                     K2Node_DynamicCast_AsSBZBase_Weapon_Data;          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNbStickerPlacements_ReturnValue;       // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USBZMenuButton* Button)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x02A4(0x0014)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        K2Node_MakeArray_Array;                            // 0x02C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_3;                 // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZWeaponCustomiaztionSlotButton_C*    CallFunc_CreateSlotButton_Button;                  // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x02E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item_3;                         // 0x02F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x02FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FD[0x3];                                      // 0x02FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0324(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0330(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_331[0x3];                                      // 0x0331(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue_1;   // 0x0338(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu;       // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZInventoryEquipmentType                    K2Node_Select_Default_1;                           // 0x0351(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x6];                                      // 0x0352(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1;     // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_2;              // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_2;        // 0x0380(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CustomizeWeaponInSlotTemp_ReturnValue;    // 0x0389(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization) == 0x000008, "Wrong alignment on WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization");
static_assert(sizeof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization) == 0x000390, "Wrong size on WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_int_Array_Index_Variable_1) == 0x000014, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_int_Loop_Counter_Variable_2) == 0x000030, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Add_IntInt_ReturnValue_1) == 0x000034, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Add_IntInt_ReturnValue_2) == 0x000038, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_int_Array_Index_Variable_2) == 0x00003C, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_int_Array_Index_Variable_3) == 0x000040, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_Event_PreviousValue) == 0x000044, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetActorOfClass_ReturnValue) == 0x000050, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_CreateDelegate_OutputDelegate_1) == 0x00005C, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_byte_Variable) == 0x000070, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_CustomEvent_Button_2) == 0x000078, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_CustomEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_CustomEvent_Button_1) == 0x000080, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_CustomEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_AsSBZWeapon_Customiaztion_Slot_Button) == 0x000088, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_AsSBZWeapon_Customiaztion_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_bSuccess) == 0x000090, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_AsSBZWeapon_Customiaztion_Part_Button) == 0x000098, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_AsSBZWeapon_Customiaztion_Part_Button' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_bSuccess_1) == 0x0000A0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_AsSBZWeapon_Part_Slot) == 0x0000A8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_AsSBZWeapon_Part_Slot' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_bSuccess_2) == 0x0000B0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_IsValid_ReturnValue_1) == 0x0000B1, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_AsSBZEquippable_Part_Data_Asset) == 0x0000B8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_AsSBZEquippable_Part_Data_Asset' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_bSuccess_3) == 0x0000C0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_byte_Variable_1) == 0x0000C1, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_byte_Variable_2) == 0x0000C2, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetChildAt_ReturnValue) == 0x0000C8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetChildAt_ReturnValue_1) == 0x0000D0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_CustomEvent_Screen) == 0x0000D8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_CustomEvent_Screen' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_SwitchEnum_CmpSuccess) == 0x0000D9, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_Event_IsDesignTime) == 0x0000DA, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetVisibility_ReturnValue) == 0x0000DB, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000DC, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_CustomEvent_Button) == 0x0000E0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_AsSBZWeapon_Customiaztion_Slot_Button_1) == 0x0000E8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_AsSBZWeapon_Customiaztion_Slot_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_bSuccess_4) == 0x0000F0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_AsSBZCosmetics_Part_Slot) == 0x0000F8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_AsSBZCosmetics_Part_Slot' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_bSuccess_5) == 0x000100, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Array_Get_Item) == 0x000108, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Array_Length_ReturnValue) == 0x000110, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_ComponentBoundEvent_Button) == 0x000118, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_SwitchEnum_CmpSuccess_2) == 0x000120, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Map_Keys_Keys) == 0x000128, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetCustomizationManager_ReturnValue) == 0x000138, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetDisplayName_ReturnValue) == 0x000148, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Map_Find_Value) == 0x000158, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Map_Find_ReturnValue) == 0x000168, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Concat_StrStr_ReturnValue) == 0x000170, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000180, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetDisplayName_ReturnValue_1) == 0x000190, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_IsValid_ReturnValue_2) == 0x0001A0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetDisplayName_ReturnValue_2) == 0x0001A8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Array_Length_ReturnValue_1) == 0x0001B8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0001C0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Less_IntInt_ReturnValue) == 0x0001D0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0001D8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0001E8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetCustomizationManager_ReturnValue_1) == 0x0001F8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetCustomizationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetUIManager_ReturnValue) == 0x000200, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetMenuWidget_ReturnValue) == 0x000208, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetCurrentWeaponSlotData_OutEquippableSlot) == 0x000210, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetCurrentWeaponSlotData_OutEquippableSlot' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetCurrentWeaponSlotData_OutWeaponSlotIndex) == 0x000214, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetCurrentWeaponSlotData_OutWeaponSlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_AsSBZMain_Menu_Widget) == 0x000218, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_AsSBZMain_Menu_Widget' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_bSuccess_6) == 0x000220, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, Temp_bool_Variable) == 0x000221, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_DisplayWeaponModiferScreen_ReturnValue) == 0x000222, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_DisplayWeaponModiferScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_Select_Default) == 0x000228, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_CreateDelegate_OutputDelegate_2) == 0x000238, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetUIManager_ReturnValue_1) == 0x000250, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetMenuWidget_ReturnValue_1) == 0x000258, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetMenuWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_AsSBZMain_Menu_Widget_1) == 0x000260, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_AsSBZMain_Menu_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_bSuccess_7) == 0x000268, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_DisplayWeaponProgressionScreen_ReturnValue) == 0x000269, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_DisplayWeaponProgressionScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_ComponentBoundEvent_NewIndex) == 0x00026C, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_SwitchInteger_CmpSuccess) == 0x000270, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Array_Get_Item_2) == 0x000278, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Array_Length_ReturnValue_2) == 0x000280, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Less_IntInt_ReturnValue_1) == 0x000284, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_AsSBZBase_Weapon_Data) == 0x000288, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_AsSBZBase_Weapon_Data' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_DynamicCast_bSuccess_8) == 0x000290, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetNbStickerPlacements_ReturnValue) == 0x000294, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetNbStickerPlacements_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Subtract_IntInt_ReturnValue) == 0x000298, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Add_IntInt_ReturnValue_3) == 0x00029C, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0002A0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_CreateDelegate_OutputDelegate_3) == 0x0002A4, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetChildAt_ReturnValue_2) == 0x0002B8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, K2Node_MakeArray_Array) == 0x0002C0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetChildAt_ReturnValue_3) == 0x0002D0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetChildAt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_CreateSlotButton_Button) == 0x0002D8, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_CreateSlotButton_Button' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_GetAllChildren_ReturnValue) == 0x0002E0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization, CallFunc_Array_Get_Item_3) == 0x0002F0, "Member 'WBP_MainMenu_LoadoutWeaponCustomization_C_ExecuteUbergraph_WBP_MainMenu_LoadoutWeaponCustomization::CallFunc_Array_Get_Item_3' has a wrong offset!");
