#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ControlsReference

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_ControlsReference.WBP_UI_ControlsReference_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_UI_ControlsReference_C final : public USBZControlsReferenceWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_ControlsReference(int32 EntryPoint);
	void OnInitialized();
	void DisplayControlsReference(const struct FSBZControlsReference& InControlsReference);
	void HideControlsReference();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_ControlsReference_C">();
	}
	static class UWBP_UI_ControlsReference_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_ControlsReference_C>();
	}
};
static_assert(alignof(UWBP_UI_ControlsReference_C) == 0x000008, "Wrong alignment on UWBP_UI_ControlsReference_C");
static_assert(sizeof(UWBP_UI_ControlsReference_C) == 0x0002E0, "Wrong size on UWBP_UI_ControlsReference_C");
static_assert(offsetof(UWBP_UI_ControlsReference_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UI_ControlsReference_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ControlsReference_C, FadeOut) == 0x0002C8, "Member 'UWBP_UI_ControlsReference_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ControlsReference_C, FadeIn) == 0x0002D0, "Member 'UWBP_UI_ControlsReference_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ControlsReference_C, Image_Background) == 0x0002D8, "Member 'UWBP_UI_ControlsReference_C::Image_Background' has a wrong offset!");

}

