#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_CircularIcon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_CircularIcon.WBP_UI_Widget_CircularIcon_C.ExecuteUbergraph_WBP_UI_Widget_CircularIcon
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_CircularIcon_C_ExecuteUbergraph_WBP_UI_Widget_CircularIcon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_CircularIcon_C_ExecuteUbergraph_WBP_UI_Widget_CircularIcon) == 0x000004, "Wrong alignment on WBP_UI_Widget_CircularIcon_C_ExecuteUbergraph_WBP_UI_Widget_CircularIcon");
static_assert(sizeof(WBP_UI_Widget_CircularIcon_C_ExecuteUbergraph_WBP_UI_Widget_CircularIcon) == 0x000008, "Wrong size on WBP_UI_Widget_CircularIcon_C_ExecuteUbergraph_WBP_UI_Widget_CircularIcon");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_ExecuteUbergraph_WBP_UI_Widget_CircularIcon, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_CircularIcon_C_ExecuteUbergraph_WBP_UI_Widget_CircularIcon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_ExecuteUbergraph_WBP_UI_Widget_CircularIcon, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_Widget_CircularIcon_C_ExecuteUbergraph_WBP_UI_Widget_CircularIcon::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_CircularIcon.WBP_UI_Widget_CircularIcon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_CircularIcon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_CircularIcon_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_CircularIcon_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_CircularIcon_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_CircularIcon_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_CircularIcon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_CircularIcon.WBP_UI_Widget_CircularIcon_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Widget_CircularIcon_C_SetText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_UI_Widget_CircularIcon_C_SetText) == 0x000008, "Wrong alignment on WBP_UI_Widget_CircularIcon_C_SetText");
static_assert(sizeof(WBP_UI_Widget_CircularIcon_C_SetText) == 0x000018, "Wrong size on WBP_UI_Widget_CircularIcon_C_SetText");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_SetText, InText) == 0x000000, "Member 'WBP_UI_Widget_CircularIcon_C_SetText::InText' has a wrong offset!");

// Function WBP_UI_Widget_CircularIcon.WBP_UI_Widget_CircularIcon_C.SetSelected
// 0x0058 (0x0058 - 0x0000)
struct WBP_UI_Widget_CircularIcon_C_SetSelected final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0030(0x0028)()
};
static_assert(alignof(WBP_UI_Widget_CircularIcon_C_SetSelected) == 0x000008, "Wrong alignment on WBP_UI_Widget_CircularIcon_C_SetSelected");
static_assert(sizeof(WBP_UI_Widget_CircularIcon_C_SetSelected) == 0x000058, "Wrong size on WBP_UI_Widget_CircularIcon_C_SetSelected");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_SetSelected, bIsSelected) == 0x000000, "Member 'WBP_UI_Widget_CircularIcon_C_SetSelected::bIsSelected' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_SetSelected, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'WBP_UI_Widget_CircularIcon_C_SetSelected::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_SetSelected, K2Node_MakeStruct_SlateColor_1) == 0x000030, "Member 'WBP_UI_Widget_CircularIcon_C_SetSelected::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function WBP_UI_Widget_CircularIcon.WBP_UI_Widget_CircularIcon_C.SetIcon
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Widget_CircularIcon_C_SetIcon final
{
public:
	class UPaperSprite*                           InIcon;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(WBP_UI_Widget_CircularIcon_C_SetIcon) == 0x000008, "Wrong alignment on WBP_UI_Widget_CircularIcon_C_SetIcon");
static_assert(sizeof(WBP_UI_Widget_CircularIcon_C_SetIcon) == 0x000020, "Wrong size on WBP_UI_Widget_CircularIcon_C_SetIcon");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_SetIcon, InIcon) == 0x000000, "Member 'WBP_UI_Widget_CircularIcon_C_SetIcon::InIcon' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_SetIcon, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_CircularIcon_C_SetIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CircularIcon_C_SetIcon, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000010, "Member 'WBP_UI_Widget_CircularIcon_C_SetIcon::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");

}

