#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Inventory_Item_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Inventory_Item_Button.WBP_Inventory_Item_Button_C
// 0x0028 (0x0388 - 0x0360)
class UWBP_Inventory_Item_Button_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Amount;                                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ItemIcon;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ItemName;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Selected;                                  // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Inventory_Item_Button(int32 EntryPoint);
	void SetupData(const class USBZEquippablePartDataAsset* NewParam);
	void ButtonFocusedChanged(bool bInHasFocus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Inventory_Item_Button_C">();
	}
	static class UWBP_Inventory_Item_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Inventory_Item_Button_C>();
	}
};
static_assert(alignof(UWBP_Inventory_Item_Button_C) == 0x000008, "Wrong alignment on UWBP_Inventory_Item_Button_C");
static_assert(sizeof(UWBP_Inventory_Item_Button_C) == 0x000388, "Wrong size on UWBP_Inventory_Item_Button_C");
static_assert(offsetof(UWBP_Inventory_Item_Button_C, UberGraphFrame) == 0x000360, "Member 'UWBP_Inventory_Item_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Button_C, Amount) == 0x000368, "Member 'UWBP_Inventory_Item_Button_C::Amount' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Button_C, ItemIcon) == 0x000370, "Member 'UWBP_Inventory_Item_Button_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Button_C, ItemName) == 0x000378, "Member 'UWBP_Inventory_Item_Button_C::ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_Inventory_Item_Button_C, Overlay_Selected) == 0x000380, "Member 'UWBP_Inventory_Item_Button_C::Overlay_Selected' has a wrong offset!");

}

