#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_CharacterPreferenceScreen

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Inventory_CharacterPreferenceScreen.WBP_UI_Inventory_CharacterPreferenceScreen_C.ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen
// 0x0308 (0x0308 - 0x0000)
struct WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0048(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0078(0x0030)()
	class FName                                   K2Node_CustomEvent_InActionInput;                  // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x00B8(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x00D0(0x0028)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F8(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x010C(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x0120(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x0150(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_4;     // 0x0180(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_5;     // 0x01B0(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x01E0(0x0010)(ReferenceParm)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_6;     // 0x01F0(0x0030)()
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x0220(0x0028)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_7;     // 0x0248(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_2;                          // 0x0278(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_2;    // 0x0288(0x0028)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCharacterPreferenceButtonSelectionAction  K2Node_Event_SelectionAction;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x02BC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x02CC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetActuallyVisible_ReturnValue;      // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen) == 0x000008, "Wrong alignment on WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen");
static_assert(sizeof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen) == 0x000308, "Wrong size on WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, CallFunc_GetChildAt_ReturnValue) == 0x000040, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlReference) == 0x000048, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000078, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_CustomEvent_InActionInput) == 0x0000A8, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_CustomEvent_InActionInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeArray_Array) == 0x0000B8, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_SwitchName_CmpSuccess) == 0x0000C8, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlsReference) == 0x0000D0, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F8, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x00010C, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x000120, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x000150, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlReference_4) == 0x000180, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlReference_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlReference_5) == 0x0001B0, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlReference_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeArray_Array_1) == 0x0001E0, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlReference_6) == 0x0001F0, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlReference_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlsReference_1) == 0x000220, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlReference_7) == 0x000248, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlReference_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeArray_Array_2) == 0x000278, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_MakeStruct_SBZButtonControlsReference_2) == 0x000288, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_MakeStruct_SBZButtonControlsReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, CallFunc_GetUIManager_ReturnValue) == 0x0002B0, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_Event_SelectionAction) == 0x0002B8, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_Event_SelectionAction' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, CallFunc_PopStack_ReturnValue) == 0x0002BC, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_SwitchEnum_CmpSuccess) == 0x0002C8, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, K2Node_Event_PreviousValue) == 0x0002CC, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, CallFunc_IsValid_ReturnValue) == 0x0002D8, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x0002E0, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x0002E8, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x0002F8, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen, CallFunc_IsWidgetActuallyVisible_ReturnValue) == 0x000300, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_ExecuteUbergraph_WBP_UI_Inventory_CharacterPreferenceScreen::CallFunc_IsWidgetActuallyVisible_ReturnValue' has a wrong offset!");

// Function WBP_UI_Inventory_CharacterPreferenceScreen.WBP_UI_Inventory_CharacterPreferenceScreen_C.UpdateCharacterSlotButtonControlsReference
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Inventory_CharacterPreferenceScreen_C_UpdateCharacterSlotButtonControlsReference final
{
public:
	ESBZCharacterPreferenceButtonSelectionAction  SelectionAction;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_CharacterPreferenceScreen_C_UpdateCharacterSlotButtonControlsReference) == 0x000001, "Wrong alignment on WBP_UI_Inventory_CharacterPreferenceScreen_C_UpdateCharacterSlotButtonControlsReference");
static_assert(sizeof(WBP_UI_Inventory_CharacterPreferenceScreen_C_UpdateCharacterSlotButtonControlsReference) == 0x000001, "Wrong size on WBP_UI_Inventory_CharacterPreferenceScreen_C_UpdateCharacterSlotButtonControlsReference");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_UpdateCharacterSlotButtonControlsReference, SelectionAction) == 0x000000, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_UpdateCharacterSlotButtonControlsReference::SelectionAction' has a wrong offset!");

// Function WBP_UI_Inventory_CharacterPreferenceScreen.WBP_UI_Inventory_CharacterPreferenceScreen_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Inventory_CharacterPreferenceScreen_C_OnControlsReferenceClicked final
{
public:
	class FName                                   InActionInput;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_CharacterPreferenceScreen_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_Inventory_CharacterPreferenceScreen_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_Inventory_CharacterPreferenceScreen_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_Inventory_CharacterPreferenceScreen_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_OnControlsReferenceClicked, InActionInput) == 0x000000, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_OnControlsReferenceClicked::InActionInput' has a wrong offset!");

// Function WBP_UI_Inventory_CharacterPreferenceScreen.WBP_UI_Inventory_CharacterPreferenceScreen_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Inventory_CharacterPreferenceScreen_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_CharacterPreferenceScreen_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_Inventory_CharacterPreferenceScreen_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_Inventory_CharacterPreferenceScreen_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_Inventory_CharacterPreferenceScreen_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_Inventory_CharacterPreferenceScreen_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_Inventory_CharacterPreferenceScreen_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

}

