#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WeaponCustomization_WeaponCosmetics

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_WeaponCustomization_WeaponCosmetics.WBP_WeaponCustomization_WeaponCosmetics_C.ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics
// 0x02A0 (0x02A0 - 0x0000)
struct WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuCosmeticItemButton*         K2Node_CustomEvent_CosmeticButton;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZCosmeticsDataAsset*           CallFunc_GetCosmeticItemData_ReturnValue;          // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZCosmeticsPartSlot*            K2Node_CustomEvent_CosmeticSlot;                   // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZCosmeticsInventoryItem>     CallFunc_GetCosmeticItems_ReturnValue;             // 0x0030(0x0010)(ReferenceParm)
	struct FSBZCosmeticPanelInitParams            K2Node_MakeStruct_SBZCosmeticPanelInitParams;      // 0x0040(0x0030)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class USBZMainMenuCosmeticItemButton* CosmeticButton)> K2Node_CreateDelegate_OutputDelegate; // 0x0074(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZStandaloneWeaponDisplay*            CallFunc_GetActorOfClass_ReturnValue;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZEquippablePartConfig*               CallFunc_GetCosmeticConfig_ReturnValue;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZCosmeticsDataAsset*           CallFunc_GetCosmeticPart_ReturnValue;              // 0x00B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00C0(0x0018)(ConstParm)
	const class USBZCosmeticsPartSlot*            CallFunc_GetCosmeticSlot_ReturnValue;              // 0x00D8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZCosmeticsPartSlot*            CallFunc_GetCosmeticSlot_ReturnValue_1;            // 0x00E0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZEquippablePartConfigGroup          CallFunc_Map_Find_Value;                           // 0x00E8(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZCosmeticsPartSlot*            CallFunc_GetCosmeticSlot_ReturnValue_2;            // 0x0100(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZCosmeticsPartSlot*            CallFunc_GetCosmeticSlot_ReturnValue_3;            // 0x0108(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZModularPartApplier*                 CallFunc_GetApplierInstance_ReturnValue;           // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZCosmeticsPartSlot*            CallFunc_GetCosmeticSlot_ReturnValue_4;            // 0x0128(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZEquippablePartConfigGroup          CallFunc_Map_Find_Value_1;                         // 0x0130(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZCosmeticsPartSlot*            CallFunc_GetCosmeticSlot_ReturnValue_5;            // 0x0148(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZModularPartApplier*                 CallFunc_GetApplierInstance_ReturnValue_1;         // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<TSubclassOf<class USBZModularPartDataAsset>> CallFunc_GetExpectedParts_ReturnValue;       // 0x0158(0x0010)(ReferenceParm)
	class USBZWeaponPatternDataConfig*            K2Node_DynamicCast_AsSBZWeapon_Pattern_Data_Config; // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZSprayCanData*                 CallFunc_Array_Get_Item;                           // 0x0178(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZSprayCanData*                 CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZCosmeticsDataAsset*           CallFunc_GetCosmeticPart_ReturnValue_1;            // 0x0188(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZEquippablePartConfig*               CallFunc_GetCosmeticConfig_ReturnValue_1;          // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZWeaponPatternDataConfig*            K2Node_DynamicCast_AsSBZWeapon_Pattern_Data_Config_1; // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZSprayCanData*                 CallFunc_Array_Get_Item_2;                         // 0x01A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZSprayCanData*                 CallFunc_Array_Get_Item_3;                         // 0x01B0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x01BD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BE[0x2];                                      // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZEquippablePartConfig*               K2Node_Select_Default;                             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZEquippablePartDataAsset*      K2Node_Select_Default_1;                           // 0x01C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_Array_Get_Item_4;                         // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0208(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZCosmeticsDataAsset*           CallFunc_GetCosmeticPart_ReturnValue_2;            // 0x0228(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class USBZModularPartDataAsset>> CallFunc_GetExpectedParts_ReturnValue_1;     // 0x0238(0x0010)(ReferenceParm)
	class UClass*                                 CallFunc_Array_Get_Item_5;                         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x0250(0x0018)(ConstParm)
	const class USBZCosmeticsPartSlot*            CallFunc_GetSlotFromDataClass_SlotAsset;           // 0x0268(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NeedConfig_ReturnValue;                   // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27A[0x2];                                      // 0x027A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x027C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NeedConfig_ReturnValue_1;                 // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NeedConfig_ReturnValue_2;                 // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0282(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_283[0x1];                                      // 0x0283(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZMetaRequestResult                         K2Node_Event_Result;                               // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics) == 0x000008, "Wrong alignment on WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics");
static_assert(sizeof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics) == 0x0002A0, "Wrong size on WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, EntryPoint) == 0x000000, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_IsVisible_ReturnValue) == 0x000004, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_ComponentBoundEvent_NewIndex) == 0x000008, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Subtract_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_CustomEvent_CosmeticButton) == 0x000018, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_CustomEvent_CosmeticButton' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticItemData_ReturnValue) == 0x000020, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_CustomEvent_CosmeticSlot) == 0x000028, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_CustomEvent_CosmeticSlot' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticItems_ReturnValue) == 0x000030, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticItems_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_MakeStruct_SBZCosmeticPanelInitParams) == 0x000040, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_MakeStruct_SBZCosmeticPanelInitParams' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_CreateDelegate_OutputDelegate) == 0x000074, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000088, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_ComponentBoundEvent_Button) == 0x000090, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetActorOfClass_ReturnValue) == 0x000098, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticConfig_ReturnValue) == 0x0000A0, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_IsValid_ReturnValue) == 0x0000A8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticPart_ReturnValue) == 0x0000B0, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticPart_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_IsValid_ReturnValue_2) == 0x0000B9, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, Temp_text_Variable) == 0x0000C0, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticSlot_ReturnValue) == 0x0000D8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticSlot_ReturnValue_1) == 0x0000E0, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Map_Find_Value) == 0x0000E8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Map_Find_ReturnValue) == 0x0000F8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticSlot_ReturnValue_2) == 0x000100, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticSlot_ReturnValue_3) == 0x000108, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_IsValid_ReturnValue_3) == 0x000110, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetApplierInstance_ReturnValue) == 0x000118, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetApplierInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_IsValid_ReturnValue_4) == 0x000120, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticSlot_ReturnValue_4) == 0x000128, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticSlot_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Map_Find_Value_1) == 0x000130, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Map_Find_ReturnValue_1) == 0x000140, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticSlot_ReturnValue_5) == 0x000148, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticSlot_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetApplierInstance_ReturnValue_1) == 0x000150, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetApplierInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetExpectedParts_ReturnValue) == 0x000158, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetExpectedParts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_DynamicCast_AsSBZWeapon_Pattern_Data_Config) == 0x000168, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_DynamicCast_AsSBZWeapon_Pattern_Data_Config' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Length_ReturnValue) == 0x000174, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Get_Item) == 0x000178, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticPart_ReturnValue_1) == 0x000188, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticPart_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticConfig_ReturnValue_1) == 0x000190, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticConfig_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_DynamicCast_AsSBZWeapon_Pattern_Data_Config_1) == 0x000198, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_DynamicCast_AsSBZWeapon_Pattern_Data_Config_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_DynamicCast_bSuccess_1) == 0x0001A0, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Get_Item_2) == 0x0001A8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Get_Item_3) == 0x0001B0, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Add_ReturnValue) == 0x0001B8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, Temp_bool_Variable) == 0x0001BC, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, Temp_bool_Variable_1) == 0x0001BD, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_Select_Default) == 0x0001C0, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_Select_Default_1) == 0x0001C8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, Temp_int_Array_Index_Variable) == 0x0001D0, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Get_Item_4) == 0x0001D8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Add_IntInt_ReturnValue) == 0x0001E0, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x0001E4, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Conv_IntToString_ReturnValue) == 0x0001E8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Concat_StrStr_ReturnValue) == 0x0001F8, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Conv_StringToText_ReturnValue) == 0x000208, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Add_ReturnValue_1) == 0x000220, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetCosmeticPart_ReturnValue_2) == 0x000228, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetCosmeticPart_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_IsValid_ReturnValue_5) == 0x000230, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetExpectedParts_ReturnValue_1) == 0x000238, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetExpectedParts_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Get_Item_5) == 0x000248, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, Temp_text_Variable_1) == 0x000250, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetSlotFromDataClass_SlotAsset) == 0x000268, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetSlotFromDataClass_SlotAsset' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Array_Add_ReturnValue_2) == 0x000270, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, Temp_int_Loop_Counter_Variable) == 0x000274, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_NeedConfig_ReturnValue) == 0x000278, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_NeedConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Less_IntInt_ReturnValue_1) == 0x000279, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Add_IntInt_ReturnValue_1) == 0x00027C, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_NeedConfig_ReturnValue_1) == 0x000280, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_NeedConfig_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_NeedConfig_ReturnValue_2) == 0x000281, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_NeedConfig_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Less_IntInt_ReturnValue_2) == 0x000282, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000284, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, K2Node_Event_Result) == 0x000288, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000290, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_ExecuteUbergraph_WBP_WeaponCustomization_WeaponCosmetics::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");

// Function WBP_WeaponCustomization_WeaponCosmetics.WBP_WeaponCustomization_WeaponCosmetics_C.OnTryApplyDone
// 0x0001 (0x0001 - 0x0000)
struct WBP_WeaponCustomization_WeaponCosmetics_C_OnTryApplyDone final
{
public:
	ESBZMetaRequestResult                         Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCustomization_WeaponCosmetics_C_OnTryApplyDone) == 0x000001, "Wrong alignment on WBP_WeaponCustomization_WeaponCosmetics_C_OnTryApplyDone");
static_assert(sizeof(WBP_WeaponCustomization_WeaponCosmetics_C_OnTryApplyDone) == 0x000001, "Wrong size on WBP_WeaponCustomization_WeaponCosmetics_C_OnTryApplyDone");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_OnTryApplyDone, Result) == 0x000000, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_OnTryApplyDone::Result' has a wrong offset!");

// Function WBP_WeaponCustomization_WeaponCosmetics.WBP_WeaponCustomization_WeaponCosmetics_C.BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_UI_TextButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_UI_TextButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_UI_TextButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_UI_TextButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_UI_TextButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_UI_TextButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_UI_TextButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_UI_TextButton_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_WeaponCustomization_WeaponCosmetics.WBP_WeaponCustomization_WeaponCosmetics_C.SetupConfigScreen
// 0x0008 (0x0008 - 0x0000)
struct WBP_WeaponCustomization_WeaponCosmetics_C_SetupConfigScreen final
{
public:
	const class USBZCosmeticsPartSlot*            CosmeticSlot_0;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCustomization_WeaponCosmetics_C_SetupConfigScreen) == 0x000008, "Wrong alignment on WBP_WeaponCustomization_WeaponCosmetics_C_SetupConfigScreen");
static_assert(sizeof(WBP_WeaponCustomization_WeaponCosmetics_C_SetupConfigScreen) == 0x000008, "Wrong size on WBP_WeaponCustomization_WeaponCosmetics_C_SetupConfigScreen");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_SetupConfigScreen, CosmeticSlot_0) == 0x000000, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_SetupConfigScreen::CosmeticSlot_0' has a wrong offset!");

// Function WBP_WeaponCustomization_WeaponCosmetics.WBP_WeaponCustomization_WeaponCosmetics_C.OnButtonPressed
// 0x0008 (0x0008 - 0x0000)
struct WBP_WeaponCustomization_WeaponCosmetics_C_OnButtonPressed final
{
public:
	class USBZMainMenuCosmeticItemButton*         CosmeticButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCustomization_WeaponCosmetics_C_OnButtonPressed) == 0x000008, "Wrong alignment on WBP_WeaponCustomization_WeaponCosmetics_C_OnButtonPressed");
static_assert(sizeof(WBP_WeaponCustomization_WeaponCosmetics_C_OnButtonPressed) == 0x000008, "Wrong size on WBP_WeaponCustomization_WeaponCosmetics_C_OnButtonPressed");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_OnButtonPressed, CosmeticButton) == 0x000000, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_OnButtonPressed::CosmeticButton' has a wrong offset!");

// Function WBP_WeaponCustomization_WeaponCosmetics.WBP_WeaponCustomization_WeaponCosmetics_C.BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_Local_Navbar_K2Node_ComponentBoundEvent_0_OnIndexChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_Local_Navbar_K2Node_ComponentBoundEvent_0_OnIndexChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_Local_Navbar_K2Node_ComponentBoundEvent_0_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_Local_Navbar_K2Node_ComponentBoundEvent_0_OnIndexChanged__DelegateSignature");
static_assert(sizeof(WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_Local_Navbar_K2Node_ComponentBoundEvent_0_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_Local_Navbar_K2Node_ComponentBoundEvent_0_OnIndexChanged__DelegateSignature");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_Local_Navbar_K2Node_ComponentBoundEvent_0_OnIndexChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_BndEvt__WBP_WeaponCustomization_WeaponCosmetics_WBP_Local_Navbar_K2Node_ComponentBoundEvent_0_OnIndexChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function WBP_WeaponCustomization_WeaponCosmetics.WBP_WeaponCustomization_WeaponCosmetics_C.SetPreviewWidgetWithValidation
// 0x0018 (0x0018 - 0x0000)
struct WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation final
{
public:
	class UWBP_Inventory_Item_Button_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZEquippablePartDataAsset*      Data;                                              // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation) == 0x000008, "Wrong alignment on WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation");
static_assert(sizeof(WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation) == 0x000018, "Wrong size on WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation, Widget) == 0x000000, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation::Widget' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation, Data) == 0x000008, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation::Data' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_SetPreviewWidgetWithValidation::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_WeaponCustomization_WeaponCosmetics.WBP_WeaponCustomization_WeaponCosmetics_C.GetSlotFromDataClass
// 0x0018 (0x0018 - 0x0000)
struct WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass final
{
public:
	TSubclassOf<class USBZModularPartDataAsset>   SlotClass;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class USBZCosmeticsPartSlot*                  SlotAsset;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass) == 0x000008, "Wrong alignment on WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass");
static_assert(sizeof(WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass) == 0x000018, "Wrong size on WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass, SlotClass) == 0x000000, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass::SlotClass' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass, SlotAsset) == 0x000008, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass::SlotAsset' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000010, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_GetSlotFromDataClass::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");

// Function WBP_WeaponCustomization_WeaponCosmetics.WBP_WeaponCustomization_WeaponCosmetics_C.NeedConfig
// 0x0020 (0x0020 - 0x0000)
struct WBP_WeaponCustomization_WeaponCosmetics_C_NeedConfig final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZCosmeticsPartSlot*            CallFunc_GetCosmeticSlot_ReturnValue;              // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZModularPartApplier*                 CallFunc_GetApplierInstance_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NeedConfig_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_WeaponCustomization_WeaponCosmetics_C_NeedConfig) == 0x000008, "Wrong alignment on WBP_WeaponCustomization_WeaponCosmetics_C_NeedConfig");
static_assert(sizeof(WBP_WeaponCustomization_WeaponCosmetics_C_NeedConfig) == 0x000020, "Wrong size on WBP_WeaponCustomization_WeaponCosmetics_C_NeedConfig");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_NeedConfig, ReturnValue) == 0x000000, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_NeedConfig::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_WeaponCustomization_WeaponCosmetics_C_NeedConfig, CallFunc_GetCosmeticSlot_ReturnValue) == 0x000008, "Member 'WBP_WeaponCustomization_WeaponCosmetics_C_NeedConfig::CallFunc_GetCosmeticSlot_ReturnValue' has a wrong offset!");
