#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_CharacterSlotButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_CharacterSlotButton.WBP_UI_Inventory_CharacterSlotButton_C
// 0x0080 (0x0410 - 0x0390)
class UWBP_UI_Inventory_CharacterSlotButton_C final : public USBZMainMenuInventoryCharacterSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0390(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0398(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Disable_T;                                         // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Disabled_Overlay;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          InventoryBaseDataIcon;                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Locked_HB;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Name_T;                                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Preffered_O;                                       // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Preffered_T;                                       // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          HasFocus;                                          // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_401[0x3];                                      // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IconDefaultOpacity;                                // 0x0404(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconDisabledOpacity;                               // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Inventory_CharacterSlotButton(int32 EntryPoint);
	void DisabledButtonSelected();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void OnPreferredValueIndexChanged();
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnCharacterSlotInitialized();
	void OnFocusChanged(bool bIsFocused);
	void InitializeCharacterData(class USBZPlayerCharacterData* InCharacterData);
	void SetDefault();
	void OnDisabledChanged(bool InDisabled);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_CharacterSlotButton_C">();
	}
	static class UWBP_UI_Inventory_CharacterSlotButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_CharacterSlotButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_CharacterSlotButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_CharacterSlotButton_C");
static_assert(sizeof(UWBP_UI_Inventory_CharacterSlotButton_C) == 0x000410, "Wrong size on UWBP_UI_Inventory_CharacterSlotButton_C");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, UberGraphFrame) == 0x000390, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, HoverAnim) == 0x000398, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Border_Highlight) == 0x0003A0, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Disable_T) == 0x0003A8, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Disable_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Disabled_Overlay) == 0x0003B0, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Disabled_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Image) == 0x0003B8, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Image_1) == 0x0003C0, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Image_2) == 0x0003C8, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Image_511) == 0x0003D0, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, InventoryBaseDataIcon) == 0x0003D8, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::InventoryBaseDataIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Locked_HB) == 0x0003E0, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Locked_HB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Name_T) == 0x0003E8, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Name_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Preffered_O) == 0x0003F0, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Preffered_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, Preffered_T) == 0x0003F8, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::Preffered_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, HasFocus) == 0x000400, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::HasFocus' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, IconDefaultOpacity) == 0x000404, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::IconDefaultOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_CharacterSlotButton_C, IconDisabledOpacity) == 0x000408, "Member 'UWBP_UI_Inventory_CharacterSlotButton_C::IconDisabledOpacity' has a wrong offset!");

}

