#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_StoreItemButton

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton
// 0x0118 (0x0118 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZItemLockReason                            Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsTransactionInProgress;           // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTransactionInProgress_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsDisabled;                        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0070(0x0018)()
	class FText                                   Temp_text_Variable;                                // 0x0088(0x0018)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x00A8(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x00C8(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00E8(0x0018)()
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0100(0x0008)(NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue_1;       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton) == 0x000118, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, EntryPoint) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, K2Node_Event_IsDesignTime) == 0x000005, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, K2Node_Event_bInHasFocus) == 0x000006, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, K2Node_Event_bInIsTransactionInProgress) == 0x000007, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::K2Node_Event_bInIsTransactionInProgress' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_IsTransactionInProgress_ReturnValue) == 0x000008, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_IsTransactionInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, K2Node_Event_bInIsDisabled) == 0x000009, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::K2Node_Event_bInIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_IsAnimationPlaying_ReturnValue) == 0x00000A, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000018, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_SelectInt_ReturnValue) == 0x00001C, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, K2Node_MakeArray_Array) == 0x000060, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_Format_ReturnValue) == 0x000070, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, Temp_text_Variable) == 0x000088, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A0, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, Temp_text_Variable_1) == 0x0000A8, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_PlayAnimationReverse_ReturnValue) == 0x0000C0, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, Temp_text_Variable_2) == 0x0000C8, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000E0, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, K2Node_Select_Default) == 0x0000E8, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, K2Node_Event_InFocusEvent) == 0x000100, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::K2Node_Event_InFocusEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_PlayAnimationReverse_ReturnValue_1) == 0x000108, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_PlayAnimationReverse_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000110, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.OnFocusLost
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_OnFocusLost final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusLost) == 0x000004, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_OnFocusLost");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusLost) == 0x000008, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_OnFocusLost");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusLost, InFocusEvent) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusLost::InFocusEvent' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.ButtonDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_ButtonDisabledChanged final
{
public:
	bool                                          bInIsDisabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_ButtonDisabledChanged) == 0x000001, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_ButtonDisabledChanged");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_ButtonDisabledChanged) == 0x000001, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_ButtonDisabledChanged");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ButtonDisabledChanged, bInIsDisabled) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ButtonDisabledChanged::bInIsDisabled' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.OnTransactionProgressChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_OnTransactionProgressChanged final
{
public:
	bool                                          bInIsTransactionInProgress;                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_OnTransactionProgressChanged) == 0x000001, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_OnTransactionProgressChanged");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_OnTransactionProgressChanged) == 0x000001, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_OnTransactionProgressChanged");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnTransactionProgressChanged, bInIsTransactionInProgress) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnTransactionProgressChanged::bInIsTransactionInProgress' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_PreConstruct");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_PreConstruct");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.OnFocusChanged
// 0x0068 (0x0068 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged) == 0x000068, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, bIsFocused) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, Temp_struct_Variable) == 0x000004, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, Temp_struct_Variable_1) == 0x000014, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000024, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000028, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000030, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, CallFunc_PlayAnimationForward_ReturnValue) == 0x000038, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, Temp_bool_Variable) == 0x000040, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, K2Node_Select_Default) == 0x000044, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged, CallFunc_SelectColor_ReturnValue) == 0x000054, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnFocusChanged::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.OnTransactionInProgress
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_OnTransactionInProgress final
{
public:
	bool                                          bIsTransactionInProgress;                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_OnTransactionInProgress) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_OnTransactionInProgress");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_OnTransactionInProgress) == 0x000010, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_OnTransactionInProgress");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnTransactionInProgress, bIsTransactionInProgress) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnTransactionInProgress::bIsTransactionInProgress' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnTransactionInProgress, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnTransactionInProgress::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.SetPrice
// 0x0048 (0x0048 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_SetPrice final
{
public:
	int64                                         Price;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCurrencyCode                              Currency;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DiscountedPrice;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DiscountedAmount;                                  // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DiscountedPercentage;                              // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0028(0x0018)()
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_SetPrice");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice) == 0x000048, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_SetPrice");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, Price) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::Price' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, Currency) == 0x000008, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::Currency' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, DiscountedPrice) == 0x000010, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::DiscountedPrice' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, DiscountedAmount) == 0x000018, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::DiscountedAmount' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, DiscountedPercentage) == 0x00001C, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::DiscountedPercentage' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000021, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000028, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetPrice, CallFunc_SelectInt_ReturnValue) == 0x000040, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetPrice::CallFunc_SelectInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.InitializeItemData
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData final
{
public:
	class USBZInventoryBaseData*                  InItemData;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_OutDisplayName;            // 0x0008(0x0018)()
	bool                                          CallFunc_GetDisplayName_OutHasText;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData) == 0x000028, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData, InItemData) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData::InItemData' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData, CallFunc_GetDisplayName_OutDisplayName) == 0x000008, "Member 'WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData::CallFunc_GetDisplayName_OutDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData, CallFunc_GetDisplayName_OutHasText) == 0x000020, "Member 'WBP_UI_MainMenu_StoreItemButton_C_InitializeItemData::CallFunc_GetDisplayName_OutHasText' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.OnDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_OnDisabledChanged final
{
public:
	bool                                          bInDisabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_OnDisabledChanged) == 0x000001, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_OnDisabledChanged");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_OnDisabledChanged) == 0x000001, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_OnDisabledChanged");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_OnDisabledChanged, bInDisabled) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_OnDisabledChanged::bInDisabled' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.Set New Visuals
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_Set_New_Visuals final
{
public:
	bool                                          Is_Mask_Of_The_Week;                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_Set_New_Visuals) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_Set_New_Visuals");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_Set_New_Visuals) == 0x000010, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_Set_New_Visuals");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_Set_New_Visuals, Is_Mask_Of_The_Week) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_Set_New_Visuals::Is_Mask_Of_The_Week' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_Set_New_Visuals, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UI_MainMenu_StoreItemButton_C_Set_New_Visuals::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C.SetWeaponType
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_MainMenu_StoreItemButton_C_SetWeaponType final
{
public:
	ESBZItemCategory                              InItemCategory;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_StoreItemButton_C_SetWeaponType) == 0x000001, "Wrong alignment on WBP_UI_MainMenu_StoreItemButton_C_SetWeaponType");
static_assert(sizeof(WBP_UI_MainMenu_StoreItemButton_C_SetWeaponType) == 0x000002, "Wrong size on WBP_UI_MainMenu_StoreItemButton_C_SetWeaponType");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetWeaponType, InItemCategory) == 0x000000, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetWeaponType::InItemCategory' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_StoreItemButton_C_SetWeaponType, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_UI_MainMenu_StoreItemButton_C_SetWeaponType::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

