#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Cosmetic_SummedCost

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Cosmetic_SummedCost.WBP_UI_Cosmetic_SummedCost_C.Setup
// 0x0080 (0x0080 - 0x0000)
struct WBP_UI_Cosmetic_SummedCost_C_Setup final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue;               // 0x0030(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0040(0x0028)()
	class USBZCurrencyManager*                    CallFunc_GetCurrencyManager_ReturnValue;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAfford_ReturnValue;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAfford_ReturnValue_1;                  // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanAfford_ReturnValue_2;                  // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0073(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0076(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0077(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_Int64Int64_ReturnValue;           // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_Int64Int64_ReturnValue_1;         // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_Int64Int64_ReturnValue_2;         // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Cosmetic_SummedCost_C_Setup) == 0x000008, "Wrong alignment on WBP_UI_Cosmetic_SummedCost_C_Setup");
static_assert(sizeof(WBP_UI_Cosmetic_SummedCost_C_Setup) == 0x000080, "Wrong size on WBP_UI_Cosmetic_SummedCost_C_Setup");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_bool_Variable_1) == 0x000003, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_bool_Variable_2) == 0x000006, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable_4) == 0x000007, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable_5) == 0x000008, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_bool_Variable_3) == 0x000009, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, K2Node_Select_Default) == 0x00000A, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable_6) == 0x00000B, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable_7) == 0x00000C, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_bool_Variable_4) == 0x00000D, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, K2Node_Select_Default_1) == 0x00000E, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable_8) == 0x00000F, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, Temp_byte_Variable_9) == 0x000010, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, K2Node_Select_Default_2) == 0x000011, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_GetGlobalColor_ReturnValue) == 0x000030, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_GetGlobalColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, K2Node_MakeStruct_SlateColor) == 0x000040, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_GetCurrencyManager_ReturnValue) == 0x000068, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_GetCurrencyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_CanAfford_ReturnValue) == 0x000070, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_CanAfford_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_CanAfford_ReturnValue_1) == 0x000071, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_CanAfford_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_CanAfford_ReturnValue_2) == 0x000072, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_CanAfford_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_BooleanAND_ReturnValue) == 0x000073, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, K2Node_Select_Default_3) == 0x000074, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_BooleanAND_ReturnValue_1) == 0x000075, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_BooleanAND_ReturnValue_2) == 0x000076, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_BooleanOR_ReturnValue) == 0x000077, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, K2Node_Select_Default_4) == 0x000078, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_Greater_Int64Int64_ReturnValue) == 0x000079, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_Greater_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_Greater_Int64Int64_ReturnValue_1) == 0x00007A, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_Greater_Int64Int64_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SummedCost_C_Setup, CallFunc_Greater_Int64Int64_ReturnValue_2) == 0x00007B, "Member 'WBP_UI_Cosmetic_SummedCost_C_Setup::CallFunc_Greater_Int64Int64_ReturnValue_2' has a wrong offset!");

}

