#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_CharacterDisplayPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_CharacterDisplayPanel.WBP_UI_CharacterDisplayPanel_C
// 0x0020 (0x02B8 - 0x0298)
class UWBP_UI_CharacterDisplayPanel_C final : public USBZMainMenuCharacterDisplayPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USBZUITextBlock*                        Text_CharacterBio;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_CharacterNAme;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_CharacterNationality;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_CharacterDisplayPanel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnEmptySet();
	void OnCharacterDataChanged(const class USBZPlayerCharacterData* InCharacterData);
	void InitializeCharacterData(class USBZPlayerCharacterData* InCharacterData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_CharacterDisplayPanel_C">();
	}
	static class UWBP_UI_CharacterDisplayPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_CharacterDisplayPanel_C>();
	}
};
static_assert(alignof(UWBP_UI_CharacterDisplayPanel_C) == 0x000008, "Wrong alignment on UWBP_UI_CharacterDisplayPanel_C");
static_assert(sizeof(UWBP_UI_CharacterDisplayPanel_C) == 0x0002B8, "Wrong size on UWBP_UI_CharacterDisplayPanel_C");
static_assert(offsetof(UWBP_UI_CharacterDisplayPanel_C, UberGraphFrame) == 0x000298, "Member 'UWBP_UI_CharacterDisplayPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CharacterDisplayPanel_C, Text_CharacterBio) == 0x0002A0, "Member 'UWBP_UI_CharacterDisplayPanel_C::Text_CharacterBio' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CharacterDisplayPanel_C, Text_CharacterNAme) == 0x0002A8, "Member 'UWBP_UI_CharacterDisplayPanel_C::Text_CharacterNAme' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CharacterDisplayPanel_C, Text_CharacterNationality) == 0x0002B0, "Member 'UWBP_UI_CharacterDisplayPanel_C::Text_CharacterNationality' has a wrong offset!");

}

