#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Menu_ActionInputButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Menu_ActionInputButton.WBP_UI_Menu_ActionInputButton_C
// 0x00B0 (0x0380 - 0x02D0)
class UWBP_UI_Menu_ActionInputButton_C final : public USBZActionInputWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ReferenceBorder;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x02F0(0x0018)(Edit, BlueprintVisible)
	bool                                          bIsHovered;                                        // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnButtonClicked;                                   // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           BorderHoverColor;                                  // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BorderIdleColor;                                   // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextHoverColor;                                    // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextIdleColor;                                     // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundHoverColor;                              // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundIdleColor;                               // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Menu_ActionInputButton(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void Set_Is_Hovered(bool bIsHovered_0);
	void UpdateButtonText(const class FText& InButtonText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Menu_ActionInputButton_C">();
	}
	static class UWBP_UI_Menu_ActionInputButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Menu_ActionInputButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Menu_ActionInputButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Menu_ActionInputButton_C");
static_assert(sizeof(UWBP_UI_Menu_ActionInputButton_C) == 0x000380, "Wrong size on UWBP_UI_Menu_ActionInputButton_C");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_UI_Menu_ActionInputButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, Image_Background) == 0x0002D8, "Member 'UWBP_UI_Menu_ActionInputButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, Image_ReferenceBorder) == 0x0002E0, "Member 'UWBP_UI_Menu_ActionInputButton_C::Image_ReferenceBorder' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, Text_Description) == 0x0002E8, "Member 'UWBP_UI_Menu_ActionInputButton_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, ButtonText) == 0x0002F0, "Member 'UWBP_UI_Menu_ActionInputButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, bIsHovered) == 0x000308, "Member 'UWBP_UI_Menu_ActionInputButton_C::bIsHovered' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, OnButtonClicked) == 0x000310, "Member 'UWBP_UI_Menu_ActionInputButton_C::OnButtonClicked' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, BorderHoverColor) == 0x000320, "Member 'UWBP_UI_Menu_ActionInputButton_C::BorderHoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, BorderIdleColor) == 0x000330, "Member 'UWBP_UI_Menu_ActionInputButton_C::BorderIdleColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, TextHoverColor) == 0x000340, "Member 'UWBP_UI_Menu_ActionInputButton_C::TextHoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, TextIdleColor) == 0x000350, "Member 'UWBP_UI_Menu_ActionInputButton_C::TextIdleColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, BackgroundHoverColor) == 0x000360, "Member 'UWBP_UI_Menu_ActionInputButton_C::BackgroundHoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Menu_ActionInputButton_C, BackgroundIdleColor) == 0x000370, "Member 'UWBP_UI_Menu_ActionInputButton_C::BackgroundIdleColor' has a wrong offset!");

}

