#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_Groups_Deployed

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_Groups_Deployed.WBP_UI_Widget_Groups_Deployed_C
// 0x0170 (0x0400 - 0x0290)
class UWBP_UI_Widget_Groups_Deployed_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C* WBP_UI_Widget_BaseGroupedCounters_Ammo;      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C* WBP_UI_Widget_BaseGroupedCounters_Armor;     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C* WBP_UI_Widget_BaseGroupedCounters_Medic;     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C* WBP_UI_Widget_BaseGroupedCounters_Turret;    // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class ABP_Placeable_AmmoBag_C*, class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C*> placableAmmo; // 0x02B8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ABP_Placeable_ArmorBag_C*, class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C*> placableArmor; // 0x0308(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ABP_Placeable_DoctorBag_C*, class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C*> placableMedic; // 0x0358(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ABP_SentryGun_C*, class UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C*> placableSentry; // 0x03A8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          bUsePlayerColors;                                  // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void update();
	void SetPlayerWidgetColor(class AActor* Placeable, class UUserWidget* Widget);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_Groups_Deployed_C">();
	}
	static class UWBP_UI_Widget_Groups_Deployed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_Groups_Deployed_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_Groups_Deployed_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_Groups_Deployed_C");
static_assert(sizeof(UWBP_UI_Widget_Groups_Deployed_C) == 0x000400, "Wrong size on UWBP_UI_Widget_Groups_Deployed_C");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_Groups_Deployed_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, WBP_UI_Widget_BaseGroupedCounters_Ammo) == 0x000298, "Member 'UWBP_UI_Widget_Groups_Deployed_C::WBP_UI_Widget_BaseGroupedCounters_Ammo' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, WBP_UI_Widget_BaseGroupedCounters_Armor) == 0x0002A0, "Member 'UWBP_UI_Widget_Groups_Deployed_C::WBP_UI_Widget_BaseGroupedCounters_Armor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, WBP_UI_Widget_BaseGroupedCounters_Medic) == 0x0002A8, "Member 'UWBP_UI_Widget_Groups_Deployed_C::WBP_UI_Widget_BaseGroupedCounters_Medic' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, WBP_UI_Widget_BaseGroupedCounters_Turret) == 0x0002B0, "Member 'UWBP_UI_Widget_Groups_Deployed_C::WBP_UI_Widget_BaseGroupedCounters_Turret' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, placableAmmo) == 0x0002B8, "Member 'UWBP_UI_Widget_Groups_Deployed_C::placableAmmo' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, placableArmor) == 0x000308, "Member 'UWBP_UI_Widget_Groups_Deployed_C::placableArmor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, placableMedic) == 0x000358, "Member 'UWBP_UI_Widget_Groups_Deployed_C::placableMedic' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, placableSentry) == 0x0003A8, "Member 'UWBP_UI_Widget_Groups_Deployed_C::placableSentry' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Deployed_C, bUsePlayerColors) == 0x0003F8, "Member 'UWBP_UI_Widget_Groups_Deployed_C::bUsePlayerColors' has a wrong offset!");

}

