#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DailyChallengeReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_DailyChallengeReward.WBP_DailyChallengeReward_C.ExecuteUbergraph_WBP_DailyChallengeReward
// 0x0158 (0x0158 - 0x0000)
struct WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_1;                              // 0x0068(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZChallengeRewardItem                K2Node_CustomEvent_InRewardItem;                   // 0x0098(0x0030)()
	class FText                                   K2Node_Select_Default;                             // 0x00C8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0140(0x0018)()
};
static_assert(alignof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward) == 0x000008, "Wrong alignment on WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward");
static_assert(sizeof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward) == 0x000158, "Wrong size on WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, EntryPoint) == 0x000000, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, Temp_bool_Variable) == 0x000004, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, Temp_text_Variable) == 0x000008, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, CallFunc_Conv_NameToString_ReturnValue) == 0x000020, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000030, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000048, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, CallFunc_Conv_IntToString_ReturnValue) == 0x000058, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, Temp_text_Variable_1) == 0x000068, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000080, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, K2Node_Event_IsDesignTime) == 0x000090, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, K2Node_CustomEvent_InRewardItem) == 0x000098, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::K2Node_CustomEvent_InRewardItem' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, K2Node_Select_Default) == 0x0000C8, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, K2Node_MakeStruct_FormatArgumentData) == 0x0000E0, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, K2Node_MakeArray_Array) == 0x000120, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000130, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward, CallFunc_Format_ReturnValue) == 0x000140, "Member 'WBP_DailyChallengeReward_C_ExecuteUbergraph_WBP_DailyChallengeReward::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_DailyChallengeReward.WBP_DailyChallengeReward_C.InitializeReward
// 0x0030 (0x0030 - 0x0000)
struct WBP_DailyChallengeReward_C_InitializeReward final
{
public:
	struct FSBZChallengeRewardItem                InRewardItem;                                      // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_DailyChallengeReward_C_InitializeReward) == 0x000008, "Wrong alignment on WBP_DailyChallengeReward_C_InitializeReward");
static_assert(sizeof(WBP_DailyChallengeReward_C_InitializeReward) == 0x000030, "Wrong size on WBP_DailyChallengeReward_C_InitializeReward");
static_assert(offsetof(WBP_DailyChallengeReward_C_InitializeReward, InRewardItem) == 0x000000, "Member 'WBP_DailyChallengeReward_C_InitializeReward::InRewardItem' has a wrong offset!");

// Function WBP_DailyChallengeReward.WBP_DailyChallengeReward_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_DailyChallengeReward_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_DailyChallengeReward_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_DailyChallengeReward_C_PreConstruct");
static_assert(sizeof(WBP_DailyChallengeReward_C_PreConstruct) == 0x000001, "Wrong size on WBP_DailyChallengeReward_C_PreConstruct");
static_assert(offsetof(WBP_DailyChallengeReward_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_DailyChallengeReward_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_DailyChallengeReward.WBP_DailyChallengeReward_C.InitializeInfamyReward
// 0x0070 (0x0070 - 0x0000)
struct WBP_DailyChallengeReward_C_InitializeInfamyReward final
{
public:
	int32                                         InInfamy;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0058(0x0018)()
};
static_assert(alignof(WBP_DailyChallengeReward_C_InitializeInfamyReward) == 0x000008, "Wrong alignment on WBP_DailyChallengeReward_C_InitializeInfamyReward");
static_assert(sizeof(WBP_DailyChallengeReward_C_InitializeInfamyReward) == 0x000070, "Wrong size on WBP_DailyChallengeReward_C_InitializeInfamyReward");
static_assert(offsetof(WBP_DailyChallengeReward_C_InitializeInfamyReward, InInfamy) == 0x000000, "Member 'WBP_DailyChallengeReward_C_InitializeInfamyReward::InInfamy' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_InitializeInfamyReward, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'WBP_DailyChallengeReward_C_InitializeInfamyReward::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_InitializeInfamyReward, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_DailyChallengeReward_C_InitializeInfamyReward::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_InitializeInfamyReward, K2Node_MakeArray_Array) == 0x000048, "Member 'WBP_DailyChallengeReward_C_InitializeInfamyReward::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_DailyChallengeReward_C_InitializeInfamyReward, CallFunc_Format_ReturnValue) == 0x000058, "Member 'WBP_DailyChallengeReward_C_InitializeInfamyReward::CallFunc_Format_ReturnValue' has a wrong offset!");

}

