#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_CircularIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_CircularIcon.WBP_UI_Widget_CircularIcon_C
// 0x0018 (0x02A8 - 0x0290)
class UWBP_UI_Widget_CircularIcon_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Icon;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Icon;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_CircularIcon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FText& InText);
	void SetSelected(bool bIsSelected);
	void SetIcon(class UPaperSprite* InIcon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_CircularIcon_C">();
	}
	static class UWBP_UI_Widget_CircularIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_CircularIcon_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_CircularIcon_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_CircularIcon_C");
static_assert(sizeof(UWBP_UI_Widget_CircularIcon_C) == 0x0002A8, "Wrong size on UWBP_UI_Widget_CircularIcon_C");
static_assert(offsetof(UWBP_UI_Widget_CircularIcon_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_CircularIcon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CircularIcon_C, Image_Icon) == 0x000298, "Member 'UWBP_UI_Widget_CircularIcon_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_CircularIcon_C, Text_Icon) == 0x0002A0, "Member 'UWBP_UI_Widget_CircularIcon_C::Text_Icon' has a wrong offset!");

}

