#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_SliderButton_RinoHud

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Settings_SliderButton_RinoHud.WBP_Settings_SliderButton_RinoHud_C.ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud
// 0x0020 (0x0020 - 0x0000)
struct WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float Value)>                  K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bInIsDisabled;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Value;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud) == 0x000004, "Wrong alignment on WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud");
static_assert(sizeof(WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud) == 0x000020, "Wrong size on WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud, EntryPoint) == 0x000000, "Member 'WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud, K2Node_Event_bInIsDisabled) == 0x000018, "Member 'WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud::K2Node_Event_bInIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud, K2Node_Event_bInHasFocus) == 0x000019, "Member 'WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud, K2Node_Event_bInIsHovered) == 0x00001A, "Member 'WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud, K2Node_CustomEvent_Value) == 0x00001C, "Member 'WBP_Settings_SliderButton_RinoHud_C_ExecuteUbergraph_WBP_Settings_SliderButton_RinoHud::K2Node_CustomEvent_Value' has a wrong offset!");

// Function WBP_Settings_SliderButton_RinoHud.WBP_Settings_SliderButton_RinoHud_C.SlideValueChangedEvent
// 0x0004 (0x0004 - 0x0000)
struct WBP_Settings_SliderButton_RinoHud_C_SlideValueChangedEvent final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_SliderButton_RinoHud_C_SlideValueChangedEvent) == 0x000004, "Wrong alignment on WBP_Settings_SliderButton_RinoHud_C_SlideValueChangedEvent");
static_assert(sizeof(WBP_Settings_SliderButton_RinoHud_C_SlideValueChangedEvent) == 0x000004, "Wrong size on WBP_Settings_SliderButton_RinoHud_C_SlideValueChangedEvent");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_SlideValueChangedEvent, Value) == 0x000000, "Member 'WBP_Settings_SliderButton_RinoHud_C_SlideValueChangedEvent::Value' has a wrong offset!");

// Function WBP_Settings_SliderButton_RinoHud.WBP_Settings_SliderButton_RinoHud_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_SliderButton_RinoHud_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_SliderButton_RinoHud_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_Settings_SliderButton_RinoHud_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_Settings_SliderButton_RinoHud_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_Settings_SliderButton_RinoHud_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_Settings_SliderButton_RinoHud_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_Settings_SliderButton_RinoHud.WBP_Settings_SliderButton_RinoHud_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_SliderButton_RinoHud_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_SliderButton_RinoHud_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_Settings_SliderButton_RinoHud_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_Settings_SliderButton_RinoHud_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_Settings_SliderButton_RinoHud_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_Settings_SliderButton_RinoHud_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_Settings_SliderButton_RinoHud.WBP_Settings_SliderButton_RinoHud_C.ButtonDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_SliderButton_RinoHud_C_ButtonDisabledChanged final
{
public:
	bool                                          bInIsDisabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_SliderButton_RinoHud_C_ButtonDisabledChanged) == 0x000001, "Wrong alignment on WBP_Settings_SliderButton_RinoHud_C_ButtonDisabledChanged");
static_assert(sizeof(WBP_Settings_SliderButton_RinoHud_C_ButtonDisabledChanged) == 0x000001, "Wrong size on WBP_Settings_SliderButton_RinoHud_C_ButtonDisabledChanged");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_ButtonDisabledChanged, bInIsDisabled) == 0x000000, "Member 'WBP_Settings_SliderButton_RinoHud_C_ButtonDisabledChanged::bInIsDisabled' has a wrong offset!");

// Function WBP_Settings_SliderButton_RinoHud.WBP_Settings_SliderButton_RinoHud_C.Set Slider Value
// 0x0004 (0x0004 - 0x0000)
struct WBP_Settings_SliderButton_RinoHud_C_Set_Slider_Value final
{
public:
	float                                         Input;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_SliderButton_RinoHud_C_Set_Slider_Value) == 0x000004, "Wrong alignment on WBP_Settings_SliderButton_RinoHud_C_Set_Slider_Value");
static_assert(sizeof(WBP_Settings_SliderButton_RinoHud_C_Set_Slider_Value) == 0x000004, "Wrong size on WBP_Settings_SliderButton_RinoHud_C_Set_Slider_Value");
static_assert(offsetof(WBP_Settings_SliderButton_RinoHud_C_Set_Slider_Value, Input) == 0x000000, "Member 'WBP_Settings_SliderButton_RinoHud_C_Set_Slider_Value::Input' has a wrong offset!");

}

