#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PlayerStatusWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_PlayerStatusWidget.WBP_UI_Widget_PlayerStatusWidget_C
// 0x0198 (0x04E0 - 0x0348)
class UWBP_UI_Widget_PlayerStatusWidget_C final : public UPD3HUDPlayerStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URetainerBox*                           HUDGlitchRetainer;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Frame;                                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlayerIcon;                                  // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoIP_C*                            WBP_VoIP;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperSprite*                           InDesignerHeisterIcon;                             // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            Tased;                                             // 0x0378(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Default;                                           // 0x03A0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Cuffed;                                            // 0x03C8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Downed;                                            // 0x03F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            In_Custody;                                        // 0x0418(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Subdued;                                           // 0x0440(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            Default_BKG;                                       // 0x0468(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            KnockedBKG;                                        // 0x0490(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            TasedBKG;                                          // 0x04B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Destruct();
	void Construct();
	void OnStateChanged(EPD3DefeatState Old, EPD3DefeatState New);
	void OnHeisterIconChangedEvent(class UPaperSprite* InNewHeisterIcon);
	void OnInitialized();
	void SetEOSProdUID();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_PlayerStatusWidget_C">();
	}
	static class UWBP_UI_Widget_PlayerStatusWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_PlayerStatusWidget_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_PlayerStatusWidget_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_PlayerStatusWidget_C");
static_assert(sizeof(UWBP_UI_Widget_PlayerStatusWidget_C) == 0x0004E0, "Wrong size on UWBP_UI_Widget_PlayerStatusWidget_C");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, UberGraphFrame) == 0x000348, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, HUDGlitchRetainer) == 0x000350, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::HUDGlitchRetainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, Image_Frame) == 0x000358, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::Image_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, Image_PlayerIcon) == 0x000360, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::Image_PlayerIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, WBP_VoIP) == 0x000368, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::WBP_VoIP' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, InDesignerHeisterIcon) == 0x000370, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::InDesignerHeisterIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, Tased) == 0x000378, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::Tased' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, Default) == 0x0003A0, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::Default' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, Cuffed) == 0x0003C8, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::Cuffed' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, Downed) == 0x0003F0, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::Downed' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, In_Custody) == 0x000418, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::In_Custody' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, Subdued) == 0x000440, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::Subdued' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, Default_BKG) == 0x000468, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::Default_BKG' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, KnockedBKG) == 0x000490, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::KnockedBKG' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerStatusWidget_C, TasedBKG) == 0x0004B8, "Member 'UWBP_UI_Widget_PlayerStatusWidget_C::TasedBKG' has a wrong offset!");

}

