#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser_FilterBar

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.ExecuteUbergraph_WBP_ServerBrowser_FilterBar
// 0x0040 (0x0040 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_ShouldHideTitle;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue_1;           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bInIsEnabled;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar) == 0x000008, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar) == 0x000040, "Wrong size on WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, EntryPoint) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_CustomEvent_ShouldHideTitle) == 0x000004, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_CustomEvent_ShouldHideTitle' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, Temp_bool_Variable) == 0x000005, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, Temp_byte_Variable) == 0x000006, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, Temp_byte_Variable_1) == 0x000007, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_Event_IsDesignTime) == 0x000008, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_ComponentBoundEvent_Button_3) == 0x000010, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_ComponentBoundEvent_Button_2) == 0x000018, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_ComponentBoundEvent_Button_1) == 0x000020, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000028, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000038, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_ComponentBoundEvent_InVisibility) == 0x000039, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00003A, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, CallFunc_HasKeyboardFocus_ReturnValue) == 0x00003B, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, CallFunc_HasKeyboardFocus_ReturnValue_1) == 0x00003C, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::CallFunc_HasKeyboardFocus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, CallFunc_BooleanOR_ReturnValue) == 0x00003D, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_CustomEvent_bInIsEnabled) == 0x00003E, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_CustomEvent_bInIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar, K2Node_Select_Default) == 0x00003F, "Member 'WBP_ServerBrowser_FilterBar_C_ExecuteUbergraph_WBP_ServerBrowser_FilterBar::K2Node_Select_Default' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.HideTitleBar
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_HideTitleBar final
{
public:
	bool                                          ShouldHideTitle_0;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_HideTitleBar) == 0x000001, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_HideTitleBar");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_HideTitleBar) == 0x000001, "Wrong size on WBP_ServerBrowser_FilterBar_C_HideTitleBar");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_HideTitleBar, ShouldHideTitle_0) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_HideTitleBar::ShouldHideTitle_0' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.ToggleRefreshButton
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_ToggleRefreshButton final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_ToggleRefreshButton) == 0x000001, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_ToggleRefreshButton");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_ToggleRefreshButton) == 0x000001, "Wrong size on WBP_ServerBrowser_FilterBar_C_ToggleRefreshButton");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_ToggleRefreshButton, bInIsEnabled) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_ToggleRefreshButton::bInIsEnabled' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.BndEvt__WBP_ServerBrowser_FilterBar_WBP_UI_Widget_ActionInput_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_WBP_UI_Widget_ActionInput_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_WBP_UI_Widget_ActionInput_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_WBP_UI_Widget_ActionInput_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_WBP_UI_Widget_ActionInput_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_WBP_UI_Widget_ActionInput_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_WBP_UI_Widget_ActionInput_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_WBP_UI_Widget_ActionInput_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_RefreshServers_K2Node_ComponentBoundEvent_10_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterDifficulty_NEW_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterDifficulty_NEW_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterDifficulty_NEW_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterDifficulty_NEW_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterDifficulty_NEW_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterDifficulty_NEW_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterDifficulty_NEW_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterDifficulty_NEW_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_New_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_New_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_New_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_New_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_New_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_New_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_New_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_BndEvt__WBP_ServerBrowser_FilterBar_Button_FilterOptions_New_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_PreConstruct");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_PreConstruct) == 0x000001, "Wrong size on WBP_ServerBrowser_FilterBar_C_PreConstruct");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.HandleButtonFocusChanged
// 0x0070 (0x0070 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsButtonEnabled;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                EmptyButtonActionDisplayText;                      // 0x0010(0x0050)(Edit, BlueprintVisible)
	class UWBP_ServerBrowser_Screen_C*            K2Node_DynamicCast_AsWBP_Server_Browser_Screen;    // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged) == 0x000008, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged) == 0x000070, "Wrong size on WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged, Button) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged::Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged, IsButtonEnabled) == 0x000008, "Member 'WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged::IsButtonEnabled' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged, EmptyButtonActionDisplayText) == 0x000010, "Member 'WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged::EmptyButtonActionDisplayText' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged, K2Node_DynamicCast_AsWBP_Server_Browser_Screen) == 0x000060, "Member 'WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged::K2Node_DynamicCast_AsWBP_Server_Browser_Screen' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_ServerBrowser_FilterBar_C_HandleButtonFocusChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_ServerBrowser_FilterBar.WBP_ServerBrowser_FilterBar_C.SwitchToOptions
// 0x0004 (0x0004 - 0x0000)
struct WBP_ServerBrowser_FilterBar_C_SwitchToOptions final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_FilterBar_C_SwitchToOptions) == 0x000001, "Wrong alignment on WBP_ServerBrowser_FilterBar_C_SwitchToOptions");
static_assert(sizeof(WBP_ServerBrowser_FilterBar_C_SwitchToOptions) == 0x000004, "Wrong size on WBP_ServerBrowser_FilterBar_C_SwitchToOptions");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_SwitchToOptions, bIsActive) == 0x000000, "Member 'WBP_ServerBrowser_FilterBar_C_SwitchToOptions::bIsActive' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_SwitchToOptions, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'WBP_ServerBrowser_FilterBar_C_SwitchToOptions::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_SwitchToOptions, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_ServerBrowser_FilterBar_C_SwitchToOptions::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_FilterBar_C_SwitchToOptions, CallFunc_BooleanAND_ReturnValue) == 0x000003, "Member 'WBP_ServerBrowser_FilterBar_C_SwitchToOptions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

