#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CableBox

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CableBox.WBP_CableBox_C
// 0x0020 (0x02B0 - 0x0290)
class UWBP_CableBox_C final : public UUserWidget
{
public:
	class UBorder*                                Border;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_83;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ModelNumber;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             STATE;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetCodeText(const class FText& InText);
	void SetState(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_CableBox_C">();
	}
	static class UWBP_CableBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CableBox_C>();
	}
};
static_assert(alignof(UWBP_CableBox_C) == 0x000008, "Wrong alignment on UWBP_CableBox_C");
static_assert(sizeof(UWBP_CableBox_C) == 0x0002B0, "Wrong size on UWBP_CableBox_C");
static_assert(offsetof(UWBP_CableBox_C, Border) == 0x000290, "Member 'UWBP_CableBox_C::Border' has a wrong offset!");
static_assert(offsetof(UWBP_CableBox_C, Border_83) == 0x000298, "Member 'UWBP_CableBox_C::Border_83' has a wrong offset!");
static_assert(offsetof(UWBP_CableBox_C, ModelNumber) == 0x0002A0, "Member 'UWBP_CableBox_C::ModelNumber' has a wrong offset!");
static_assert(offsetof(UWBP_CableBox_C, STATE) == 0x0002A8, "Member 'UWBP_CableBox_C::STATE' has a wrong offset!");

}

