#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_BaseDistancePercentage_RinoHud

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_BaseDistancePercentage_RinoHud.WBP_UI_Widget_BaseDistancePercentage_RinoHud_C.ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud");
static_assert(sizeof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud) == 0x000010, "Wrong size on WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseDistancePercentage_RinoHud::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_BaseDistancePercentage_RinoHud.WBP_UI_Widget_BaseDistancePercentage_RinoHud_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_BaseDistancePercentage_RinoHud.WBP_UI_Widget_BaseDistancePercentage_RinoHud_C.SetValues
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_SetValues final
{
public:
	float                                         Distance;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Percentage;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_SetValues) == 0x000004, "Wrong alignment on WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_SetValues");
static_assert(sizeof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_SetValues) == 0x000008, "Wrong size on WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_SetValues");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_SetValues, Distance) == 0x000000, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_SetValues::Distance' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_SetValues, Percentage) == 0x000004, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C_SetValues::Percentage' has a wrong offset!");

// Function WBP_UI_Widget_BaseDistancePercentage_RinoHud.WBP_UI_Widget_BaseDistancePercentage_RinoHud_C._Update
// 0x0100 (0x0100 - 0x0000)
struct WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update final
{
public:
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_FFloor64_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0058(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_1;                           // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B0(0x0018)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E8(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update");
static_assert(sizeof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update) == 0x000100, "Wrong size on WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, Temp_struct_Variable) == 0x000000, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, Temp_struct_Variable_1) == 0x000010, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, Temp_bool_Variable) == 0x000020, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, Temp_struct_Variable_2) == 0x000024, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, Temp_bool_Variable_1) == 0x000034, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000038, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_FFloor_ReturnValue) == 0x00003C, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000040, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000044, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_FFloor64_ReturnValue) == 0x000048, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_FFloor64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000058, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_Conv_TextToString_ReturnValue) == 0x000070, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, K2Node_Select_Default) == 0x000080, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_Concat_StrStr_ReturnValue) == 0x000090, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, K2Node_Select_Default_1) == 0x0000A0, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B0, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_Conv_IntToString_ReturnValue) == 0x0000C8, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000D8, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0000E8, "Member 'WBP_UI_Widget_BaseDistancePercentage_RinoHud_C__Update::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

}

