#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NewsBannerButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NewsBannerButton.WBP_NewsBannerButton_C
// 0x0130 (0x0490 - 0x0360)
class UWBP_NewsBannerButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnFocused;                                         // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 BottomBackground_I;                                // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZCarouselWidget*                     Carousel;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Description_T;                                     // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_188;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outline_I;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Title_T;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperSprite*                           EditorSprite;                                      // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnCarouselPressed;                                 // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         ScrollIntervall;                                   // 0x03F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x03FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZNewsDataUIEntry>            NewsEntries;                                       // 0x0400(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSBZNewsDataUIEntry                    CurrentEntry;                                      // 0x0410(0x0070)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(int32 NewIndex)> OnCarouselPageIndexChanged;                       // 0x0480(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_NewsBannerButton(int32 EntryPoint);
	void ButtonFocusChanging(bool bInHasFocus);
	void ButtonSelected();
	void SetCarouselScrollingEnabled(bool InEnable);
	void PreConstruct(bool IsDesignTime);
	void OnPageChanged(class USBZCarouselWidget* CarouselWidget, int32 CurrentPageIndex);
	void OnInitialized();
	void Destruct();
	void AddItem(TSoftObjectPtr<class UPaperSprite> InNewsBannerSprite);
	void OnFocusedChanged(bool InFocused);
	void OnHoveredChanged(bool InHovered);
	void InitializeNewsEntries(TArray<struct FSBZNewsDataUIEntry>& InNewsEntries, class UWBP_PageCycler_C*& PageCycler);
	void NavigateToPage(int32 InNavigateIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NewsBannerButton_C">();
	}
	static class UWBP_NewsBannerButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NewsBannerButton_C>();
	}
};
static_assert(alignof(UWBP_NewsBannerButton_C) == 0x000008, "Wrong alignment on UWBP_NewsBannerButton_C");
static_assert(sizeof(UWBP_NewsBannerButton_C) == 0x000490, "Wrong size on UWBP_NewsBannerButton_C");
static_assert(offsetof(UWBP_NewsBannerButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_NewsBannerButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, OnFocused) == 0x000368, "Member 'UWBP_NewsBannerButton_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, BottomBackground_I) == 0x000370, "Member 'UWBP_NewsBannerButton_C::BottomBackground_I' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Carousel) == 0x000378, "Member 'UWBP_NewsBannerButton_C::Carousel' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Description_T) == 0x000380, "Member 'UWBP_NewsBannerButton_C::Description_T' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Image) == 0x000388, "Member 'UWBP_NewsBannerButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Image_1) == 0x000390, "Member 'UWBP_NewsBannerButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Image_2) == 0x000398, "Member 'UWBP_NewsBannerButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Image_3) == 0x0003A0, "Member 'UWBP_NewsBannerButton_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Image_4) == 0x0003A8, "Member 'UWBP_NewsBannerButton_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Image_5) == 0x0003B0, "Member 'UWBP_NewsBannerButton_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Image_6) == 0x0003B8, "Member 'UWBP_NewsBannerButton_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Image_188) == 0x0003C0, "Member 'UWBP_NewsBannerButton_C::Image_188' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Image_511) == 0x0003C8, "Member 'UWBP_NewsBannerButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Outline_I) == 0x0003D0, "Member 'UWBP_NewsBannerButton_C::Outline_I' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, Title_T) == 0x0003D8, "Member 'UWBP_NewsBannerButton_C::Title_T' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, EditorSprite) == 0x0003E0, "Member 'UWBP_NewsBannerButton_C::EditorSprite' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, OnCarouselPressed) == 0x0003E8, "Member 'UWBP_NewsBannerButton_C::OnCarouselPressed' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, ScrollIntervall) == 0x0003F8, "Member 'UWBP_NewsBannerButton_C::ScrollIntervall' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, CurrentIndex) == 0x0003FC, "Member 'UWBP_NewsBannerButton_C::CurrentIndex' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, NewsEntries) == 0x000400, "Member 'UWBP_NewsBannerButton_C::NewsEntries' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, CurrentEntry) == 0x000410, "Member 'UWBP_NewsBannerButton_C::CurrentEntry' has a wrong offset!");
static_assert(offsetof(UWBP_NewsBannerButton_C, OnCarouselPageIndexChanged) == 0x000480, "Member 'UWBP_NewsBannerButton_C::OnCarouselPageIndexChanged' has a wrong offset!");

}

