#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_LobbyTypeSelector

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_LobbyTypeSelector.WBP_LobbyTypeSelector_C
// 0x0060 (0x03D8 - 0x0378)
class UWBP_LobbyTypeSelector_C final : public USBZSelectorWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_Left;                                       // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_Right;                                      // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderButton;                                // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderButton2;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeftArrow;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RightArrow;                                  // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LobbyTypeLabel;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_ButtonBase;                                // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LobbyTypeName;                                // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsConstructed;                                    // 0x03D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_LobbyTypeSelector(int32 EntryPoint);
	void Construct();
	void OnInitialized();
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnSelectedRight();
	void OnSelectedLeft();
	void BndEvt__WBP_UI_Menus_Options_Selector_Button_Left_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_UI_Menus_Options_Selector_Button_Right_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnSelectionOptionChanged(int32 InCurrentIndex, bool bOverrideReadOnly);
	void UpdateVisuals();
	void UpdateType(ESBZOnlineJoinType InLobbyType);
	void SetFocusVisuals(bool InIsFocused);
	void Set_Compact(bool InIsCompact);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_LobbyTypeSelector_C">();
	}
	static class UWBP_LobbyTypeSelector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_LobbyTypeSelector_C>();
	}
};
static_assert(alignof(UWBP_LobbyTypeSelector_C) == 0x000008, "Wrong alignment on UWBP_LobbyTypeSelector_C");
static_assert(sizeof(UWBP_LobbyTypeSelector_C) == 0x0003D8, "Wrong size on UWBP_LobbyTypeSelector_C");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, UberGraphFrame) == 0x000378, "Member 'UWBP_LobbyTypeSelector_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, Button_Left) == 0x000380, "Member 'UWBP_LobbyTypeSelector_C::Button_Left' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, Button_Right) == 0x000388, "Member 'UWBP_LobbyTypeSelector_C::Button_Right' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, Image_Background) == 0x000390, "Member 'UWBP_LobbyTypeSelector_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, Image_BorderButton) == 0x000398, "Member 'UWBP_LobbyTypeSelector_C::Image_BorderButton' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, Image_BorderButton2) == 0x0003A0, "Member 'UWBP_LobbyTypeSelector_C::Image_BorderButton2' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, Image_LeftArrow) == 0x0003A8, "Member 'UWBP_LobbyTypeSelector_C::Image_LeftArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, Image_RightArrow) == 0x0003B0, "Member 'UWBP_LobbyTypeSelector_C::Image_RightArrow' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, LobbyTypeLabel) == 0x0003B8, "Member 'UWBP_LobbyTypeSelector_C::LobbyTypeLabel' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, Overlay_ButtonBase) == 0x0003C0, "Member 'UWBP_LobbyTypeSelector_C::Overlay_ButtonBase' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, Text_LobbyTypeName) == 0x0003C8, "Member 'UWBP_LobbyTypeSelector_C::Text_LobbyTypeName' has a wrong offset!");
static_assert(offsetof(UWBP_LobbyTypeSelector_C, bIsConstructed) == 0x0003D0, "Member 'UWBP_LobbyTypeSelector_C::bIsConstructed' has a wrong offset!");

}

