#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RenownLevel

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_RenownLevel.WBP_RenownLevel_C.ExecuteUbergraph_WBP_RenownLevel
// 0x0030 (0x0030 - 0x0000)
struct WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZInfamyManager*                      CallFunc_GetInfamyManager_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NewLevel, int32 PreviousLevel)> K2Node_CreateDelegate_OutputDelegate;       // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZInfamyManager*                      CallFunc_GetInfamyManager_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel) == 0x000008, "Wrong alignment on WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel");
static_assert(sizeof(WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel) == 0x000030, "Wrong size on WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel");
static_assert(offsetof(WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel, EntryPoint) == 0x000000, "Member 'WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel, CallFunc_GetInfamyManager_ReturnValue) == 0x000008, "Member 'WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel::CallFunc_GetInfamyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel, CallFunc_GetInfamyManager_ReturnValue_1) == 0x000028, "Member 'WBP_RenownLevel_C_ExecuteUbergraph_WBP_RenownLevel::CallFunc_GetInfamyManager_ReturnValue_1' has a wrong offset!");

// Function WBP_RenownLevel.WBP_RenownLevel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RenownLevel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_RenownLevel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_RenownLevel_C_PreConstruct");
static_assert(sizeof(WBP_RenownLevel_C_PreConstruct) == 0x000001, "Wrong size on WBP_RenownLevel_C_PreConstruct");
static_assert(offsetof(WBP_RenownLevel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_RenownLevel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_RenownLevel.WBP_RenownLevel_C.SetIconAndLevel
// 0x0058 (0x0058 - 0x0000)
struct WBP_RenownLevel_C_SetIconAndLevel final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_GetTierColor_OutColor;                    // 0x0008(0x0028)()
	class UPaperSprite*                           CallFunc_GetIcon_OutSprite;                        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
};
static_assert(alignof(WBP_RenownLevel_C_SetIconAndLevel) == 0x000008, "Wrong alignment on WBP_RenownLevel_C_SetIconAndLevel");
static_assert(sizeof(WBP_RenownLevel_C_SetIconAndLevel) == 0x000058, "Wrong size on WBP_RenownLevel_C_SetIconAndLevel");
static_assert(offsetof(WBP_RenownLevel_C_SetIconAndLevel, InLevel) == 0x000000, "Member 'WBP_RenownLevel_C_SetIconAndLevel::InLevel' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_SetIconAndLevel, CallFunc_GetTierColor_OutColor) == 0x000008, "Member 'WBP_RenownLevel_C_SetIconAndLevel::CallFunc_GetTierColor_OutColor' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_SetIconAndLevel, CallFunc_GetIcon_OutSprite) == 0x000030, "Member 'WBP_RenownLevel_C_SetIconAndLevel::CallFunc_GetIcon_OutSprite' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_SetIconAndLevel, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'WBP_RenownLevel_C_SetIconAndLevel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_SetIconAndLevel, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'WBP_RenownLevel_C_SetIconAndLevel::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

// Function WBP_RenownLevel.WBP_RenownLevel_C.GetIcon
// 0x0038 (0x0038 - 0x0000)
struct WBP_RenownLevel_C_GetIcon final
{
public:
	int32                                         InRenownLevel;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           OutSprite;                                         // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RenownLevel_C_GetIcon) == 0x000008, "Wrong alignment on WBP_RenownLevel_C_GetIcon");
static_assert(sizeof(WBP_RenownLevel_C_GetIcon) == 0x000038, "Wrong size on WBP_RenownLevel_C_GetIcon");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, InRenownLevel) == 0x000000, "Member 'WBP_RenownLevel_C_GetIcon::InRenownLevel' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, OutSprite) == 0x000008, "Member 'WBP_RenownLevel_C_GetIcon::OutSprite' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_RenownLevel_C_GetIcon::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_RenownLevel_C_GetIcon::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'WBP_RenownLevel_C_GetIcon::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, CallFunc_Divide_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_RenownLevel_C_GetIcon::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, CallFunc_Percent_IntInt_ReturnValue) == 0x000020, "Member 'WBP_RenownLevel_C_GetIcon::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, CallFunc_Greater_IntInt_ReturnValue) == 0x000024, "Member 'WBP_RenownLevel_C_GetIcon::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, CallFunc_SelectInt_ReturnValue) == 0x000028, "Member 'WBP_RenownLevel_C_GetIcon::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetIcon, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_RenownLevel_C_GetIcon::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_RenownLevel.WBP_RenownLevel_C.GetTierColor
// 0x0070 (0x0070 - 0x0000)
struct WBP_RenownLevel_C_GetTierColor final
{
public:
	int32                                         InRenownLevel;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            OutColor;                                          // 0x0008(0x0028)(Parm, OutParm)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            CallFunc_Array_Get_Item;                           // 0x0048(0x0028)()
};
static_assert(alignof(WBP_RenownLevel_C_GetTierColor) == 0x000008, "Wrong alignment on WBP_RenownLevel_C_GetTierColor");
static_assert(sizeof(WBP_RenownLevel_C_GetTierColor) == 0x000070, "Wrong size on WBP_RenownLevel_C_GetTierColor");
static_assert(offsetof(WBP_RenownLevel_C_GetTierColor, InRenownLevel) == 0x000000, "Member 'WBP_RenownLevel_C_GetTierColor::InRenownLevel' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetTierColor, OutColor) == 0x000008, "Member 'WBP_RenownLevel_C_GetTierColor::OutColor' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetTierColor, CallFunc_Divide_IntInt_ReturnValue) == 0x000030, "Member 'WBP_RenownLevel_C_GetTierColor::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetTierColor, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_RenownLevel_C_GetTierColor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetTierColor, CallFunc_Subtract_IntInt_ReturnValue) == 0x000038, "Member 'WBP_RenownLevel_C_GetTierColor::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetTierColor, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_RenownLevel_C_GetTierColor::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetTierColor, CallFunc_SelectInt_ReturnValue) == 0x000040, "Member 'WBP_RenownLevel_C_GetTierColor::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_GetTierColor, CallFunc_Array_Get_Item) == 0x000048, "Member 'WBP_RenownLevel_C_GetTierColor::CallFunc_Array_Get_Item' has a wrong offset!");

// Function WBP_RenownLevel.WBP_RenownLevel_C.UpdateVisuals
// 0x000C (0x000C - 0x0000)
struct WBP_RenownLevel_C_UpdateVisuals final
{
public:
	int32                                         InLevel;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RenownLevel_C_UpdateVisuals) == 0x000004, "Wrong alignment on WBP_RenownLevel_C_UpdateVisuals");
static_assert(sizeof(WBP_RenownLevel_C_UpdateVisuals) == 0x00000C, "Wrong size on WBP_RenownLevel_C_UpdateVisuals");
static_assert(offsetof(WBP_RenownLevel_C_UpdateVisuals, InLevel) == 0x000000, "Member 'WBP_RenownLevel_C_UpdateVisuals::InLevel' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_UpdateVisuals, Temp_byte_Variable) == 0x000004, "Member 'WBP_RenownLevel_C_UpdateVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_UpdateVisuals, CallFunc_Greater_IntInt_ReturnValue) == 0x000005, "Member 'WBP_RenownLevel_C_UpdateVisuals::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_UpdateVisuals, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_RenownLevel_C_UpdateVisuals::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_UpdateVisuals, Temp_bool_Variable) == 0x000007, "Member 'WBP_RenownLevel_C_UpdateVisuals::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_UpdateVisuals, K2Node_Select_Default) == 0x000008, "Member 'WBP_RenownLevel_C_UpdateVisuals::K2Node_Select_Default' has a wrong offset!");

// Function WBP_RenownLevel.WBP_RenownLevel_C.UpdateRenown
// 0x0010 (0x0010 - 0x0000)
struct WBP_RenownLevel_C_UpdateRenown final
{
public:
	class USBZInfamyManager*                      CallFunc_GetInfamyManager_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_ClientGetCurrentRenownLevel_ReturnValue;  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RenownLevel_C_UpdateRenown) == 0x000008, "Wrong alignment on WBP_RenownLevel_C_UpdateRenown");
static_assert(sizeof(WBP_RenownLevel_C_UpdateRenown) == 0x000010, "Wrong size on WBP_RenownLevel_C_UpdateRenown");
static_assert(offsetof(WBP_RenownLevel_C_UpdateRenown, CallFunc_GetInfamyManager_ReturnValue) == 0x000000, "Member 'WBP_RenownLevel_C_UpdateRenown::CallFunc_GetInfamyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_UpdateRenown, CallFunc_ClientGetCurrentRenownLevel_ReturnValue) == 0x000008, "Member 'WBP_RenownLevel_C_UpdateRenown::CallFunc_ClientGetCurrentRenownLevel_ReturnValue' has a wrong offset!");

// Function WBP_RenownLevel.WBP_RenownLevel_C.SetRenown
// 0x0004 (0x0004 - 0x0000)
struct WBP_RenownLevel_C_SetRenown final
{
public:
	int32                                         InRenown;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RenownLevel_C_SetRenown) == 0x000004, "Wrong alignment on WBP_RenownLevel_C_SetRenown");
static_assert(sizeof(WBP_RenownLevel_C_SetRenown) == 0x000004, "Wrong size on WBP_RenownLevel_C_SetRenown");
static_assert(offsetof(WBP_RenownLevel_C_SetRenown, InRenown) == 0x000000, "Member 'WBP_RenownLevel_C_SetRenown::InRenown' has a wrong offset!");

// Function WBP_RenownLevel.WBP_RenownLevel_C.OnRenownChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_RenownLevel_C_OnRenownChanged final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousLevel;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RenownLevel_C_OnRenownChanged) == 0x000004, "Wrong alignment on WBP_RenownLevel_C_OnRenownChanged");
static_assert(sizeof(WBP_RenownLevel_C_OnRenownChanged) == 0x000008, "Wrong size on WBP_RenownLevel_C_OnRenownChanged");
static_assert(offsetof(WBP_RenownLevel_C_OnRenownChanged, NewLevel) == 0x000000, "Member 'WBP_RenownLevel_C_OnRenownChanged::NewLevel' has a wrong offset!");
static_assert(offsetof(WBP_RenownLevel_C_OnRenownChanged, PreviousLevel) == 0x000004, "Member 'WBP_RenownLevel_C_OnRenownChanged::PreviousLevel' has a wrong offset!");

}

