#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Preplanning_MainMenu_PlayerReadyStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Preplanning_MainMenu_PlayerReadyStatus.WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C
// 0x0100 (0x04B8 - 0x03B8)
class UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C final : public USBZMainMenuPreplanningPlayerStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_I;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_90;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_343;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_EmptySlot;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_NebulaIcon;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlatformIcon;                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LobbyOwner_T;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Outline_I;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PlatformName_Hb;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PlayerDetails_Vb;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyStatusBg_I;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ReadyStatusLine_I;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SecondaryBackground_I;                             // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_InfamyLevel;                                  // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NebulaPlayerName;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PlatformPlayerName;                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_ReadyStatus;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RenownLevel_C*                     WBP_RenownLevel;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoIP_C*                            WBP_VoIP;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         PlayerIdx;                                         // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasPlayerStatus;                                   // 0x0494(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_495[0x3];                                      // 0x0495(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPlayerStatusRemoved;                             // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(const class FString& PlayerName, bool HasPlayerStatus)> OnPlayerStatusUpdating; // 0x04A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PlayerReadyStatus(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnPlayerStatusRemoved_Event();
	void OnLobbyPlayerStatusUpdated();
	void OnMMStopped(ESBZOnlineCode ErrorCode);
	void OnLobbyUpdate(ESBZOnlineCode ErrorCode);
	void OnLeft();
	void GetLobbyInfo(struct FSBZLobbyCharacterInfoUi* CharacterUIInfo, bool* IsValid);
	void CleanWidget();
	void SetPlayerUIInfo(const struct FSBZLobbyCharacterInfoUi& InCharacter);
	void OnControlsReferencePressed(class FName ActionName);
	void OnFocusedVisuals(bool bIsFocused);
	void RefreshVisual();
	void SetLobbyOwnerVisibility(const class FString& InUserID);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C">();
	}
	static class UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C>();
	}
};
static_assert(alignof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C) == 0x000008, "Wrong alignment on UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C");
static_assert(sizeof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C) == 0x0004B8, "Wrong size on UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, UberGraphFrame) == 0x0003B8, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Background_I) == 0x0003C0, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image) == 0x0003C8, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_1) == 0x0003D0, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_2) == 0x0003D8, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_3) == 0x0003E0, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_4) == 0x0003E8, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_5) == 0x0003F0, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_6) == 0x0003F8, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_90) == 0x000400, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_90' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_343) == 0x000408, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_343' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_EmptySlot) == 0x000410, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_EmptySlot' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_NebulaIcon) == 0x000418, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_NebulaIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Image_PlatformIcon) == 0x000420, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Image_PlatformIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, LobbyOwner_T) == 0x000428, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::LobbyOwner_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Outline_I) == 0x000430, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Outline_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, PlatformName_Hb) == 0x000438, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::PlatformName_Hb' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, PlayerDetails_Vb) == 0x000440, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::PlayerDetails_Vb' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, ReadyStatusBg_I) == 0x000448, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::ReadyStatusBg_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, ReadyStatusLine_I) == 0x000450, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::ReadyStatusLine_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, SecondaryBackground_I) == 0x000458, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::SecondaryBackground_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Text_InfamyLevel) == 0x000460, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Text_InfamyLevel' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Text_NebulaPlayerName) == 0x000468, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Text_NebulaPlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Text_PlatformPlayerName) == 0x000470, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Text_PlatformPlayerName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, Text_ReadyStatus) == 0x000478, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::Text_ReadyStatus' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, WBP_RenownLevel) == 0x000480, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::WBP_RenownLevel' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, WBP_VoIP) == 0x000488, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::WBP_VoIP' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, PlayerIdx) == 0x000490, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::PlayerIdx' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, HasPlayerStatus) == 0x000494, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::HasPlayerStatus' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, OnPlayerStatusRemoved) == 0x000498, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::OnPlayerStatusRemoved' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C, OnPlayerStatusUpdating) == 0x0004A8, "Member 'UWBP_UI_Preplanning_MainMenu_PlayerReadyStatus_C::OnPlayerStatusUpdating' has a wrong offset!");

}

