#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_BaseGroupedCounters_RinoHud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_BaseGroupedCounters_RinoHud.WBP_UI_Widget_BaseGroupedCounters_RinoHud_C
// 0x0100 (0x0390 - 0x0290)
class UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Items;                                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseCounter_RinoHud_C*   WBP_UI_Widget_BaseCounter_RinoHud;                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bAutoVisibility;                                   // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            bLogoBrush;                                        // 0x02B0(0x0090)(Edit, BlueprintVisible)
	TSet<class USBZWidgetBase*>                   bAddedWidgets;                                     // 0x0340(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	struct FSlateBrush _GetLogoBrush();
	void AddWidget(class USBZWidgetBase*& Widget);
	void RemoveWidget(class USBZWidgetBase*& Widget);
	void _HandleVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_BaseGroupedCounters_RinoHud_C">();
	}
	static class UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C");
static_assert(sizeof(UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C) == 0x000390, "Wrong size on UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C");
static_assert(offsetof(UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C, Items) == 0x000298, "Member 'UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C::Items' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C, WBP_UI_Widget_BaseCounter_RinoHud) == 0x0002A0, "Member 'UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C::WBP_UI_Widget_BaseCounter_RinoHud' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C, bAutoVisibility) == 0x0002A8, "Member 'UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C::bAutoVisibility' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C, bLogoBrush) == 0x0002B0, "Member 'UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C::bLogoBrush' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C, bAddedWidgets) == 0x000340, "Member 'UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C::bAddedWidgets' has a wrong offset!");

}

