#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SideBarNotification

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_SideBarNotification.WBP_UI_SideBarNotification_C
// 0x0060 (0x0318 - 0x02B8)
class UWBP_UI_SideBarNotification_C final : public USBZSideBarNotifications
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Animation_SwitchNotification;                      // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               Icon_Overlay;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_155;                                         // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Header;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextParagraph;                                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text_1;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text_2;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TinyTop_Text_3;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          WBP_InventoryBaseData_Icon;                        // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_SideBarNotification(int32 EntryPoint);
	void OnNotificationDisplayed(const struct FSBZSideBarNotificationData& InNotificationToDisplay);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_SideBarNotification_C">();
	}
	static class UWBP_UI_SideBarNotification_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_SideBarNotification_C>();
	}
};
static_assert(alignof(UWBP_UI_SideBarNotification_C) == 0x000008, "Wrong alignment on UWBP_UI_SideBarNotification_C");
static_assert(sizeof(UWBP_UI_SideBarNotification_C) == 0x000318, "Wrong size on UWBP_UI_SideBarNotification_C");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_UI_SideBarNotification_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, Animation_SwitchNotification) == 0x0002C0, "Member 'UWBP_UI_SideBarNotification_C::Animation_SwitchNotification' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, Icon_Overlay) == 0x0002C8, "Member 'UWBP_UI_SideBarNotification_C::Icon_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, Image_155) == 0x0002D0, "Member 'UWBP_UI_SideBarNotification_C::Image_155' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, Image_Background) == 0x0002D8, "Member 'UWBP_UI_SideBarNotification_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, Text_Header) == 0x0002E0, "Member 'UWBP_UI_SideBarNotification_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, TextParagraph) == 0x0002E8, "Member 'UWBP_UI_SideBarNotification_C::TextParagraph' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, TinyTop_Text) == 0x0002F0, "Member 'UWBP_UI_SideBarNotification_C::TinyTop_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, TinyTop_Text_1) == 0x0002F8, "Member 'UWBP_UI_SideBarNotification_C::TinyTop_Text_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, TinyTop_Text_2) == 0x000300, "Member 'UWBP_UI_SideBarNotification_C::TinyTop_Text_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, TinyTop_Text_3) == 0x000308, "Member 'UWBP_UI_SideBarNotification_C::TinyTop_Text_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SideBarNotification_C, WBP_InventoryBaseData_Icon) == 0x000310, "Member 'UWBP_UI_SideBarNotification_C::WBP_InventoryBaseData_Icon' has a wrong offset!");

}

