#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PocketDrillWidget

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_PocketDrillWidget.WBP_PocketDrillWidget_C.ExecuteUbergraph_WBP_PocketDrillWidget
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZBreachingEquipmentState                   Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0068(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0080(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00B0(0x0018)()
	ESBZBreachingEquipmentState                   K2Node_Event_NewState;                             // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x00D0(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget) == 0x000008, "Wrong alignment on WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget");
static_assert(sizeof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget) == 0x0000F0, "Wrong size on WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, EntryPoint) == 0x000000, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, Temp_byte_Variable) == 0x000004, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, Temp_text_Variable) == 0x000008, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, Temp_text_Variable_1) == 0x000020, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, Temp_text_Variable_2) == 0x000038, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, Temp_text_Variable_3) == 0x000050, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, Temp_text_Variable_4) == 0x000068, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, Temp_text_Variable_5) == 0x000080, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::Temp_text_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, Temp_text_Variable_6) == 0x000098, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::Temp_text_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, Temp_text_Variable_7) == 0x0000B0, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::Temp_text_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, K2Node_Event_NewState) == 0x0000C8, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C9, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, K2Node_Select_Default) == 0x0000D0, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0000E8, "Member 'WBP_PocketDrillWidget_C_ExecuteUbergraph_WBP_PocketDrillWidget::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");

// Function WBP_PocketDrillWidget.WBP_PocketDrillWidget_C.OnUpdateBreachState
// 0x0001 (0x0001 - 0x0000)
struct WBP_PocketDrillWidget_C_OnUpdateBreachState final
{
public:
	ESBZBreachingEquipmentState                   NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PocketDrillWidget_C_OnUpdateBreachState) == 0x000001, "Wrong alignment on WBP_PocketDrillWidget_C_OnUpdateBreachState");
static_assert(sizeof(WBP_PocketDrillWidget_C_OnUpdateBreachState) == 0x000001, "Wrong size on WBP_PocketDrillWidget_C_OnUpdateBreachState");
static_assert(offsetof(WBP_PocketDrillWidget_C_OnUpdateBreachState, NewState) == 0x000000, "Member 'WBP_PocketDrillWidget_C_OnUpdateBreachState::NewState' has a wrong offset!");

}

