#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_BaseGroupedCounters_RinoHud

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_BaseGroupedCounters_RinoHud.WBP_UI_Widget_BaseGroupedCounters_RinoHud_C.ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud) == 0x000004, "Wrong alignment on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud");
static_assert(sizeof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud) == 0x000008, "Wrong size on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseGroupedCounters_RinoHud::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_BaseGroupedCounters_RinoHud.WBP_UI_Widget_BaseGroupedCounters_RinoHud_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_BaseGroupedCounters_RinoHud.WBP_UI_Widget_BaseGroupedCounters_RinoHud_C._GetLogoBrush
// 0x0090 (0x0090 - 0x0000)
struct WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__GetLogoBrush final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0090)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__GetLogoBrush) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__GetLogoBrush");
static_assert(sizeof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__GetLogoBrush) == 0x000090, "Wrong size on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__GetLogoBrush");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__GetLogoBrush, ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__GetLogoBrush::ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_BaseGroupedCounters_RinoHud.WBP_UI_Widget_BaseGroupedCounters_RinoHud_C.AddWidget
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget final
{
public:
	class USBZWidgetBase*                         Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget");
static_assert(sizeof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget) == 0x000020, "Wrong size on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget, Widget) == 0x000000, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget, K2Node_MakeStruct_Margin) == 0x000008, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000018, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_AddWidget::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_BaseGroupedCounters_RinoHud.WBP_UI_Widget_BaseGroupedCounters_RinoHud_C.RemoveWidget
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_RemoveWidget final
{
public:
	class USBZWidgetBase*                         Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, InstancedReference, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_RemoveWidget) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_RemoveWidget");
static_assert(sizeof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_RemoveWidget) == 0x000010, "Wrong size on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_RemoveWidget");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_RemoveWidget, Widget) == 0x000000, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_RemoveWidget::Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_RemoveWidget, CallFunc_Set_Remove_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C_RemoveWidget::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_BaseGroupedCounters_RinoHud.WBP_UI_Widget_BaseGroupedCounters_RinoHud_C._HandleVisibility
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Set_Length_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility) == 0x000004, "Wrong alignment on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility");
static_assert(sizeof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility) == 0x00000C, "Wrong size on WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility, CallFunc_Set_Length_ReturnValue) == 0x000004, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility::CallFunc_Set_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility, K2Node_Select_Default) == 0x000009, "Member 'WBP_UI_Widget_BaseGroupedCounters_RinoHud_C__HandleVisibility::K2Node_Select_Default' has a wrong offset!");

}

