#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_NavBar

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_NavBar.WBP_UI_NavBar_C
// 0x0030 (0x0300 - 0x02D0)
class UWBP_UI_NavBar_C final : public USBZMenuNavBar
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_I;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_end_line;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_end_line;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      Widget_TabBackward_Hold;                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_Hold_C*      Widget_TabForward_Hold;                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_NavBar(int32 EntryPoint);
	void OnStackChanged(const struct FSBZUIStackChangedEvent& StackEvent);
	void OnInitialized();
	void OnTabbedBackward();
	void OnTabbedForward();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_NavBar_C">();
	}
	static class UWBP_UI_NavBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_NavBar_C>();
	}
};
static_assert(alignof(UWBP_UI_NavBar_C) == 0x000008, "Wrong alignment on UWBP_UI_NavBar_C");
static_assert(sizeof(UWBP_UI_NavBar_C) == 0x000300, "Wrong size on UWBP_UI_NavBar_C");
static_assert(offsetof(UWBP_UI_NavBar_C, UberGraphFrame) == 0x0002D0, "Member 'UWBP_UI_NavBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_NavBar_C, Background_I) == 0x0002D8, "Member 'UWBP_UI_NavBar_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_NavBar_C, Left_end_line) == 0x0002E0, "Member 'UWBP_UI_NavBar_C::Left_end_line' has a wrong offset!");
static_assert(offsetof(UWBP_UI_NavBar_C, Right_end_line) == 0x0002E8, "Member 'UWBP_UI_NavBar_C::Right_end_line' has a wrong offset!");
static_assert(offsetof(UWBP_UI_NavBar_C, Widget_TabBackward_Hold) == 0x0002F0, "Member 'UWBP_UI_NavBar_C::Widget_TabBackward_Hold' has a wrong offset!");
static_assert(offsetof(UWBP_UI_NavBar_C, Widget_TabForward_Hold) == 0x0002F8, "Member 'UWBP_UI_NavBar_C::Widget_TabForward_Hold' has a wrong offset!");

}

