#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KeypadUVLightInteraction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "E_CodeGuessedStatus_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KeypadUVLightInteraction.WBP_KeypadUVLightInteraction_C
// 0x0070 (0x0300 - 0x0290)
class UWBP_KeypadUVLightInteraction_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_83;                                         // 0x0298(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_0;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_2;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_3;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_4;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_5;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_6;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_7;                                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_8;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_9;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CodeText;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ABP_KeyPad_C*                           Keypad;                                            // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_KeypadUVLightInteraction(int32 EntryPoint);
	void SetKeypad(class ABP_KeyPad_C* Keypad_0);
	class FText Get_CodeText_Text_0();
	struct FLinearColor GetBrushColor_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_KeypadUVLightInteraction_C">();
	}
	static class UWBP_KeypadUVLightInteraction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KeypadUVLightInteraction_C>();
	}
};
static_assert(alignof(UWBP_KeypadUVLightInteraction_C) == 0x000008, "Wrong alignment on UWBP_KeypadUVLightInteraction_C");
static_assert(sizeof(UWBP_KeypadUVLightInteraction_C) == 0x000300, "Wrong size on UWBP_KeypadUVLightInteraction_C");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, UberGraphFrame) == 0x000290, "Member 'UWBP_KeypadUVLightInteraction_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Border_83) == 0x000298, "Member 'UWBP_KeypadUVLightInteraction_C::Border_83' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_0) == 0x0002A0, "Member 'UWBP_KeypadUVLightInteraction_C::Button_0' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_1) == 0x0002A8, "Member 'UWBP_KeypadUVLightInteraction_C::Button_1' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_2) == 0x0002B0, "Member 'UWBP_KeypadUVLightInteraction_C::Button_2' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_3) == 0x0002B8, "Member 'UWBP_KeypadUVLightInteraction_C::Button_3' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_4) == 0x0002C0, "Member 'UWBP_KeypadUVLightInteraction_C::Button_4' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_5) == 0x0002C8, "Member 'UWBP_KeypadUVLightInteraction_C::Button_5' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_6) == 0x0002D0, "Member 'UWBP_KeypadUVLightInteraction_C::Button_6' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_7) == 0x0002D8, "Member 'UWBP_KeypadUVLightInteraction_C::Button_7' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_8) == 0x0002E0, "Member 'UWBP_KeypadUVLightInteraction_C::Button_8' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Button_9) == 0x0002E8, "Member 'UWBP_KeypadUVLightInteraction_C::Button_9' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, CodeText) == 0x0002F0, "Member 'UWBP_KeypadUVLightInteraction_C::CodeText' has a wrong offset!");
static_assert(offsetof(UWBP_KeypadUVLightInteraction_C, Keypad) == 0x0002F8, "Member 'UWBP_KeypadUVLightInteraction_C::Keypad' has a wrong offset!");

}

