#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_PagerWidget_RinoHud

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_PagerWidget_RinoHud.WBP_UI_PagerWidget_RinoHud_C.ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_AnswerPagerValue;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MaxAnswerPagerValue;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                K2Node_Event_NewState;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud) == 0x000004, "Wrong alignment on WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud");
static_assert(sizeof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud) == 0x000018, "Wrong size on WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud, EntryPoint) == 0x000000, "Member 'WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud, K2Node_Event_AnswerPagerValue) == 0x000004, "Member 'WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud::K2Node_Event_AnswerPagerValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud, K2Node_Event_MaxAnswerPagerValue) == 0x000008, "Member 'WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud::K2Node_Event_MaxAnswerPagerValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud, K2Node_Event_NewState) == 0x00000C, "Member 'WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud::K2Node_Event_NewState' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud, CallFunc_Subtract_IntInt_ReturnValue) == 0x000010, "Member 'WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000015, "Member 'WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud, CallFunc_BooleanOR_ReturnValue) == 0x000016, "Member 'WBP_UI_PagerWidget_RinoHud_C_ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_UI_PagerWidget_RinoHud.WBP_UI_PagerWidget_RinoHud_C.OnHeistStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_PagerWidget_RinoHud_C_OnHeistStateChanged final
{
public:
	EPD3HeistState                                NewState;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_PagerWidget_RinoHud_C_OnHeistStateChanged) == 0x000001, "Wrong alignment on WBP_UI_PagerWidget_RinoHud_C_OnHeistStateChanged");
static_assert(sizeof(WBP_UI_PagerWidget_RinoHud_C_OnHeistStateChanged) == 0x000001, "Wrong size on WBP_UI_PagerWidget_RinoHud_C_OnHeistStateChanged");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_OnHeistStateChanged, NewState) == 0x000000, "Member 'WBP_UI_PagerWidget_RinoHud_C_OnHeistStateChanged::NewState' has a wrong offset!");

// Function WBP_UI_PagerWidget_RinoHud.WBP_UI_PagerWidget_RinoHud_C.OnAnswerPagerValueChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_PagerWidget_RinoHud_C_OnAnswerPagerValueChanged final
{
public:
	int32                                         AnswerPagerValue;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAnswerPagerValue;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_PagerWidget_RinoHud_C_OnAnswerPagerValueChanged) == 0x000004, "Wrong alignment on WBP_UI_PagerWidget_RinoHud_C_OnAnswerPagerValueChanged");
static_assert(sizeof(WBP_UI_PagerWidget_RinoHud_C_OnAnswerPagerValueChanged) == 0x000008, "Wrong size on WBP_UI_PagerWidget_RinoHud_C_OnAnswerPagerValueChanged");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_OnAnswerPagerValueChanged, AnswerPagerValue) == 0x000000, "Member 'WBP_UI_PagerWidget_RinoHud_C_OnAnswerPagerValueChanged::AnswerPagerValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_OnAnswerPagerValueChanged, MaxAnswerPagerValue) == 0x000004, "Member 'WBP_UI_PagerWidget_RinoHud_C_OnAnswerPagerValueChanged::MaxAnswerPagerValue' has a wrong offset!");

// Function WBP_UI_PagerWidget_RinoHud.WBP_UI_PagerWidget_RinoHud_C.Update Pager Color
// 0x0088 (0x0088 - 0x0000)
struct WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color final
{
public:
	class UWBP_UI_Widget_BaseCounter_RinoHud_C*   CounterWidget;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RemaingPagers;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0038(0x0028)()
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0060(0x0028)()
};
static_assert(alignof(WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color) == 0x000008, "Wrong alignment on WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color");
static_assert(sizeof(WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color) == 0x000088, "Wrong size on WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color, CounterWidget) == 0x000000, "Member 'WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color::CounterWidget' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color, RemaingPagers) == 0x000008, "Member 'WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color::RemaingPagers' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color, Temp_bool_Variable) == 0x00000C, "Member 'WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00000D, "Member 'WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color, K2Node_MakeStruct_SlateColor) == 0x000010, "Member 'WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color, K2Node_MakeStruct_SlateColor_1) == 0x000038, "Member 'WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color, K2Node_Select_Default) == 0x000060, "Member 'WBP_UI_PagerWidget_RinoHud_C_Update_Pager_Color::K2Node_Select_Default' has a wrong offset!");

}

