#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_Objective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_Objective.WBP_UI_Widget_Objective_C
// 0x0128 (0x0420 - 0x02F8)
class UWBP_UI_Widget_Objective_C final : public USBZObjectiveWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnSabotageTickingLoot;                             // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TickingLootPulsate;                                // 0x0308(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnFinishedAnimation_2;                             // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnFinishedAnimation;                               // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               BlurredDollarsCounterBackground;                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Border_I;                                          // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Dollar00_T;                                        // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Dollar01_T;                                        // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Dollar02_T;                                        // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Dollar03_T;                                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DollarIcon_I;                                      // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DollarPrefix_T;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ObjectiveIcon_WS;                                  // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SlantedObjectiveRect_I;                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        TickingLootIcon_WS;                                // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            IncreasingColor;                                   // 0x0380(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DecreasingColor;                                   // 0x03A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            SabotagedColor;                                    // 0x03D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NotTickingColor;                                   // 0x03F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_UI_Widget_Objective(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnObjectiveInitialized(class ASBZObjective* ObjectiveInit, bool bIsSubObjective);
	void OnTickingTypeChanged(ESBZTickingLootType InTickingLootType);
	void ObjectiveActivated(class ASBZObjective* NewObjectiveActivated);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnObjectiveRemoved();
	void UpdateTickingLootType(ESBZTickingLootType InType);
	void InitTickingLootVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_Objective_C">();
	}
	static class UWBP_UI_Widget_Objective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_Objective_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_Objective_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_Objective_C");
static_assert(sizeof(UWBP_UI_Widget_Objective_C) == 0x000420, "Wrong size on UWBP_UI_Widget_Objective_C");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_UI_Widget_Objective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, OnSabotageTickingLoot) == 0x000300, "Member 'UWBP_UI_Widget_Objective_C::OnSabotageTickingLoot' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, TickingLootPulsate) == 0x000308, "Member 'UWBP_UI_Widget_Objective_C::TickingLootPulsate' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, OnFinishedAnimation_2) == 0x000310, "Member 'UWBP_UI_Widget_Objective_C::OnFinishedAnimation_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, OnFinishedAnimation) == 0x000318, "Member 'UWBP_UI_Widget_Objective_C::OnFinishedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, Background_I) == 0x000320, "Member 'UWBP_UI_Widget_Objective_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, BlurredDollarsCounterBackground) == 0x000328, "Member 'UWBP_UI_Widget_Objective_C::BlurredDollarsCounterBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, Border_I) == 0x000330, "Member 'UWBP_UI_Widget_Objective_C::Border_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, Dollar00_T) == 0x000338, "Member 'UWBP_UI_Widget_Objective_C::Dollar00_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, Dollar01_T) == 0x000340, "Member 'UWBP_UI_Widget_Objective_C::Dollar01_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, Dollar02_T) == 0x000348, "Member 'UWBP_UI_Widget_Objective_C::Dollar02_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, Dollar03_T) == 0x000350, "Member 'UWBP_UI_Widget_Objective_C::Dollar03_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, DollarIcon_I) == 0x000358, "Member 'UWBP_UI_Widget_Objective_C::DollarIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, DollarPrefix_T) == 0x000360, "Member 'UWBP_UI_Widget_Objective_C::DollarPrefix_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, ObjectiveIcon_WS) == 0x000368, "Member 'UWBP_UI_Widget_Objective_C::ObjectiveIcon_WS' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, SlantedObjectiveRect_I) == 0x000370, "Member 'UWBP_UI_Widget_Objective_C::SlantedObjectiveRect_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, TickingLootIcon_WS) == 0x000378, "Member 'UWBP_UI_Widget_Objective_C::TickingLootIcon_WS' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, IncreasingColor) == 0x000380, "Member 'UWBP_UI_Widget_Objective_C::IncreasingColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, DecreasingColor) == 0x0003A8, "Member 'UWBP_UI_Widget_Objective_C::DecreasingColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, SabotagedColor) == 0x0003D0, "Member 'UWBP_UI_Widget_Objective_C::SabotagedColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Objective_C, NotTickingColor) == 0x0003F8, "Member 'UWBP_UI_Widget_Objective_C::NotTickingColor' has a wrong offset!");

}

