#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_InventoryScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SM_InventoryScreen.WBP_UI_SM_InventoryScreen_C.ExecuteUbergraph_WBP_UI_SM_InventoryScreen
// 0x0858 (0x0858 - 0x0000)
struct WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue; // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget;          // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisplayItemInventoryScreen_ReturnValue;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_1;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_1; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_11;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFocused;             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZInventoryEquipmentType                    K2Node_ComponentBoundEvent_ButtonType;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisplayItemInventoryScreen_ReturnValue_1; // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B[0x5];                                       // 0x006B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_2; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_2;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisplaySkillsSelection_ReturnValue;       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_92[0x2];                                       // 0x0092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_3; // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0098(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InActionInput;                  // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_4; // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x00D8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x00F0(0x0030)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_10;              // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_5;           // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue;  // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x2];                                      // 0x012A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x012C(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0140(0x0030)()
	bool                                          CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue_1; // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0180(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_3;              // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x01A0(0x0030)()
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_3;        // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisplayItemInventoryScreen_ReturnValue_2; // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x6];                                      // 0x01DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_4;               // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZLoadoutManager*                     CallFunc_GetLoadoutManager_ReturnValue;            // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZPlayerLoadoutConfig>        CallFunc_GetPlayerLoadouts_ReturnValue;            // 0x0200(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0210(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x0228(0x0030)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_5;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_6;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_4;              // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_4;        // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_5; // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData_4;       // 0x02A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisplayItemInventoryScreen_ReturnValue_3; // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x7];                                      // 0x02A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_7;               // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_9;               // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_8;               // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_4;           // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x02E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_3;           // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x0300(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_8;               // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_5;            // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0330(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x033C(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_4;     // 0x0350(0x0030)()
	class USBZLoadoutManager*                     CallFunc_GetLoadoutManager_ReturnValue_1;          // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0388(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_6; // 0x039C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_5;     // 0x03A0(0x0030)()
	struct FSBZPlayerLoadoutConfig                K2Node_ComponentBoundEvent_PlayerLoadout;          // 0x03D0(0x0098)(ConstParm)
	int32                                         K2Node_ComponentBoundEvent_PlayerLoadoutIndex;     // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0470(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZMetaRequestResult                         CallFunc_SetActiveLoadoutIndex_ReturnValue;        // 0x0479(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47A[0x6];                                      // 0x047A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_9;               // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0488(0x0018)()
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_5;              // 0x04A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_5;        // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x7];                                      // 0x04B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData_3;       // 0x04B8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData_2;       // 0x04C0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x04C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x04D4(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_6;     // 0x04E8(0x0030)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0518(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData_1;       // 0x0520(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_7;     // 0x0528(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0558(0x0010)(ReferenceParm)
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_7; // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C[0x4];                                      // 0x056C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0570(0x0028)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_8;     // 0x0598(0x0030)()
	class FName                                   K2Node_Event_PreviousValue;                        // 0x05C8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x05D8(0x0010)(ReferenceParm)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_9;     // 0x05E8(0x0030)()
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x0618(0x0028)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_2;                          // 0x0640(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_2;    // 0x0650(0x0028)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_10;    // 0x0678(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_3;                          // 0x06A8(0x0010)(ReferenceParm)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_11;    // 0x06B8(0x0030)()
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_3;    // 0x06E8(0x0028)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_4;                          // 0x0710(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_4;    // 0x0720(0x0028)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_12;    // 0x0748(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_5;                          // 0x0778(0x0010)(ReferenceParm)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_13;    // 0x0788(0x0030)()
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_5;    // 0x07B8(0x0028)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_6;                          // 0x07E0(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_6;    // 0x07F0(0x0028)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_10;              // 0x0818(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_6;            // 0x0820(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActivePlayerLoadoutIndex_ReturnValue;  // 0x082C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData;         // 0x0830(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZEquippableLoadoutSlot                     K2Node_ComponentBoundEvent_EquippableSlot;         // 0x0839(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_83A[0x2];                                      // 0x083A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_ActiveWeaponIndex;      // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisplayWeaponInventoryScreen_ReturnValue; // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_11;              // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen) == 0x000008, "Wrong alignment on WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen");
static_assert(sizeof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen) == 0x000858, "Wrong size on WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue) == 0x000010, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetMenuWidget_ReturnValue) == 0x000018, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue) == 0x000020, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget) == 0x000028, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue_1) == 0x000038, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_DisplayItemInventoryScreen_ReturnValue) == 0x000040, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_DisplayItemInventoryScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetMenuWidget_ReturnValue_1) == 0x000048, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetMenuWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget_1) == 0x000050, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_1) == 0x00005C, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_11) == 0x000060, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_11' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_bIsFocused) == 0x000068, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_ButtonType) == 0x000069, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_ButtonType' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_DisplayItemInventoryScreen_ReturnValue_1) == 0x00006A, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_DisplayItemInventoryScreen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue_2) == 0x000070, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetMenuWidget_ReturnValue_2) == 0x000078, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetMenuWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_2) == 0x000080, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget_2) == 0x000088, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_DisplaySkillsSelection_ReturnValue) == 0x000091, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_DisplaySkillsSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_3) == 0x000094, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Text) == 0x000098, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_Conv_TextToString_ReturnValue) == 0x0000B0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_CustomEvent_InActionInput) == 0x0000C0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_CustomEvent_InActionInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_SwitchName_CmpSuccess) == 0x0000CC, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_4) == 0x0000D0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_IsValid_ReturnValue) == 0x0000D4, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_CreateDelegate_OutputDelegate) == 0x0000D8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeStruct_SBZButtonControlReference) == 0x0000F0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_10) == 0x000120, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled_5) == 0x000128, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue) == 0x000129, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x00012C, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000140, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue_1) == 0x000170, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_NewIndex) == 0x000174, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue_3) == 0x000178, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000180, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetMenuWidget_ReturnValue_3) == 0x000198, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetMenuWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x0001A0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget_3) == 0x0001D0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_bSuccess_3) == 0x0001D8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_DisplayItemInventoryScreen_ReturnValue_2) == 0x0001D9, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_DisplayItemInventoryScreen_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue_4) == 0x0001E0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0001E8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetLoadoutManager_ReturnValue) == 0x0001F8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetLoadoutManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetPlayerLoadouts_ReturnValue) == 0x000200, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetPlayerLoadouts_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x000210, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x000228, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue_5) == 0x000258, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000260, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000270, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetCustomizationManager_ReturnValue) == 0x000278, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue_6) == 0x000280, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetMenuWidget_ReturnValue_4) == 0x000288, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetMenuWidget_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget_4) == 0x000290, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_bSuccess_4) == 0x000298, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_5) == 0x00029C, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_ActiveItemData_4) == 0x0002A0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_ActiveItemData_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_DisplayItemInventoryScreen_ReturnValue_3) == 0x0002A8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_DisplayItemInventoryScreen_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue_7) == 0x0002B0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_MakeLiteralName_ReturnValue_3) == 0x0002B8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_9) == 0x0002C8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_8) == 0x0002D0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled_4) == 0x0002D8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_7) == 0x0002E0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_6) == 0x0002E8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled_3) == 0x0002F0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_5) == 0x0002F8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_MakeLiteralName_ReturnValue_4) == 0x000300, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_MakeLiteralName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_4) == 0x000310, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue_8) == 0x000318, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_MakeLiteralName_ReturnValue_5) == 0x000320, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_MakeLiteralName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_3) == 0x000330, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x000338, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_CreateDelegate_OutputDelegate_4) == 0x00033C, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_4) == 0x000350, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetLoadoutManager_ReturnValue_1) == 0x000380, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetLoadoutManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_CreateDelegate_OutputDelegate_5) == 0x000388, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_6) == 0x00039C, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_5) == 0x0003A0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_PlayerLoadout) == 0x0003D0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_PlayerLoadout' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_PlayerLoadoutIndex) == 0x000468, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_PlayerLoadoutIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_2) == 0x000470, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000478, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_SetActiveLoadoutIndex_ReturnValue) == 0x000479, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_SetActiveLoadoutIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetUIManager_ReturnValue_9) == 0x000480, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetUIManager_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_Conv_StringToText_ReturnValue) == 0x000488, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetMenuWidget_ReturnValue_5) == 0x0004A0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetMenuWidget_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget_5) == 0x0004A8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_DynamicCast_bSuccess_5) == 0x0004B0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_ActiveItemData_3) == 0x0004B8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_ActiveItemData_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_ActiveItemData_2) == 0x0004C0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_ActiveItemData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button_1) == 0x0004C8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled) == 0x0004D0, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_CreateDelegate_OutputDelegate_6) == 0x0004D4, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_6) == 0x0004E8, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_Button) == 0x000518, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_ComponentBoundEvent_ActiveItemData_1) == 0x000520, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_ComponentBoundEvent_ActiveItemData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_7) == 0x000528, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeArray_Array) == 0x000558, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_7) == 0x000568, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000570, "Member 'WBP_UI_SM_InventoryScreen_C_ExecuteUbergraph_WBP_UI_SM_InventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
