#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerDecrypter

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerDecrypter.WBP_ServerDecrypter_C
// 0x0038 (0x02C8 - 0x0290)
class UWBP_ServerDecrypter_C final : public UUserWidget
{
public:
	class UProgressBar*                           DecryptingPros;                                    // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             desc_text_1;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_108;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             sub_text;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void setText(const class FText& top, const class FText& bottom);
	void setMachineRunning(bool State);
	void setProgress(float progress);
	void setProgressbarVisibility(bool visible);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerDecrypter_C">();
	}
	static class UWBP_ServerDecrypter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerDecrypter_C>();
	}
};
static_assert(alignof(UWBP_ServerDecrypter_C) == 0x000008, "Wrong alignment on UWBP_ServerDecrypter_C");
static_assert(sizeof(UWBP_ServerDecrypter_C) == 0x0002C8, "Wrong size on UWBP_ServerDecrypter_C");
static_assert(offsetof(UWBP_ServerDecrypter_C, DecryptingPros) == 0x000290, "Member 'UWBP_ServerDecrypter_C::DecryptingPros' has a wrong offset!");
static_assert(offsetof(UWBP_ServerDecrypter_C, desc_text_1) == 0x000298, "Member 'UWBP_ServerDecrypter_C::desc_text_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServerDecrypter_C, Image_1) == 0x0002A0, "Member 'UWBP_ServerDecrypter_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_ServerDecrypter_C, Image_2) == 0x0002A8, "Member 'UWBP_ServerDecrypter_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_ServerDecrypter_C, Image_3) == 0x0002B0, "Member 'UWBP_ServerDecrypter_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_ServerDecrypter_C, Image_108) == 0x0002B8, "Member 'UWBP_ServerDecrypter_C::Image_108' has a wrong offset!");
static_assert(offsetof(UWBP_ServerDecrypter_C, sub_text) == 0x0002C0, "Member 'UWBP_ServerDecrypter_C::sub_text' has a wrong offset!");

}

