#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_StoreItemButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_StoreItemButton.WBP_UI_MainMenu_StoreItemButton_C
// 0x0178 (0x05F0 - 0x0478)
class UWBP_UI_MainMenu_StoreItemButton_C final : public USBZBlackMarketStoreItemButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disabled_Hover;                                    // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Locked_A;                                          // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchasing_A;                                      // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DefaultPrice_T;                                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_CurrencyWidget_C*           DiscountedPriceCurrency;                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_123;                                         // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_212;                                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ItemCost_WS;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          ItemIcon;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ItemName_T;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               ItemType_O_1;                                      // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ItemType_T;                                        // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedIcon_I;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        LockedStatus_T;                                    // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MaskOfTheWeek;                                     // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MotwBg_I;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 OverlayBKG_I;                                      // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        PurchaseInfo_WS;                                   // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_CurrencyWidget_C*           StandardPrice;                                     // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Transaction_O;                                     // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TransactionProgress_T;                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHasDisplayTextData;                               // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstance*                      DefaultOutline;                                    // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      SelectedOutline;                                   // 0x05A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                      InactiveOutline;                                   // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         ButtonBackgroundDefault;                           // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         ButtonBackgroundInactive;                          // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         ButtonBackgroundSelected;                          // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         DefaultTextColor;                                  // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         LockedTextColor;                                   // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconDisabledOpacity;                               // 0x05E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IconDefaultOpacity;                                // 0x05E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasFocus;                                          // 0x05E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsMaskOfTheWeek;                                   // 0x05E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_StoreItemButton(int32 EntryPoint);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	void DisabledButtonSelected();
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void OnTransactionProgressChanged(bool bInIsTransactionInProgress);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnPlayerStoreItemDataIntialized();
	void PreConstruct(bool IsDesignTime);
	void OnFocusChanged(bool bIsFocused);
	void OnTransactionInProgress(bool bIsTransactionInProgress);
	void SetPrice(int64 Price, ESBZCurrencyCode Currency, int64 DiscountedPrice, int32 DiscountedAmount, int32 DiscountedPercentage);
	void InitializeItemData(class USBZInventoryBaseData* InItemData);
	void OnDisabledChanged(bool bInDisabled);
	void SetDisabled();
	void SetDisabledFocused();
	void SetFocused();
	void SetDefault();
	void Set_New_Visuals(bool Is_Mask_Of_The_Week);
	void SetWeaponType(ESBZItemCategory InItemCategory);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_StoreItemButton_C">();
	}
	static class UWBP_UI_MainMenu_StoreItemButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_StoreItemButton_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_StoreItemButton_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_StoreItemButton_C");
static_assert(sizeof(UWBP_UI_MainMenu_StoreItemButton_C) == 0x0005F0, "Wrong size on UWBP_UI_MainMenu_StoreItemButton_C");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, UberGraphFrame) == 0x000478, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Disabled_Hover) == 0x000480, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Disabled_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, HoverAnim) == 0x000488, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Locked_A) == 0x000490, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Locked_A' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Purchasing_A) == 0x000498, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Purchasing_A' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Border_Highlight) == 0x0004A0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, DefaultPrice_T) == 0x0004A8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::DefaultPrice_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, DiscountedPriceCurrency) == 0x0004B0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::DiscountedPriceCurrency' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image) == 0x0004B8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_1) == 0x0004C0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_2) == 0x0004C8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_3) == 0x0004D0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_4) == 0x0004D8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_5) == 0x0004E0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_6) == 0x0004E8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_7) == 0x0004F0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_8) == 0x0004F8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_8' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_9) == 0x000500, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_9' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_10) == 0x000508, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_123) == 0x000510, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_123' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_212) == 0x000518, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_212' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Image_511) == 0x000520, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, ItemCost_WS) == 0x000528, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::ItemCost_WS' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, ItemIcon) == 0x000530, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, ItemName_T) == 0x000538, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::ItemName_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, ItemType_O_1) == 0x000540, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::ItemType_O_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, ItemType_T) == 0x000548, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::ItemType_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, LockedIcon_I) == 0x000550, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::LockedIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, LockedStatus_T) == 0x000558, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::LockedStatus_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, MaskOfTheWeek) == 0x000560, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::MaskOfTheWeek' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, MotwBg_I) == 0x000568, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::MotwBg_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, OverlayBKG_I) == 0x000570, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::OverlayBKG_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, PurchaseInfo_WS) == 0x000578, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::PurchaseInfo_WS' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, StandardPrice) == 0x000580, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::StandardPrice' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, Transaction_O) == 0x000588, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::Transaction_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, TransactionProgress_T) == 0x000590, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::TransactionProgress_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, bHasDisplayTextData) == 0x000598, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::bHasDisplayTextData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, DefaultOutline) == 0x0005A0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::DefaultOutline' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, SelectedOutline) == 0x0005A8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::SelectedOutline' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, InactiveOutline) == 0x0005B0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::InactiveOutline' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, ButtonBackgroundDefault) == 0x0005B8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::ButtonBackgroundDefault' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, ButtonBackgroundInactive) == 0x0005C0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::ButtonBackgroundInactive' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, ButtonBackgroundSelected) == 0x0005C8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::ButtonBackgroundSelected' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, DefaultTextColor) == 0x0005D0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::DefaultTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, LockedTextColor) == 0x0005D8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::LockedTextColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, IconDisabledOpacity) == 0x0005E0, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::IconDisabledOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, IconDefaultOpacity) == 0x0005E4, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::IconDefaultOpacity' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, HasFocus) == 0x0005E8, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::HasFocus' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_StoreItemButton_C, IsMaskOfTheWeek) == 0x0005E9, "Member 'UWBP_UI_MainMenu_StoreItemButton_C::IsMaskOfTheWeek' has a wrong offset!");

}

