#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_JobOverview_PlayerStatus

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SM_JobOverview_PlayerStatus.WBP_UI_SM_JobOverview_PlayerStatus_C.ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus
// 0x0268 (0x0268 - 0x0000)
struct WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPlayerReadyStatusValue                       Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerReadyInfo                    K2Node_Event_InPlayerReadyInfo;                    // 0x0008(0x0098)(ConstParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00F0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0108(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0128(0x0018)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           CallFunc_GetSpriteForNebula_ReturnValue;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           CallFunc_GetSpriteForPlatform_ReturnValue;         // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0160(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0178(0x0018)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable_2;                              // 0x0198(0x0018)()
	class FText                                   CallFunc_GetLocalizedPlayerNoName_ReturnValue;     // 0x01B0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x01C8(0x0018)()
	ESBZFirstPartyPlatform                        CallFunc_GetFirstPartyPlatform_ReturnValue;        // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_3;                              // 0x01E8(0x0018)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_4;                              // 0x0208(0x0018)()
	TScriptInterface<class ISlateTextureAtlasInterface> K2Node_Select_Default_1;                     // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	class FText                                   K2Node_Select_Default_2;                           // 0x0230(0x0018)()
	ESBZFirstPartyPlatform                        CallFunc_GetFirstPartyPlatform_ReturnValue_1;      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24A[0x6];                                      // 0x024A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_3;                           // 0x0250(0x0018)()
};
static_assert(alignof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus) == 0x000008, "Wrong alignment on WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus");
static_assert(sizeof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus) == 0x000268, "Wrong size on WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, EntryPoint) == 0x000000, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, Temp_bool_Variable) == 0x000005, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, K2Node_Event_InPlayerReadyInfo) == 0x000008, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::K2Node_Event_InPlayerReadyInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, K2Node_MakeStruct_FormatArgumentData) == 0x0000A0, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, K2Node_MakeArray_Array) == 0x0000E0, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_Conv_StringToText_ReturnValue) == 0x0000F0, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_Format_ReturnValue) == 0x000108, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_TextIsEmpty_ReturnValue) == 0x000120, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000128, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_GetUIManager_ReturnValue) == 0x000140, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, Temp_bool_Variable_2) == 0x000148, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_GetSpriteForNebula_ReturnValue) == 0x000150, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_GetSpriteForNebula_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_GetSpriteForPlatform_ReturnValue) == 0x000158, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_GetSpriteForPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, Temp_text_Variable) == 0x000160, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, Temp_text_Variable_1) == 0x000178, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_GetUIManager_ReturnValue_1) == 0x000190, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, Temp_text_Variable_2) == 0x000198, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_GetLocalizedPlayerNoName_ReturnValue) == 0x0001B0, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_GetLocalizedPlayerNoName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, K2Node_Select_Default) == 0x0001C8, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_GetFirstPartyPlatform_ReturnValue) == 0x0001E0, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_GetFirstPartyPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, Temp_text_Variable_3) == 0x0001E8, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000200, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, Temp_text_Variable_4) == 0x000208, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, K2Node_Select_Default_1) == 0x000220, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, K2Node_Select_Default_2) == 0x000230, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_GetFirstPartyPlatform_ReturnValue_1) == 0x000248, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_GetFirstPartyPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000249, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus, K2Node_Select_Default_3) == 0x000250, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_ExecuteUbergraph_WBP_UI_SM_JobOverview_PlayerStatus::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_UI_SM_JobOverview_PlayerStatus.WBP_UI_SM_JobOverview_PlayerStatus_C.SetPlayerInfo
// 0x0098 (0x0098 - 0x0000)
struct WBP_UI_SM_JobOverview_PlayerStatus_C_SetPlayerInfo final
{
public:
	struct FSBZPlayerReadyInfo                    InPlayerReadyInfo;                                 // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_SM_JobOverview_PlayerStatus_C_SetPlayerInfo) == 0x000008, "Wrong alignment on WBP_UI_SM_JobOverview_PlayerStatus_C_SetPlayerInfo");
static_assert(sizeof(WBP_UI_SM_JobOverview_PlayerStatus_C_SetPlayerInfo) == 0x000098, "Wrong size on WBP_UI_SM_JobOverview_PlayerStatus_C_SetPlayerInfo");
static_assert(offsetof(WBP_UI_SM_JobOverview_PlayerStatus_C_SetPlayerInfo, InPlayerReadyInfo) == 0x000000, "Member 'WBP_UI_SM_JobOverview_PlayerStatus_C_SetPlayerInfo::InPlayerReadyInfo' has a wrong offset!");

}

