#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Skills_Line

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.ExecuteUbergraph_WBP_UI_Skills_Line
// 0x0110 (0x0110 - 0x0000)
struct WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Skills_Button_C*                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Skills_Button_C*                CallFunc_Create_ReturnValue_1;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Index_Variable;                           // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkill*                              CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_1;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue_2;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_CustomEvent_Button;                         // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsEnabled;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class USBZMenuButton* Button, bool bIsEnabled)> K2Node_CreateDelegate_OutputDelegate; // 0x00A4(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_InLanguage;                     // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Step_Size_Variable;                       // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& InLanguage)> K2Node_CreateDelegate_OutputDelegate_2;         // 0x00EC(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0108(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line) == 0x000008, "Wrong alignment on WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line");
static_assert(sizeof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line) == 0x000110, "Wrong size on WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, EntryPoint) == 0x000000, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Less_IntInt_ReturnValue) == 0x000010, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Create_ReturnValue_1) == 0x000018, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, Temp_int_Variable) == 0x000020, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000024, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_Event_IsDesignTime) == 0x00002C, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_IsValid_ReturnValue) == 0x00002D, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Array_LastIndex_ReturnValue) == 0x000030, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Subtract_IntInt_ReturnValue) == 0x000034, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, Temp_int_Index_Variable) == 0x000038, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::Temp_int_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000049, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000050, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_AddChildToHorizontalBox_ReturnValue_1) == 0x000058, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_AddChildToHorizontalBox_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Less_FloatFloat_ReturnValue) == 0x000060, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Array_AddUnique_ReturnValue) == 0x000064, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Array_AddUnique_ReturnValue_1) == 0x000068, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Array_AddUnique_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Array_AddUnique_ReturnValue_2) == 0x00006C, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Array_AddUnique_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_ComponentBoundEvent_Button_1) == 0x000070, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000078, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_ComponentBoundEvent_Button) == 0x000080, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000088, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_CustomEvent_Button) == 0x000090, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_CustomEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_CustomEvent_bIsEnabled) == 0x000098, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_CustomEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Abs_Int_ReturnValue) == 0x00009C, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Max_ReturnValue) == 0x0000A0, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_CreateDelegate_OutputDelegate) == 0x0000A4, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B8, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_GetUIManager_ReturnValue) == 0x0000D0, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_CustomEvent_InLanguage) == 0x0000D8, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_CustomEvent_InLanguage' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, Temp_int_Step_Size_Variable) == 0x0000E8, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::Temp_int_Step_Size_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000EC, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000100, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_Add_IntInt_ReturnValue_1) == 0x000104, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line, CallFunc_K2_SetTimer_ReturnValue) == 0x000108, "Member 'WBP_UI_Skills_Line_C_ExecuteUbergraph_WBP_UI_Skills_Line::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.OnLanguageChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Line_C_OnLanguageChanged final
{
public:
	class FString                                 InLanguage;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Line_C_OnLanguageChanged) == 0x000008, "Wrong alignment on WBP_UI_Skills_Line_C_OnLanguageChanged");
static_assert(sizeof(WBP_UI_Skills_Line_C_OnLanguageChanged) == 0x000010, "Wrong size on WBP_UI_Skills_Line_C_OnLanguageChanged");
static_assert(offsetof(WBP_UI_Skills_Line_C_OnLanguageChanged, InLanguage) == 0x000000, "Member 'WBP_UI_Skills_Line_C_OnLanguageChanged::InLanguage' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.SkillButtonFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Line_C_SkillButtonFocused final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Line_C_SkillButtonFocused) == 0x000008, "Wrong alignment on WBP_UI_Skills_Line_C_SkillButtonFocused");
static_assert(sizeof(WBP_UI_Skills_Line_C_SkillButtonFocused) == 0x000010, "Wrong size on WBP_UI_Skills_Line_C_SkillButtonFocused");
static_assert(offsetof(WBP_UI_Skills_Line_C_SkillButtonFocused, Button) == 0x000000, "Member 'WBP_UI_Skills_Line_C_SkillButtonFocused::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SkillButtonFocused, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Skills_Line_C_SkillButtonFocused::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_MasteryButton_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Skills_Line_C_BndEvt__WBP_UI_Skills_Line_BaseSkillButton_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Line_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Line_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Skills_Line_C_PreConstruct");
static_assert(sizeof(WBP_UI_Skills_Line_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Skills_Line_C_PreConstruct");
static_assert(offsetof(WBP_UI_Skills_Line_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Skills_Line_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.SetSkillLineMainAndMasteryButtons
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons final
{
public:
	class USBZSkillData*                          MasterySkillInfo;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZSkillData*                          BaseSkillInfo;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZSkill*                              CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkill*                              CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZSkill*                              CallFunc_Array_Get_Item_2;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons) == 0x000008, "Wrong alignment on WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons");
static_assert(sizeof(WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons) == 0x000030, "Wrong size on WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons, MasterySkillInfo) == 0x000000, "Member 'WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons::MasterySkillInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons, BaseSkillInfo) == 0x000008, "Member 'WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons::BaseSkillInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons, CallFunc_Array_LastIndex_ReturnValue) == 0x000018, "Member 'WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons, CallFunc_Array_Get_Item_2) == 0x000028, "Member 'WBP_UI_Skills_Line_C_SetSkillLineMainAndMasteryButtons::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.SetResearched
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Line_C_SetResearched final
{
public:
	bool                                          IsResearched;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Line_C_SetResearched) == 0x000001, "Wrong alignment on WBP_UI_Skills_Line_C_SetResearched");
static_assert(sizeof(WBP_UI_Skills_Line_C_SetResearched) == 0x000001, "Wrong size on WBP_UI_Skills_Line_C_SetResearched");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetResearched, IsResearched) == 0x000000, "Member 'WBP_UI_Skills_Line_C_SetResearched::IsResearched' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.WBP_UI_Skills_Line_AutoGenFunc
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Line_C_WBP_UI_Skills_Line_AutoGenFunc final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Line_C_WBP_UI_Skills_Line_AutoGenFunc) == 0x000001, "Wrong alignment on WBP_UI_Skills_Line_C_WBP_UI_Skills_Line_AutoGenFunc");
static_assert(sizeof(WBP_UI_Skills_Line_C_WBP_UI_Skills_Line_AutoGenFunc) == 0x000001, "Wrong size on WBP_UI_Skills_Line_C_WBP_UI_Skills_Line_AutoGenFunc");
static_assert(offsetof(WBP_UI_Skills_Line_C_WBP_UI_Skills_Line_AutoGenFunc, Navigation_0) == 0x000000, "Member 'WBP_UI_Skills_Line_C_WBP_UI_Skills_Line_AutoGenFunc::Navigation_0' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.SetSkillLineDescriptionEnabled
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled final
{
public:
	bool                                          bInFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         InButton;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          WasAlreadyActive;                                  // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled) == 0x000008, "Wrong alignment on WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled");
static_assert(sizeof(WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled) == 0x000018, "Wrong size on WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled, bInFocused) == 0x000000, "Member 'WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled::bInFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled, InButton) == 0x000008, "Member 'WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled::InButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled, WasAlreadyActive) == 0x000010, "Member 'WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled::WasAlreadyActive' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled, Temp_byte_Variable) == 0x000011, "Member 'WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled, Temp_bool_Variable) == 0x000013, "Member 'WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled, K2Node_Select_Default) == 0x000014, "Member 'WBP_UI_Skills_Line_C_SetSkillLineDescriptionEnabled::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.UpdateSkillLineDescription
// 0x0038 (0x0038 - 0x0000)
struct WBP_UI_Skills_Line_C_UpdateSkillLineDescription final
{
public:
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_RegexReplace_ReturnValue;                 // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(WBP_UI_Skills_Line_C_UpdateSkillLineDescription) == 0x000008, "Wrong alignment on WBP_UI_Skills_Line_C_UpdateSkillLineDescription");
static_assert(sizeof(WBP_UI_Skills_Line_C_UpdateSkillLineDescription) == 0x000038, "Wrong size on WBP_UI_Skills_Line_C_UpdateSkillLineDescription");
static_assert(offsetof(WBP_UI_Skills_Line_C_UpdateSkillLineDescription, CallFunc_Conv_TextToString_ReturnValue) == 0x000000, "Member 'WBP_UI_Skills_Line_C_UpdateSkillLineDescription::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_UpdateSkillLineDescription, CallFunc_RegexReplace_ReturnValue) == 0x000010, "Member 'WBP_UI_Skills_Line_C_UpdateSkillLineDescription::CallFunc_RegexReplace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Line_C_UpdateSkillLineDescription, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WBP_UI_Skills_Line_C_UpdateSkillLineDescription::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Line.WBP_UI_Skills_Line_C.CheckLineStillFocused
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Line_C_CheckLineStillFocused final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Line_C_CheckLineStillFocused) == 0x000001, "Wrong alignment on WBP_UI_Skills_Line_C_CheckLineStillFocused");
static_assert(sizeof(WBP_UI_Skills_Line_C_CheckLineStillFocused) == 0x000001, "Wrong size on WBP_UI_Skills_Line_C_CheckLineStillFocused");
static_assert(offsetof(WBP_UI_Skills_Line_C_CheckLineStillFocused, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_UI_Skills_Line_C_CheckLineStillFocused::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

