#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_PagerWidget_RinoHud

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_PagerWidget_RinoHud.WBP_UI_PagerWidget_RinoHud_C
// 0x0018 (0x02A8 - 0x0290)
class UWBP_UI_PagerWidget_RinoHud_C final : public UPD3HUDPagerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_Widget_BaseCounter_RinoHud_C*   WBP_UI_Widget_BaseCounter_Pagers;                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isSearching;                                       // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x3];                                      // 0x02A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         remainingPagers;                                   // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_PagerWidget_RinoHud(int32 EntryPoint);
	void OnHeistStateChanged(EPD3HeistState NewState);
	void OnAnswerPagerValueChanged(int32 AnswerPagerValue, int32 MaxAnswerPagerValue);
	void Update_Pager_Color(class UWBP_UI_Widget_BaseCounter_RinoHud_C* CounterWidget, int32 RemaingPagers);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_PagerWidget_RinoHud_C">();
	}
	static class UWBP_UI_PagerWidget_RinoHud_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_PagerWidget_RinoHud_C>();
	}
};
static_assert(alignof(UWBP_UI_PagerWidget_RinoHud_C) == 0x000008, "Wrong alignment on UWBP_UI_PagerWidget_RinoHud_C");
static_assert(sizeof(UWBP_UI_PagerWidget_RinoHud_C) == 0x0002A8, "Wrong size on UWBP_UI_PagerWidget_RinoHud_C");
static_assert(offsetof(UWBP_UI_PagerWidget_RinoHud_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_PagerWidget_RinoHud_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_RinoHud_C, WBP_UI_Widget_BaseCounter_Pagers) == 0x000298, "Member 'UWBP_UI_PagerWidget_RinoHud_C::WBP_UI_Widget_BaseCounter_Pagers' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_RinoHud_C, isSearching) == 0x0002A0, "Member 'UWBP_UI_PagerWidget_RinoHud_C::isSearching' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_RinoHud_C, remainingPagers) == 0x0002A4, "Member 'UWBP_UI_PagerWidget_RinoHud_C::remainingPagers' has a wrong offset!");

}

