#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_QuickplayPopUp

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp
// 0x01C8 (0x01C8 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameUserSettings*                   CallFunc_GetSBZGameUserSettings_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZOnlineJoinType                            Temp_byte_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZDifficulty                                CallFunc_GetMatchmakingDifficulty_ReturnValue;     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZOnlineJoinType                            Temp_byte_Variable_1;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZOnlineJoinType                            Temp_byte_Variable_2;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZOnlineJoinType                            K2Node_Select_Default;                             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x002C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0050(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0080(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0090(0x0028)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x00C4(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x00D8(0x0030)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x0110(0x0010)(ReferenceParm)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0120(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x0130(0x0028)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TryRemoveFromStack_ReturnValue;           // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZPartyManager*                       CallFunc_GetPartyManager_ReturnValue;              // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZOnlineMatchmakingParams            K2Node_MakeStruct_SBZOnlineMatchmakingParams;      // 0x01A0(0x0028)()
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp) == 0x0001C8, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, EntryPoint) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_GetSBZGameUserSettings_ReturnValue) == 0x000008, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_GetSBZGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, Temp_byte_Variable) == 0x000010, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_GetMatchmakingDifficulty_ReturnValue) == 0x000011, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_GetMatchmakingDifficulty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, Temp_byte_Variable_1) == 0x000012, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, Temp_byte_Variable_2) == 0x000013, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_GetGameStateMachine_ReturnValue) == 0x000018, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_ComponentBoundEvent_NewIndex) == 0x000020, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, Temp_int_Variable) == 0x000024, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_Conv_IntToByte_ReturnValue) == 0x000028, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_GetValidValue_ReturnValue) == 0x000029, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_Select_Default) == 0x00002A, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_Event_PreviousValue) == 0x00002C, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_MakeStruct_SBZButtonControlReference) == 0x000050, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_MakeArray_Array) == 0x000080, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000090, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_ComponentBoundEvent_Button_4) == 0x0000B8, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x0000C0, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000C4, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x0000D8, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_GetUIManager_ReturnValue) == 0x000108, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_MakeArray_Array_1) == 0x000110, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_PopStack_ReturnValue) == 0x000120, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_MakeStruct_SBZButtonControlsReference_1) == 0x000130, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_MakeStruct_SBZButtonControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_PlayAnimation_ReturnValue) == 0x000158, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_GetUIManager_ReturnValue_1) == 0x000160, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_ComponentBoundEvent_Button_3) == 0x000168, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_ComponentBoundEvent_Button_2) == 0x000170, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_ComponentBoundEvent_Button_1) == 0x000178, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000180, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_TryRemoveFromStack_ReturnValue) == 0x000181, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_TryRemoveFromStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_ComponentBoundEvent_Button) == 0x000188, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000190, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, CallFunc_GetPartyManager_ReturnValue) == 0x000198, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::CallFunc_GetPartyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp, K2Node_MakeStruct_SBZOnlineMatchmakingParams) == 0x0001A0, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_ExecuteUbergraph_WBP_UI_MainMenu_QuickplayPopUp::K2Node_MakeStruct_SBZOnlineMatchmakingParams' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonBACK_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_1_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_1_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_1_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_1_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_1_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_1_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_1_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_ButtonReady_1_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_MatchmakeButton_InspectScreen_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_MatchmakeButton_InspectScreen_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_MatchmakeButton_InspectScreen_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_MatchmakeButton_InspectScreen_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_MatchmakeButton_InspectScreen_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_MatchmakeButton_InspectScreen_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_MatchmakeButton_InspectScreen_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_MatchmakeButton_InspectScreen_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_1_SBZOnSelectorOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_1_SBZOnSelectorOptionChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_1_SBZOnSelectorOptionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_1_SBZOnSelectorOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_1_SBZOnSelectorOptionChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_1_SBZOnSelectorOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_1_SBZOnSelectorOptionChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_BndEvt__WBP_UI_MainMenu_QuickplayPopUp_WBP_UI_DifficultySelectorWidget_02_K2Node_ComponentBoundEvent_1_SBZOnSelectorOptionChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.Update Difficulty Visuals
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals final
{
public:
	ESBZDifficulty                                NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0008(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals) == 0x000028, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals, NewParam) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals, CallFunc_Map_Find_Value) == 0x000008, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals, CallFunc_Map_Find_ReturnValue) == 0x000020, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_Update_Difficulty_Visuals::CallFunc_Map_Find_ReturnValue' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.Set Difficulty
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_Set_Difficulty final
{
public:
	ESBZDifficulty                                InDifficulty;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_Set_Difficulty) == 0x000001, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_Set_Difficulty");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_Set_Difficulty) == 0x000002, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_Set_Difficulty");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_Set_Difficulty, InDifficulty) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_Set_Difficulty::InDifficulty' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_Set_Difficulty, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_Set_Difficulty::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.OnControlsReferenceClicked
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0018(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked) == 0x000028, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked, ActionName) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked::ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked, K2Node_SwitchName_CmpSuccess) == 0x00000C, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked, CallFunc_GetUIManager_ReturnValue) == 0x000010, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked, CallFunc_PopStack_ReturnValue) == 0x000018, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_OnControlsReferenceClicked::CallFunc_PopStack_ReturnValue' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.LobbyTypeSelectorNavigateDown
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_LobbyTypeSelectorNavigateDown final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_LobbyTypeSelectorNavigateDown) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_LobbyTypeSelectorNavigateDown");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_LobbyTypeSelectorNavigateDown) == 0x000010, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_LobbyTypeSelectorNavigateDown");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_LobbyTypeSelectorNavigateDown, Navigation_0) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_LobbyTypeSelectorNavigateDown::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_LobbyTypeSelectorNavigateDown, ReturnValue) == 0x000008, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_LobbyTypeSelectorNavigateDown::ReturnValue' has a wrong offset!");

// Function WBP_UI_MainMenu_QuickplayPopUp.WBP_UI_MainMenu_QuickplayPopUp_C.UpdateType
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_MainMenu_QuickplayPopUp_C_UpdateType final
{
public:
	ESBZOnlineJoinType                            InLobbyType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_QuickplayPopUp_C_UpdateType) == 0x000001, "Wrong alignment on WBP_UI_MainMenu_QuickplayPopUp_C_UpdateType");
static_assert(sizeof(WBP_UI_MainMenu_QuickplayPopUp_C_UpdateType) == 0x000001, "Wrong size on WBP_UI_MainMenu_QuickplayPopUp_C_UpdateType");
static_assert(offsetof(WBP_UI_MainMenu_QuickplayPopUp_C_UpdateType, InLobbyType) == 0x000000, "Member 'WBP_UI_MainMenu_QuickplayPopUp_C_UpdateType::InLobbyType' has a wrong offset!");

}

