#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_LoadoutCustomization

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization
// 0x02B0 (0x02B0 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	class ACH_UI_MM_PlayerCharacter_C*            CallFunc_GetActorOfClass_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZEquippableLoadoutSlot                     K2Node_ComponentBoundEvent_EquippableSlot;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_ActiveWeaponIndex;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData_4;       // 0x0040(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData_3;       // 0x0048(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData_2;       // 0x0050(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData_1;       // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget;          // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_1;              // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_2;              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_1;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_2;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_4;               // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsFocused;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZInventoryEquipmentType                    K2Node_ComponentBoundEvent_ButtonType;             // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_3;              // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_3;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_5;               // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0100(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_4;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_4;        // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisplaySkillsSelection_ReturnValue;       // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisplayItemInventoryScreen_ReturnValue;   // 0x0123(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisplayItemInventoryScreen_ReturnValue_1; // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisplayItemInventoryScreen_ReturnValue_2; // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DisplayWeaponInventoryScreen_ReturnValue; // 0x0126(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_127[0x1];                                      // 0x0127(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_6;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InActionInput;                  // 0x0130(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x013C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x014C(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0160(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0190(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x01C0(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x01D8(0x0028)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_7;               // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_5;              // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_5;        // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZInventoryBaseData*            K2Node_ComponentBoundEvent_ActiveItemData;         // 0x0220(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisplayItemInventoryScreen_ReturnValue_3; // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0230(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0270(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0280(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0298(0x0018)()
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization) == 0x000008, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization) == 0x0002B0, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, EntryPoint) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_IsEmpty_ReturnValue) == 0x000010, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetActorOfClass_ReturnValue) == 0x000030, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_EquippableSlot) == 0x000038, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_EquippableSlot' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_ActiveWeaponIndex) == 0x00003C, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_ActiveWeaponIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_ActiveItemData_4) == 0x000040, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_ActiveItemData_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_ActiveItemData_3) == 0x000048, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_ActiveItemData_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_ActiveItemData_2) == 0x000050, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_ActiveItemData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_ActiveItemData_1) == 0x000058, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_ActiveItemData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetUIManager_ReturnValue) == 0x000060, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetUIManager_ReturnValue_1) == 0x000068, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetMenuWidget_ReturnValue) == 0x000070, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_AsSBZMain_Menu_Widget) == 0x000078, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_AsSBZMain_Menu_Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetUIManager_ReturnValue_2) == 0x000088, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetUIManager_ReturnValue_3) == 0x000090, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetMenuWidget_ReturnValue_1) == 0x000098, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetMenuWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetMenuWidget_ReturnValue_2) == 0x0000A0, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetMenuWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_AsSBZMain_Menu_Widget_1) == 0x0000A8, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_AsSBZMain_Menu_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_AsSBZMain_Menu_Widget_2) == 0x0000B8, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_AsSBZMain_Menu_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_bSuccess_2) == 0x0000C0, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetUIManager_ReturnValue_4) == 0x0000C8, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetUIManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_Button) == 0x0000D0, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_bIsFocused) == 0x0000D8, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_ButtonType) == 0x0000D9, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_ButtonType' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetMenuWidget_ReturnValue_3) == 0x0000E0, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetMenuWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_AsSBZMain_Menu_Widget_3) == 0x0000E8, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_AsSBZMain_Menu_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_bSuccess_3) == 0x0000F0, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetUIManager_ReturnValue_5) == 0x0000F8, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetUIManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_Event_PreviousValue) == 0x000100, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetMenuWidget_ReturnValue_4) == 0x000110, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetMenuWidget_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_AsSBZMain_Menu_Widget_4) == 0x000118, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_AsSBZMain_Menu_Widget_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_bSuccess_4) == 0x000120, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_IsValid_ReturnValue) == 0x000121, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_DisplaySkillsSelection_ReturnValue) == 0x000122, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_DisplaySkillsSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_DisplayItemInventoryScreen_ReturnValue) == 0x000123, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_DisplayItemInventoryScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_DisplayItemInventoryScreen_ReturnValue_1) == 0x000124, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_DisplayItemInventoryScreen_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_DisplayItemInventoryScreen_ReturnValue_2) == 0x000125, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_DisplayItemInventoryScreen_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_DisplayWeaponInventoryScreen_ReturnValue) == 0x000126, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_DisplayWeaponInventoryScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetUIManager_ReturnValue_6) == 0x000128, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetUIManager_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_CustomEvent_InActionInput) == 0x000130, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_CustomEvent_InActionInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_PopStack_ReturnValue) == 0x00013C, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_SwitchName_CmpSuccess) == 0x000148, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, Temp_bool_Variable) == 0x000149, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_CreateDelegate_OutputDelegate) == 0x00014C, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_MakeStruct_SBZButtonControlReference) == 0x000160, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000190, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_MakeArray_Array) == 0x0001C0, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_PlayAnimationForward_ReturnValue) == 0x0001D0, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_MakeStruct_SBZButtonControlsReference) == 0x0001D8, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetUIManager_ReturnValue_7) == 0x000200, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetUIManager_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_GetMenuWidget_ReturnValue_5) == 0x000208, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_GetMenuWidget_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_AsSBZMain_Menu_Widget_5) == 0x000210, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_AsSBZMain_Menu_Widget_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_DynamicCast_bSuccess_5) == 0x000218, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_ComponentBoundEvent_ActiveItemData) == 0x000220, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_ComponentBoundEvent_ActiveItemData' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_DisplayItemInventoryScreen_ReturnValue_3) == 0x000228, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_DisplayItemInventoryScreen_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_IsValid_ReturnValue_1) == 0x000229, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_MakeStruct_FormatArgumentData) == 0x000230, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_MakeArray_Array_1) == 0x000270, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, CallFunc_Format_ReturnValue) == 0x000280, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization, K2Node_Select_Default) == 0x000298, "Member 'WBP_UI_SM_LoadoutCustomization_C_ExecuteUbergraph_WBP_UI_SM_LoadoutCustomization::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.BndEvt__WBP_UI_SM_LoadoutCustomization_Widget_Loadout_K2Node_ComponentBoundEvent_9_OnItemButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_LoadoutCustomization_Widget_Loadout_K2Node_ComponentBoundEvent_9_OnItemButtonSelected__DelegateSignature final
{
public:
	const class USBZInventoryBaseData*            ActiveItemData;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_LoadoutCustomization_Widget_Loadout_K2Node_ComponentBoundEvent_9_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_LoadoutCustomization_Widget_Loadout_K2Node_ComponentBoundEvent_9_OnItemButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_LoadoutCustomization_Widget_Loadout_K2Node_ComponentBoundEvent_9_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_LoadoutCustomization_Widget_Loadout_K2Node_ComponentBoundEvent_9_OnItemButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_LoadoutCustomization_Widget_Loadout_K2Node_ComponentBoundEvent_9_OnItemButtonSelected__DelegateSignature, ActiveItemData) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_LoadoutCustomization_Widget_Loadout_K2Node_ComponentBoundEvent_9_OnItemButtonSelected__DelegateSignature::ActiveItemData' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_OnControlsReferenceClicked final
{
public:
	class FName                                   InActionInput;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_OnControlsReferenceClicked, InActionInput) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_OnControlsReferenceClicked::InActionInput' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZInventoryEquipmentType                    ButtonType;                                        // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature, bIsFocused) == 0x000008, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature, ButtonType) == 0x000009, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnButtonFocusChanged__DelegateSignature::ButtonType' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_4_OnItemButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_4_OnItemButtonSelected__DelegateSignature final
{
public:
	const class USBZInventoryBaseData*            ActiveItemData;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_4_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_4_OnItemButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_4_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_4_OnItemButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_4_OnItemButtonSelected__DelegateSignature, ActiveItemData) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_4_OnItemButtonSelected__DelegateSignature::ActiveItemData' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnItemButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnItemButtonSelected__DelegateSignature final
{
public:
	const class USBZInventoryBaseData*            ActiveItemData;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnItemButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnItemButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnItemButtonSelected__DelegateSignature, ActiveItemData) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_3_OnItemButtonSelected__DelegateSignature::ActiveItemData' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_2_OnItemButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_2_OnItemButtonSelected__DelegateSignature final
{
public:
	const class USBZInventoryBaseData*            ActiveItemData;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_2_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_2_OnItemButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_2_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_2_OnItemButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_2_OnItemButtonSelected__DelegateSignature, ActiveItemData) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_2_OnItemButtonSelected__DelegateSignature::ActiveItemData' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_1_OnItemButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_1_OnItemButtonSelected__DelegateSignature final
{
public:
	const class USBZInventoryBaseData*            ActiveItemData;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_1_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_1_OnItemButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_1_OnItemButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_1_OnItemButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_1_OnItemButtonSelected__DelegateSignature, ActiveItemData) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_1_OnItemButtonSelected__DelegateSignature::ActiveItemData' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature final
{
public:
	ESBZEquippableLoadoutSlot                     EquippableSlot;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ActiveWeaponIndex;                                 // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature) == 0x000004, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature, EquippableSlot) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature::EquippableSlot' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature, ActiveWeaponIndex) == 0x000004, "Member 'WBP_UI_SM_LoadoutCustomization_C_BndEvt__WBP_UI_SM_InventoryScreen_Widget_Loadout_K2Node_ComponentBoundEvent_0_OnWeaponButtonSelected__DelegateSignature::ActiveWeaponIndex' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.SetDisabledState
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_SetDisabledState final
{
public:
	bool                                          bIsDisabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState) == 0x000004, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_SetDisabledState");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState) == 0x000010, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_SetDisabledState");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, bIsDisabled) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::bIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, CallFunc_SelectFloat_ReturnValue) == 0x000004, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, Temp_byte_Variable_1) == 0x000008, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, Temp_bool_Variable) == 0x000009, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, Temp_byte_Variable_2) == 0x00000A, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, Temp_byte_Variable_3) == 0x00000B, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, Temp_bool_Variable_1) == 0x00000C, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, K2Node_Select_Default) == 0x00000D, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_SetDisabledState, K2Node_Select_Default_1) == 0x00000E, "Member 'WBP_UI_SM_LoadoutCustomization_C_SetDisabledState::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_UI_SM_LoadoutCustomization.WBP_UI_SM_LoadoutCustomization_C.GetWeaponConfig
// 0x02D0 (0x02D0 - 0x0000)
struct WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig final
{
public:
	ESBZEquippableLoadoutSlot                     InEquippableSlot;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZEquippableConfig                   Equippable_Config;                                 // 0x0008(0x0070)(Parm, OutParm)
	uint8                                         Temp_byte_Variable;                                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZEquippableConfig                   Temp_struct_Variable;                              // 0x0080(0x0070)()
	struct FSBZEquippableConfig                   Temp_struct_Variable_1;                            // 0x00F0(0x0070)()
	ESBZEquippableLoadoutSlot                     Temp_byte_Variable_1;                              // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSaveManager*                        CallFunc_Get_ReturnValue;                          // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZProgressionSaveGame*                CallFunc_GetProgressionSaveGame_ReturnValue;       // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquippedWeaponInventorySlotIndex_ReturnValue; // 0x0178(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEquippedWeaponInventorySlotIndex_ReturnValue_1; // 0x017C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZWeaponInventorySlot                CallFunc_GetWeaponConfigSlot_ReturnValue;          // 0x0188(0x00D8)(ConstParm)
	struct FSBZEquippableConfig                   K2Node_Select_Default_1;                           // 0x0260(0x0070)()
};
static_assert(alignof(WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig) == 0x000008, "Wrong alignment on WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig");
static_assert(sizeof(WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig) == 0x0002D0, "Wrong size on WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig, InEquippableSlot) == 0x000000, "Member 'WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig::InEquippableSlot' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig, Equippable_Config) == 0x000008, "Member 'WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig::Equippable_Config' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig, Temp_byte_Variable) == 0x000078, "Member 'WBP_UI_SM_LoadoutCustomization_C_GetWeaponConfig::Temp_byte_Variable' has a wrong offset!");
