#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PartyContainerWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_PartyContainerWidget.WBP_UI_Widget_PartyContainerWidget_C.ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UPD3KeyItemContainer* InContainer)> K2Node_CreateDelegate_OutputDelegate;   // 0x0008(0x0014)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD3KeyItemContainer*                   K2Node_CustomEvent_InContainer;                    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget) == 0x000008, "Wrong alignment on WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget");
static_assert(sizeof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget) == 0x000030, "Wrong size on WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget, Temp_bool_Variable) == 0x000004, "Member 'WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget, Temp_byte_Variable) == 0x00001C, "Member 'WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget, Temp_byte_Variable_1) == 0x00001D, "Member 'WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget, K2Node_Event_IsDesignTime) == 0x00001E, "Member 'WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget, K2Node_CustomEvent_InContainer) == 0x000020, "Member 'WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget::K2Node_CustomEvent_InContainer' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget, CallFunc_HasAnyChildren_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget, K2Node_Select_Default) == 0x000029, "Member 'WBP_UI_Widget_PartyContainerWidget_C_ExecuteUbergraph_WBP_UI_Widget_PartyContainerWidget::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_Widget_PartyContainerWidget.WBP_UI_Widget_PartyContainerWidget_C.OnKeyItemCountChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_PartyContainerWidget_C_OnKeyItemCountChanged final
{
public:
	class UPD3KeyItemContainer*                   InContainer;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PartyContainerWidget_C_OnKeyItemCountChanged) == 0x000008, "Wrong alignment on WBP_UI_Widget_PartyContainerWidget_C_OnKeyItemCountChanged");
static_assert(sizeof(WBP_UI_Widget_PartyContainerWidget_C_OnKeyItemCountChanged) == 0x000008, "Wrong size on WBP_UI_Widget_PartyContainerWidget_C_OnKeyItemCountChanged");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_OnKeyItemCountChanged, InContainer) == 0x000000, "Member 'WBP_UI_Widget_PartyContainerWidget_C_OnKeyItemCountChanged::InContainer' has a wrong offset!");

// Function WBP_UI_Widget_PartyContainerWidget.WBP_UI_Widget_PartyContainerWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_PartyContainerWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_PartyContainerWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_PartyContainerWidget_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_PartyContainerWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_PartyContainerWidget_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_PartyContainerWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_PartyContainerWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

