#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_UpscalingModeChoiceButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_UpscalingModeChoiceButton.WBP_Settings_UpscalingModeChoiceButton_C
// 0x0058 (0x0490 - 0x0438)
class UWBP_Settings_UpscalingModeChoiceButton_C final : public USBZSettingsButtonUpscalingModeChoice
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Border_Image;                                      // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MouseOnly_TextButton_C*            Button_Left;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MouseOnly_TextButton_C*            Button_Right;                                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_OptionChoice;                                 // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SettingName;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           Color_Border;                                      // 0x0478(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Settings_UpscalingModeChoiceButton(int32 EntryPoint);
	void SettingChanged();
	void OptionNamesChanged();
	void SelectionNameChanged();
	void BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_2_OnMenuMouseButtonSelected__DelegateSignature(class USBZMenuMouseButton* Button);
	void BndEvt__WBP_Settings_TwoChoiceButton_Button_Option1_K2Node_ComponentBoundEvent_1_OnMenuMouseButtonSelected__DelegateSignature(class USBZMenuMouseButton* Button);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RefreshVisuals();
	void On_Hover_Visuals(bool bIsHovered);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void ChoiceIndexVisuals(int32 ChoiceIndex_0);
	void InitializeVisuals();
	void UpdateSettingNameText();
	void UpdateOptionsText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_UpscalingModeChoiceButton_C">();
	}
	static class UWBP_Settings_UpscalingModeChoiceButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_UpscalingModeChoiceButton_C>();
	}
};
static_assert(alignof(UWBP_Settings_UpscalingModeChoiceButton_C) == 0x000008, "Wrong alignment on UWBP_Settings_UpscalingModeChoiceButton_C");
static_assert(sizeof(UWBP_Settings_UpscalingModeChoiceButton_C) == 0x000490, "Wrong size on UWBP_Settings_UpscalingModeChoiceButton_C");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, UberGraphFrame) == 0x000438, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, Border_Image) == 0x000440, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::Border_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, Button_Left) == 0x000448, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::Button_Left' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, Button_Right) == 0x000450, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::Button_Right' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, Image_Background) == 0x000458, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, Image_BG) == 0x000460, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, Text_OptionChoice) == 0x000468, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::Text_OptionChoice' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, Text_SettingName) == 0x000470, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::Text_SettingName' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, Color_Border) == 0x000478, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::Color_Border' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_UpscalingModeChoiceButton_C, DynamicMaterial) == 0x000488, "Member 'UWBP_Settings_UpscalingModeChoiceButton_C::DynamicMaterial' has a wrong offset!");

}

