#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser_FilterButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerBrowser_FilterButton.WBP_ServerBrowser_FilterButton_C
// 0x0090 (0x03F0 - 0x0360)
class UWBP_ServerBrowser_FilterButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         Background_Hb;                                     // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ButtonText_T;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_Image;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperSprite*                           ButtonIcon;                                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActiveColor;                                       // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InactiveColor;                                     // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InactiveHoverColor;                                // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              IconSize;                                          // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x03D0(0x0018)(Edit, BlueprintVisible)
	class UAkAudioEvent*                          Selected;                                          // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ServerBrowser_FilterButton(int32 EntryPoint);
	void ButtonSelected();
	void ButtonDisabledChanged(bool bInIsDisabled);
	void ButtonFocusedChanged(bool bInHasFocus);
	void PreConstruct(bool IsDesignTime);
	void SetIcon(class UPaperSprite* Icon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerBrowser_FilterButton_C">();
	}
	static class UWBP_ServerBrowser_FilterButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerBrowser_FilterButton_C>();
	}
};
static_assert(alignof(UWBP_ServerBrowser_FilterButton_C) == 0x000008, "Wrong alignment on UWBP_ServerBrowser_FilterButton_C");
static_assert(sizeof(UWBP_ServerBrowser_FilterButton_C) == 0x0003F0, "Wrong size on UWBP_ServerBrowser_FilterButton_C");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_ServerBrowser_FilterButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, Background_Hb) == 0x000368, "Member 'UWBP_ServerBrowser_FilterButton_C::Background_Hb' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, ButtonText_T) == 0x000370, "Member 'UWBP_ServerBrowser_FilterButton_C::ButtonText_T' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, Icon_Image) == 0x000378, "Member 'UWBP_ServerBrowser_FilterButton_C::Icon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, ButtonIcon) == 0x000380, "Member 'UWBP_ServerBrowser_FilterButton_C::ButtonIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, ActiveColor) == 0x000388, "Member 'UWBP_ServerBrowser_FilterButton_C::ActiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, InactiveColor) == 0x000398, "Member 'UWBP_ServerBrowser_FilterButton_C::InactiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, HoverColor) == 0x0003A8, "Member 'UWBP_ServerBrowser_FilterButton_C::HoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, InactiveHoverColor) == 0x0003B8, "Member 'UWBP_ServerBrowser_FilterButton_C::InactiveHoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, IconSize) == 0x0003C8, "Member 'UWBP_ServerBrowser_FilterButton_C::IconSize' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, ButtonText) == 0x0003D0, "Member 'UWBP_ServerBrowser_FilterButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_FilterButton_C, Selected) == 0x0003E8, "Member 'UWBP_ServerBrowser_FilterButton_C::Selected' has a wrong offset!");

}

