#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_Replay

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SM_Replay.WBP_UI_SM_Replay_C.ExecuteUbergraph_WBP_UI_SM_Replay
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_ReplayLength;                         // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 K2Node_Event_ReplayElapased;                       // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         K2Node_Event_ReplayElapsedPercent;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0050(0x0018)()
	bool                                          CallFunc_PauseReplay_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ResumeReplay_ReturnValue;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPaused_ReturnValue;                     // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StopReplay_ReturnValue;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_StartReplay_ReturnValue;                  // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_CreateObject_Object;                      // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZReplayEventInfo                    CallFunc_Array_Get_Item;                           // 0x0080(0x0020)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnchors                               K2Node_MakeStruct_Anchors;                         // 0x00B8(0x0010)(NoDestructor)
};
static_assert(alignof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay) == 0x000008, "Wrong alignment on WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay");
static_assert(sizeof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay) == 0x0000C8, "Wrong size on WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, EntryPoint) == 0x000000, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, K2Node_Event_ReplayLength) == 0x000010, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::K2Node_Event_ReplayLength' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, K2Node_Event_ReplayElapased) == 0x000020, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::K2Node_Event_ReplayElapased' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, K2Node_Event_ReplayElapsedPercent) == 0x000030, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::K2Node_Event_ReplayElapsedPercent' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_Conv_StringToText_ReturnValue) == 0x000038, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000050, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_PauseReplay_ReturnValue) == 0x000068, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_PauseReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_ResumeReplay_ReturnValue) == 0x000069, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_ResumeReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_IsPaused_ReturnValue) == 0x00006A, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_IsPaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_StopReplay_ReturnValue) == 0x00006B, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_StopReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_StartReplay_ReturnValue) == 0x00006C, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_StartReplay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_CreateObject_Object) == 0x000070, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_CreateObject_Object' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_AddChildToCanvas_ReturnValue) == 0x000078, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_Array_Get_Item) == 0x000080, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_MakeVector2D_ReturnValue) == 0x0000A8, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, CallFunc_MakeVector2D_ReturnValue_1) == 0x0000B0, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay, K2Node_MakeStruct_Anchors) == 0x0000B8, "Member 'WBP_UI_SM_Replay_C_ExecuteUbergraph_WBP_UI_SM_Replay::K2Node_MakeStruct_Anchors' has a wrong offset!");

// Function WBP_UI_SM_Replay.WBP_UI_SM_Replay_C.OnReplayUpdate
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_SM_Replay_C_OnReplayUpdate final
{
public:
	class FString                                 ReplayLength;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 ReplayElapased;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         ReplayElapsedPercent;                              // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_Replay_C_OnReplayUpdate) == 0x000008, "Wrong alignment on WBP_UI_SM_Replay_C_OnReplayUpdate");
static_assert(sizeof(WBP_UI_SM_Replay_C_OnReplayUpdate) == 0x000028, "Wrong size on WBP_UI_SM_Replay_C_OnReplayUpdate");
static_assert(offsetof(WBP_UI_SM_Replay_C_OnReplayUpdate, ReplayLength) == 0x000000, "Member 'WBP_UI_SM_Replay_C_OnReplayUpdate::ReplayLength' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_OnReplayUpdate, ReplayElapased) == 0x000010, "Member 'WBP_UI_SM_Replay_C_OnReplayUpdate::ReplayElapased' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_OnReplayUpdate, ReplayElapsedPercent) == 0x000020, "Member 'WBP_UI_SM_Replay_C_OnReplayUpdate::ReplayElapsedPercent' has a wrong offset!");

// Function WBP_UI_SM_Replay.WBP_UI_SM_Replay_C.Get_ReplayProgressBar_Percent_0
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0 final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZReplayPlayerController*             K2Node_DynamicCast_AsSBZReplay_Player_Controller;  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0) == 0x000008, "Wrong alignment on WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0");
static_assert(sizeof(WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0) == 0x000020, "Wrong size on WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0");
static_assert(offsetof(WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0, ReturnValue) == 0x000000, "Member 'WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0, K2Node_DynamicCast_AsSBZReplay_Player_Controller) == 0x000010, "Member 'WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0::K2Node_DynamicCast_AsSBZReplay_Player_Controller' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_UI_SM_Replay_C_Get_ReplayProgressBar_Percent_0::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_UI_SM_Replay.WBP_UI_SM_Replay_C.Get_TimeDilation_Text_0
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_SM_Replay_C_Get_TimeDilation_Text_0 final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0018(0x0018)()
};
static_assert(alignof(WBP_UI_SM_Replay_C_Get_TimeDilation_Text_0) == 0x000008, "Wrong alignment on WBP_UI_SM_Replay_C_Get_TimeDilation_Text_0");
static_assert(sizeof(WBP_UI_SM_Replay_C_Get_TimeDilation_Text_0) == 0x000030, "Wrong size on WBP_UI_SM_Replay_C_Get_TimeDilation_Text_0");
static_assert(offsetof(WBP_UI_SM_Replay_C_Get_TimeDilation_Text_0, ReturnValue) == 0x000000, "Member 'WBP_UI_SM_Replay_C_Get_TimeDilation_Text_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_Replay_C_Get_TimeDilation_Text_0, CallFunc_Conv_FloatToText_ReturnValue) == 0x000018, "Member 'WBP_UI_SM_Replay_C_Get_TimeDilation_Text_0::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");

}

