#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PageCycler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PageCycler.WBP_PageCycler_C
// 0x0088 (0x0318 - 0x0290)
class UWBP_PageCycler_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         ItemPagers_HB;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Left_O;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_C*           LeftNavigateAction;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Right_O;                                           // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_C*           RightNavigateAction;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 InNavigateIndex)> NavigateToIndex;                           // 0x02C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                         DesignerDisplayPageCount;                          // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PageCycleCounter_C*                ActivePageItem;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_PageCycleCounter_C*>        PageItems;                                         // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMulticastInlineDelegate<void()>              DecrementPageIndex;                                // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              IncrementPageIndex;                                // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          MKBNavigationEnabled;                              // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_PageCycler(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnInputTypeChanged(bool bKeyboardMouseInput);
	void DisableActionNavigation();
	void EnableActionNavigation();
	void OnRightNavigationPressed();
	void OnLeftNavigationPressed();
	void UpdateActiveIndex(int32 InNewIndex);
	void OnAddedPage(int32 InIndex);
	void OnNavItemClicked(int32 InIndex);
	void CreateAndAddPageCount(int32 Index_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PageCycler_C">();
	}
	static class UWBP_PageCycler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PageCycler_C>();
	}
};
static_assert(alignof(UWBP_PageCycler_C) == 0x000008, "Wrong alignment on UWBP_PageCycler_C");
static_assert(sizeof(UWBP_PageCycler_C) == 0x000318, "Wrong size on UWBP_PageCycler_C");
static_assert(offsetof(UWBP_PageCycler_C, UberGraphFrame) == 0x000290, "Member 'UWBP_PageCycler_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, ItemPagers_HB) == 0x000298, "Member 'UWBP_PageCycler_C::ItemPagers_HB' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, Left_O) == 0x0002A0, "Member 'UWBP_PageCycler_C::Left_O' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, LeftNavigateAction) == 0x0002A8, "Member 'UWBP_PageCycler_C::LeftNavigateAction' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, Right_O) == 0x0002B0, "Member 'UWBP_PageCycler_C::Right_O' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, RightNavigateAction) == 0x0002B8, "Member 'UWBP_PageCycler_C::RightNavigateAction' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, NavigateToIndex) == 0x0002C0, "Member 'UWBP_PageCycler_C::NavigateToIndex' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, DesignerDisplayPageCount) == 0x0002D0, "Member 'UWBP_PageCycler_C::DesignerDisplayPageCount' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, ActivePageItem) == 0x0002D8, "Member 'UWBP_PageCycler_C::ActivePageItem' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, PageItems) == 0x0002E0, "Member 'UWBP_PageCycler_C::PageItems' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, DecrementPageIndex) == 0x0002F0, "Member 'UWBP_PageCycler_C::DecrementPageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, IncrementPageIndex) == 0x000300, "Member 'UWBP_PageCycler_C::IncrementPageIndex' has a wrong offset!");
static_assert(offsetof(UWBP_PageCycler_C, MKBNavigationEnabled) == 0x000310, "Member 'UWBP_PageCycler_C::MKBNavigationEnabled' has a wrong offset!");

}

