#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_Replays

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_MainMenu_Replays.WBP_UI_MainMenu_Replays_C.ExecuteUbergraph_WBP_UI_MainMenu_Replays
// 0x0188 (0x0188 - 0x0000)
struct WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_MainMenu_Replay_C*              CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0014(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSBZReplayInfo>                 K2Node_CustomEvent_Replays;                        // 0x0028(0x0010)(ReferenceParm)
	class USBZGameInstance*                       K2Node_DynamicCast_AsSBZGame_Instance;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZReplayManager*                      CallFunc_GetReplayManager_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZReplayInfo                         CallFunc_Array_Get_Item;                           // 0x0050(0x0060)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x00DC(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InActionInput;                  // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x00FC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0118(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0148(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0158(0x0028)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays");
static_assert(sizeof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays) == 0x000188, "Wrong size on WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, EntryPoint) == 0x000000, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_Event_PreviousValue) == 0x000014, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_GetGameInstance_ReturnValue) == 0x000020, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_CustomEvent_Replays) == 0x000028, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_CustomEvent_Replays' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_DynamicCast_AsSBZGame_Instance) == 0x000038, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_DynamicCast_AsSBZGame_Instance' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_GetReplayManager_ReturnValue) == 0x000048, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_GetReplayManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_AddChild_ReturnValue) == 0x0000B8, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_GetChildAt_ReturnValue) == 0x0000C0, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_HasAnyChildren_ReturnValue) == 0x0000C8, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_GetUIManager_ReturnValue) == 0x0000D0, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, Temp_int_Loop_Counter_Variable) == 0x0000D8, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_PopStack_ReturnValue) == 0x0000DC, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, CallFunc_Add_IntInt_ReturnValue) == 0x0000EC, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_CustomEvent_InActionInput) == 0x0000F0, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_CustomEvent_InActionInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_CreateDelegate_OutputDelegate) == 0x0000FC, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_SwitchName_CmpSuccess) == 0x000110, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_MakeStruct_SBZButtonControlReference) == 0x000118, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_MakeArray_Array) == 0x000148, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000158, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays, K2Node_ComponentBoundEvent_Button) == 0x000180, "Member 'WBP_UI_MainMenu_Replays_C_ExecuteUbergraph_WBP_UI_MainMenu_Replays::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_UI_MainMenu_Replays.WBP_UI_MainMenu_Replays_C.BndEvt__WBP_UI_MainMenu_Replays_Button_GoBack_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_MainMenu_Replays_C_BndEvt__WBP_UI_MainMenu_Replays_Button_GoBack_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_Replays_C_BndEvt__WBP_UI_MainMenu_Replays_Button_GoBack_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_Replays_C_BndEvt__WBP_UI_MainMenu_Replays_Button_GoBack_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_MainMenu_Replays_C_BndEvt__WBP_UI_MainMenu_Replays_Button_GoBack_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_MainMenu_Replays_C_BndEvt__WBP_UI_MainMenu_Replays_Button_GoBack_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_BndEvt__WBP_UI_MainMenu_Replays_Button_GoBack_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_MainMenu_Replays_C_BndEvt__WBP_UI_MainMenu_Replays_Button_GoBack_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_MainMenu_Replays.WBP_UI_MainMenu_Replays_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_MainMenu_Replays_C_OnControlsReferenceClicked final
{
public:
	class FName                                   InActionInput;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_Replays_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_MainMenu_Replays_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_MainMenu_Replays_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_MainMenu_Replays_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_OnControlsReferenceClicked, InActionInput) == 0x000000, "Member 'WBP_UI_MainMenu_Replays_C_OnControlsReferenceClicked::InActionInput' has a wrong offset!");

// Function WBP_UI_MainMenu_Replays.WBP_UI_MainMenu_Replays_C.On Found Replays
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_MainMenu_Replays_C_On_Found_Replays final
{
public:
	TArray<struct FSBZReplayInfo>                 Replays_0;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_MainMenu_Replays_C_On_Found_Replays) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_Replays_C_On_Found_Replays");
static_assert(sizeof(WBP_UI_MainMenu_Replays_C_On_Found_Replays) == 0x000010, "Wrong size on WBP_UI_MainMenu_Replays_C_On_Found_Replays");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_On_Found_Replays, Replays_0) == 0x000000, "Member 'WBP_UI_MainMenu_Replays_C_On_Found_Replays::Replays_0' has a wrong offset!");

// Function WBP_UI_MainMenu_Replays.WBP_UI_MainMenu_Replays_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_MainMenu_Replays_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_Replays_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_MainMenu_Replays_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_MainMenu_Replays_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_MainMenu_Replays_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_MainMenu_Replays_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_MainMenu_Replays_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

}

