#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_CharacterPreferenceDisplay

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_CharacterPreferenceDisplay.WBP_UI_CharacterPreferenceDisplay_C.ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay
// 0x0038 (0x0038 - 0x0000)
struct WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0010(0x0008)(NoDestructor)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay) == 0x000008, "Wrong alignment on WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay");
static_assert(sizeof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay) == 0x000038, "Wrong size on WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, EntryPoint) == 0x000000, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, Temp_int_Variable) == 0x000004, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, K2Node_MakeStruct_SlateChildSize) == 0x000010, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, CallFunc_GetChildrenCount_ReturnValue) == 0x000020, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000028, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000034, "Member 'WBP_UI_CharacterPreferenceDisplay_C_ExecuteUbergraph_WBP_UI_CharacterPreferenceDisplay::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_CharacterPreferenceDisplay.WBP_UI_CharacterPreferenceDisplay_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_CharacterPreferenceDisplay_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_CharacterPreferenceDisplay_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_CharacterPreferenceDisplay_C_PreConstruct");
static_assert(sizeof(WBP_UI_CharacterPreferenceDisplay_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_CharacterPreferenceDisplay_C_PreConstruct");
static_assert(offsetof(WBP_UI_CharacterPreferenceDisplay_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_CharacterPreferenceDisplay_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

