#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_WeaponProgressionScreen

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_WeaponProgressionScreen.WBP_UI_WeaponProgressionScreen_C.ExecuteUbergraph_WBP_UI_WeaponProgressionScreen
// 0x0110 (0x0110 - 0x0000)
struct WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0008(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_WeaponPartProgressionButton_C*  CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZWeaponPartDataAsset*          K2Node_Event_FocusedWeaponPart;                    // 0x0030(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Index_Variable;                           // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Step_Size_Variable;                       // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0060(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0090(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x00A8(0x0010)(ReferenceParm)
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x00C8(0x0028)()
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0100(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen) == 0x000008, "Wrong alignment on WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen");
static_assert(sizeof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen) == 0x000110, "Wrong size on WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000004, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, K2Node_Event_PreviousValue) == 0x000008, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, K2Node_Event_IsDesignTime) == 0x000014, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, K2Node_Event_FocusedWeaponPart) == 0x000030, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::K2Node_Event_FocusedWeaponPart' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000038, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, Temp_int_Index_Variable) == 0x000044, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::Temp_int_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000048, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000049, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, Temp_int_Step_Size_Variable) == 0x00004C, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::Temp_int_Step_Size_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_Abs_Int_ReturnValue) == 0x000050, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_Max_ReturnValue) == 0x000058, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, K2Node_MakeStruct_SBZButtonControlReference) == 0x000060, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000090, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, K2Node_MakeArray_Array) == 0x0000A8, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, K2Node_CustomEvent_ActionName) == 0x0000B8, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, K2Node_MakeStruct_SBZButtonControlsReference) == 0x0000C8, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, K2Node_SwitchName_CmpSuccess) == 0x0000F0, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_GetUIManager_ReturnValue) == 0x0000F8, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen, CallFunc_PopStack_ReturnValue) == 0x000100, "Member 'WBP_UI_WeaponProgressionScreen_C_ExecuteUbergraph_WBP_UI_WeaponProgressionScreen::CallFunc_PopStack_ReturnValue' has a wrong offset!");

// Function WBP_UI_WeaponProgressionScreen.WBP_UI_WeaponProgressionScreen_C.OnControlsReferencePressed
// 0x000C (0x000C - 0x0000)
struct WBP_UI_WeaponProgressionScreen_C_OnControlsReferencePressed final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponProgressionScreen_C_OnControlsReferencePressed) == 0x000004, "Wrong alignment on WBP_UI_WeaponProgressionScreen_C_OnControlsReferencePressed");
static_assert(sizeof(WBP_UI_WeaponProgressionScreen_C_OnControlsReferencePressed) == 0x00000C, "Wrong size on WBP_UI_WeaponProgressionScreen_C_OnControlsReferencePressed");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_OnControlsReferencePressed, ActionName) == 0x000000, "Member 'WBP_UI_WeaponProgressionScreen_C_OnControlsReferencePressed::ActionName' has a wrong offset!");

// Function WBP_UI_WeaponProgressionScreen.WBP_UI_WeaponProgressionScreen_C.FocusedWeaponPartChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_WeaponProgressionScreen_C_FocusedWeaponPartChanged final
{
public:
	const class USBZWeaponPartDataAsset*          FocusedWeaponPart;                                 // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponProgressionScreen_C_FocusedWeaponPartChanged) == 0x000008, "Wrong alignment on WBP_UI_WeaponProgressionScreen_C_FocusedWeaponPartChanged");
static_assert(sizeof(WBP_UI_WeaponProgressionScreen_C_FocusedWeaponPartChanged) == 0x000008, "Wrong size on WBP_UI_WeaponProgressionScreen_C_FocusedWeaponPartChanged");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_FocusedWeaponPartChanged, FocusedWeaponPart) == 0x000000, "Member 'WBP_UI_WeaponProgressionScreen_C_FocusedWeaponPartChanged::FocusedWeaponPart' has a wrong offset!");

// Function WBP_UI_WeaponProgressionScreen.WBP_UI_WeaponProgressionScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_WeaponProgressionScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_WeaponProgressionScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_WeaponProgressionScreen_C_PreConstruct");
static_assert(sizeof(WBP_UI_WeaponProgressionScreen_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_WeaponProgressionScreen_C_PreConstruct");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_WeaponProgressionScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_WeaponProgressionScreen.WBP_UI_WeaponProgressionScreen_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_WeaponProgressionScreen_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponProgressionScreen_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_WeaponProgressionScreen_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_WeaponProgressionScreen_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_WeaponProgressionScreen_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_WeaponProgressionScreen_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_WeaponProgressionScreen_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

}

