#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Skills_Description

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Skills_Description.WBP_UI_Skills_Description_C.ExecuteUbergraph_WBP_UI_Skills_Description
// 0x004C (0x004C - 0x0000)
struct WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description) == 0x000004, "Wrong alignment on WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description");
static_assert(sizeof(WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description) == 0x00004C, "Wrong size on WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description");
static_assert(offsetof(WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description, EntryPoint) == 0x000000, "Member 'WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000040, "Member 'WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description, CallFunc_GetScrollOffset_ReturnValue) == 0x000044, "Member 'WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description, CallFunc_Add_FloatFloat_ReturnValue) == 0x000048, "Member 'WBP_UI_Skills_Description_C_ExecuteUbergraph_WBP_UI_Skills_Description::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Description.WBP_UI_Skills_Description_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_UI_Skills_Description_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Description_C_Tick) == 0x000004, "Wrong alignment on WBP_UI_Skills_Description_C_Tick");
static_assert(sizeof(WBP_UI_Skills_Description_C_Tick) == 0x00003C, "Wrong size on WBP_UI_Skills_Description_C_Tick");
static_assert(offsetof(WBP_UI_Skills_Description_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_UI_Skills_Description_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_UI_Skills_Description_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_UI_Skills_Description.WBP_UI_Skills_Description_C.SetFocusedButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Description_C_SetFocusedButton final
{
public:
	class UWBP_UI_Skills_Button_C*                Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Description_C_SetFocusedButton) == 0x000008, "Wrong alignment on WBP_UI_Skills_Description_C_SetFocusedButton");
static_assert(sizeof(WBP_UI_Skills_Description_C_SetFocusedButton) == 0x000010, "Wrong size on WBP_UI_Skills_Description_C_SetFocusedButton");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetFocusedButton, Skill) == 0x000000, "Member 'WBP_UI_Skills_Description_C_SetFocusedButton::Skill' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetFocusedButton, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Description_C_SetFocusedButton::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetFocusedButton, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_UI_Skills_Description_C_SetFocusedButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetFocusedButton, CallFunc_BooleanAND_ReturnValue) == 0x00000A, "Member 'WBP_UI_Skills_Description_C_SetFocusedButton::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Description.WBP_UI_Skills_Description_C.SetSkillInfoOld
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Description_C_SetSkillInfoOld final
{
public:
	class USBZSkillData*                          Skill_data;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Description_C_SetSkillInfoOld) == 0x000008, "Wrong alignment on WBP_UI_Skills_Description_C_SetSkillInfoOld");
static_assert(sizeof(WBP_UI_Skills_Description_C_SetSkillInfoOld) == 0x000010, "Wrong size on WBP_UI_Skills_Description_C_SetSkillInfoOld");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillInfoOld, Skill_data) == 0x000000, "Member 'WBP_UI_Skills_Description_C_SetSkillInfoOld::Skill_data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillInfoOld, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Description_C_SetSkillInfoOld::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Description.WBP_UI_Skills_Description_C.SetSkillInfo
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Description_C_SetSkillInfo final
{
public:
	class UWBP_UI_Skills_Button_C*                SkillButton;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Description_C_SetSkillInfo) == 0x000008, "Wrong alignment on WBP_UI_Skills_Description_C_SetSkillInfo");
static_assert(sizeof(WBP_UI_Skills_Description_C_SetSkillInfo) == 0x000010, "Wrong size on WBP_UI_Skills_Description_C_SetSkillInfo");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillInfo, SkillButton) == 0x000000, "Member 'WBP_UI_Skills_Description_C_SetSkillInfo::SkillButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillInfo, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Description_C_SetSkillInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Description.WBP_UI_Skills_Description_C.SetSkillDescription
// 0x0170 (0x0170 - 0x0000)
struct WBP_UI_Skills_Description_C_SetSkillDescription final
{
public:
	class UWBP_UI_Skills_Button_C*                SkillButton;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0020(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetFormattedDescriptionText_ReturnValue;  // 0x0048(0x0018)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0070(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TextToUpper_ReturnValue_1;                // 0x0090(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetFormattedDescriptionText_ReturnValue_1; // 0x00B8(0x0018)()
	class FText                                   CallFunc_GetFormattedDescriptionText_ReturnValue_2; // 0x00D0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0158(0x0018)()
};
static_assert(alignof(WBP_UI_Skills_Description_C_SetSkillDescription) == 0x000008, "Wrong alignment on WBP_UI_Skills_Description_C_SetSkillDescription");
static_assert(sizeof(WBP_UI_Skills_Description_C_SetSkillDescription) == 0x000170, "Wrong size on WBP_UI_Skills_Description_C_SetSkillDescription");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, SkillButton) == 0x000000, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::SkillButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_TextToUpper_ReturnValue) == 0x000020, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Conv_TextToString_ReturnValue) == 0x000038, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_GetFormattedDescriptionText_ReturnValue) == 0x000048, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_GetFormattedDescriptionText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Concat_StrStr_ReturnValue) == 0x000060, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_MakeLiteralText_ReturnValue_1) == 0x000070, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_TextToUpper_ReturnValue_1) == 0x000090, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_TextToUpper_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000A8, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_GetFormattedDescriptionText_ReturnValue_1) == 0x0000B8, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_GetFormattedDescriptionText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_GetFormattedDescriptionText_ReturnValue_2) == 0x0000D0, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_GetFormattedDescriptionText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000E8, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Conv_TextToString_ReturnValue_3) == 0x0000F8, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000108, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000118, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000128, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Concat_StrStr_ReturnValue_4) == 0x000138, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Concat_StrStr_ReturnValue_5) == 0x000148, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillDescription, CallFunc_Conv_StringToText_ReturnValue) == 0x000158, "Member 'WBP_UI_Skills_Description_C_SetSkillDescription::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Description.WBP_UI_Skills_Description_C.SetSkillImage
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Skills_Description_C_SetSkillImage final
{
public:
	class UWBP_UI_Skills_Button_C*                SkillButton;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Description_C_SetSkillImage) == 0x000008, "Wrong alignment on WBP_UI_Skills_Description_C_SetSkillImage");
static_assert(sizeof(WBP_UI_Skills_Description_C_SetSkillImage) == 0x000008, "Wrong size on WBP_UI_Skills_Description_C_SetSkillImage");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillImage, SkillButton) == 0x000000, "Member 'WBP_UI_Skills_Description_C_SetSkillImage::SkillButton' has a wrong offset!");

// Function WBP_UI_Skills_Description.WBP_UI_Skills_Description_C.SetState
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_UI_Skills_Description_C_SetState final
{
public:
	class UWBP_UI_Skills_Button_C*                SkillsButton;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0010(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0040(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0058(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0070(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0088(0x0018)()
};
static_assert(alignof(WBP_UI_Skills_Description_C_SetState) == 0x000008, "Wrong alignment on WBP_UI_Skills_Description_C_SetState");
static_assert(sizeof(WBP_UI_Skills_Description_C_SetState) == 0x0000A0, "Wrong size on WBP_UI_Skills_Description_C_SetState");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetState, SkillsButton) == 0x000000, "Member 'WBP_UI_Skills_Description_C_SetState::SkillsButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetState, Temp_byte_Variable) == 0x000008, "Member 'WBP_UI_Skills_Description_C_SetState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetState, Temp_text_Variable) == 0x000010, "Member 'WBP_UI_Skills_Description_C_SetState::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetState, Temp_text_Variable_1) == 0x000028, "Member 'WBP_UI_Skills_Description_C_SetState::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetState, Temp_text_Variable_2) == 0x000040, "Member 'WBP_UI_Skills_Description_C_SetState::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetState, Temp_text_Variable_3) == 0x000058, "Member 'WBP_UI_Skills_Description_C_SetState::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetState, Temp_text_Variable_4) == 0x000070, "Member 'WBP_UI_Skills_Description_C_SetState::Temp_text_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetState, K2Node_Select_Default) == 0x000088, "Member 'WBP_UI_Skills_Description_C_SetState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_Skills_Description.WBP_UI_Skills_Description_C.SetSkillProgress
// 0x0118 (0x0118 - 0x0000)
struct WBP_UI_Skills_Description_C_SetSkillProgress final
{
public:
	class UWBP_UI_Skills_Button_C*                SkillButton;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0078(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_3;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x00E8(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0100(0x0018)()
};
static_assert(alignof(WBP_UI_Skills_Description_C_SetSkillProgress) == 0x000008, "Wrong alignment on WBP_UI_Skills_Description_C_SetSkillProgress");
static_assert(sizeof(WBP_UI_Skills_Description_C_SetSkillProgress) == 0x000118, "Wrong size on WBP_UI_Skills_Description_C_SetSkillProgress");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillProgress, SkillButton) == 0x000000, "Member 'WBP_UI_Skills_Description_C_SetSkillProgress::SkillButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillProgress, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Description_C_SetSkillProgress::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Description_C_SetSkillProgress, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'WBP_UI_Skills_Description_C_SetSkillProgress::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
