#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Social_ReportPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_MainMenu_Social_ReportPopup.WBP_MainMenu_Social_ReportPopup_C.ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup
// 0x0038 (0x0038 - 0x0000)
struct WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x0008(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup) == 0x000008, "Wrong alignment on WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup");
static_assert(sizeof(WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup) == 0x000038, "Wrong size on WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup, K2Node_ComponentBoundEvent_Text) == 0x000008, "Member 'WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup, K2Node_ComponentBoundEvent_CommitMethod) == 0x000020, "Member 'WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup, CallFunc_Conv_TextToString_ReturnValue) == 0x000028, "Member 'WBP_MainMenu_Social_ReportPopup_C_ExecuteUbergraph_WBP_MainMenu_Social_ReportPopup::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");

// Function WBP_MainMenu_Social_ReportPopup.WBP_MainMenu_Social_ReportPopup_C.BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct WBP_MainMenu_Social_ReportPopup_C_BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Social_ReportPopup_C_BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Social_ReportPopup_C_BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Social_ReportPopup_C_BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on WBP_MainMenu_Social_ReportPopup_C_BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_MainMenu_Social_ReportPopup_C_BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature::Text' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature, CommitMethod) == 0x000018, "Member 'WBP_MainMenu_Social_ReportPopup_C_BndEvt__WBP_MainMenu_Social_ReportPopup_ReportCommentTextField_K2Node_ComponentBoundEvent_0_OnMultiLineEditableTextCommittedEvent__DelegateSignature::CommitMethod' has a wrong offset!");

// Function WBP_MainMenu_Social_ReportPopup.WBP_MainMenu_Social_ReportPopup_C.SetPlayerName
// 0x0080 (0x0080 - 0x0000)
struct WBP_MainMenu_Social_ReportPopup_C_SetPlayerName final
{
public:
	class FText                                   PlayerName;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
};
static_assert(alignof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName) == 0x000008, "Wrong alignment on WBP_MainMenu_Social_ReportPopup_C_SetPlayerName");
static_assert(sizeof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName) == 0x000080, "Wrong size on WBP_MainMenu_Social_ReportPopup_C_SetPlayerName");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName, PlayerName) == 0x000000, "Member 'WBP_MainMenu_Social_ReportPopup_C_SetPlayerName::PlayerName' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_MainMenu_Social_ReportPopup_C_SetPlayerName::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_MainMenu_Social_ReportPopup_C_SetPlayerName::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Social_ReportPopup_C_SetPlayerName, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WBP_MainMenu_Social_ReportPopup_C_SetPlayerName::CallFunc_Format_ReturnValue' has a wrong offset!");

}

