#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_InputKeyActionBindings

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.ExecuteUbergraph_WBP_Settings_InputKeyActionBindings
// 0x0018 (0x0018 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsDisabled;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue;               // 0x0008(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings) == 0x000004, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings) == 0x000018, "Wrong size on WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings, EntryPoint) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings, K2Node_Event_bInIsDisabled) == 0x000005, "Member 'WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings::K2Node_Event_bInIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings, K2Node_Event_bInHasFocus) == 0x000006, "Member 'WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings, K2Node_Event_bInIsHovered) == 0x000007, "Member 'WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings, CallFunc_GetGlobalColor_ReturnValue) == 0x000008, "Member 'WBP_Settings_InputKeyActionBindings_C_ExecuteUbergraph_WBP_Settings_InputKeyActionBindings::CallFunc_GetGlobalColor_ReturnValue' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_Settings_InputKeyActionBindings_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_Settings_InputKeyActionBindings_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.ButtonDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_ButtonDisabledChanged final
{
public:
	bool                                          bInIsDisabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_ButtonDisabledChanged) == 0x000001, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_ButtonDisabledChanged");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_ButtonDisabledChanged) == 0x000001, "Wrong size on WBP_Settings_InputKeyActionBindings_C_ButtonDisabledChanged");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ButtonDisabledChanged, bInIsDisabled) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_ButtonDisabledChanged::bInIsDisabled' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_PreConstruct");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_PreConstruct) == 0x000001, "Wrong size on WBP_Settings_InputKeyActionBindings_C_PreConstruct");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.RefreshVisuals
// 0x0002 (0x0002 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_RefreshVisuals final
{
public:
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_RefreshVisuals) == 0x000001, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_RefreshVisuals");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_RefreshVisuals) == 0x000002, "Wrong size on WBP_Settings_InputKeyActionBindings_C_RefreshVisuals");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_RefreshVisuals, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_RefreshVisuals::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_RefreshVisuals, CallFunc_IsHovered_ReturnValue) == 0x000001, "Member 'WBP_Settings_InputKeyActionBindings_C_RefreshVisuals::CallFunc_IsHovered_ReturnValue' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.OnHoverVisuals
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_OnHoverVisuals final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_OnHoverVisuals) == 0x000001, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_OnHoverVisuals");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_OnHoverVisuals) == 0x000001, "Wrong size on WBP_Settings_InputKeyActionBindings_C_OnHoverVisuals");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_OnHoverVisuals, bIsHovered) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_OnHoverVisuals::bIsHovered' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.OnDisabledVisuals
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_OnDisabledVisuals final
{
public:
	bool                                          bIsDisabled_0;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_OnDisabledVisuals) == 0x000001, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_OnDisabledVisuals");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_OnDisabledVisuals) == 0x000001, "Wrong size on WBP_Settings_InputKeyActionBindings_C_OnDisabledVisuals");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_OnDisabledVisuals, bIsDisabled_0) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_OnDisabledVisuals::bIsDisabled_0' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.OnFocusedVisuals
// 0x0001 (0x0001 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_OnFocusedVisuals final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_OnFocusedVisuals) == 0x000001, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_OnFocusedVisuals");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_OnFocusedVisuals) == 0x000001, "Wrong size on WBP_Settings_InputKeyActionBindings_C_OnFocusedVisuals");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_OnFocusedVisuals, bIsFocused) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_OnFocusedVisuals::bIsFocused' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.GetJoinedActionNames
// 0x0098 (0x0098 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames final
{
public:
	TArray<class FText>                           Action_Names;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 Result;                                            // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
	TArray<class FText>                           NewLocalVar_0;                                     // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class FString>                         TempActionStrings;                                 // 0x0030(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0050(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_JoinStringArray_ReturnValue;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames) == 0x000008, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames) == 0x000098, "Wrong size on WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, Action_Names) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::Action_Names' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, Result) == 0x000010, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::Result' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, NewLocalVar_0) == 0x000020, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, TempActionStrings) == 0x000030, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::TempActionStrings' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, Temp_int_Array_Index_Variable) == 0x000044, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, CallFunc_Array_Get_Item) == 0x000050, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, CallFunc_Conv_TextToString_ReturnValue) == 0x000068, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, CallFunc_Less_IntInt_ReturnValue) == 0x000078, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, CallFunc_JoinStringArray_ReturnValue) == 0x000080, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::CallFunc_JoinStringArray_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'WBP_Settings_InputKeyActionBindings_C_GetJoinedActionNames::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_Settings_InputKeyActionBindings.WBP_Settings_InputKeyActionBindings_C.ActionNamesVisuals
// 0x0040 (0x0040 - 0x0000)
struct WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals final
{
public:
	class USBZGamepadBindingsManager*             CallFunc_GetGamepadBindingsManager_ReturnValue;    // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           CallFunc_GetBindingNamesLocalized_ReturnValue;     // 0x0008(0x0010)(ReferenceParm)
	class FString                                 CallFunc_GetJoinedActionNames_Result;              // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0028(0x0018)()
};
static_assert(alignof(WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals) == 0x000008, "Wrong alignment on WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals");
static_assert(sizeof(WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals) == 0x000040, "Wrong size on WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals, CallFunc_GetGamepadBindingsManager_ReturnValue) == 0x000000, "Member 'WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals::CallFunc_GetGamepadBindingsManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals, CallFunc_GetBindingNamesLocalized_ReturnValue) == 0x000008, "Member 'WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals::CallFunc_GetBindingNamesLocalized_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals, CallFunc_GetJoinedActionNames_Result) == 0x000018, "Member 'WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals::CallFunc_GetJoinedActionNames_Result' has a wrong offset!");
static_assert(offsetof(WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals, CallFunc_Conv_StringToText_ReturnValue) == 0x000028, "Member 'WBP_Settings_InputKeyActionBindings_C_ActionNamesVisuals::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

