#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AssetReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AssetReward.WBP_AssetReward_C
// 0x00A0 (0x0330 - 0x0290)
class UWBP_AssetReward_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Frame;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Icon;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SBZText_Count;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SBZText_Description;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SBZText_Title;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DisplayName;                                       // 0x02C8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   DisplayDescription;                                // 0x02E0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Amount;                                            // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPaperSprite>            Icon;                                              // 0x0300(0x0030)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_AssetReward(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnLoaded_BA88526C4084A77CB124FAB91DC3BFBA(class UObject* Loaded);
	void UpdateAssetCount(int32 InCount);
	void UpdateRewardIconDimensions(class UPaperSprite* Sprite);
	void AddToAssetCount(int32 AddAmount);
	void PlayAppearAnim();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_AssetReward_C">();
	}
	static class UWBP_AssetReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AssetReward_C>();
	}
};
static_assert(alignof(UWBP_AssetReward_C) == 0x000008, "Wrong alignment on UWBP_AssetReward_C");
static_assert(sizeof(UWBP_AssetReward_C) == 0x000330, "Wrong size on UWBP_AssetReward_C");
static_assert(offsetof(UWBP_AssetReward_C, UberGraphFrame) == 0x000290, "Member 'UWBP_AssetReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, FadeIn) == 0x000298, "Member 'UWBP_AssetReward_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, Border_Frame) == 0x0002A0, "Member 'UWBP_AssetReward_C::Border_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, Image_Icon) == 0x0002A8, "Member 'UWBP_AssetReward_C::Image_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, SBZText_Count) == 0x0002B0, "Member 'UWBP_AssetReward_C::SBZText_Count' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, SBZText_Description) == 0x0002B8, "Member 'UWBP_AssetReward_C::SBZText_Description' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, SBZText_Title) == 0x0002C0, "Member 'UWBP_AssetReward_C::SBZText_Title' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, DisplayName) == 0x0002C8, "Member 'UWBP_AssetReward_C::DisplayName' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, DisplayDescription) == 0x0002E0, "Member 'UWBP_AssetReward_C::DisplayDescription' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, Amount) == 0x0002F8, "Member 'UWBP_AssetReward_C::Amount' has a wrong offset!");
static_assert(offsetof(UWBP_AssetReward_C, Icon) == 0x000300, "Member 'UWBP_AssetReward_C::Icon' has a wrong offset!");

}

