#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_DamageFalloff

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_DamageFalloff.WBP_UI_Widget_DamageFalloff_C.ExecuteUbergraph_WBP_UI_Widget_DamageFalloff
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_DamageFalloff_C_ExecuteUbergraph_WBP_UI_Widget_DamageFalloff final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_DamageFalloff_C_ExecuteUbergraph_WBP_UI_Widget_DamageFalloff) == 0x000004, "Wrong alignment on WBP_UI_Widget_DamageFalloff_C_ExecuteUbergraph_WBP_UI_Widget_DamageFalloff");
static_assert(sizeof(WBP_UI_Widget_DamageFalloff_C_ExecuteUbergraph_WBP_UI_Widget_DamageFalloff) == 0x000008, "Wrong size on WBP_UI_Widget_DamageFalloff_C_ExecuteUbergraph_WBP_UI_Widget_DamageFalloff");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_ExecuteUbergraph_WBP_UI_Widget_DamageFalloff, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_DamageFalloff_C_ExecuteUbergraph_WBP_UI_Widget_DamageFalloff::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_ExecuteUbergraph_WBP_UI_Widget_DamageFalloff, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_Widget_DamageFalloff_C_ExecuteUbergraph_WBP_UI_Widget_DamageFalloff::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_DamageFalloff.WBP_UI_Widget_DamageFalloff_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_DamageFalloff_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_DamageFalloff_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_DamageFalloff_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_DamageFalloff_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_DamageFalloff_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_DamageFalloff_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_DamageFalloff.WBP_UI_Widget_DamageFalloff_C.OnPaint
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_UI_Widget_DamageFalloff_C_OnPaint final
{
public:
	struct FPaintContext                          Context;                                           // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue_1;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetPaintSpaceGeometry_ReturnValue;        // 0x0040(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_2;               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_3;               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_DamageFalloff_C_OnPaint) == 0x000008, "Wrong alignment on WBP_UI_Widget_DamageFalloff_C_OnPaint");
static_assert(sizeof(WBP_UI_Widget_DamageFalloff_C_OnPaint) == 0x0000A8, "Wrong size on WBP_UI_Widget_DamageFalloff_C_OnPaint");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, Context) == 0x000000, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::Context' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000030, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_MakeLiteralFloat_ReturnValue_1) == 0x000034, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_MakeLiteralFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_MakeVector2D_ReturnValue) == 0x000038, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_GetPaintSpaceGeometry_ReturnValue) == 0x000040, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_GetPaintSpaceGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_GetLocalSize_ReturnValue) == 0x000078, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_GetLocalSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_BreakVector2D_X) == 0x000080, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_BreakVector2D_Y) == 0x000084, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_Add_FloatFloat_ReturnValue) == 0x000088, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00008C, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_1) == 0x000090, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_2) == 0x000098, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DamageFalloff_C_OnPaint, CallFunc_MakeVector2D_ReturnValue_3) == 0x0000A0, "Member 'WBP_UI_Widget_DamageFalloff_C_OnPaint::CallFunc_MakeVector2D_ReturnValue_3' has a wrong offset!");

}

