#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Preplanning_MainMenu_PreplanningItemButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Preplanning_MainMenu_PreplanningItemButton.WBP_UI_Preplanning_MainMenu_PreplanningItemButton_C
// 0x0040 (0x03B0 - 0x0370)
class UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C final : public USBZMainMenuPrePlanningItemSelectionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Overlay_ButtonVisuals;                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_RemoveVisuals;                             // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_Remove;                                       // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_StackCount;                                   // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_PreplanningItemVisuals_C*       Widget_PreplanningItemVisuals;                     // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsRemoveButton;                                    // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_PreplanningItemButton(int32 EntryPoint);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void SetRemoveAssetButton(bool bIsRemoveAssetButton);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnInitialized();
	void OnPrePlanningItemInitialized(const class USBZPreplanningAssetData* InPreplanningData);
	void PreConstruct(bool IsDesignTime);
	void RefreshVisuals();
	void OnFocused(bool bIsFocused);
	void OnHovered(bool bIsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Preplanning_MainMenu_PreplanningItemButton_C">();
	}
	static class UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C");
static_assert(sizeof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C) == 0x0003B0, "Wrong size on UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C, UberGraphFrame) == 0x000370, "Member 'UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C, Image_Background) == 0x000378, "Member 'UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C, Overlay_ButtonVisuals) == 0x000380, "Member 'UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C::Overlay_ButtonVisuals' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C, Overlay_RemoveVisuals) == 0x000388, "Member 'UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C::Overlay_RemoveVisuals' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C, Text_Remove) == 0x000390, "Member 'UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C::Text_Remove' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C, Text_StackCount) == 0x000398, "Member 'UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C::Text_StackCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C, Widget_PreplanningItemVisuals) == 0x0003A0, "Member 'UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C::Widget_PreplanningItemVisuals' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C, IsRemoveButton) == 0x0003A8, "Member 'UWBP_UI_Preplanning_MainMenu_PreplanningItemButton_C::IsRemoveButton' has a wrong offset!");

}

