#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_Overlay_Right

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C
// 0x0078 (0x0318 - 0x02A0)
class UWBP_UI_HUD_Overlay_Right_C final : public USBZHUDOverlayRight
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BackgroundColor;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SecurityModifiers_VB;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Difficulty;                                   // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_LevelName;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SecurityCompany;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Title;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Difficulity;                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_Favors;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VerticalBox_SecurityModifiers;                     // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UPD3SecurityCompanyDataAsset*>   SecurityCompanyAssetArray;                         // 0x02F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<ESBZSecurityCompany>                   SecurityCompanyTypeArray;                          // 0x0300(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USBZUIData*                             UIData;                                            // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_HUD_Overlay_Right(int32 EntryPoint);
	void OnInitialized();
	void OnLoaded_45950CCB4250C2A3A91CA382B6A32B48(class UObject* Loaded);
	void SetDifficultyText();
	void Set_Security_Companies();
	void SetHeistName();
	void UpdateDifficulityVisibility();
	void UpdateFavorVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_HUD_Overlay_Right_C">();
	}
	static class UWBP_UI_HUD_Overlay_Right_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_HUD_Overlay_Right_C>();
	}
};
static_assert(alignof(UWBP_UI_HUD_Overlay_Right_C) == 0x000008, "Wrong alignment on UWBP_UI_HUD_Overlay_Right_C");
static_assert(sizeof(UWBP_UI_HUD_Overlay_Right_C) == 0x000318, "Wrong size on UWBP_UI_HUD_Overlay_Right_C");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_UI_HUD_Overlay_Right_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, BackgroundColor) == 0x0002A8, "Member 'UWBP_UI_HUD_Overlay_Right_C::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, SecurityModifiers_VB) == 0x0002B0, "Member 'UWBP_UI_HUD_Overlay_Right_C::SecurityModifiers_VB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, Text_Difficulty) == 0x0002B8, "Member 'UWBP_UI_HUD_Overlay_Right_C::Text_Difficulty' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, Text_LevelName) == 0x0002C0, "Member 'UWBP_UI_HUD_Overlay_Right_C::Text_LevelName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, Text_SecurityCompany) == 0x0002C8, "Member 'UWBP_UI_HUD_Overlay_Right_C::Text_SecurityCompany' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, Text_Title) == 0x0002D0, "Member 'UWBP_UI_HUD_Overlay_Right_C::Text_Title' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, VerticalBox_Difficulity) == 0x0002D8, "Member 'UWBP_UI_HUD_Overlay_Right_C::VerticalBox_Difficulity' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, VerticalBox_Favors) == 0x0002E0, "Member 'UWBP_UI_HUD_Overlay_Right_C::VerticalBox_Favors' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, VerticalBox_SecurityModifiers) == 0x0002E8, "Member 'UWBP_UI_HUD_Overlay_Right_C::VerticalBox_SecurityModifiers' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, SecurityCompanyAssetArray) == 0x0002F0, "Member 'UWBP_UI_HUD_Overlay_Right_C::SecurityCompanyAssetArray' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, SecurityCompanyTypeArray) == 0x000300, "Member 'UWBP_UI_HUD_Overlay_Right_C::SecurityCompanyTypeArray' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Right_C, UIData) == 0x000310, "Member 'UWBP_UI_HUD_Overlay_Right_C::UIData' has a wrong offset!");

}

