#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SocialScreen

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.ExecuteUbergraph_WBP_UI_SocialScreen
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0018(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0034(0x0014)(ZeroConstructor, NoDestructor)
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZGameStateMachineState                     CallFunc_GetGameStateMachineState_ReturnValue;     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Social_ContextMenu_C*           CallFunc_IsContextMenuDisplayed_ContextMenu;       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                K2Node_MakeMap_Map;                                // 0x0078(0x0050)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FText& Text)>      K2Node_CreateDelegate_OutputDelegate_1;            // 0x00D4(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue_1;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item;                           // 0x00F0(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameStateInHeist_IsInHeist;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZGameStateMachineState                     CallFunc_GetGameStateMachineState_ReturnValue_1;   // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x1];                                      // 0x0123(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0140(0x0030)()
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0170(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0180(0x0010)(ReferenceParm)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0198(0x0028)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x01C0(0x0014)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D5[0x3];                                      // 0x01D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue_1;     // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen");
static_assert(sizeof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen) == 0x0001F8, "Wrong size on WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_int_Array_Index_Variable) == 0x000010, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_byte_Variable_2) == 0x000014, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_Event_PreviousValue) == 0x000018, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_CustomEvent_ActionName) == 0x000024, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000034, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000048, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_GetGameStateMachineState_ReturnValue) == 0x000050, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_GetGameStateMachineState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000052, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_IsContextMenuDisplayed_ContextMenu) == 0x000058, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_IsContextMenuDisplayed_ContextMenu' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_bool_Variable) == 0x000060, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_IsValid_ReturnValue_2) == 0x000061, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_Select_Default) == 0x000062, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_byte_Variable_3) == 0x000063, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_ComponentBoundEvent_Button_1) == 0x000068, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000070, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_MakeMap_Map) == 0x000078, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_ComponentBoundEvent_Button) == 0x0000C8, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_IsVisible_ReturnValue) == 0x0000D0, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_bool_Variable_1) == 0x0000D1, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000D4, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_HasKeyboardFocus_ReturnValue) == 0x0000E8, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_HasKeyboardFocus_ReturnValue_1) == 0x0000E9, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_HasKeyboardFocus_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_Array_Length_ReturnValue) == 0x000108, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_Array_Add_ReturnValue) == 0x00010C, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_int_Variable) == 0x000114, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_ComponentBoundEvent_NewIndex) == 0x000118, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_int_Variable_1) == 0x00011C, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_IsGameStateInHeist_IsInHeist) == 0x000120, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_IsGameStateInHeist_IsInHeist' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_GetGameStateMachineState_ReturnValue_1) == 0x000121, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_GetGameStateMachineState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000122, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x000124, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_BooleanOR_ReturnValue) == 0x000130, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_GetUIManager_ReturnValue) == 0x000138, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_MakeStruct_SBZButtonControlReference) == 0x000140, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_PopStack_ReturnValue) == 0x000170, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_MakeArray_Array) == 0x000180, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_GetUIManager_ReturnValue_1) == 0x000190, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000198, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001C0, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_Select_Default_1) == 0x0001D4, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x0001D8, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, Temp_bool_Variable_2) == 0x0001E0, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, CallFunc_PlayAnimationTimeRange_ReturnValue_1) == 0x0001E8, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::CallFunc_PlayAnimationTimeRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen, K2Node_Select_Default_2) == 0x0001F0, "Member 'WBP_UI_SocialScreen_C_ExecuteUbergraph_WBP_UI_SocialScreen::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.BndEvt__WBP_UI_SocialScreen_WBP_Local_Navbar_K2Node_ComponentBoundEvent_3_OnIndexChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialScreen_WBP_Local_Navbar_K2Node_ComponentBoundEvent_3_OnIndexChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialScreen_WBP_Local_Navbar_K2Node_ComponentBoundEvent_3_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialScreen_WBP_Local_Navbar_K2Node_ComponentBoundEvent_3_OnIndexChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialScreen_WBP_Local_Navbar_K2Node_ComponentBoundEvent_3_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialScreen_WBP_Local_Navbar_K2Node_ComponentBoundEvent_3_OnIndexChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialScreen_WBP_Local_Navbar_K2Node_ComponentBoundEvent_3_OnIndexChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialScreen_WBP_Local_Navbar_K2Node_ComponentBoundEvent_3_OnIndexChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_SocialScreen_C_BndEvt__WBP_UI_SocialSearchScreen_Widget_SearchUser_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.OnControlsReferencePressed
// 0x000C (0x000C - 0x0000)
struct WBP_UI_SocialScreen_C_OnControlsReferencePressed final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SocialScreen_C_OnControlsReferencePressed) == 0x000004, "Wrong alignment on WBP_UI_SocialScreen_C_OnControlsReferencePressed");
static_assert(sizeof(WBP_UI_SocialScreen_C_OnControlsReferencePressed) == 0x00000C, "Wrong size on WBP_UI_SocialScreen_C_OnControlsReferencePressed");
static_assert(offsetof(WBP_UI_SocialScreen_C_OnControlsReferencePressed, ActionName) == 0x000000, "Member 'WBP_UI_SocialScreen_C_OnControlsReferencePressed::ActionName' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_SocialScreen_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SocialScreen_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_SocialScreen_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_SocialScreen_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_SocialScreen_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_SocialScreen_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_SocialScreen_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.UpdateMenuControlReference
// 0x0158 (0x0158 - 0x0000)
struct WBP_UI_SocialScreen_C_UpdateMenuControlReference final
{
public:
	TMap<class FName, class FText>                ButtonActionDisplayText;                           // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<struct FSBZButtonControlReference>     ActionList;                                        // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0060(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Map_Find_Value;                           // 0x0088(0x0018)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x00A8(0x0030)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x00E0(0x0030)()
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0110(0x0028)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x013C(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SocialScreen_C_UpdateMenuControlReference) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_UpdateMenuControlReference");
static_assert(sizeof(WBP_UI_SocialScreen_C_UpdateMenuControlReference) == 0x000158, "Wrong size on WBP_UI_SocialScreen_C_UpdateMenuControlReference");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, ButtonActionDisplayText) == 0x000000, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::ButtonActionDisplayText' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, ActionList) == 0x000050, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::ActionList' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, CallFunc_Map_Keys_Keys) == 0x000060, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, Temp_int_Array_Index_Variable) == 0x000070, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, CallFunc_Map_Find_Value) == 0x000088, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, CallFunc_Map_Find_ReturnValue) == 0x0000A0, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, Temp_int_Loop_Counter_Variable) == 0x0000A4, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, K2Node_MakeStruct_SBZButtonControlReference) == 0x0000A8, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, CallFunc_Add_IntInt_ReturnValue) == 0x0000DC, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x0000E0, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000110, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, CallFunc_Array_Add_ReturnValue) == 0x000138, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, K2Node_CreateDelegate_OutputDelegate) == 0x00013C, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateMenuControlReference, CallFunc_Array_Add_ReturnValue_1) == 0x000150, "Member 'WBP_UI_SocialScreen_C_UpdateMenuControlReference::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.HandleButtonFocusChanged
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_UI_SocialScreen_C_HandleButtonFocusChanged final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsButtonEnabled;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                ButtonActionDisplayText;                           // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	TMap<class FName, class FText>                EmptyButtonActionDisplayText;                      // 0x0060(0x0050)(Edit, BlueprintVisible)
};
static_assert(alignof(WBP_UI_SocialScreen_C_HandleButtonFocusChanged) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_HandleButtonFocusChanged");
static_assert(sizeof(WBP_UI_SocialScreen_C_HandleButtonFocusChanged) == 0x0000B0, "Wrong size on WBP_UI_SocialScreen_C_HandleButtonFocusChanged");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleButtonFocusChanged, Button) == 0x000000, "Member 'WBP_UI_SocialScreen_C_HandleButtonFocusChanged::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleButtonFocusChanged, IsButtonEnabled) == 0x000008, "Member 'WBP_UI_SocialScreen_C_HandleButtonFocusChanged::IsButtonEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleButtonFocusChanged, ButtonActionDisplayText) == 0x000010, "Member 'WBP_UI_SocialScreen_C_HandleButtonFocusChanged::ButtonActionDisplayText' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleButtonFocusChanged, EmptyButtonActionDisplayText) == 0x000060, "Member 'WBP_UI_SocialScreen_C_HandleButtonFocusChanged::EmptyButtonActionDisplayText' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.IsContextMenuDisplayed
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SocialScreen_C_IsContextMenuDisplayed final
{
public:
	class UWBP_UI_Social_ContextMenu_C*           ContextMenu;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SocialScreen_C_IsContextMenuDisplayed) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_IsContextMenuDisplayed");
static_assert(sizeof(WBP_UI_SocialScreen_C_IsContextMenuDisplayed) == 0x000010, "Wrong size on WBP_UI_SocialScreen_C_IsContextMenuDisplayed");
static_assert(offsetof(WBP_UI_SocialScreen_C_IsContextMenuDisplayed, ContextMenu) == 0x000000, "Member 'WBP_UI_SocialScreen_C_IsContextMenuDisplayed::ContextMenu' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_IsContextMenuDisplayed, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_UI_SocialScreen_C_IsContextMenuDisplayed::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_IsContextMenuDisplayed, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'WBP_UI_SocialScreen_C_IsContextMenuDisplayed::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.BindContextMenu
// 0x0058 (0x0058 - 0x0000)
struct WBP_UI_SocialScreen_C_BindContextMenu final
{
public:
	class USBZPlayerCardContainer*                PlayerCardContainer;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           PlayerCardList;                                    // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Social_PlayerCard_C*            K2Node_DynamicCast_AsWBP_UI_Social_Player_Card;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_UI_Social_PlayerCard_C* ActiveContext)> K2Node_CreateDelegate_OutputDelegate; // 0x003C(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SocialScreen_C_BindContextMenu) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_BindContextMenu");
static_assert(sizeof(WBP_UI_SocialScreen_C_BindContextMenu) == 0x000058, "Wrong size on WBP_UI_SocialScreen_C_BindContextMenu");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, PlayerCardContainer) == 0x000000, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::PlayerCardContainer' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, PlayerCardList) == 0x000008, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::PlayerCardList' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, CallFunc_GetChildrenCount_ReturnValue) == 0x000010, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, Temp_int_Variable) == 0x000014, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, K2Node_DynamicCast_AsWBP_UI_Social_Player_Card) == 0x000028, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::K2Node_DynamicCast_AsWBP_UI_Social_Player_Card' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000031, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, CallFunc_Add_IntInt_ReturnValue) == 0x000034, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000038, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_BindContextMenu, CallFunc_BooleanOR_ReturnValue) == 0x000050, "Member 'WBP_UI_SocialScreen_C_BindContextMenu::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.OnContextMenuOpened
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SocialScreen_C_OnContextMenuOpened final
{
public:
	class UWBP_UI_Social_PlayerCard_C*            ActivePlayerCard;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SocialScreen_C_OnContextMenuOpened) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_OnContextMenuOpened");
static_assert(sizeof(WBP_UI_SocialScreen_C_OnContextMenuOpened) == 0x000010, "Wrong size on WBP_UI_SocialScreen_C_OnContextMenuOpened");
static_assert(offsetof(WBP_UI_SocialScreen_C_OnContextMenuOpened, ActivePlayerCard) == 0x000000, "Member 'WBP_UI_SocialScreen_C_OnContextMenuOpened::ActivePlayerCard' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_OnContextMenuOpened, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_UI_SocialScreen_C_OnContextMenuOpened::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_OnContextMenuOpened, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000009, "Member 'WBP_UI_SocialScreen_C_OnContextMenuOpened::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.UpdateDefaultFocus
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_SocialScreen_C_UpdateDefaultFocus final
{
public:
	class UWBP_UI_Social_PlayerCard_C*            FirstVisibleOfContainer;                           // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                PlayerCardToFocus;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SocialScreen_C_UpdateDefaultFocus) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_UpdateDefaultFocus");
static_assert(sizeof(WBP_UI_SocialScreen_C_UpdateDefaultFocus) == 0x000018, "Wrong size on WBP_UI_SocialScreen_C_UpdateDefaultFocus");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateDefaultFocus, FirstVisibleOfContainer) == 0x000000, "Member 'WBP_UI_SocialScreen_C_UpdateDefaultFocus::FirstVisibleOfContainer' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateDefaultFocus, PlayerCardToFocus) == 0x000008, "Member 'WBP_UI_SocialScreen_C_UpdateDefaultFocus::PlayerCardToFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_UpdateDefaultFocus, CallFunc_IsVisible_ReturnValue) == 0x000010, "Member 'WBP_UI_SocialScreen_C_UpdateDefaultFocus::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.HandleSearchTextChanged
// 0x0070 (0x0070 - 0x0000)
struct WBP_UI_SocialScreen_C_HandleSearchTextChanged final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0058(0x0018)()
};
static_assert(alignof(WBP_UI_SocialScreen_C_HandleSearchTextChanged) == 0x000008, "Wrong alignment on WBP_UI_SocialScreen_C_HandleSearchTextChanged");
static_assert(sizeof(WBP_UI_SocialScreen_C_HandleSearchTextChanged) == 0x000070, "Wrong size on WBP_UI_SocialScreen_C_HandleSearchTextChanged");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleSearchTextChanged, InText) == 0x000000, "Member 'WBP_UI_SocialScreen_C_HandleSearchTextChanged::InText' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleSearchTextChanged, CallFunc_Conv_TextToString_ReturnValue) == 0x000018, "Member 'WBP_UI_SocialScreen_C_HandleSearchTextChanged::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleSearchTextChanged, CallFunc_Len_ReturnValue) == 0x000028, "Member 'WBP_UI_SocialScreen_C_HandleSearchTextChanged::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleSearchTextChanged, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000030, "Member 'WBP_UI_SocialScreen_C_HandleSearchTextChanged::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleSearchTextChanged, CallFunc_Left_ReturnValue) == 0x000040, "Member 'WBP_UI_SocialScreen_C_HandleSearchTextChanged::CallFunc_Left_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleSearchTextChanged, CallFunc_Greater_IntInt_ReturnValue) == 0x000050, "Member 'WBP_UI_SocialScreen_C_HandleSearchTextChanged::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SocialScreen_C_HandleSearchTextChanged, CallFunc_Conv_StringToText_ReturnValue) == 0x000058, "Member 'WBP_UI_SocialScreen_C_HandleSearchTextChanged::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_UI_SocialScreen.WBP_UI_SocialScreen_C.SetFocusOnActiveContainer
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_UI_SocialScreen_C_SetFocusOnActiveContainer final
{
public:
	TMap<class FName, class FText>                EmptyButtonActionDisplayText;                      // 0x0000(0x0050)(Edit, BlueprintVisible)
	class UPanelWidget*                           PlayerCardList;                                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         VisiblePlayerCardIndex;                            // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0060(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
