#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_LoadoutSkillsButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C.ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton
// 0x0090 (0x0090 - 0x0000)
struct WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Variable_1;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_EquippedSkillCount;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_2;                               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_3;                               // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkillManager*                       CallFunc_GetSkillManager_ReturnValue;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEarnedSkillPoints_ReturnValue;         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlay*                               K2Node_Select_Default_1;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_Select_Default_2;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseInventoryItemVisualsWidget*     K2Node_Select_Default_3;                           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             K2Node_Select_Default_4;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton");
static_assert(sizeof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton) == 0x000090, "Wrong size on WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, EntryPoint) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, Temp_int_Variable) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, K2Node_Event_IsDesignTime) == 0x00000C, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, Temp_byte_Variable_1) == 0x00000D, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, K2Node_Event_bInHasFocus) == 0x00000E, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, K2Node_Event_bInIsHovered) == 0x00000F, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, Temp_int_Variable_1) == 0x000010, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::Temp_int_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, K2Node_Event_EquippedSkillCount) == 0x000014, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::K2Node_Event_EquippedSkillCount' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, CallFunc_Array_IsValidIndex_ReturnValue) == 0x000020, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::CallFunc_Array_IsValidIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, Temp_bool_Variable) == 0x000021, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, K2Node_Select_Default) == 0x000040, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, Temp_int_Variable_2) == 0x000044, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::Temp_int_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, Temp_int_Variable_3) == 0x000048, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::Temp_int_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, CallFunc_GetSkillManager_ReturnValue) == 0x000050, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::CallFunc_GetSkillManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, CallFunc_GetEarnedSkillPoints_ReturnValue) == 0x000058, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::CallFunc_GetEarnedSkillPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, CallFunc_Subtract_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, Temp_int_Variable_4) == 0x000060, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::Temp_int_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, K2Node_Select_Default_1) == 0x000068, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, K2Node_Select_Default_2) == 0x000070, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, K2Node_Select_Default_3) == 0x000078, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, K2Node_Select_Default_4) == 0x000080, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000088, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutSkillsButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C.InitializeSkills
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkills final
{
public:
	int32                                         EquippedSkillCount;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkills) == 0x000004, "Wrong alignment on WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkills");
static_assert(sizeof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkills) == 0x000004, "Wrong size on WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkills");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkills, EquippedSkillCount) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkills::EquippedSkillCount' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Inventory_LoadoutSkillsButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutSkillsButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Inventory_LoadoutSkillsButton_C_PreConstruct");
static_assert(sizeof(WBP_UI_Inventory_LoadoutSkillsButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Inventory_LoadoutSkillsButton_C_PreConstruct");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C.OnHover
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Inventory_LoadoutSkillsButton_C_OnHover final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutSkillsButton_C_OnHover) == 0x000001, "Wrong alignment on WBP_UI_Inventory_LoadoutSkillsButton_C_OnHover");
static_assert(sizeof(WBP_UI_Inventory_LoadoutSkillsButton_C_OnHover) == 0x000001, "Wrong size on WBP_UI_Inventory_LoadoutSkillsButton_C_OnHover");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_OnHover, bIsHovered) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_OnHover::bIsHovered' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C.OnFocused
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused final
{
public:
	bool                                          bIsFocused;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused");
static_assert(sizeof(WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused) == 0x000028, "Wrong size on WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused, bIsFocused) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused::bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused, CallFunc_SelectColor_ReturnValue) == 0x000018, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_OnFocused::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C.RefreshVisuals
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_Inventory_LoadoutSkillsButton_C_RefreshVisuals final
{
public:
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutSkillsButton_C_RefreshVisuals) == 0x000001, "Wrong alignment on WBP_UI_Inventory_LoadoutSkillsButton_C_RefreshVisuals");
static_assert(sizeof(WBP_UI_Inventory_LoadoutSkillsButton_C_RefreshVisuals) == 0x000002, "Wrong size on WBP_UI_Inventory_LoadoutSkillsButton_C_RefreshVisuals");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_RefreshVisuals, CallFunc_IsHovered_ReturnValue) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_RefreshVisuals::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_RefreshVisuals, CallFunc_HasKeyboardFocus_ReturnValue) == 0x000001, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_RefreshVisuals::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutSkillsButton.WBP_UI_Inventory_LoadoutSkillsButton_C.InitializeSkillPointsVisual
// 0x0078 (0x0078 - 0x0000)
struct WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual final
{
public:
	int32                                         SkillPointsRemaining;                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0008(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0060(0x0018)()
};
static_assert(alignof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual");
static_assert(sizeof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual) == 0x000078, "Wrong size on WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual, SkillPointsRemaining) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual::SkillPointsRemaining' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual, K2Node_MakeStruct_FormatArgumentData) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual, K2Node_MakeArray_Array) == 0x000050, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual, CallFunc_Format_ReturnValue) == 0x000060, "Member 'WBP_UI_Inventory_LoadoutSkillsButton_C_InitializeSkillPointsVisual::CallFunc_Format_ReturnValue' has a wrong offset!");

}

