#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_Debug_MainMenuVersionText_

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_Debug_MainMenuVersionText_.WBP_UI_Widget_Debug_MainMenuVersionText__C
// 0x0020 (0x02B0 - 0x0290)
class UWBP_UI_Widget_Debug_MainMenuVersionText__C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             txtText;                                           // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_Debug_MainMenuVersionText_(int32 EntryPoint);
	void OnInitialized();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetText(const class FString& NewParam);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_Debug_MainMenuVersionText__C">();
	}
	static class UWBP_UI_Widget_Debug_MainMenuVersionText__C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_Debug_MainMenuVersionText__C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_Debug_MainMenuVersionText__C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_Debug_MainMenuVersionText__C");
static_assert(sizeof(UWBP_UI_Widget_Debug_MainMenuVersionText__C) == 0x0002B0, "Wrong size on UWBP_UI_Widget_Debug_MainMenuVersionText__C");
static_assert(offsetof(UWBP_UI_Widget_Debug_MainMenuVersionText__C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_Debug_MainMenuVersionText__C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Debug_MainMenuVersionText__C, txtText) == 0x000298, "Member 'UWBP_UI_Widget_Debug_MainMenuVersionText__C::txtText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Debug_MainMenuVersionText__C, Text) == 0x0002A0, "Member 'UWBP_UI_Widget_Debug_MainMenuVersionText__C::Text' has a wrong offset!");

}

