#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PocketDrillWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PocketDrillWidget.WBP_PocketDrillWidget_C
// 0x0020 (0x0310 - 0x02F0)
class UWBP_PocketDrillWidget_C final : public USBZDrillWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_590;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             StateText;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUserWidget*                            Target;                                            // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PocketDrillWidget(int32 EntryPoint);
	void OnUpdateBreachState(ESBZBreachingEquipmentState NewState);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PocketDrillWidget_C">();
	}
	static class UWBP_PocketDrillWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PocketDrillWidget_C>();
	}
};
static_assert(alignof(UWBP_PocketDrillWidget_C) == 0x000008, "Wrong alignment on UWBP_PocketDrillWidget_C");
static_assert(sizeof(UWBP_PocketDrillWidget_C) == 0x000310, "Wrong size on UWBP_PocketDrillWidget_C");
static_assert(offsetof(UWBP_PocketDrillWidget_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_PocketDrillWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PocketDrillWidget_C, Image_590) == 0x0002F8, "Member 'UWBP_PocketDrillWidget_C::Image_590' has a wrong offset!");
static_assert(offsetof(UWBP_PocketDrillWidget_C, StateText) == 0x000300, "Member 'UWBP_PocketDrillWidget_C::StateText' has a wrong offset!");
static_assert(offsetof(UWBP_PocketDrillWidget_C, Target) == 0x000308, "Member 'UWBP_PocketDrillWidget_C::Target' has a wrong offset!");

}

