#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_PlayerCardContainer_FilterButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_PlayerCardContainer_FilterButton.WBP_UI_PlayerCardContainer_FilterButton_C
// 0x0048 (0x03A8 - 0x0360)
class UWBP_UI_PlayerCardContainer_FilterButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Icon_Image;                                        // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperSprite*                           ButtonIcon;                                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActiveColor;                                       // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           InactiveColor;                                     // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverColor;                                        // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_PlayerCardContainer_FilterButton(int32 EntryPoint);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void ButtonFocusedChanged(bool bInHasFocus);
	void PreConstruct(bool IsDesignTime);
	void OnReferenceSelected(class FName ActionName);
	void SetIcon(class UPaperSprite* Icon);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_PlayerCardContainer_FilterButton_C">();
	}
	static class UWBP_UI_PlayerCardContainer_FilterButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_PlayerCardContainer_FilterButton_C>();
	}
};
static_assert(alignof(UWBP_UI_PlayerCardContainer_FilterButton_C) == 0x000008, "Wrong alignment on UWBP_UI_PlayerCardContainer_FilterButton_C");
static_assert(sizeof(UWBP_UI_PlayerCardContainer_FilterButton_C) == 0x0003A8, "Wrong size on UWBP_UI_PlayerCardContainer_FilterButton_C");
static_assert(offsetof(UWBP_UI_PlayerCardContainer_FilterButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_PlayerCardContainer_FilterButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PlayerCardContainer_FilterButton_C, Icon_Image) == 0x000368, "Member 'UWBP_UI_PlayerCardContainer_FilterButton_C::Icon_Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PlayerCardContainer_FilterButton_C, ButtonIcon) == 0x000370, "Member 'UWBP_UI_PlayerCardContainer_FilterButton_C::ButtonIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PlayerCardContainer_FilterButton_C, ActiveColor) == 0x000378, "Member 'UWBP_UI_PlayerCardContainer_FilterButton_C::ActiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PlayerCardContainer_FilterButton_C, InactiveColor) == 0x000388, "Member 'UWBP_UI_PlayerCardContainer_FilterButton_C::InactiveColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PlayerCardContainer_FilterButton_C, HoverColor) == 0x000398, "Member 'UWBP_UI_PlayerCardContainer_FilterButton_C::HoverColor' has a wrong offset!");

}

