#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_MaskSlotButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_MaskSlotButton.WBP_UI_Inventory_MaskSlotButton_C
// 0x0098 (0x04D0 - 0x0438)
class UWBP_UI_Inventory_MaskSlotButton_C final : public USBZMainMenuInventoryMaskSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0440(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Customize_O;                                       // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Equipped_Text;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EquippedB;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_98;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plus_Icon_1;                                       // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Preset_O;                                          // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Purchase;                                          // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TextBlock_Name;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Inventory_HorizontalModGrid_C*  WBP_UI_Inventory_HorizontalModGrid;                // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_Icon;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Inventory_MaskSlotButton(int32 EntryPoint);
	void OnInitialized();
	void SetActiveMaskSlot(bool bIsActiveMaskSlot);
	void OnMaskSlotInitialized();
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void PreConstruct(bool IsDesignTime);
	void RefreshVisuals();
	void OnHover(bool bIsHovered);
	void OnFocused(bool bIsFocused);
	void Set_Mask_Name_Colour(const struct FLinearColor& DesiredColour);
	void InitializeSuitVisuals();
	void CanCustomize(bool* CanCustomize_0);
	void Get_Mould_Mod_Data(class USBZModularPartDataAsset** Part);
	class USBZInventoryBaseData* GetMaskMouldOrData();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_MaskSlotButton_C">();
	}
	static class UWBP_UI_Inventory_MaskSlotButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_MaskSlotButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_MaskSlotButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_MaskSlotButton_C");
static_assert(sizeof(UWBP_UI_Inventory_MaskSlotButton_C) == 0x0004D0, "Wrong size on UWBP_UI_Inventory_MaskSlotButton_C");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, UberGraphFrame) == 0x000438, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, HoverAnim) == 0x000440, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Border_Highlight) == 0x000448, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Customize_O) == 0x000450, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Customize_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Equipped_Text) == 0x000458, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Equipped_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, EquippedB) == 0x000460, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::EquippedB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Image) == 0x000468, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Image_1) == 0x000470, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Image_2) == 0x000478, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Image_7) == 0x000480, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Image_98) == 0x000488, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Image_98' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Image_511) == 0x000490, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Image_Background) == 0x000498, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Plus_Icon_1) == 0x0004A0, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Plus_Icon_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Preset_O) == 0x0004A8, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Preset_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Purchase) == 0x0004B0, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Purchase' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, TextBlock_Name) == 0x0004B8, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, WBP_UI_Inventory_HorizontalModGrid) == 0x0004C0, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::WBP_UI_Inventory_HorizontalModGrid' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_MaskSlotButton_C, Widget_Icon) == 0x0004C8, "Member 'UWBP_UI_Inventory_MaskSlotButton_C::Widget_Icon' has a wrong offset!");

}

