#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_3D_Widget

#include "Basic.hpp"

#include "CompState_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_3D_Widget.WBP_3D_Widget_C
// 0x0048 (0x02D8 - 0x0290)
class UWBP_3D_Widget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_ComputerNonActive_C*               WBP_ComputerNonActive;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ComputerTrueActive_C*              WBP_ComputerTrueActive;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HackingTimer_C*                    WBP_HackingTimer;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_1_C*                          WBP_Menu_1;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_2_C*                          WBP_Menu_2;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Menu_3_C*                          WBP_Menu_3;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_MenuStart_C*                       WBP_MenuStart;                                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ECompState                                    Int;                                               // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_3D_Widget(int32 EntryPoint);
	void SetScrollDownFocus(bool NewParam);
	void SetScrollUpFocus(bool NewParam);
	void Set_ButtonUsed();
	void SetActiveButtonFocus(int32 Selection, bool NewParam);
	void SetArtList(const class FString& NewParam);
	void SetBackButtonFocus(int32 Int_0, bool NewParam);
	void SetMenuFocusOnButtons(int32 NewParam, bool NewParam2);
	void Set_State(ECompState Int_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_3D_Widget_C">();
	}
	static class UWBP_3D_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_3D_Widget_C>();
	}
};
static_assert(alignof(UWBP_3D_Widget_C) == 0x000008, "Wrong alignment on UWBP_3D_Widget_C");
static_assert(sizeof(UWBP_3D_Widget_C) == 0x0002D8, "Wrong size on UWBP_3D_Widget_C");
static_assert(offsetof(UWBP_3D_Widget_C, UberGraphFrame) == 0x000290, "Member 'UWBP_3D_Widget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_3D_Widget_C, WBP_ComputerNonActive) == 0x000298, "Member 'UWBP_3D_Widget_C::WBP_ComputerNonActive' has a wrong offset!");
static_assert(offsetof(UWBP_3D_Widget_C, WBP_ComputerTrueActive) == 0x0002A0, "Member 'UWBP_3D_Widget_C::WBP_ComputerTrueActive' has a wrong offset!");
static_assert(offsetof(UWBP_3D_Widget_C, WBP_HackingTimer) == 0x0002A8, "Member 'UWBP_3D_Widget_C::WBP_HackingTimer' has a wrong offset!");
static_assert(offsetof(UWBP_3D_Widget_C, WBP_Menu_1) == 0x0002B0, "Member 'UWBP_3D_Widget_C::WBP_Menu_1' has a wrong offset!");
static_assert(offsetof(UWBP_3D_Widget_C, WBP_Menu_2) == 0x0002B8, "Member 'UWBP_3D_Widget_C::WBP_Menu_2' has a wrong offset!");
static_assert(offsetof(UWBP_3D_Widget_C, WBP_Menu_3) == 0x0002C0, "Member 'UWBP_3D_Widget_C::WBP_Menu_3' has a wrong offset!");
static_assert(offsetof(UWBP_3D_Widget_C, WBP_MenuStart) == 0x0002C8, "Member 'UWBP_3D_Widget_C::WBP_MenuStart' has a wrong offset!");
static_assert(offsetof(UWBP_3D_Widget_C, Int) == 0x0002D0, "Member 'UWBP_3D_Widget_C::Int' has a wrong offset!");

}

