#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_SegmentedAttributeBar

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_SegmentedAttributeBar.WBP_UI_Widget_SegmentedAttributeBar_C
// 0x0088 (0x03E8 - 0x0360)
class UWBP_UI_Widget_SegmentedAttributeBar_C final : public UPD3SegmentedPercentWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Shader;                                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         MaxAttribute;                                      // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnBuilt;                                           // 0x0378(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         CurrentPercent;                                    // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundColor;                                   // 0x038C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           MainColor;                                         // 0x039C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           LaggingColor;                                      // 0x03AC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TickThickness;                                     // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TickUpLimit;                                       // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TickDownLimit;                                     // 0x03C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialInst;                                      // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TraumaColor;                                       // 0x03D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TestProgress;                                      // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsVisibilityUpdated;                              // 0x03E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_Widget_SegmentedAttributeBar(int32 EntryPoint);
	void OnInitialized();
	void OnTraumaRatioChanged(float StartOffset, float EndOffset);
	void PreConstruct(bool IsDesignTime);
	void OnMaxAttributeUpdate(float NewValue, float OldPercentage, float NewPercentage);
	void OnCurrentAttributeUpdate(float NewValue, float OldPercentage, float NewPercentage);
	void OnSetup(float CurrentValueSetup, float MaxValueSetup, float PercentageSetup);
	void SetShaderParams();
	void SetShaderProgress(float Progress);
	void UpdateVisibility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_SegmentedAttributeBar_C">();
	}
	static class UWBP_UI_Widget_SegmentedAttributeBar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_SegmentedAttributeBar_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_SegmentedAttributeBar_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_SegmentedAttributeBar_C");
static_assert(sizeof(UWBP_UI_Widget_SegmentedAttributeBar_C) == 0x0003E8, "Wrong size on UWBP_UI_Widget_SegmentedAttributeBar_C");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, Shader) == 0x000368, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::Shader' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, MaxAttribute) == 0x000370, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::MaxAttribute' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, OnBuilt) == 0x000378, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::OnBuilt' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, CurrentPercent) == 0x000388, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::CurrentPercent' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, BackgroundColor) == 0x00038C, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::BackgroundColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, MainColor) == 0x00039C, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::MainColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, LaggingColor) == 0x0003AC, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::LaggingColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, TickThickness) == 0x0003BC, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::TickThickness' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, TickUpLimit) == 0x0003C0, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::TickUpLimit' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, TickDownLimit) == 0x0003C4, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::TickDownLimit' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, MaterialInst) == 0x0003C8, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::MaterialInst' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, TraumaColor) == 0x0003D0, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::TraumaColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, TestProgress) == 0x0003E0, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::TestProgress' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_SegmentedAttributeBar_C, bIsVisibilityUpdated) == 0x0003E4, "Member 'UWBP_UI_Widget_SegmentedAttributeBar_C::bIsVisibilityUpdated' has a wrong offset!");

}

