#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_ItemDescription_StatModule

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_ItemDescription_StatModule.WBP_UI_Inventory_ItemDescription_StatModule_C
// 0x0030 (0x02C0 - 0x0290)
class UWBP_UI_Inventory_ItemDescription_StatModule_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           Progress_Stat_Base;                                // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Progress_Stat_Increase;                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Stat_Base;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Stat_Increase;                                // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Stat_Name;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Inventory_ItemDescription_StatModule(int32 EntryPoint);
	void Construct();
	void SetStat(float BaseValue, float Addition, const class FText& StatName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_ItemDescription_StatModule_C">();
	}
	static class UWBP_UI_Inventory_ItemDescription_StatModule_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_ItemDescription_StatModule_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_ItemDescription_StatModule_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_ItemDescription_StatModule_C");
static_assert(sizeof(UWBP_UI_Inventory_ItemDescription_StatModule_C) == 0x0002C0, "Wrong size on UWBP_UI_Inventory_ItemDescription_StatModule_C");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescription_StatModule_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Inventory_ItemDescription_StatModule_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescription_StatModule_C, Progress_Stat_Base) == 0x000298, "Member 'UWBP_UI_Inventory_ItemDescription_StatModule_C::Progress_Stat_Base' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescription_StatModule_C, Progress_Stat_Increase) == 0x0002A0, "Member 'UWBP_UI_Inventory_ItemDescription_StatModule_C::Progress_Stat_Increase' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescription_StatModule_C, Text_Stat_Base) == 0x0002A8, "Member 'UWBP_UI_Inventory_ItemDescription_StatModule_C::Text_Stat_Base' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescription_StatModule_C, Text_Stat_Increase) == 0x0002B0, "Member 'UWBP_UI_Inventory_ItemDescription_StatModule_C::Text_Stat_Increase' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescription_StatModule_C, Text_Stat_Name) == 0x0002B8, "Member 'UWBP_UI_Inventory_ItemDescription_StatModule_C::Text_Stat_Name' has a wrong offset!");

}

