#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_Overlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_HUD_Overlay.WBP_UI_HUD_Overlay_C
// 0x0038 (0x02C8 - 0x0290)
class UWBP_UI_HUD_Overlay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeIn;                                            // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_Timer_C*                 WBP_UI_Widget_Timer;                               // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_HUD_Overlay_ObjectiveContainer_C* Widget_LeftObjectiveContainer;                   // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_HUD_Overlay_Right_C*            Widget_RightContainer;                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsShowing;                                         // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_HUD_Overlay(int32 EntryPoint);
	void Construct();
	void Hide();
	void Show();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_HUD_Overlay_C">();
	}
	static class UWBP_UI_HUD_Overlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_HUD_Overlay_C>();
	}
};
static_assert(alignof(UWBP_UI_HUD_Overlay_C) == 0x000008, "Wrong alignment on UWBP_UI_HUD_Overlay_C");
static_assert(sizeof(UWBP_UI_HUD_Overlay_C) == 0x0002C8, "Wrong size on UWBP_UI_HUD_Overlay_C");
static_assert(offsetof(UWBP_UI_HUD_Overlay_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_HUD_Overlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_C, FadeOut) == 0x000298, "Member 'UWBP_UI_HUD_Overlay_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_C, FadeIn) == 0x0002A0, "Member 'UWBP_UI_HUD_Overlay_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_C, WBP_UI_Widget_Timer) == 0x0002A8, "Member 'UWBP_UI_HUD_Overlay_C::WBP_UI_Widget_Timer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_C, Widget_LeftObjectiveContainer) == 0x0002B0, "Member 'UWBP_UI_HUD_Overlay_C::Widget_LeftObjectiveContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_C, Widget_RightContainer) == 0x0002B8, "Member 'UWBP_UI_HUD_Overlay_C::Widget_RightContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_C, IsShowing) == 0x0002C0, "Member 'UWBP_UI_HUD_Overlay_C::IsShowing' has a wrong offset!");

}

