#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_ObjectiveContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_ObjectiveContainer.WBP_UI_Widget_ObjectiveContainer_C
// 0x0068 (0x0328 - 0x02C0)
class UWBP_UI_Widget_ObjectiveContainer_C final : public USBZObjectiveContainerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       CloseAnimation;                                    // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OpenAnimation;                                     // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_C*           HUDOverlayKeybind;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_663;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FrameObjective;                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ActivatedObjectiveText;                       // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ObjectiveActivateHeader;                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Twk_DisplayTime;                                   // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_30C[0x4];                                      // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASBZObjective*>                  ObjectiveArray;                                    // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                          bIsPlayingAnimation;                               // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_Widget_ObjectiveContainer(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void WidgetAnimationEvt_CloseAnimation_K2Node_WidgetAnimationEvent_2();
	void ObjectiveAdded(class ASBZObjective* Objective);
	void ObjectiveRemove(class ASBZObjective* Objective);
	void WidgetAnimationEvt_OpenAnimation_K2Node_WidgetAnimationEvent_0();
	void TryPlayAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_ObjectiveContainer_C">();
	}
	static class UWBP_UI_Widget_ObjectiveContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_ObjectiveContainer_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_ObjectiveContainer_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_ObjectiveContainer_C");
static_assert(sizeof(UWBP_UI_Widget_ObjectiveContainer_C) == 0x000328, "Wrong size on UWBP_UI_Widget_ObjectiveContainer_C");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, CloseAnimation) == 0x0002C8, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::CloseAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, OpenAnimation) == 0x0002D0, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::OpenAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, HUDOverlayKeybind) == 0x0002D8, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::HUDOverlayKeybind' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, Image_663) == 0x0002E0, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::Image_663' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, Image_BG) == 0x0002E8, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, Image_FrameObjective) == 0x0002F0, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::Image_FrameObjective' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, Text_ActivatedObjectiveText) == 0x0002F8, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::Text_ActivatedObjectiveText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, Text_ObjectiveActivateHeader) == 0x000300, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::Text_ObjectiveActivateHeader' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, Twk_DisplayTime) == 0x000308, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::Twk_DisplayTime' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, ObjectiveArray) == 0x000310, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::ObjectiveArray' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_ObjectiveContainer_C, bIsPlayingAnimation) == 0x000320, "Member 'UWBP_UI_Widget_ObjectiveContainer_C::bIsPlayingAnimation' has a wrong offset!");

}

