#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SuitInventoryScreen

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SuitInventoryScreen.WBP_UI_SuitInventoryScreen_C.ExecuteUbergraph_WBP_UI_SuitInventoryScreen
// 0x0690 (0x0690 - 0x0000)
struct WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasSuccessful_1;                     // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0014(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0040(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0050(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0080(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_Event_InFocusedButton;                      // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFocused;                           // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x00E8(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x0118(0x0030)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Inventory_SuitSlotButton_C*     K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Button; // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanCustomize_bCanCustomize;               // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget;          // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSuitSlotIndex_ReturnValue;             // 0x017C(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DisplaySuitCustomizationScreen_ReturnValue; // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_182[0x6];                                      // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0198(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue;      // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_4;     // 0x01C8(0x0030)()
	class UWBP_UI_Inventory_SuitSlotButton_C*     K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Button_1; // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_5;     // 0x0208(0x0030)()
	int32                                         CallFunc_GetSuitSlotIndex_ReturnValue_1;           // 0x0238(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0240(0x0010)(ReferenceParm)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0250(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_6;     // 0x0268(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_7;     // 0x0298(0x0030)()
	bool                                          Temp_bool_Variable_1;                              // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x7];                                      // 0x02C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x02D0(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_2;                              // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_8;     // 0x02E8(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_9;     // 0x0318(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_2;                          // 0x0348(0x0010)(ReferenceParm)
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_3;                          // 0x0358(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_bWasSuccessful;                       // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu;       // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue_1;                   // 0x0398(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_1;              // 0x03A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget_1;        // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_10;    // 0x03C0(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_11;    // 0x03F0(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0420(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_434[0x4];                                      // 0x0434(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_4;                          // 0x0438(0x0010)(ReferenceParm)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0448(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0450(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_451[0x7];                                      // 0x0451(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0458(0x0028)()
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0480(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default;                             // 0x0488(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZMainMenuPlayerCharacter*            CallFunc_GetMainMenuMannequin_ReturnValue;         // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1;     // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_3;                              // 0x04A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4AA[0x2];                                      // 0x04AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x04AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x04B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x04B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x04C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x04C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C9[0x7];                                      // 0x04C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x04D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZInventorySlotStoreItem             K2Node_Event_Item;                                 // 0x04D8(0x00E0)(ConstParm)
	bool                                          Temp_bool_Variable_4;                              // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BA[0x6];                                      // 0x05BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Inventory_SuitSlotStoreItemButton_C* K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button; // 0x05C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Inventory_SuitSlotButton_C*     K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Button_2; // 0x05D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x05D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCustomize_bCanCustomize_1;             // 0x05D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanCustomize_bCanCustomize_2;             // 0x05DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05DB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5DD[0x3];                                      // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default_2;                           // 0x05E0(0x0010)(ReferenceParm)
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default_3;                           // 0x05F0(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x0600(0x0028)()
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_2;    // 0x0628(0x0028)()
	int32                                         CallFunc_GetSuitSlotIndex_ReturnValue_2;           // 0x0650(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_654[0x4];                                      // 0x0654(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZSuitConfig                         CallFunc_GetSuitInSlotConfig_ReturnValue;          // 0x0658(0x0028)(ConstParm)
	bool                                          CallFunc_CanDiscardSuitInSlot_ReturnValue;         // 0x0680(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0681(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x0682(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_683[0x5];                                      // 0x0683(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZInventoryBaseData*            K2Node_Select_Default_5;                           // 0x0688(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen) == 0x000008, "Wrong alignment on WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen");
static_assert(sizeof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen) == 0x000690, "Wrong size on WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, Temp_bool_Variable) == 0x000004, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_PlayAnimationForward_ReturnValue) == 0x000008, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Event_bWasSuccessful_1) == 0x000010, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Event_bWasSuccessful_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Event_PreviousValue) == 0x000014, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, Temp_byte_Variable) == 0x000020, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_CustomEvent_ActionName) == 0x000024, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetUIManager_ReturnValue) == 0x000038, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_PopStack_ReturnValue) == 0x000040, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference) == 0x000050, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000080, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Event_InFocusedButton) == 0x0000C8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Event_InFocusedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Event_bIsFocused) == 0x0000D0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Event_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_ComponentBoundEvent_Button_1) == 0x0000D8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x0000E0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x0000E8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x000118, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetUIManager_ReturnValue_1) == 0x000148, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Button) == 0x000150, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_bSuccess) == 0x000158, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetMenuWidget_ReturnValue) == 0x000160, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_CanCustomize_bCanCustomize) == 0x000168, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_CanCustomize_bCanCustomize' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget) == 0x000170, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_bSuccess_1) == 0x000178, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetSuitSlotIndex_ReturnValue) == 0x00017C, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetSuitSlotIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, Temp_byte_Variable_1) == 0x000180, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_DisplaySuitCustomizationScreen_ReturnValue) == 0x000181, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_DisplaySuitCustomizationScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000188, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetChildAt_ReturnValue) == 0x000190, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x000198, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetCustomizationManager_ReturnValue) == 0x0001A8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_4) == 0x0001C8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Button_1) == 0x0001F8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_bSuccess_2) == 0x000200, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_5) == 0x000208, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetSuitSlotIndex_ReturnValue_1) == 0x000238, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetSuitSlotIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeArray_Array) == 0x000240, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x000250, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_6) == 0x000268, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_7) == 0x000298, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, Temp_bool_Variable_1) == 0x0002C8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeArray_Array_1) == 0x0002D0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, Temp_bool_Variable_2) == 0x0002E0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_8) == 0x0002E8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_9) == 0x000318, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeArray_Array_2) == 0x000348, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeArray_Array_3) == 0x000358, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Event_bWasSuccessful) == 0x000368, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Event_bWasSuccessful' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetGameMode_ReturnValue) == 0x000370, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_IsValid_ReturnValue) == 0x000378, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu) == 0x000380, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_bSuccess_3) == 0x000388, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetUIManager_ReturnValue_2) == 0x000390, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_PopStack_ReturnValue_1) == 0x000398, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_PopStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetMenuWidget_ReturnValue_1) == 0x0003A8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetMenuWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_AsSBZMain_Menu_Widget_1) == 0x0003B0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_AsSBZMain_Menu_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_bSuccess_4) == 0x0003B8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_10) == 0x0003C0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlReference_11) == 0x0003F0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlReference_11' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x000420, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeArray_Array_4) == 0x000438, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_ComponentBoundEvent_Button) == 0x000448, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000450, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000458, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetChildAt_ReturnValue_1) == 0x000480, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Select_Default) == 0x000488, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetGameMode_ReturnValue_1) == 0x000490, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetGameMode_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetMainMenuMannequin_ReturnValue) == 0x000498, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetMainMenuMannequin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1) == 0x0004A0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_bSuccess_5) == 0x0004A8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, Temp_bool_Variable_3) == 0x0004A9, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetChildrenCount_ReturnValue) == 0x0004AC, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x0004B0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x0004B4, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_Clamp_ReturnValue) == 0x0004B8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetChildAt_ReturnValue_2) == 0x0004C0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetChildAt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_IsVisible_ReturnValue) == 0x0004C8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Select_Default_1) == 0x0004D0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Event_Item) == 0x0004D8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Event_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, Temp_bool_Variable_4) == 0x0005B8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, Temp_bool_Variable_5) == 0x0005B9, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button) == 0x0005C0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Store_Item_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_bSuccess_6) == 0x0005C8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Button_2) == 0x0005D0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_AsWBP_UI_Inventory_Suit_Slot_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_DynamicCast_bSuccess_7) == 0x0005D8, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_CanCustomize_bCanCustomize_1) == 0x0005D9, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_CanCustomize_bCanCustomize_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_CanCustomize_bCanCustomize_2) == 0x0005DA, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_CanCustomize_bCanCustomize_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_Not_PreBool_ReturnValue) == 0x0005DB, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_Not_PreBool_ReturnValue_1) == 0x0005DC, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Select_Default_2) == 0x0005E0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Select_Default_3) == 0x0005F0, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference_1) == 0x000600, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_MakeStruct_SBZButtonControlsReference_2) == 0x000628, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_MakeStruct_SBZButtonControlsReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetSuitSlotIndex_ReturnValue_2) == 0x000650, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetSuitSlotIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_GetSuitInSlotConfig_ReturnValue) == 0x000658, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_GetSuitInSlotConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_CanDiscardSuitInSlot_ReturnValue) == 0x000680, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_CanDiscardSuitInSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, CallFunc_IsValid_ReturnValue_1) == 0x000681, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Select_Default_4) == 0x000682, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen, K2Node_Select_Default_5) == 0x000688, "Member 'WBP_UI_SuitInventoryScreen_C_ExecuteUbergraph_WBP_UI_SuitInventoryScreen::K2Node_Select_Default_5' has a wrong offset!");

// Function WBP_UI_SuitInventoryScreen.WBP_UI_SuitInventoryScreen_C.OnSlotPriceChanged
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_UI_SuitInventoryScreen_C_OnSlotPriceChanged final
{
public:
	struct FSBZInventorySlotStoreItem             Item;                                              // 0x0000(0x00E0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_SuitInventoryScreen_C_OnSlotPriceChanged) == 0x000008, "Wrong alignment on WBP_UI_SuitInventoryScreen_C_OnSlotPriceChanged");
static_assert(sizeof(WBP_UI_SuitInventoryScreen_C_OnSlotPriceChanged) == 0x0000E0, "Wrong size on WBP_UI_SuitInventoryScreen_C_OnSlotPriceChanged");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_OnSlotPriceChanged, Item) == 0x000000, "Member 'WBP_UI_SuitInventoryScreen_C_OnSlotPriceChanged::Item' has a wrong offset!");

// Function WBP_UI_SuitInventoryScreen.WBP_UI_SuitInventoryScreen_C.BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_WBP_UI_AppearanceTextButton_223_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_SuitInventoryScreen.WBP_UI_SuitInventoryScreen_C.OnItemDiscarded
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_SuitInventoryScreen_C_OnItemDiscarded final
{
public:
	bool                                          bWasSuccessful;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SuitInventoryScreen_C_OnItemDiscarded) == 0x000001, "Wrong alignment on WBP_UI_SuitInventoryScreen_C_OnItemDiscarded");
static_assert(sizeof(WBP_UI_SuitInventoryScreen_C_OnItemDiscarded) == 0x000001, "Wrong size on WBP_UI_SuitInventoryScreen_C_OnItemDiscarded");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_OnItemDiscarded, bWasSuccessful) == 0x000000, "Member 'WBP_UI_SuitInventoryScreen_C_OnItemDiscarded::bWasSuccessful' has a wrong offset!");

// Function WBP_UI_SuitInventoryScreen.WBP_UI_SuitInventoryScreen_C.BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_SuitInventoryScreen_C_BndEvt__WBP_UI_SuitInventoryScreen_Button_BuySlots_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_SuitInventoryScreen.WBP_UI_SuitInventoryScreen_C.SuitSlotButtonFocusedChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SuitInventoryScreen_C_SuitSlotButtonFocusedChanged final
{
public:
	class USBZMenuButton*                         InFocusedButton;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
