#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_Groups_Timed

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_Groups_Timed.WBP_UI_Widget_Groups_Timed_C
// 0x0540 (0x07D0 - 0x0290)
class UWBP_UI_Widget_Groups_Timed_C final : public USBZWidgetBase
{
public:
	class UWBP_UI_Widget_BaseGroupedCounters_RinoHud_C* WBP_UI_Widget_BaseGroupedCounters_RinoHud;   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class AActor*, ESBZHackableActorState>   hackableActors_mapOfStates;                        // 0x0298(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class ASBZHackableActor*, class UWBP_UI_Widget_BaseTimedAction_RinoHud_C*> hackableActors_mapOfAssociations; // 0x02E8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ASBZCarriedHackableKey*, class UWBP_UI_Widget_BaseTimedAction_RinoHud_C*> hackableKeys_mapOfAssociations; // 0x0338(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ASBZBreachingEquipmentBase*, ESBZBreachingEquipmentState> pocketDrills_mapOfStates;   // 0x0388(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class ASBZBreachingEquipmentBase*, class UWBP_UI_Widget_BaseTimedAction_RinoHud_C*> pocketDrills_mapOfAssociations; // 0x03D8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ASBZThermalLance*, ESBZBreachingEquipmentState> thermalDrills_mapOfStates;            // 0x0428(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class ASBZThermalLance*, class UWBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C*> thermalDrills_mapOfAssociations; // 0x0478(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	class UWBP_UI_Widget_BaseTimedSkill_RinoHud_C* GlitchProtocolTimer;                              // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DycryptServerEndSeconds;                           // 0x04D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_BaseTimedActionWzCount_RinoHud_C* DycryptServerWidget;                      // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DecryptServerBags;                                 // 0x04E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JewelryMachineLastUpdate;                          // 0x04E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseTimedActionWzCount_RinoHud_C* JewelryMachineWidget;                     // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZLootProcessorState                        JewelryMachineLastState;                           // 0x04F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          JewelryMachineWasSabotagedAfterDone;               // 0x04F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4F2[0x6];                                      // 0x04F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class ASBZLootProcessor*, class USBZWidgetBase*> SingleLootProcessorWidgets;                // 0x04F8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ASBZLootProcessor*, ESBZLootProcessorState> SingleLootProcessorStates;                // 0x0548(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class ASBZLootProcessor*, float>         SingleLootProcessorLastUpdate;                     // 0x0598(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class ASBZLootProcessor*, bool>          SingleLootProcessorWasSabotagedAfterDone;          // 0x05E8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class ASBZThermite*, class UWBP_UI_Widget_BaseTimedAction_RinoHud_C*> ThermiteWidgets;      // 0x0638(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ASBZModifiableTimer*, ESBZTimerState> modifiableTimers_mapOfStates;                   // 0x0688(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class ASBZModifiableTimer*, class UWBP_UI_Widget_BaseTimedAction_RinoHud_C*> modifiableTimers_mapOfAssociations; // 0x06D8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ASBZPlayerState*, class UWBP_UI_Widget_BaseTimedSkill_RinoHud_C*> interceptor_widgets; // 0x0728(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ASBZPlayerState*, float>           interceptor_end;                                   // 0x0778(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          _________;                                         // 0x07C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void update();
	void Breaching_Equipments_Base_Handling(TArray<class ASBZBreachingEquipmentBase*>& Array);
	void UpdateSingleProcessorLootWidgetValue(const class ASBZLootProcessor*& Key, int32 count, float Distance, uint8 Color, float progress_0_To_100);
	void PrintToModLoader(const class FString& msg, class FString* msg1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_Groups_Timed_C">();
	}
	static class UWBP_UI_Widget_Groups_Timed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_Groups_Timed_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_Groups_Timed_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_Groups_Timed_C");
static_assert(sizeof(UWBP_UI_Widget_Groups_Timed_C) == 0x0007D0, "Wrong size on UWBP_UI_Widget_Groups_Timed_C");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, WBP_UI_Widget_BaseGroupedCounters_RinoHud) == 0x000290, "Member 'UWBP_UI_Widget_Groups_Timed_C::WBP_UI_Widget_BaseGroupedCounters_RinoHud' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, hackableActors_mapOfStates) == 0x000298, "Member 'UWBP_UI_Widget_Groups_Timed_C::hackableActors_mapOfStates' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, hackableActors_mapOfAssociations) == 0x0002E8, "Member 'UWBP_UI_Widget_Groups_Timed_C::hackableActors_mapOfAssociations' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, hackableKeys_mapOfAssociations) == 0x000338, "Member 'UWBP_UI_Widget_Groups_Timed_C::hackableKeys_mapOfAssociations' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, pocketDrills_mapOfStates) == 0x000388, "Member 'UWBP_UI_Widget_Groups_Timed_C::pocketDrills_mapOfStates' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, pocketDrills_mapOfAssociations) == 0x0003D8, "Member 'UWBP_UI_Widget_Groups_Timed_C::pocketDrills_mapOfAssociations' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, thermalDrills_mapOfStates) == 0x000428, "Member 'UWBP_UI_Widget_Groups_Timed_C::thermalDrills_mapOfStates' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, thermalDrills_mapOfAssociations) == 0x000478, "Member 'UWBP_UI_Widget_Groups_Timed_C::thermalDrills_mapOfAssociations' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, GlitchProtocolTimer) == 0x0004C8, "Member 'UWBP_UI_Widget_Groups_Timed_C::GlitchProtocolTimer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, DycryptServerEndSeconds) == 0x0004D0, "Member 'UWBP_UI_Widget_Groups_Timed_C::DycryptServerEndSeconds' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, DycryptServerWidget) == 0x0004D8, "Member 'UWBP_UI_Widget_Groups_Timed_C::DycryptServerWidget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, DecryptServerBags) == 0x0004E0, "Member 'UWBP_UI_Widget_Groups_Timed_C::DecryptServerBags' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, JewelryMachineLastUpdate) == 0x0004E4, "Member 'UWBP_UI_Widget_Groups_Timed_C::JewelryMachineLastUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, JewelryMachineWidget) == 0x0004E8, "Member 'UWBP_UI_Widget_Groups_Timed_C::JewelryMachineWidget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, JewelryMachineLastState) == 0x0004F0, "Member 'UWBP_UI_Widget_Groups_Timed_C::JewelryMachineLastState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, JewelryMachineWasSabotagedAfterDone) == 0x0004F1, "Member 'UWBP_UI_Widget_Groups_Timed_C::JewelryMachineWasSabotagedAfterDone' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, SingleLootProcessorWidgets) == 0x0004F8, "Member 'UWBP_UI_Widget_Groups_Timed_C::SingleLootProcessorWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, SingleLootProcessorStates) == 0x000548, "Member 'UWBP_UI_Widget_Groups_Timed_C::SingleLootProcessorStates' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, SingleLootProcessorLastUpdate) == 0x000598, "Member 'UWBP_UI_Widget_Groups_Timed_C::SingleLootProcessorLastUpdate' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, SingleLootProcessorWasSabotagedAfterDone) == 0x0005E8, "Member 'UWBP_UI_Widget_Groups_Timed_C::SingleLootProcessorWasSabotagedAfterDone' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, ThermiteWidgets) == 0x000638, "Member 'UWBP_UI_Widget_Groups_Timed_C::ThermiteWidgets' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, modifiableTimers_mapOfStates) == 0x000688, "Member 'UWBP_UI_Widget_Groups_Timed_C::modifiableTimers_mapOfStates' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, modifiableTimers_mapOfAssociations) == 0x0006D8, "Member 'UWBP_UI_Widget_Groups_Timed_C::modifiableTimers_mapOfAssociations' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, interceptor_widgets) == 0x000728, "Member 'UWBP_UI_Widget_Groups_Timed_C::interceptor_widgets' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, interceptor_end) == 0x000778, "Member 'UWBP_UI_Widget_Groups_Timed_C::interceptor_end' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Groups_Timed_C, _________) == 0x0007C8, "Member 'UWBP_UI_Widget_Groups_Timed_C::_________' has a wrong offset!");

}

