#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Onboarding_Intro_Choice_PopUpWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget
// 0x0140 (0x0140 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable_4;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_5;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable_8;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_9;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable_10;                             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_11;                             // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          Temp_byte_Variable_12;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_13;                             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_8;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_5;           // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_4;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_3;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_2;                           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InputName;                            // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          K2Node_Select_Default_3;                           // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB[0x5];                                       // 0x00BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          K2Node_Select_Default_4;                           // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_5;                           // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameUserSettings*                   CallFunc_GetSBZGameUserSettings_ReturnValue;       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameUserSettings*                   CallFunc_GetSBZGameUserSettings_ReturnValue_1;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameUserSettings*                   CallFunc_GetSBZGameUserSettings_ReturnValue_2;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameUserSettings*                   CallFunc_GetSBZGameUserSettings_ReturnValue_3;     // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameUserSettings*                   CallFunc_GetSBZGameUserSettings_ReturnValue_4;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCrossplayUserPrivilege_ReturnValue;    // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_9;              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget) == 0x000140, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, EntryPoint) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_bool_Variable) == 0x000004, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable) == 0x000005, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_bool_Variable_1) == 0x000007, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_2) == 0x000008, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_3) == 0x000009, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_bool_Variable_2) == 0x00000A, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_4) == 0x00000B, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_5) == 0x00000C, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_bool_Variable_3) == 0x00000D, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_6) == 0x00000E, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_7) == 0x00000F, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_bool_Variable_4) == 0x000010, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_8) == 0x000011, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_9) == 0x000012, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_bool_Variable_5) == 0x000013, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_10) == 0x000014, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_11) == 0x000015, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_bool_Variable_6) == 0x000016, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_12) == 0x000017, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, Temp_byte_Variable_13) == 0x000018, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_Button_8) == 0x000020, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_Button_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_bIsEnabled_5) == 0x000028, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_bIsEnabled_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_Button_7) == 0x000030, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_bIsEnabled_4) == 0x000038, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_bIsEnabled_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_Select_Default) == 0x000039, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_Select_Default_1) == 0x00003A, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_Button_6) == 0x000048, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_bIsEnabled_3) == 0x000050, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_bIsEnabled_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x000058, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_Select_Default_2) == 0x000060, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_Button_5) == 0x000068, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue_2) == 0x000070, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue_3) == 0x000078, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_Button_4) == 0x000080, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_Button_3) == 0x000088, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue_4) == 0x000090, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue_5) == 0x000098, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_Event_InputName) == 0x0000A0, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_Event_InputName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_Button_2) == 0x0000B0, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x0000B8, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_SwitchName_CmpSuccess) == 0x0000B9, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_Select_Default_3) == 0x0000BA, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_Button_1) == 0x0000C0, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x0000C8, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_Button) == 0x0000D0, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_ComponentBoundEvent_bIsEnabled) == 0x0000D8, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_Select_Default_4) == 0x0000D9, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_Select_Default_5) == 0x0000DA, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue_6) == 0x0000E0, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_GetUIManager_ReturnValue) == 0x0000E8, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_GetSBZGameUserSettings_ReturnValue) == 0x0000F0, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_GetSBZGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_GetSBZGameUserSettings_ReturnValue_1) == 0x0000F8, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_GetSBZGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_GetSBZGameUserSettings_ReturnValue_2) == 0x000100, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_GetSBZGameUserSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_GetSBZGameUserSettings_ReturnValue_3) == 0x000108, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_GetSBZGameUserSettings_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_Not_PreBool_ReturnValue) == 0x000110, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_GetSBZGameUserSettings_ReturnValue_4) == 0x000118, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_GetSBZGameUserSettings_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue_7) == 0x000120, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_HasCrossplayUserPrivilege_ReturnValue) == 0x000128, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_HasCrossplayUserPrivilege_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, K2Node_Select_Default_6) == 0x000129, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue_8) == 0x000130, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget, CallFunc_PlayAnimation_ReturnValue_9) == 0x000138, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget::CallFunc_PlayAnimation_ReturnValue_9' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.ActionInput
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ActionInput final
{
public:
	class FName                                   InputName;                                         // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ActionInput) == 0x000004, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ActionInput");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ActionInput) == 0x00000C, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ActionInput");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ActionInput, InputName) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_ActionInput::InputName' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C.BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C_BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

