#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_DEBUG_RoomStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_DEBUG_RoomStatus.WBP_UI_DEBUG_RoomStatus_C.ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	class ASBZRoomVolume*                         K2Node_Event_RoomVolume;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetRoomName_ReturnValue;                  // 0x0078(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0090(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
};
static_assert(alignof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus) == 0x000008, "Wrong alignment on WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus");
static_assert(sizeof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus) == 0x0000F8, "Wrong size on WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus, EntryPoint) == 0x000000, "Member 'WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000008, "Member 'WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus, K2Node_Event_RoomVolume) == 0x000030, "Member 'WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus::K2Node_Event_RoomVolume' has a wrong offset!");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus, CallFunc_GetRoomName_ReturnValue) == 0x000078, "Member 'WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus::CallFunc_GetRoomName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus, K2Node_MakeStruct_FormatArgumentData_1) == 0x000090, "Member 'WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_UI_DEBUG_RoomStatus_C_ExecuteUbergraph_WBP_UI_DEBUG_RoomStatus::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_UI_DEBUG_RoomStatus.WBP_UI_DEBUG_RoomStatus_C.OnRoomChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_DEBUG_RoomStatus_C_OnRoomChanged final
{
public:
	class ASBZRoomVolume*                         RoomVolume;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_DEBUG_RoomStatus_C_OnRoomChanged) == 0x000008, "Wrong alignment on WBP_UI_DEBUG_RoomStatus_C_OnRoomChanged");
static_assert(sizeof(WBP_UI_DEBUG_RoomStatus_C_OnRoomChanged) == 0x000008, "Wrong size on WBP_UI_DEBUG_RoomStatus_C_OnRoomChanged");
static_assert(offsetof(WBP_UI_DEBUG_RoomStatus_C_OnRoomChanged, RoomVolume) == 0x000000, "Member 'WBP_UI_DEBUG_RoomStatus_C_OnRoomChanged::RoomVolume' has a wrong offset!");

}

