#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ArmorChunkButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_ArmorChunkButton.WBP_UI_ArmorChunkButton_C
// 0x0048 (0x0420 - 0x03D8)
class UWBP_UI_ArmorChunkButton_C final : public USBZMainMenuArmorChunkButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 ArmorType_I;                                       // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChunkColor_I;                                      // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Disabled_I;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Equipped_T;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EquippedB;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ItemName_T;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_ArmorChunkButton(int32 EntryPoint);
	void DefaultButtonSet();
	void OnEquippedChanged(bool bInIsEquipped);
	void ArmorChunkInitialized(const struct FSBZArmorChunkTypeData& InArmorChunkData);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void OnFocusChanged(bool bIsFocused);
	void SetDefaultButton();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_ArmorChunkButton_C">();
	}
	static class UWBP_UI_ArmorChunkButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_ArmorChunkButton_C>();
	}
};
static_assert(alignof(UWBP_UI_ArmorChunkButton_C) == 0x000008, "Wrong alignment on UWBP_UI_ArmorChunkButton_C");
static_assert(sizeof(UWBP_UI_ArmorChunkButton_C) == 0x000420, "Wrong size on UWBP_UI_ArmorChunkButton_C");
static_assert(offsetof(UWBP_UI_ArmorChunkButton_C, UberGraphFrame) == 0x0003D8, "Member 'UWBP_UI_ArmorChunkButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorChunkButton_C, HoverAnim) == 0x0003E0, "Member 'UWBP_UI_ArmorChunkButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorChunkButton_C, ArmorType_I) == 0x0003E8, "Member 'UWBP_UI_ArmorChunkButton_C::ArmorType_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorChunkButton_C, Border_Highlight) == 0x0003F0, "Member 'UWBP_UI_ArmorChunkButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorChunkButton_C, ChunkColor_I) == 0x0003F8, "Member 'UWBP_UI_ArmorChunkButton_C::ChunkColor_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorChunkButton_C, Disabled_I) == 0x000400, "Member 'UWBP_UI_ArmorChunkButton_C::Disabled_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorChunkButton_C, Equipped_T) == 0x000408, "Member 'UWBP_UI_ArmorChunkButton_C::Equipped_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorChunkButton_C, EquippedB) == 0x000410, "Member 'UWBP_UI_ArmorChunkButton_C::EquippedB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorChunkButton_C, ItemName_T) == 0x000418, "Member 'UWBP_UI_ArmorChunkButton_C::ItemName_T' has a wrong offset!");

}

