#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_DownedCounter

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_DownedCounter.WBP_UI_Widget_DownedCounter_C.ExecuteUbergraph_WBP_UI_Widget_DownedCounter
// 0x0068 (0x0068 - 0x0000)
struct WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_PrimaryValue;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_SecondaryValue;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_1;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewValue_1;                           // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_OldValue_1;                           // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_2;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0028(0x0018)()
	int32                                         CallFunc_FFloor_ReturnValue_3;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewValue;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_OldValue;                             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_4;                     // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FFloor_ReturnValue_5;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_2;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_3;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_4;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter) == 0x000008, "Wrong alignment on WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter");
static_assert(sizeof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter) == 0x000068, "Wrong size on WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, K2Node_Event_PrimaryValue) == 0x000004, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::K2Node_Event_PrimaryValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, K2Node_Event_SecondaryValue) == 0x000008, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::K2Node_Event_SecondaryValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_FFloor_ReturnValue) == 0x00000C, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_FFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_FFloor_ReturnValue_1) == 0x000010, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_FFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, K2Node_Event_NewValue_1) == 0x000014, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::K2Node_Event_NewValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, K2Node_Event_OldValue_1) == 0x000018, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::K2Node_Event_OldValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_FFloor_ReturnValue_2) == 0x000020, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_FFloor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_Conv_IntToText_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_FFloor_ReturnValue_3) == 0x000040, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_FFloor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, K2Node_Event_NewValue) == 0x000044, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::K2Node_Event_NewValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, K2Node_Event_OldValue) == 0x000048, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::K2Node_Event_OldValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_FFloor_ReturnValue_4) == 0x00004C, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_FFloor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_FFloor_ReturnValue_5) == 0x000050, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_FFloor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000054, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_Subtract_IntInt_ReturnValue_2) == 0x000058, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_Subtract_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_Subtract_IntInt_ReturnValue_3) == 0x00005C, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_Subtract_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter, CallFunc_Subtract_IntInt_ReturnValue_4) == 0x000060, "Member 'WBP_UI_Widget_DownedCounter_C_ExecuteUbergraph_WBP_UI_Widget_DownedCounter::CallFunc_Subtract_IntInt_ReturnValue_4' has a wrong offset!");

// Function WBP_UI_Widget_DownedCounter.WBP_UI_Widget_DownedCounter_C.OnSetup
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_DownedCounter_C_OnSetup final
{
public:
	float                                         PrimaryValue;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SecondaryValue;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_DownedCounter_C_OnSetup) == 0x000004, "Wrong alignment on WBP_UI_Widget_DownedCounter_C_OnSetup");
static_assert(sizeof(WBP_UI_Widget_DownedCounter_C_OnSetup) == 0x000008, "Wrong size on WBP_UI_Widget_DownedCounter_C_OnSetup");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_OnSetup, PrimaryValue) == 0x000000, "Member 'WBP_UI_Widget_DownedCounter_C_OnSetup::PrimaryValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_OnSetup, SecondaryValue) == 0x000004, "Member 'WBP_UI_Widget_DownedCounter_C_OnSetup::SecondaryValue' has a wrong offset!");

// Function WBP_UI_Widget_DownedCounter.WBP_UI_Widget_DownedCounter_C.OnSecondaryAttributeUpdate
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_DownedCounter_C_OnSecondaryAttributeUpdate final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_DownedCounter_C_OnSecondaryAttributeUpdate) == 0x000004, "Wrong alignment on WBP_UI_Widget_DownedCounter_C_OnSecondaryAttributeUpdate");
static_assert(sizeof(WBP_UI_Widget_DownedCounter_C_OnSecondaryAttributeUpdate) == 0x000008, "Wrong size on WBP_UI_Widget_DownedCounter_C_OnSecondaryAttributeUpdate");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_OnSecondaryAttributeUpdate, NewValue) == 0x000000, "Member 'WBP_UI_Widget_DownedCounter_C_OnSecondaryAttributeUpdate::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_OnSecondaryAttributeUpdate, OldValue) == 0x000004, "Member 'WBP_UI_Widget_DownedCounter_C_OnSecondaryAttributeUpdate::OldValue' has a wrong offset!");

// Function WBP_UI_Widget_DownedCounter.WBP_UI_Widget_DownedCounter_C.OnPrimaryAttributeUpdate
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_DownedCounter_C_OnPrimaryAttributeUpdate final
{
public:
	float                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OldValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_DownedCounter_C_OnPrimaryAttributeUpdate) == 0x000004, "Wrong alignment on WBP_UI_Widget_DownedCounter_C_OnPrimaryAttributeUpdate");
static_assert(sizeof(WBP_UI_Widget_DownedCounter_C_OnPrimaryAttributeUpdate) == 0x000008, "Wrong size on WBP_UI_Widget_DownedCounter_C_OnPrimaryAttributeUpdate");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_OnPrimaryAttributeUpdate, NewValue) == 0x000000, "Member 'WBP_UI_Widget_DownedCounter_C_OnPrimaryAttributeUpdate::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_OnPrimaryAttributeUpdate, OldValue) == 0x000004, "Member 'WBP_UI_Widget_DownedCounter_C_OnPrimaryAttributeUpdate::OldValue' has a wrong offset!");

// Function WBP_UI_Widget_DownedCounter.WBP_UI_Widget_DownedCounter_C.ChangeValueWithAnim
// 0x0068 (0x0068 - 0x0000)
struct WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim final
{
public:
	int32                                         NewValue;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OldValue;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue_1;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0040(0x0018)()
	class UWidgetAnimation*                       K2Node_Select_Default_1;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim) == 0x000008, "Wrong alignment on WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim");
static_assert(sizeof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim) == 0x000068, "Wrong size on WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, NewValue) == 0x000000, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::NewValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, OldValue) == 0x000004, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::OldValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, Temp_bool_Variable) == 0x000008, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000009, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, Temp_bool_Variable_1) == 0x00000A, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, Temp_byte_Variable) == 0x00000B, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, Temp_byte_Variable_1) == 0x00000C, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, CallFunc_LessEqual_IntInt_ReturnValue) == 0x00000D, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, K2Node_Select_Default) == 0x00000E, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, CallFunc_Max_ReturnValue) == 0x000010, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, CallFunc_Conv_IntToText_ReturnValue) == 0x000018, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, CallFunc_Subtract_IntInt_ReturnValue) == 0x000030, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, CallFunc_Max_ReturnValue_1) == 0x000034, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::CallFunc_Max_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000040, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, K2Node_Select_Default_1) == 0x000058, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000060, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_DownedCounter.WBP_UI_Widget_DownedCounter_C.ChangeValueWithoutAnim
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Widget_DownedCounter_C_ChangeValueWithoutAnim final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithoutAnim) == 0x000008, "Wrong alignment on WBP_UI_Widget_DownedCounter_C_ChangeValueWithoutAnim");
static_assert(sizeof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithoutAnim) == 0x000020, "Wrong size on WBP_UI_Widget_DownedCounter_C_ChangeValueWithoutAnim");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithoutAnim, Value) == 0x000000, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithoutAnim::Value' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_DownedCounter_C_ChangeValueWithoutAnim, CallFunc_Conv_IntToText_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_DownedCounter_C_ChangeValueWithoutAnim::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");

}

