#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoIP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VoIP.WBP_VoIP_C
// 0x0030 (0x02C0 - 0x0290)
class UWBP_VoIP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 SoundIconOFF;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SoundIconOn;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 EOSProdUID;                                        // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          IsMuted;                                           // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsBlocked;                                         // 0x02B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsTalking;                                         // 0x02BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_VoIP(int32 EntryPoint);
	void VoicechatParticipantsChanged(const class FString& EOSId, bool Joined);
	void SetStateVisibility();
	void PlayerBlockUpdated(const class FString& EOSProdID, bool bIsBlocked);
	void PlayerMuteUpdated(const class FString& EOSProdID, bool bIsMuted);
	void InitialVOIPSetup();
	void Update_VOIP_UI();
	void PlayerTalkingUpdated(const class FString& ChannelName, const class FString& PlayerName, bool bIsTalking);
	void PreConstruct(bool IsDesignTime);
	void CheckState();
	void UpdateTalkingIndicator(const class FString& InPlayerName, bool IsTalking_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VoIP_C">();
	}
	static class UWBP_VoIP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VoIP_C>();
	}
};
static_assert(alignof(UWBP_VoIP_C) == 0x000008, "Wrong alignment on UWBP_VoIP_C");
static_assert(sizeof(UWBP_VoIP_C) == 0x0002C0, "Wrong size on UWBP_VoIP_C");
static_assert(offsetof(UWBP_VoIP_C, UberGraphFrame) == 0x000290, "Member 'UWBP_VoIP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VoIP_C, SoundIconOFF) == 0x000298, "Member 'UWBP_VoIP_C::SoundIconOFF' has a wrong offset!");
static_assert(offsetof(UWBP_VoIP_C, SoundIconOn) == 0x0002A0, "Member 'UWBP_VoIP_C::SoundIconOn' has a wrong offset!");
static_assert(offsetof(UWBP_VoIP_C, EOSProdUID) == 0x0002A8, "Member 'UWBP_VoIP_C::EOSProdUID' has a wrong offset!");
static_assert(offsetof(UWBP_VoIP_C, IsMuted) == 0x0002B8, "Member 'UWBP_VoIP_C::IsMuted' has a wrong offset!");
static_assert(offsetof(UWBP_VoIP_C, IsBlocked) == 0x0002B9, "Member 'UWBP_VoIP_C::IsBlocked' has a wrong offset!");
static_assert(offsetof(UWBP_VoIP_C, IsTalking) == 0x0002BA, "Member 'UWBP_VoIP_C::IsTalking' has a wrong offset!");

}

