#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_TutorialMouseButton

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_TutorialMouseButton.WBP_UI_TutorialMouseButton_C.ExecuteUbergraph_WBP_UI_TutorialMouseButton
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsShowingTutorial_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsHovered;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton) == 0x000008, "Wrong alignment on WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton");
static_assert(sizeof(WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton) == 0x000010, "Wrong size on WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton, EntryPoint) == 0x000000, "Member 'WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton, CallFunc_IsHovered_ReturnValue) == 0x000004, "Member 'WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton, CallFunc_IsShowingTutorial_ReturnValue) == 0x000005, "Member 'WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton::CallFunc_IsShowingTutorial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton, K2Node_Event_IsDesignTime) == 0x000006, "Member 'WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton, K2Node_Event_bInIsHovered) == 0x000007, "Member 'WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton::K2Node_Event_bInIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_UI_TutorialMouseButton_C_ExecuteUbergraph_WBP_UI_TutorialMouseButton::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UI_TutorialMouseButton.WBP_UI_TutorialMouseButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_TutorialMouseButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_TutorialMouseButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_TutorialMouseButton_C_PreConstruct");
static_assert(sizeof(WBP_UI_TutorialMouseButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_TutorialMouseButton_C_PreConstruct");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_TutorialMouseButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_TutorialMouseButton.WBP_UI_TutorialMouseButton_C.ButtonHoveredChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_TutorialMouseButton_C_ButtonHoveredChanged final
{
public:
	bool                                          bInIsHovered;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_TutorialMouseButton_C_ButtonHoveredChanged) == 0x000001, "Wrong alignment on WBP_UI_TutorialMouseButton_C_ButtonHoveredChanged");
static_assert(sizeof(WBP_UI_TutorialMouseButton_C_ButtonHoveredChanged) == 0x000001, "Wrong size on WBP_UI_TutorialMouseButton_C_ButtonHoveredChanged");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_ButtonHoveredChanged, bInIsHovered) == 0x000000, "Member 'WBP_UI_TutorialMouseButton_C_ButtonHoveredChanged::bInIsHovered' has a wrong offset!");

// Function WBP_UI_TutorialMouseButton.WBP_UI_TutorialMouseButton_C.SetHovered
// 0x0005 (0x0005 - 0x0000)
struct WBP_UI_TutorialMouseButton_C_SetHovered final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_TutorialMouseButton_C_SetHovered) == 0x000001, "Wrong alignment on WBP_UI_TutorialMouseButton_C_SetHovered");
static_assert(sizeof(WBP_UI_TutorialMouseButton_C_SetHovered) == 0x000005, "Wrong size on WBP_UI_TutorialMouseButton_C_SetHovered");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetHovered, bIsHovered) == 0x000000, "Member 'WBP_UI_TutorialMouseButton_C_SetHovered::bIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetHovered, Temp_bool_Variable) == 0x000001, "Member 'WBP_UI_TutorialMouseButton_C_SetHovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetHovered, Temp_byte_Variable) == 0x000002, "Member 'WBP_UI_TutorialMouseButton_C_SetHovered::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetHovered, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_UI_TutorialMouseButton_C_SetHovered::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetHovered, K2Node_Select_Default) == 0x000004, "Member 'WBP_UI_TutorialMouseButton_C_SetHovered::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_TutorialMouseButton.WBP_UI_TutorialMouseButton_C.SetActive
// 0x0009 (0x0009 - 0x0000)
struct WBP_UI_TutorialMouseButton_C_SetActive final
{
public:
	bool                                          bIsActive;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_TutorialMouseButton_C_SetActive) == 0x000001, "Wrong alignment on WBP_UI_TutorialMouseButton_C_SetActive");
static_assert(sizeof(WBP_UI_TutorialMouseButton_C_SetActive) == 0x000009, "Wrong size on WBP_UI_TutorialMouseButton_C_SetActive");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetActive, bIsActive) == 0x000000, "Member 'WBP_UI_TutorialMouseButton_C_SetActive::bIsActive' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetActive, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_TutorialMouseButton_C_SetActive::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetActive, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UI_TutorialMouseButton_C_SetActive::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetActive, Temp_bool_Variable) == 0x000003, "Member 'WBP_UI_TutorialMouseButton_C_SetActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetActive, Temp_byte_Variable_2) == 0x000004, "Member 'WBP_UI_TutorialMouseButton_C_SetActive::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetActive, Temp_byte_Variable_3) == 0x000005, "Member 'WBP_UI_TutorialMouseButton_C_SetActive::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetActive, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_UI_TutorialMouseButton_C_SetActive::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetActive, K2Node_Select_Default) == 0x000007, "Member 'WBP_UI_TutorialMouseButton_C_SetActive::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_TutorialMouseButton_C_SetActive, K2Node_Select_Default_1) == 0x000008, "Member 'WBP_UI_TutorialMouseButton_C_SetActive::K2Node_Select_Default_1' has a wrong offset!");

}

