#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Buff_Info

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Buff_Info.WBP_Buff_Info_C
// 0x0030 (0x02C0 - 0x0290)
class UWBP_Buff_Info_C final : public UUserWidget
{
public:
	class URichTextBlock*                         Edge_T;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EdgeIcon_I;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Grit_T;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 GritIcon_I;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Rush_T;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RushIcon_I;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Buff_Info_C">();
	}
	static class UWBP_Buff_Info_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Buff_Info_C>();
	}
};
static_assert(alignof(UWBP_Buff_Info_C) == 0x000008, "Wrong alignment on UWBP_Buff_Info_C");
static_assert(sizeof(UWBP_Buff_Info_C) == 0x0002C0, "Wrong size on UWBP_Buff_Info_C");
static_assert(offsetof(UWBP_Buff_Info_C, Edge_T) == 0x000290, "Member 'UWBP_Buff_Info_C::Edge_T' has a wrong offset!");
static_assert(offsetof(UWBP_Buff_Info_C, EdgeIcon_I) == 0x000298, "Member 'UWBP_Buff_Info_C::EdgeIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_Buff_Info_C, Grit_T) == 0x0002A0, "Member 'UWBP_Buff_Info_C::Grit_T' has a wrong offset!");
static_assert(offsetof(UWBP_Buff_Info_C, GritIcon_I) == 0x0002A8, "Member 'UWBP_Buff_Info_C::GritIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_Buff_Info_C, Rush_T) == 0x0002B0, "Member 'UWBP_Buff_Info_C::Rush_T' has a wrong offset!");
static_assert(offsetof(UWBP_Buff_Info_C, RushIcon_I) == 0x0002B8, "Member 'UWBP_Buff_Info_C::RushIcon_I' has a wrong offset!");

}

