#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ArmorChunk_EquippedDisplay

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_ArmorChunk_EquippedDisplay.WBP_ArmorChunk_EquippedDisplay_C.SetSlotData
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_ArmorChunk_EquippedDisplay_C_SetSlotData final
{
public:
	struct FSBZArmorConfig                        ArmorConfig;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsLoadout;                                         // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DownTotal;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RegenTotal;                                        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetConsumableCount_ReturnValue;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetFormattedPassiveDescriptionText_ReturnValue; // 0x0038(0x0018)()
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAmmoCapacityScale_ReturnValue;         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxDownCount_ReturnValue;              // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetReplenishDelay_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZArmorSpeedPenalty                         CallFunc_GetSpeedPenalty_ReturnValue;              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZArmorChunkType                            CallFunc_Array_Get_Item;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZArmorSettings*                CallFunc_Get_ReturnValue;                          // 0x0088(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZArmorChunkTypeData                 CallFunc_GetChunkData_ReturnValue;                 // 0x0094(0x0054)(ConstParm, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ArmorChunk_EquippedDisplay_Slot_C* K2Node_Select_Default;                             // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData) == 0x000008, "Wrong alignment on WBP_ArmorChunk_EquippedDisplay_C_SetSlotData");
static_assert(sizeof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData) == 0x0000F8, "Wrong size on WBP_ArmorChunk_EquippedDisplay_C_SetSlotData");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, ArmorConfig) == 0x000000, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::ArmorConfig' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, IsLoadout) == 0x000020, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::IsLoadout' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, DownTotal) == 0x000024, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::DownTotal' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, RegenTotal) == 0x000028, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::RegenTotal' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Array_Length_ReturnValue_1) == 0x000030, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_GetConsumableCount_ReturnValue) == 0x000034, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_GetConsumableCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_GetFormattedPassiveDescriptionText_ReturnValue) == 0x000038, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_GetFormattedPassiveDescriptionText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_FTrunc_ReturnValue) == 0x000050, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_GetAmmoCapacityScale_ReturnValue) == 0x000054, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_GetAmmoCapacityScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_GetMaxDownCount_ReturnValue) == 0x000058, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_GetMaxDownCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_GetReplenishDelay_ReturnValue) == 0x00005C, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_GetReplenishDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_GetSpeedPenalty_ReturnValue) == 0x000060, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_GetSpeedPenalty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, Temp_int_Array_Index_Variable) == 0x000064, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Array_Get_Item) == 0x000068, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, Temp_int_Loop_Counter_Variable) == 0x00006C, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Add_IntInt_ReturnValue) == 0x000074, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Add_FloatFloat_ReturnValue) == 0x000078, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x00007C, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_FTrunc_ReturnValue_1) == 0x000080, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Max_ReturnValue) == 0x000084, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Get_ReturnValue) == 0x000088, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, Temp_int_Variable) == 0x000090, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_GetChunkData_ReturnValue) == 0x000094, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_GetChunkData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000E8, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x0000EC, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ArmorChunk_EquippedDisplay_C_SetSlotData, K2Node_Select_Default) == 0x0000F0, "Member 'WBP_ArmorChunk_EquippedDisplay_C_SetSlotData::K2Node_Select_Default' has a wrong offset!");

}

