#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SafeHouseHUD

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_SafeHouseHUD.WBP_UI_SafeHouseHUD_C.ExecuteUbergraph_WBP_UI_SafeHouseHUD
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SafeHouseHUD_C_ExecuteUbergraph_WBP_UI_SafeHouseHUD final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0004(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SafeHouseHUD_C_ExecuteUbergraph_WBP_UI_SafeHouseHUD) == 0x000004, "Wrong alignment on WBP_UI_SafeHouseHUD_C_ExecuteUbergraph_WBP_UI_SafeHouseHUD");
static_assert(sizeof(WBP_UI_SafeHouseHUD_C_ExecuteUbergraph_WBP_UI_SafeHouseHUD) == 0x000010, "Wrong size on WBP_UI_SafeHouseHUD_C_ExecuteUbergraph_WBP_UI_SafeHouseHUD");
static_assert(offsetof(WBP_UI_SafeHouseHUD_C_ExecuteUbergraph_WBP_UI_SafeHouseHUD, EntryPoint) == 0x000000, "Member 'WBP_UI_SafeHouseHUD_C_ExecuteUbergraph_WBP_UI_SafeHouseHUD::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SafeHouseHUD_C_ExecuteUbergraph_WBP_UI_SafeHouseHUD, K2Node_Event_PreviousValue) == 0x000004, "Member 'WBP_UI_SafeHouseHUD_C_ExecuteUbergraph_WBP_UI_SafeHouseHUD::K2Node_Event_PreviousValue' has a wrong offset!");

// Function WBP_UI_SafeHouseHUD.WBP_UI_SafeHouseHUD_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_SafeHouseHUD_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SafeHouseHUD_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_SafeHouseHUD_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_SafeHouseHUD_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_SafeHouseHUD_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_SafeHouseHUD_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_SafeHouseHUD_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

}

