#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_WidgetPlaceableStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_WidgetPlaceableStatus.WBP_UI_WidgetPlaceableStatus_C
// 0x0028 (0x0318 - 0x02F0)
class UWBP_UI_WidgetPlaceableStatus_C final : public UPD3PlaceableStatusWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_98;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ThrowableImage;                              // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ThrowableImage_BG;                           // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_AmmoInventory;                                // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_WidgetPlaceableStatus(int32 EntryPoint);
	void OnInitialized();
	void OnAmmoInventoryChanged(int32 InAmmoInventory);
	void OnIconChanged(const TSoftObjectPtr<class UPaperSprite>& InIcon);
	void PreConstruct(bool IsDesignTime);
	void OnLoaded_544E70C143CD46C6006D9DA0806A0FCB(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_WidgetPlaceableStatus_C">();
	}
	static class UWBP_UI_WidgetPlaceableStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_WidgetPlaceableStatus_C>();
	}
};
static_assert(alignof(UWBP_UI_WidgetPlaceableStatus_C) == 0x000008, "Wrong alignment on UWBP_UI_WidgetPlaceableStatus_C");
static_assert(sizeof(UWBP_UI_WidgetPlaceableStatus_C) == 0x000318, "Wrong size on UWBP_UI_WidgetPlaceableStatus_C");
static_assert(offsetof(UWBP_UI_WidgetPlaceableStatus_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_WidgetPlaceableStatus_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_WidgetPlaceableStatus_C, Image_98) == 0x0002F8, "Member 'UWBP_UI_WidgetPlaceableStatus_C::Image_98' has a wrong offset!");
static_assert(offsetof(UWBP_UI_WidgetPlaceableStatus_C, Image_ThrowableImage) == 0x000300, "Member 'UWBP_UI_WidgetPlaceableStatus_C::Image_ThrowableImage' has a wrong offset!");
static_assert(offsetof(UWBP_UI_WidgetPlaceableStatus_C, Image_ThrowableImage_BG) == 0x000308, "Member 'UWBP_UI_WidgetPlaceableStatus_C::Image_ThrowableImage_BG' has a wrong offset!");
static_assert(offsetof(UWBP_UI_WidgetPlaceableStatus_C, Text_AmmoInventory) == 0x000310, "Member 'UWBP_UI_WidgetPlaceableStatus_C::Text_AmmoInventory' has a wrong offset!");

}

