#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_HeistState

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_HeistState.WBP_UI_Widget_HeistState_C
// 0x0038 (0x02C8 - 0x0290)
class UWBP_UI_Widget_HeistState_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FlashingAnimation;                                 // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HeistDescription_T;                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HeistName_T;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EPD3HeistState                                CurrentState;                                      // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HeistEndTime;                                      // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         HostageCount;                                      // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZNegotiationTradeType                      NegotiationTradeType;                              // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_HeistState(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnFBIActivationChanged_Event_0(bool bIsActive);
	void OnNegotiationTradeTypeChanged(ESBZNegotiationTradeType OldType, ESBZNegotiationTradeType NewType);
	void OnHostageDemandChanged(uint8 OldNrHostages, uint8 NewNrHostages);
	void OnInitialized();
	void OnHeistStateChanged(EPD3HeistState OldState, EPD3HeistState NewState);
	void OnNegotiationTimeChanged(float OldTime, float NewTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnAssaultState();
	void OnCasingState();
	void OnNegotiationState();
	void OnHideState();
	void UpdateNegotiation();
	void OnSearchState();
	void OnAnticipationState();
	void OnControlState();
	void OnPointOfNoReturn();
	void OnFirstRespondersState();
	void OnAlarmState();
	void UpdateTradeCount();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_HeistState_C">();
	}
	static class UWBP_UI_Widget_HeistState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_HeistState_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_HeistState_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_HeistState_C");
static_assert(sizeof(UWBP_UI_Widget_HeistState_C) == 0x0002C8, "Wrong size on UWBP_UI_Widget_HeistState_C");
static_assert(offsetof(UWBP_UI_Widget_HeistState_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_HeistState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_HeistState_C, FlashingAnimation) == 0x000298, "Member 'UWBP_UI_Widget_HeistState_C::FlashingAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_HeistState_C, Background_I) == 0x0002A0, "Member 'UWBP_UI_Widget_HeistState_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_HeistState_C, HeistDescription_T) == 0x0002A8, "Member 'UWBP_UI_Widget_HeistState_C::HeistDescription_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_HeistState_C, HeistName_T) == 0x0002B0, "Member 'UWBP_UI_Widget_HeistState_C::HeistName_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_HeistState_C, CurrentState) == 0x0002B8, "Member 'UWBP_UI_Widget_HeistState_C::CurrentState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_HeistState_C, HeistEndTime) == 0x0002BC, "Member 'UWBP_UI_Widget_HeistState_C::HeistEndTime' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_HeistState_C, HostageCount) == 0x0002C0, "Member 'UWBP_UI_Widget_HeistState_C::HostageCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_HeistState_C, NegotiationTradeType) == 0x0002C1, "Member 'UWBP_UI_Widget_HeistState_C::NegotiationTradeType' has a wrong offset!");

}

