#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConfirmationPopup_InventoryItemDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ConfirmationPopup_InventoryItemDisplay.WBP_ConfirmationPopup_InventoryItemDisplay_C
// 0x0038 (0x02C8 - 0x0290)
class UWBP_ConfirmationPopup_InventoryItemDisplay_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             DefaultPrice_T;                                    // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_CurrencyWidget_C*           DiscountedPriceCurrency;                           // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ItemCost_WS;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          ItemIcon;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NameText;                                          // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_CurrencyWidget_C*           StandardPrice;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay(int32 EntryPoint);
	void InitializeItem(const class USBZInventoryBaseData* InventoryItem, int64 Cost, ESBZCurrencyCode Currency, int64 DiscountedPrice, int32 DiscountedAmount, int32 DiscountedPercentage);
	void SetPrice(int64 Price, ESBZCurrencyCode Currency, int64 DiscountedPrice, int32 DiscountedAmount, int32 DiscountedPercentage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ConfirmationPopup_InventoryItemDisplay_C">();
	}
	static class UWBP_ConfirmationPopup_InventoryItemDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ConfirmationPopup_InventoryItemDisplay_C>();
	}
};
static_assert(alignof(UWBP_ConfirmationPopup_InventoryItemDisplay_C) == 0x000008, "Wrong alignment on UWBP_ConfirmationPopup_InventoryItemDisplay_C");
static_assert(sizeof(UWBP_ConfirmationPopup_InventoryItemDisplay_C) == 0x0002C8, "Wrong size on UWBP_ConfirmationPopup_InventoryItemDisplay_C");
static_assert(offsetof(UWBP_ConfirmationPopup_InventoryItemDisplay_C, UberGraphFrame) == 0x000290, "Member 'UWBP_ConfirmationPopup_InventoryItemDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ConfirmationPopup_InventoryItemDisplay_C, DefaultPrice_T) == 0x000298, "Member 'UWBP_ConfirmationPopup_InventoryItemDisplay_C::DefaultPrice_T' has a wrong offset!");
static_assert(offsetof(UWBP_ConfirmationPopup_InventoryItemDisplay_C, DiscountedPriceCurrency) == 0x0002A0, "Member 'UWBP_ConfirmationPopup_InventoryItemDisplay_C::DiscountedPriceCurrency' has a wrong offset!");
static_assert(offsetof(UWBP_ConfirmationPopup_InventoryItemDisplay_C, ItemCost_WS) == 0x0002A8, "Member 'UWBP_ConfirmationPopup_InventoryItemDisplay_C::ItemCost_WS' has a wrong offset!");
static_assert(offsetof(UWBP_ConfirmationPopup_InventoryItemDisplay_C, ItemIcon) == 0x0002B0, "Member 'UWBP_ConfirmationPopup_InventoryItemDisplay_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ConfirmationPopup_InventoryItemDisplay_C, NameText) == 0x0002B8, "Member 'UWBP_ConfirmationPopup_InventoryItemDisplay_C::NameText' has a wrong offset!");
static_assert(offsetof(UWBP_ConfirmationPopup_InventoryItemDisplay_C, StandardPrice) == 0x0002C0, "Member 'UWBP_ConfirmationPopup_InventoryItemDisplay_C::StandardPrice' has a wrong offset!");

}

