#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_LoginScreenBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_LoginScreenBase.WBP_UI_LoginScreenBase_C
// 0x0068 (0x06E0 - 0x0678)
class UWBP_UI_LoginScreenBase_C final : public USBZLoginScreenBaseWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0678(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PressStartMotion;                                  // 0x0680(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Fadein;                                            // 0x0688(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_TextBasedNewsBanner_C*             AccelbyteStatusBanner;                             // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_0;                                // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_OverlayBackground;                           // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Error;                                     // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Error;                                        // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_PressAnyButton;                          // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_CreateAccount_C*                Widget_CreateAccount;                              // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       BinkMediaPlayer;                                   // 0x06D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_LoginScreenBase(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void InitializeLoginMenu();
	void Construct();
	void OnInitialized();
	void OnLoginError(const class FText& ErrorMessage);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_LoginScreenBase_C">();
	}
	static class UWBP_UI_LoginScreenBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_LoginScreenBase_C>();
	}
};
static_assert(alignof(UWBP_UI_LoginScreenBase_C) == 0x000008, "Wrong alignment on UWBP_UI_LoginScreenBase_C");
static_assert(sizeof(UWBP_UI_LoginScreenBase_C) == 0x0006E0, "Wrong size on UWBP_UI_LoginScreenBase_C");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, UberGraphFrame) == 0x000678, "Member 'UWBP_UI_LoginScreenBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, PressStartMotion) == 0x000680, "Member 'UWBP_UI_LoginScreenBase_C::PressStartMotion' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Fadein) == 0x000688, "Member 'UWBP_UI_LoginScreenBase_C::Fadein' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, AccelbyteStatusBanner) == 0x000690, "Member 'UWBP_UI_LoginScreenBase_C::AccelbyteStatusBanner' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, CircularThrobber_0) == 0x000698, "Member 'UWBP_UI_LoginScreenBase_C::CircularThrobber_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Image_0) == 0x0006A0, "Member 'UWBP_UI_LoginScreenBase_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Image_Background) == 0x0006A8, "Member 'UWBP_UI_LoginScreenBase_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Image_OverlayBackground) == 0x0006B0, "Member 'UWBP_UI_LoginScreenBase_C::Image_OverlayBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Overlay_Error) == 0x0006B8, "Member 'UWBP_UI_LoginScreenBase_C::Overlay_Error' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Text_Error) == 0x0006C0, "Member 'UWBP_UI_LoginScreenBase_C::Text_Error' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, TextBlock_PressAnyButton) == 0x0006C8, "Member 'UWBP_UI_LoginScreenBase_C::TextBlock_PressAnyButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, Widget_CreateAccount) == 0x0006D0, "Member 'UWBP_UI_LoginScreenBase_C::Widget_CreateAccount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoginScreenBase_C, BinkMediaPlayer) == 0x0006D8, "Member 'UWBP_UI_LoginScreenBase_C::BinkMediaPlayer' has a wrong offset!");

}

