#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_AppearanceTextButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_AppearanceTextButton.WBP_UI_AppearanceTextButton_C
// 0x00A8 (0x0410 - 0x0368)
class UWBP_UI_AppearanceTextButton_C final : public USBZInventoryDefaultButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       DisabledSelectedAnimation;                         // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectedAnimation;                                 // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Frame_Button;                               // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Equipped_Text;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EquippedB;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_98;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Button;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_DisplayText;                                  // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultTextValue;                                  // 0x03F0(0x0018)(Edit, BlueprintVisible)
	struct FVector2D                              InititalSize;                                      // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_AppearanceTextButton(int32 EntryPoint);
	void DisabledButtonSelected();
	void ButtonHoveredChanged(bool bInIsHovered);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnHoverVisuals(bool bIsHovered);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void RefreshVisual();
	void SetButtonText(const class FText& InButtonText);
	void ResetToDefaultButtonText();
	void GetText(class FText* OutText);
	void DefaultEquipped(bool bEquipped);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_AppearanceTextButton_C">();
	}
	static class UWBP_UI_AppearanceTextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_AppearanceTextButton_C>();
	}
};
static_assert(alignof(UWBP_UI_AppearanceTextButton_C) == 0x000008, "Wrong alignment on UWBP_UI_AppearanceTextButton_C");
static_assert(sizeof(UWBP_UI_AppearanceTextButton_C) == 0x000410, "Wrong size on UWBP_UI_AppearanceTextButton_C");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, UberGraphFrame) == 0x000368, "Member 'UWBP_UI_AppearanceTextButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, HoverAnim) == 0x000370, "Member 'UWBP_UI_AppearanceTextButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, DisabledSelectedAnimation) == 0x000378, "Member 'UWBP_UI_AppearanceTextButton_C::DisabledSelectedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, SelectedAnimation) == 0x000380, "Member 'UWBP_UI_AppearanceTextButton_C::SelectedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Border_Frame_Button) == 0x000388, "Member 'UWBP_UI_AppearanceTextButton_C::Border_Frame_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Equipped_Text) == 0x000390, "Member 'UWBP_UI_AppearanceTextButton_C::Equipped_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, EquippedB) == 0x000398, "Member 'UWBP_UI_AppearanceTextButton_C::EquippedB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Image_3) == 0x0003A0, "Member 'UWBP_UI_AppearanceTextButton_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Image_4) == 0x0003A8, "Member 'UWBP_UI_AppearanceTextButton_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Image_5) == 0x0003B0, "Member 'UWBP_UI_AppearanceTextButton_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Image_6) == 0x0003B8, "Member 'UWBP_UI_AppearanceTextButton_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Image_7) == 0x0003C0, "Member 'UWBP_UI_AppearanceTextButton_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Image_8) == 0x0003C8, "Member 'UWBP_UI_AppearanceTextButton_C::Image_8' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Image_9) == 0x0003D0, "Member 'UWBP_UI_AppearanceTextButton_C::Image_9' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Image_98) == 0x0003D8, "Member 'UWBP_UI_AppearanceTextButton_C::Image_98' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Overlay_Button) == 0x0003E0, "Member 'UWBP_UI_AppearanceTextButton_C::Overlay_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, Text_DisplayText) == 0x0003E8, "Member 'UWBP_UI_AppearanceTextButton_C::Text_DisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, DefaultTextValue) == 0x0003F0, "Member 'UWBP_UI_AppearanceTextButton_C::DefaultTextValue' has a wrong offset!");
static_assert(offsetof(UWBP_UI_AppearanceTextButton_C, InititalSize) == 0x000408, "Member 'UWBP_UI_AppearanceTextButton_C::InititalSize' has a wrong offset!");

}

