#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_RiskLevel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_RiskLevel.WBP_UI_Widget_RiskLevel_C
// 0x0098 (0x0328 - 0x0290)
class UWBP_UI_Widget_RiskLevel_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnNormalSet;                                       // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnMayhemSet;                                       // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnOneDownSet;                                      // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnDeathWishSet;                                    // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnOverkillSet;                                     // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnVeryHardSet;                                     // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnHardSet;                                         // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_CompanyContainer;                    // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_1;                                 // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_2;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_3;                                 // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_4;                                 // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_5;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_RiskLevel_6;                                 // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Difficulty;                                   // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              AnimationComplete;                                 // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_UI_Widget_RiskLevel(int32 EntryPoint);
	void WidgetAnimationEvt_OnNormalSet_K2Node_WidgetAnimationEvent_0();
	void WidgetAnimationEvt_OnMayhemSet_K2Node_WidgetAnimationEvent_7();
	void WidgetAnimationEvt_OnVeryHardSet_K2Node_WidgetAnimationEvent_6();
	void WidgetAnimationEvt_OnOverkillSet_K2Node_WidgetAnimationEvent_5();
	void WidgetAnimationEvt_OnOneDownSet_K2Node_WidgetAnimationEvent_4();
	void WidgetAnimationEvt_OnHardSet_K2Node_WidgetAnimationEvent_2();
	void WidgetAnimationEvt_OnDeathWishSet_K2Node_WidgetAnimationEvent_1();
	void GetDifficultyName(int32 GetDifficultyString, class FText* DifficultyString);
	void HideWidget();
	void PlayFadeInAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_RiskLevel_C">();
	}
	static class UWBP_UI_Widget_RiskLevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_RiskLevel_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_RiskLevel_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_RiskLevel_C");
static_assert(sizeof(UWBP_UI_Widget_RiskLevel_C) == 0x000328, "Wrong size on UWBP_UI_Widget_RiskLevel_C");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Widget_RiskLevel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, OnNormalSet) == 0x000298, "Member 'UWBP_UI_Widget_RiskLevel_C::OnNormalSet' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, OnMayhemSet) == 0x0002A0, "Member 'UWBP_UI_Widget_RiskLevel_C::OnMayhemSet' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, FadeOut) == 0x0002A8, "Member 'UWBP_UI_Widget_RiskLevel_C::FadeOut' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, OnOneDownSet) == 0x0002B0, "Member 'UWBP_UI_Widget_RiskLevel_C::OnOneDownSet' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, OnDeathWishSet) == 0x0002B8, "Member 'UWBP_UI_Widget_RiskLevel_C::OnDeathWishSet' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, OnOverkillSet) == 0x0002C0, "Member 'UWBP_UI_Widget_RiskLevel_C::OnOverkillSet' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, OnVeryHardSet) == 0x0002C8, "Member 'UWBP_UI_Widget_RiskLevel_C::OnVeryHardSet' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, OnHardSet) == 0x0002D0, "Member 'UWBP_UI_Widget_RiskLevel_C::OnHardSet' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, HorizontalBox_CompanyContainer) == 0x0002D8, "Member 'UWBP_UI_Widget_RiskLevel_C::HorizontalBox_CompanyContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, Image_RiskLevel_1) == 0x0002E0, "Member 'UWBP_UI_Widget_RiskLevel_C::Image_RiskLevel_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, Image_RiskLevel_2) == 0x0002E8, "Member 'UWBP_UI_Widget_RiskLevel_C::Image_RiskLevel_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, Image_RiskLevel_3) == 0x0002F0, "Member 'UWBP_UI_Widget_RiskLevel_C::Image_RiskLevel_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, Image_RiskLevel_4) == 0x0002F8, "Member 'UWBP_UI_Widget_RiskLevel_C::Image_RiskLevel_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, Image_RiskLevel_5) == 0x000300, "Member 'UWBP_UI_Widget_RiskLevel_C::Image_RiskLevel_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, Image_RiskLevel_6) == 0x000308, "Member 'UWBP_UI_Widget_RiskLevel_C::Image_RiskLevel_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, Text_Difficulty) == 0x000310, "Member 'UWBP_UI_Widget_RiskLevel_C::Text_Difficulty' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_RiskLevel_C, AnimationComplete) == 0x000318, "Member 'UWBP_UI_Widget_RiskLevel_C::AnimationComplete' has a wrong offset!");

}

