#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_RinoHud_Main

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_RinoHud_Main.WBP_UI_Widget_RinoHud_Main_C.ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main
// 0x05F0 (0x05F0 - 0x0000)
struct WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_UI_SM_ActionPhaseMenu_C*>   CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0028(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZSettingsMenuManager*                CallFunc_Get_ReturnValue;                          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SettingsMenuManagerHasCategory_Exists;    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZSettingsMenuCategoryInfo           CallFunc_ConstructSaveCategory_SBZSettingsMenuCategoryInfo; // 0x0058(0x0080)()
	class UWBP_Settings_ColorSelector_RinoHud_C*  CallFunc_Create_ReturnValue;                       // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName SettingsCategoryName, class FName SettingsName, const struct FColor& ColorValue)> K2Node_CreateDelegate_OutputDelegate; // 0x00E4(0x0014)(ZeroConstructor, NoDestructor)
	class UWBP_UI_SM_ActionPhaseMenu_C*           CallFunc_Array_Get_Item;                           // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Settings_SliderButton_RinoHud_C*   CallFunc_Create_ReturnValue_1;                     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZSettingsMenuGroupInfo              CallFunc_Array_Get_Item_1;                         // 0x0110(0x0078)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x018C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18D[0x3];                                      // 0x018D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSettingsMenuManager*                CallFunc_Get_ReturnValue_1;                        // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName SettingsCategoryName, class FName SettingsName, float SlideValue)> K2Node_CreateDelegate_OutputDelegate_1; // 0x01A0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZSettingsMenuCategoryInfo           CallFunc_Array_Get_Item_2;                         // 0x01B8(0x0080)()
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x023C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x023D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x023E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23F[0x1];                                      // 0x023F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_SettingsCategory;               // 0x0240(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SettingsName_2;                 // 0x024C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bToggleValue;                   // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Settings_TwoChoiceButton_RinoHud_C* CallFunc_Create_ReturnValue_2;                    // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName SettingsCategory, class FName SettingsName, bool bToggleValue)> K2Node_CreateDelegate_OutputDelegate_2; // 0x0268(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_SettingsCategoryName_1;         // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SettingsName_1;                 // 0x0288(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_SlideValue;                     // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29D[0x3];                                      // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Settings_Screen_Category_C*        CallFunc_Create_ReturnValue_3;                     // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USettings_GroupTitle_C*                 CallFunc_SpawnObject_ReturnValue;                  // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x02D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SettingsCategoryName;           // 0x02D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SettingsName;                   // 0x02E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 K2Node_CustomEvent_ColorValue;                     // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_GetSettingsItemColor_hudColor;            // 0x02F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x02F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZSettingData                        CallFunc_Array_Get_Item_3;                         // 0x0300(0x02E8)()
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetSettingsItemBool_Value;                // 0x05E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5EA[0x2];                                      // 0x05EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetSettingsItemFloat_Value;               // 0x05EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main) == 0x000008, "Wrong alignment on WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main");
static_assert(sizeof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main) == 0x0005F0, "Wrong size on WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_Event_IsDesignTime) == 0x00000D, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_MakeLiteralName_ReturnValue) == 0x000018, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, Temp_int_Loop_Counter_Variable_1) == 0x000024, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000028, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Add_IntInt_ReturnValue_1) == 0x00003C, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Less_IntInt_ReturnValue) == 0x000040, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, Temp_int_Loop_Counter_Variable_2) == 0x000044, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Get_ReturnValue) == 0x000048, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Add_IntInt_ReturnValue_2) == 0x000050, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_SettingsMenuManagerHasCategory_Exists) == 0x000054, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_SettingsMenuManagerHasCategory_Exists' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_ConstructSaveCategory_SBZSettingsMenuCategoryInfo) == 0x000058, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_ConstructSaveCategory_SBZSettingsMenuCategoryInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Create_ReturnValue) == 0x0000D8, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, Temp_int_Array_Index_Variable_1) == 0x0000E0, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CreateDelegate_OutputDelegate) == 0x0000E4, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Array_Get_Item) == 0x0000F8, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, Temp_int_Array_Index_Variable_2) == 0x000100, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Create_ReturnValue_1) == 0x000108, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Array_Length_ReturnValue_1) == 0x000188, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Less_IntInt_ReturnValue_1) == 0x00018C, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Array_Length_ReturnValue_2) == 0x000190, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Get_ReturnValue_1) == 0x000198, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Get_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001A0, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Array_Get_Item_2) == 0x0001B8, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Array_Length_ReturnValue_3) == 0x000238, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Less_IntInt_ReturnValue_2) == 0x00023C, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_BooleanAND_ReturnValue) == 0x00023D, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00023E, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CustomEvent_SettingsCategory) == 0x000240, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CustomEvent_SettingsCategory' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CustomEvent_SettingsName_2) == 0x00024C, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CustomEvent_SettingsName_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CustomEvent_bToggleValue) == 0x000258, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CustomEvent_bToggleValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Create_ReturnValue_2) == 0x000260, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CreateDelegate_OutputDelegate_2) == 0x000268, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CustomEvent_SettingsCategoryName_1) == 0x00027C, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CustomEvent_SettingsCategoryName_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CustomEvent_SettingsName_1) == 0x000288, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CustomEvent_SettingsName_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CustomEvent_SlideValue) == 0x000294, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CustomEvent_SlideValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, Temp_int_Loop_Counter_Variable_3) == 0x000298, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Less_IntInt_ReturnValue_3) == 0x00029C, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Add_IntInt_ReturnValue_3) == 0x0002A0, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Create_ReturnValue_3) == 0x0002A8, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_SpawnObject_ReturnValue) == 0x0002B0, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_AddChild_ReturnValue) == 0x0002B8, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_AddChild_ReturnValue_1) == 0x0002C0, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_AddChild_ReturnValue_2) == 0x0002C8, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_AddChild_ReturnValue_3) == 0x0002D0, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CustomEvent_SettingsCategoryName) == 0x0002D8, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CustomEvent_SettingsCategoryName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CustomEvent_SettingsName) == 0x0002E4, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CustomEvent_SettingsName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_CustomEvent_ColorValue) == 0x0002F0, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_CustomEvent_ColorValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_GetSettingsItemColor_hudColor) == 0x0002F4, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_GetSettingsItemColor_hudColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, Temp_int_Array_Index_Variable_3) == 0x0002F8, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_Array_Get_Item_3) == 0x000300, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, K2Node_SwitchEnum_CmpSuccess) == 0x0005E8, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_GetSettingsItemBool_Value) == 0x0005E9, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_GetSettingsItemBool_Value' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main, CallFunc_GetSettingsItemFloat_Value) == 0x0005EC, "Member 'WBP_UI_Widget_RinoHud_Main_C_ExecuteUbergraph_WBP_UI_Widget_RinoHud_Main::CallFunc_GetSettingsItemFloat_Value' has a wrong offset!");

// Function WBP_UI_Widget_RinoHud_Main.WBP_UI_Widget_RinoHud_Main_C.ColorChanged
// 0x001C (0x001C - 0x0000)
struct WBP_UI_Widget_RinoHud_Main_C_ColorChanged final
{
public:
	class FName                                   SettingsCategoryName;                              // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SettingsName;                                      // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 ColorValue;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_RinoHud_Main_C_ColorChanged) == 0x000004, "Wrong alignment on WBP_UI_Widget_RinoHud_Main_C_ColorChanged");
static_assert(sizeof(WBP_UI_Widget_RinoHud_Main_C_ColorChanged) == 0x00001C, "Wrong size on WBP_UI_Widget_RinoHud_Main_C_ColorChanged");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ColorChanged, SettingsCategoryName) == 0x000000, "Member 'WBP_UI_Widget_RinoHud_Main_C_ColorChanged::SettingsCategoryName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ColorChanged, SettingsName) == 0x00000C, "Member 'WBP_UI_Widget_RinoHud_Main_C_ColorChanged::SettingsName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ColorChanged, ColorValue) == 0x000018, "Member 'WBP_UI_Widget_RinoHud_Main_C_ColorChanged::ColorValue' has a wrong offset!");

// Function WBP_UI_Widget_RinoHud_Main.WBP_UI_Widget_RinoHud_Main_C.SlideValueChanged
// 0x001C (0x001C - 0x0000)
struct WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged final
{
public:
	class FName                                   SettingsCategoryName;                              // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SettingsName;                                      // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlideValue;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged) == 0x000004, "Wrong alignment on WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged");
static_assert(sizeof(WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged) == 0x00001C, "Wrong size on WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged, SettingsCategoryName) == 0x000000, "Member 'WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged::SettingsCategoryName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged, SettingsName) == 0x00000C, "Member 'WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged::SettingsName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged, SlideValue) == 0x000018, "Member 'WBP_UI_Widget_RinoHud_Main_C_SlideValueChanged::SlideValue' has a wrong offset!");

// Function WBP_UI_Widget_RinoHud_Main.WBP_UI_Widget_RinoHud_Main_C.ToggleValueChanged
// 0x001C (0x001C - 0x0000)
struct WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged final
{
public:
	class FName                                   SettingsCategory;                                  // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SettingsName;                                      // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bToggleValue;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged) == 0x000004, "Wrong alignment on WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged");
static_assert(sizeof(WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged) == 0x00001C, "Wrong size on WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged, SettingsCategory) == 0x000000, "Member 'WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged::SettingsCategory' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged, SettingsName) == 0x00000C, "Member 'WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged::SettingsName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged, bToggleValue) == 0x000018, "Member 'WBP_UI_Widget_RinoHud_Main_C_ToggleValueChanged::bToggleValue' has a wrong offset!");

// Function WBP_UI_Widget_RinoHud_Main.WBP_UI_Widget_RinoHud_Main_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_RinoHud_Main_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_RinoHud_Main_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_RinoHud_Main_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_RinoHud_Main_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_RinoHud_Main_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_RinoHud_Main_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_RinoHud_Main.WBP_UI_Widget_RinoHud_Main_C.LoadConfig
// 0x0040 (0x0040 - 0x0000)
struct WBP_UI_Widget_RinoHud_Main_C_LoadConfig final
{
public:
	class UBP_RinoHud_Savegame_C*                 CallFunc_LoadConfig_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_RinoHud_Main_C_LoadConfig) == 0x000008, "Wrong alignment on WBP_UI_Widget_RinoHud_Main_C_LoadConfig");
static_assert(sizeof(WBP_UI_Widget_RinoHud_Main_C_LoadConfig) == 0x000040, "Wrong size on WBP_UI_Widget_RinoHud_Main_C_LoadConfig");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_LoadConfig, CallFunc_LoadConfig_ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_RinoHud_Main_C_LoadConfig::CallFunc_LoadConfig_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_RinoHud_Main_C_LoadConfig, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_RinoHud_Main_C_LoadConfig::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
