#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ComputerUnlocked

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_ComputerUnlocked.WBP_ComputerUnlocked_C.UpdateDisplayText
// 0x0068 (0x0068 - 0x0000)
struct WBP_ComputerUnlocked_C_UpdateDisplayText final
{
public:
	struct FSBZHackableDisplayText                NewDisplayText;                                    // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_2;                // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_3;                // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ComputerUnlocked_C_UpdateDisplayText) == 0x000008, "Wrong alignment on WBP_ComputerUnlocked_C_UpdateDisplayText");
static_assert(sizeof(WBP_ComputerUnlocked_C_UpdateDisplayText) == 0x000068, "Wrong size on WBP_ComputerUnlocked_C_UpdateDisplayText");
static_assert(offsetof(WBP_ComputerUnlocked_C_UpdateDisplayText, NewDisplayText) == 0x000000, "Member 'WBP_ComputerUnlocked_C_UpdateDisplayText::NewDisplayText' has a wrong offset!");
static_assert(offsetof(WBP_ComputerUnlocked_C_UpdateDisplayText, CallFunc_TextIsEmpty_ReturnValue) == 0x000060, "Member 'WBP_ComputerUnlocked_C_UpdateDisplayText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ComputerUnlocked_C_UpdateDisplayText, CallFunc_TextIsEmpty_ReturnValue_1) == 0x000061, "Member 'WBP_ComputerUnlocked_C_UpdateDisplayText::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ComputerUnlocked_C_UpdateDisplayText, CallFunc_TextIsEmpty_ReturnValue_2) == 0x000062, "Member 'WBP_ComputerUnlocked_C_UpdateDisplayText::CallFunc_TextIsEmpty_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ComputerUnlocked_C_UpdateDisplayText, CallFunc_TextIsEmpty_ReturnValue_3) == 0x000063, "Member 'WBP_ComputerUnlocked_C_UpdateDisplayText::CallFunc_TextIsEmpty_ReturnValue_3' has a wrong offset!");

}

