#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Skills_Button

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"
#include "ESBZSkillEquipResult_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Skills_Button.WBP_UI_Skills_Button_C
// 0x0130 (0x0498 - 0x0368)
class UWBP_UI_Skills_Button_C final : public USBZSkillsMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0368(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EquippedTriangle_Anim;                             // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PulseOverlay;                                      // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AcedIcon_I;                                        // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquippedAnim_I;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EquippedIcon_I;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 FailEquip_I;                                       // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon_I;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_450;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Inactive_I;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedIcon_I;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Progress_Pb;                                       // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ResearchBg_I;                                      // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ResearchBorder;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               ResearchSizeBox;                                   // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ResearchText;                                      // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                                SizeBox;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SkillName;                                         // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Unequipped_I;                                      // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZSkill*                              Skill;                                             // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_UI_Skills_Menu_C*                  SkillsMenu;                                        // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsEquipped;                                        // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkill*                              AcedSkill;                                         // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                object;                                            // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           DescriptionImage;                                  // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Skills_Line_C*                  SkillLine;                                         // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ButtonIndex;                                       // 0x0458(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHoveredFocus;                                   // 0x045C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45D[0x3];                                      // 0x045D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(bool bEquipped)> BaseSkillEquipChanged;                            // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsMastery;                                         // 0x0470(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_471[0x3];                                      // 0x0471(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           EquippedColor;                                     // 0x0474(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           AcedColor;                                         // 0x0484(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Skills_Button(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	void OnBaseSkillEquipChanged(bool bEquipped);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonAlternativeSelected();
	void ButtonFocusedChanged(bool bInHasFocus);
	void Init();
	void ButtonSelected();
	void OnLoaded_768385304A5076C4893ADC97ABC601C1(class UObject* Loaded);
	void OnLoaded_B5E36C62476E1F58F16D1589DC03935D(class UObject* Loaded);
	void Set_State(ESBZSkillState State);
	void IsLocked(bool* IsLocked_0);
	void SetFocused(bool Focus);
	void Selected();
	void Unselected();
	void Reset();
	void SetButtonIndex(int32 Index_0);
	void SetResearchButtonVisiblity(bool bVisible);
	void SetResearched(bool bResearched);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Skills_Button_C">();
	}
	static class UWBP_UI_Skills_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Skills_Button_C>();
	}
};
static_assert(alignof(UWBP_UI_Skills_Button_C) == 0x000008, "Wrong alignment on UWBP_UI_Skills_Button_C");
static_assert(sizeof(UWBP_UI_Skills_Button_C) == 0x000498, "Wrong size on UWBP_UI_Skills_Button_C");
static_assert(offsetof(UWBP_UI_Skills_Button_C, UberGraphFrame) == 0x000368, "Member 'UWBP_UI_Skills_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, EquippedTriangle_Anim) == 0x000370, "Member 'UWBP_UI_Skills_Button_C::EquippedTriangle_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, PulseOverlay) == 0x000378, "Member 'UWBP_UI_Skills_Button_C::PulseOverlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, AcedIcon_I) == 0x000380, "Member 'UWBP_UI_Skills_Button_C::AcedIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Border_Highlight) == 0x000388, "Member 'UWBP_UI_Skills_Button_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, EquippedAnim_I) == 0x000390, "Member 'UWBP_UI_Skills_Button_C::EquippedAnim_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, EquippedIcon_I) == 0x000398, "Member 'UWBP_UI_Skills_Button_C::EquippedIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, FailEquip_I) == 0x0003A0, "Member 'UWBP_UI_Skills_Button_C::FailEquip_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Icon_I) == 0x0003A8, "Member 'UWBP_UI_Skills_Button_C::Icon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Image_1) == 0x0003B0, "Member 'UWBP_UI_Skills_Button_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Image_2) == 0x0003B8, "Member 'UWBP_UI_Skills_Button_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Image_3) == 0x0003C0, "Member 'UWBP_UI_Skills_Button_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Image_450) == 0x0003C8, "Member 'UWBP_UI_Skills_Button_C::Image_450' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Inactive_I) == 0x0003D0, "Member 'UWBP_UI_Skills_Button_C::Inactive_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, LockedIcon_I) == 0x0003D8, "Member 'UWBP_UI_Skills_Button_C::LockedIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Progress_Pb) == 0x0003E0, "Member 'UWBP_UI_Skills_Button_C::Progress_Pb' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, ResearchBg_I) == 0x0003E8, "Member 'UWBP_UI_Skills_Button_C::ResearchBg_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, ResearchBorder) == 0x0003F0, "Member 'UWBP_UI_Skills_Button_C::ResearchBorder' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, ResearchSizeBox) == 0x0003F8, "Member 'UWBP_UI_Skills_Button_C::ResearchSizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, ResearchText) == 0x000400, "Member 'UWBP_UI_Skills_Button_C::ResearchText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, SizeBox) == 0x000408, "Member 'UWBP_UI_Skills_Button_C::SizeBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, SkillName) == 0x000410, "Member 'UWBP_UI_Skills_Button_C::SkillName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Unequipped_I) == 0x000418, "Member 'UWBP_UI_Skills_Button_C::Unequipped_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, Skill) == 0x000420, "Member 'UWBP_UI_Skills_Button_C::Skill' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, SkillsMenu) == 0x000428, "Member 'UWBP_UI_Skills_Button_C::SkillsMenu' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, IsEquipped) == 0x000430, "Member 'UWBP_UI_Skills_Button_C::IsEquipped' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, AcedSkill) == 0x000438, "Member 'UWBP_UI_Skills_Button_C::AcedSkill' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, object) == 0x000440, "Member 'UWBP_UI_Skills_Button_C::object' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, DescriptionImage) == 0x000448, "Member 'UWBP_UI_Skills_Button_C::DescriptionImage' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, SkillLine) == 0x000450, "Member 'UWBP_UI_Skills_Button_C::SkillLine' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, ButtonIndex) == 0x000458, "Member 'UWBP_UI_Skills_Button_C::ButtonIndex' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, bIsHoveredFocus) == 0x00045C, "Member 'UWBP_UI_Skills_Button_C::bIsHoveredFocus' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, BaseSkillEquipChanged) == 0x000460, "Member 'UWBP_UI_Skills_Button_C::BaseSkillEquipChanged' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, IsMastery) == 0x000470, "Member 'UWBP_UI_Skills_Button_C::IsMastery' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, EquippedColor) == 0x000474, "Member 'UWBP_UI_Skills_Button_C::EquippedColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Skills_Button_C, AcedColor) == 0x000484, "Member 'UWBP_UI_Skills_Button_C::AcedColor' has a wrong offset!");

}

