#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser_Navbar

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ServerBrowser_Navbar.WBP_ServerBrowser_Navbar_C.ExecuteUbergraph_WBP_ServerBrowser_Navbar
// 0x01F0 (0x01F0 - 0x0000)
struct WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWidgetActuallyVisible_ReturnValue;      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x003C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_5;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 OutNavBarIndex)>         K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_OutNavBarIndex;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8A[0x2];                                       // 0x008A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable;                                // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0098(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x00B4(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x00CC(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   Temp_name_Variable_1;                              // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Select_Default;                             // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetActuallyVisible_ReturnValue_1;    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FD[0x3];                                       // 0x00FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable_2;                              // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStackLocked_ReturnValue;                // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0115(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_116[0x2];                                      // 0x0116(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x0118(0x0008)(NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   Temp_name_Variable_3;                              // 0x0124(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_1;                           // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_7;                              // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_143[0x1];                                      // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default_2;                           // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Select_Default_3;                           // 0x0148(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_4;                           // 0x017C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x018C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsWidgetActuallyVisible_ReturnValue_2;    // 0x01AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AE[0x2];                                      // 0x01AE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ServerBrowser_NavBar_Button_C*     CallFunc_Create_ReturnValue;                       // 0x01B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStackLocked_ReturnValue_1;              // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x5];                                      // 0x01C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_6;                           // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_7;                           // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_2;                  // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x01EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x01ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x01EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar) == 0x000008, "Wrong alignment on WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar");
static_assert(sizeof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar) == 0x0001F0, "Wrong size on WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, EntryPoint) == 0x000000, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_bool_Variable) == 0x000004, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_IsWidgetActuallyVisible_ReturnValue) == 0x000005, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_IsWidgetActuallyVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_bool_Variable_1) == 0x000006, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_struct_Variable) == 0x000008, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_bool_Variable_2) == 0x000028, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_struct_Variable_2) == 0x00002C, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_struct_Variable_3) == 0x00003C, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_bool_Variable_3) == 0x00004C, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_byte_Variable) == 0x00004D, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_byte_Variable_1) == 0x00004E, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_bool_Variable_4) == 0x00004F, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_byte_Variable_2) == 0x000050, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_byte_Variable_3) == 0x000051, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_int_Array_Index_Variable) == 0x000054, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_int_Loop_Counter_Variable) == 0x000058, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Add_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_int_Variable) == 0x000060, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_Event_IsDesignTime) == 0x000064, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_bool_Variable_5) == 0x000065, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_CustomEvent_OutNavBarIndex) == 0x00007C, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_CustomEvent_OutNavBarIndex' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Add_IntInt_ReturnValue_1) == 0x000080, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Add_IntInt_ReturnValue_2) == 0x000084, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Less_IntInt_ReturnValue) == 0x000088, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000089, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_name_Variable) == 0x00008C, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_CreateDelegate_OutputDelegate_1) == 0x0000B4, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000C8, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000CC, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_name_Variable_1) == 0x0000E0, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_name_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_bool_Variable_6) == 0x0000EC, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_Select_Default) == 0x0000F0, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_IsWidgetActuallyVisible_ReturnValue_1) == 0x0000FC, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_IsWidgetActuallyVisible_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_GetUIManager_ReturnValue) == 0x000100, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_name_Variable_2) == 0x000108, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_name_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_IsStackLocked_ReturnValue) == 0x000114, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_IsStackLocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Not_PreBool_ReturnValue) == 0x000115, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_MakeStruct_SlateChildSize) == 0x000118, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_BooleanAND_ReturnValue) == 0x000120, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_name_Variable_3) == 0x000124, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_name_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Array_Length_ReturnValue_1) == 0x000130, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Subtract_IntInt_ReturnValue) == 0x000134, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_ComponentBoundEvent_InVisibility) == 0x000138, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_Select_Default_1) == 0x00013C, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000140, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Greater_IntInt_ReturnValue) == 0x000141, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, Temp_bool_Variable_7) == 0x000142, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_Select_Default_2) == 0x000144, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_Select_Default_3) == 0x000148, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_ComponentBoundEvent_Button_3) == 0x000158, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000160, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_ComponentBoundEvent_Button_2) == 0x000168, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_ComponentBoundEvent_Button_1) == 0x000170, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000178, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_Select_Default_4) == 0x00017C, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_Select_Default_5) == 0x00018C, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_ComponentBoundEvent_Button) == 0x0001A0, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Play2DSound_ReturnValue) == 0x0001A8, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_BooleanAND_ReturnValue_1) == 0x0001AC, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_IsWidgetActuallyVisible_ReturnValue_2) == 0x0001AD, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_IsWidgetActuallyVisible_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_GetUIManager_ReturnValue_1) == 0x0001B0, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Create_ReturnValue) == 0x0001B8, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_IsStackLocked_ReturnValue_1) == 0x0001C0, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_IsStackLocked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Not_PreBool_ReturnValue_1) == 0x0001C1, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_BooleanAND_ReturnValue_2) == 0x0001C2, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x0001C8, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x0001D0, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_BooleanAND_ReturnValue_3) == 0x0001D8, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Array_Length_ReturnValue_2) == 0x0001DC, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0001E0, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_BooleanOR_ReturnValue) == 0x0001E1, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_BooleanOR_ReturnValue_1) == 0x0001E2, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_Select_Default_6) == 0x0001E3, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, K2Node_Select_Default_7) == 0x0001E4, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_BooleanOR_ReturnValue_2) == 0x0001E5, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_BooleanOR_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Array_Length_ReturnValue_3) == 0x0001E8, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_BooleanAND_ReturnValue_4) == 0x0001EC, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0001ED, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar, CallFunc_BooleanAND_ReturnValue_5) == 0x0001EE, "Member 'WBP_ServerBrowser_Navbar_C_ExecuteUbergraph_WBP_ServerBrowser_Navbar::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");

// Function WBP_ServerBrowser_Navbar.WBP_ServerBrowser_Navbar_C.BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ServerBrowser_Navbar.WBP_ServerBrowser_Navbar_C.BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavRight_B_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_ServerBrowser_Navbar.WBP_ServerBrowser_Navbar_C.BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ServerBrowser_Navbar.WBP_ServerBrowser_Navbar_C.BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_NavLeft_B_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_ServerBrowser_Navbar.WBP_ServerBrowser_Navbar_C.BndEvt__WBP_ServerBrowser_Navbar_Widget_TabBackward_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_Widget_TabBackward_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_Widget_TabBackward_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_Widget_TabBackward_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_Widget_TabBackward_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_Widget_TabBackward_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_Widget_TabBackward_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature, InVisibility) == 0x000000, "Member 'WBP_ServerBrowser_Navbar_C_BndEvt__WBP_ServerBrowser_Navbar_Widget_TabBackward_K2Node_ComponentBoundEvent_0_OnVisibilityChangedEvent__DelegateSignature::InVisibility' has a wrong offset!");

// Function WBP_ServerBrowser_Navbar.WBP_ServerBrowser_Navbar_C.NavBarButtonClicked
// 0x0004 (0x0004 - 0x0000)
struct WBP_ServerBrowser_Navbar_C_NavBarButtonClicked final
{
public:
	int32                                         OutNavBarIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_Navbar_C_NavBarButtonClicked) == 0x000004, "Wrong alignment on WBP_ServerBrowser_Navbar_C_NavBarButtonClicked");
static_assert(sizeof(WBP_ServerBrowser_Navbar_C_NavBarButtonClicked) == 0x000004, "Wrong size on WBP_ServerBrowser_Navbar_C_NavBarButtonClicked");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_NavBarButtonClicked, OutNavBarIndex) == 0x000000, "Member 'WBP_ServerBrowser_Navbar_C_NavBarButtonClicked::OutNavBarIndex' has a wrong offset!");

// Function WBP_ServerBrowser_Navbar.WBP_ServerBrowser_Navbar_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerBrowser_Navbar_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_Navbar_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ServerBrowser_Navbar_C_PreConstruct");
static_assert(sizeof(WBP_ServerBrowser_Navbar_C_PreConstruct) == 0x000001, "Wrong size on WBP_ServerBrowser_Navbar_C_PreConstruct");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ServerBrowser_Navbar_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ServerBrowser_Navbar.WBP_ServerBrowser_Navbar_C.UpdateIndex
// 0x0058 (0x0058 - 0x0000)
struct WBP_ServerBrowser_Navbar_C_UpdateIndex final
{
public:
	int32                                         NewActiveIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitial;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PreviousActiveIndex;                               // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputTypeController_ReturnValue;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ServerBrowser_NavBar_Button_C*     K2Node_DynamicCast_AsWBP_Server_Browser_Nav_Bar_Button; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_ServerBrowser_NavBar_Button_C*     K2Node_DynamicCast_AsWBP_Server_Browser_Nav_Bar_Button_1; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_2;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_Navbar_C_UpdateIndex) == 0x000008, "Wrong alignment on WBP_ServerBrowser_Navbar_C_UpdateIndex");
static_assert(sizeof(WBP_ServerBrowser_Navbar_C_UpdateIndex) == 0x000058, "Wrong size on WBP_ServerBrowser_Navbar_C_UpdateIndex");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, NewActiveIndex) == 0x000000, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::NewActiveIndex' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, IsInitial) == 0x000004, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::IsInitial' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, PreviousActiveIndex) == 0x000008, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::PreviousActiveIndex' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, CallFunc_IsInputTypeController_ReturnValue) == 0x00000C, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::CallFunc_IsInputTypeController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, CallFunc_Not_PreBool_ReturnValue) == 0x00000D, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, CallFunc_BooleanOR_ReturnValue) == 0x00000E, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000014, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000015, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, CallFunc_GetChildAt_ReturnValue) == 0x000018, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, K2Node_DynamicCast_AsWBP_Server_Browser_Nav_Bar_Button) == 0x000020, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::K2Node_DynamicCast_AsWBP_Server_Browser_Nav_Bar_Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_Navbar_C_UpdateIndex, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_ServerBrowser_Navbar_C_UpdateIndex::K2Node_DynamicCast_bSuccess' has a wrong offset!");
