#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_SM_MatchmakingStatus

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus
// 0x0180 (0x0180 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FSBZUIStackChangedEvent& StackEvent)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0030(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZUIStackChangedEvent                K2Node_CustomEvent_StackEvent;                     // 0x0044(0x001C)(NoDestructor)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMatchmakingInProgress_ReturnValue;      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue_1;               // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBZOnlineCode ErrorCode)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x0078(0x0014)(ZeroConstructor, NoDestructor)
	ESBZOnlineCode                                K2Node_CustomEvent_ErrorCode_1;                    // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PeekStack_ReturnValue;                    // 0x0098(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZAsyncLoadingProgress               K2Node_Event_Progress;                             // 0x00A8(0x0004)(ConstParm, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESBZOnlineCode ErrorCode)>     K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B0(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x00C8(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x00DC(0x0014)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00F0(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue_2;               // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_1;        // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZOnlineCode                                K2Node_CustomEvent_ErrorCode;                      // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_141[0x3];                                      // 0x0141(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0148(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0160(0x0008)(NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_2;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus) == 0x000180, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_GetSBZOnline_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_GetSBZOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_GetUIManager_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CreateDelegate_OutputDelegate_1) == 0x000030, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CustomEvent_StackEvent) == 0x000044, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CustomEvent_StackEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_GetGameStateMachine_ReturnValue) == 0x000060, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_Not_PreBool_ReturnValue) == 0x000068, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_IsMatchmakingInProgress_ReturnValue) == 0x000069, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_IsMatchmakingInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00006A, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_BooleanAND_ReturnValue) == 0x00006B, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_GetSBZOnline_ReturnValue_1) == 0x000070, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_GetSBZOnline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CreateDelegate_OutputDelegate_2) == 0x000078, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CustomEvent_ErrorCode_1) == 0x00008C, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CustomEvent_ErrorCode_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_GetUIManager_ReturnValue_1) == 0x000090, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_PeekStack_ReturnValue) == 0x000098, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_PeekStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x0000A4, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_Event_Progress) == 0x0000A8, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_Event_Progress' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000AC, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B0, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_Event_IsDesignTime) == 0x0000C4, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C8, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000DC, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_Event_MyGeometry) == 0x0000F0, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_Event_InDeltaTime) == 0x000128, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_GetSBZOnline_ReturnValue_2) == 0x000130, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_GetSBZOnline_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_GetGameStateMachine_ReturnValue_1) == 0x000138, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_GetGameStateMachine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CustomEvent_ErrorCode) == 0x000140, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CustomEvent_ErrorCode' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_Play2DSound_ReturnValue) == 0x000144, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_CreateDelegate_OutputDelegate_6) == 0x000148, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000160, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, K2Node_ComponentBoundEvent_Button) == 0x000168, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_GetGameStateMachine_ReturnValue_2) == 0x000170, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_GetGameStateMachine_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000178, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_ExecuteUbergraph_WBP_UI_Widget_SM_MatchmakingStatus::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.BndEvt__WBP_UI_Widget_SM_MatchmakingStatus_BPW_UI_MatchMakingCancel_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_BndEvt__WBP_UI_Widget_SM_MatchmakingStatus_BPW_UI_MatchMakingCancel_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_BndEvt__WBP_UI_Widget_SM_MatchmakingStatus_BPW_UI_MatchMakingCancel_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_BndEvt__WBP_UI_Widget_SM_MatchmakingStatus_BPW_UI_MatchMakingCancel_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_BndEvt__WBP_UI_Widget_SM_MatchmakingStatus_BPW_UI_MatchMakingCancel_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_BndEvt__WBP_UI_Widget_SM_MatchmakingStatus_BPW_UI_MatchMakingCancel_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_BndEvt__WBP_UI_Widget_SM_MatchmakingStatus_BPW_UI_MatchMakingCancel_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_BndEvt__WBP_UI_Widget_SM_MatchmakingStatus_BPW_UI_MatchMakingCancel_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.OnLocalClientReady_Event_0
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_OnLocalClientReady_Event_0 final
{
public:
	ESBZOnlineCode                                ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnLocalClientReady_Event_0) == 0x000001, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_OnLocalClientReady_Event_0");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnLocalClientReady_Event_0) == 0x000001, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_OnLocalClientReady_Event_0");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnLocalClientReady_Event_0, ErrorCode) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_OnLocalClientReady_Event_0::ErrorCode' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_Tick) == 0x000004, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_Tick");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_Tick) == 0x00003C, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_Tick");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.OnAsyncLoadingProgress
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_OnAsyncLoadingProgress final
{
public:
	struct FSBZAsyncLoadingProgress               Progress;                                          // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnAsyncLoadingProgress) == 0x000004, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_OnAsyncLoadingProgress");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnAsyncLoadingProgress) == 0x000004, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_OnAsyncLoadingProgress");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnAsyncLoadingProgress, Progress) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_OnAsyncLoadingProgress::Progress' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.OnLobbyEvent
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_OnLobbyEvent final
{
public:
	ESBZOnlineCode                                ErrorCode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnLobbyEvent) == 0x000001, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_OnLobbyEvent");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnLobbyEvent) == 0x000001, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_OnLobbyEvent");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnLobbyEvent, ErrorCode) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_OnLobbyEvent::ErrorCode' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.OnUIStackChanged
// 0x001C (0x001C - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_OnUIStackChanged final
{
public:
	struct FSBZUIStackChangedEvent                StackEvent;                                        // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnUIStackChanged) == 0x000004, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_OnUIStackChanged");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnUIStackChanged) == 0x00001C, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_OnUIStackChanged");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_OnUIStackChanged, StackEvent) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_OnUIStackChanged::StackEvent' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.InitalizeLookingForMatch
// 0x0238 (0x0238 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch final
{
public:
	bool                                          CallFunc_IsPartyHost_ReturnValue;                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZPartyManager*                       CallFunc_GetPartyManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetPartyPlayersNumber_ReturnValue;        // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZUIData*                       CallFunc_GetUIData_ReturnValue;                    // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0030(0x0018)()
	bool                                          Temp_bool_Variable_1;                              // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZOnlineMatchmakingParams            CallFunc_GetMatchMakingParameters_ReturnValue;     // 0x0058(0x0028)()
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_GetPathNameFromLevelIdx_ReturnValue;      // 0x0088(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	class UPD3HeistDataAsset*                     CallFunc_GetHeistDataFromLevelPath_ReturnValue;    // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDifficultyText_OutDifficultyText;      // 0x00B0(0x0018)()
	bool                                          CallFunc_GetDifficultyText_bHasText;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0110(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0120(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0138(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0150(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x01B8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01F8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0208(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0220(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch) == 0x000238, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_IsPartyHost_ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_IsPartyHost_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetPartyManager_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetPartyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, Temp_bool_Variable) == 0x000010, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetPartyPlayersNumber_ReturnValue) == 0x000014, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetPartyPlayersNumber_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_BooleanOR_ReturnValue) == 0x000019, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetUIManager_ReturnValue) == 0x000020, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetUIData_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, Temp_text_Variable) == 0x000030, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, Temp_bool_Variable_1) == 0x000048, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetGameStateMachine_ReturnValue) == 0x000050, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetMatchMakingParameters_ReturnValue) == 0x000058, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetMatchMakingParameters_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetValidValue_ReturnValue) == 0x000080, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetPathNameFromLevelIdx_ReturnValue) == 0x000088, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetPathNameFromLevelIdx_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetHeistDataFromLevelPath_ReturnValue) == 0x0000A8, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetHeistDataFromLevelPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetDifficultyText_OutDifficultyText) == 0x0000B0, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetDifficultyText_OutDifficultyText' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_GetDifficultyText_bHasText) == 0x0000C8, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_GetDifficultyText_bHasText' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_IsValid_ReturnValue) == 0x0000C9, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, K2Node_MakeStruct_FormatArgumentData) == 0x0000D0, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, K2Node_MakeArray_Array) == 0x000110, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_Format_ReturnValue) == 0x000120, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, K2Node_Select_Default) == 0x000138, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, K2Node_MakeStruct_FormatArgumentData_1) == 0x000150, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, K2Node_MakeArray_Array_1) == 0x000190, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_Format_ReturnValue_1) == 0x0001A0, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, K2Node_MakeStruct_FormatArgumentData_2) == 0x0001B8, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, K2Node_MakeArray_Array_2) == 0x0001F8, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, CallFunc_Format_ReturnValue_2) == 0x000208, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch, K2Node_Select_Default_1) == 0x000220, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeLookingForMatch::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.InitalizeMatch found
// 0x0060 (0x0060 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found final
{
public:
	class FText                                   CallFunc_GetMatchJoiningText_Output_Text;          // 0x0000(0x0018)()
	class FText                                   CallFunc_GetMatchJoiningText_OutDifficultyText;    // 0x0018(0x0018)()
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZOnlineMatchmakingParams            CallFunc_GetMatchMakingParameters_ReturnValue;     // 0x0038(0x0028)()
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found) == 0x000060, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found, CallFunc_GetMatchJoiningText_Output_Text) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found::CallFunc_GetMatchJoiningText_Output_Text' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found, CallFunc_GetMatchJoiningText_OutDifficultyText) == 0x000018, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found::CallFunc_GetMatchJoiningText_OutDifficultyText' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found, CallFunc_GetGameStateMachine_ReturnValue) == 0x000030, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found, CallFunc_GetMatchMakingParameters_ReturnValue) == 0x000038, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_InitalizeMatch_found::CallFunc_GetMatchMakingParameters_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.UpdateLobbyHeader
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateLobbyHeader final
{
public:
	bool                                          CallFunc_IsSoloGameEnabled_ReturnValue;            // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateLobbyHeader) == 0x000001, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateLobbyHeader");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateLobbyHeader) == 0x000001, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateLobbyHeader");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateLobbyHeader, CallFunc_IsSoloGameEnabled_ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateLobbyHeader::CallFunc_IsSoloGameEnabled_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.UpdateTimer
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer final
{
public:
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue;                 // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTimerRemainingNonPausableTimeByHandle_ReturnValue; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_FormatIntToTimerText_ReturnValue;         // 0x0010(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer) == 0x000028, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer, CallFunc_GetSBZOnline_ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer::CallFunc_GetSBZOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer, CallFunc_GetTimerRemainingNonPausableTimeByHandle_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer::CallFunc_GetTimerRemainingNonPausableTimeByHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer, CallFunc_FTrunc_ReturnValue) == 0x00000C, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer, CallFunc_FormatIntToTimerText_ReturnValue) == 0x000010, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateTimer::CallFunc_FormatIntToTimerText_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.DisplayNotifications
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_DisplayNotifications final
{
public:
	bool                                          bShowNotification;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_DisplayNotifications) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_DisplayNotifications");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_DisplayNotifications) == 0x000010, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_DisplayNotifications");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_DisplayNotifications, bShowNotification) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_DisplayNotifications::bShowNotification' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_DisplayNotifications, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_DisplayNotifications::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.GetMatchJoiningText
// 0x0180 (0x0180 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText final
{
public:
	class FText                                   Output_Text;                                       // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   OutDifficultyText;                                 // 0x0018(0x0018)(Parm, OutParm)
	bool                                          Temp_bool_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZMissionInfo                        CallFunc_GetBeaconMissionInfo_OutInfo;             // 0x0050(0x0008)(NoDestructor)
	const class USBZUIData*                       CallFunc_GetUIData_ReturnValue;                    // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        CallFunc_GetPathNameFromLevelIdx_ReturnValue;      // 0x0060(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD3HeistDataAsset*                     CallFunc_GetHeistDataFromLevelPath_ReturnValue;    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDifficultyText_OutDifficultyText;      // 0x0090(0x0018)()
	bool                                          CallFunc_GetDifficultyText_bHasText;               // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00B0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00F0(0x0010)(ReferenceParm)
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0138(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0150(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0168(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText) == 0x000180, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, Output_Text) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::Output_Text' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, OutDifficultyText) == 0x000018, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::OutDifficultyText' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, Temp_bool_Variable) == 0x000030, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, K2Node_MakeArray_Array) == 0x000038, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_GetUIManager_ReturnValue) == 0x000048, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_GetBeaconMissionInfo_OutInfo) == 0x000050, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_GetBeaconMissionInfo_OutInfo' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_GetUIData_ReturnValue) == 0x000058, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_GetUIData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_GetPathNameFromLevelIdx_ReturnValue) == 0x000060, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_GetPathNameFromLevelIdx_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_GetValidValue_ReturnValue) == 0x000080, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_GetHeistDataFromLevelPath_ReturnValue) == 0x000088, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_GetHeistDataFromLevelPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_GetDifficultyText_OutDifficultyText) == 0x000090, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_GetDifficultyText_OutDifficultyText' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_GetDifficultyText_bHasText) == 0x0000A8, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_GetDifficultyText_bHasText' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_IsValid_ReturnValue) == 0x0000A9, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, K2Node_MakeStruct_FormatArgumentData) == 0x0000B0, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, K2Node_MakeArray_Array_1) == 0x0000F0, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_BreakSoftObjectPath_PathString) == 0x000100, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_BreakSoftObjectPath_PathString' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_Format_ReturnValue) == 0x000110, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_GetBaseFilename_ReturnValue) == 0x000128, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_Conv_StringToText_ReturnValue) == 0x000138, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, K2Node_Select_Default) == 0x000150, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText, CallFunc_Format_ReturnValue_1) == 0x000168, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_GetMatchJoiningText::CallFunc_Format_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_Widget_SM_MatchmakingStatus.WBP_UI_Widget_SM_MatchmakingStatus_C.UpdateHoldValue
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateHoldValue final
{
public:
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateHoldValue) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateHoldValue");
static_assert(sizeof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateHoldValue) == 0x000010, "Wrong size on WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateHoldValue");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateHoldValue, CallFunc_GetGameStateMachine_ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateHoldValue::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateHoldValue, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_SM_MatchmakingStatus_C_UpdateHoldValue::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
