#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_Overlay_Objective

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_HUD_Overlay_Objective.WBP_UI_HUD_Overlay_Objective_C
// 0x0028 (0x0320 - 0x02F8)
class UWBP_UI_HUD_Overlay_Objective_C final : public USBZObjectiveWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnFinishedAnimation;                               // 0x0300(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_135;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ObjectiveIntel;                               // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_HUD_Overlay_Objective(int32 EntryPoint);
	void ObjectiveActivated(class ASBZObjective* Param_ObjectiveActivated_0);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnObjectiveRemoved();
	void SetObjectiveIntel(class ASBZObjective* Objective_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_HUD_Overlay_Objective_C">();
	}
	static class UWBP_UI_HUD_Overlay_Objective_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_HUD_Overlay_Objective_C>();
	}
};
static_assert(alignof(UWBP_UI_HUD_Overlay_Objective_C) == 0x000008, "Wrong alignment on UWBP_UI_HUD_Overlay_Objective_C");
static_assert(sizeof(UWBP_UI_HUD_Overlay_Objective_C) == 0x000320, "Wrong size on UWBP_UI_HUD_Overlay_Objective_C");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Objective_C, UberGraphFrame) == 0x0002F8, "Member 'UWBP_UI_HUD_Overlay_Objective_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Objective_C, OnFinishedAnimation) == 0x000300, "Member 'UWBP_UI_HUD_Overlay_Objective_C::OnFinishedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Objective_C, Image_135) == 0x000308, "Member 'UWBP_UI_HUD_Overlay_Objective_C::Image_135' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Objective_C, Image_Background) == 0x000310, "Member 'UWBP_UI_HUD_Overlay_Objective_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_HUD_Overlay_Objective_C, Text_ObjectiveIntel) == 0x000318, "Member 'UWBP_UI_HUD_Overlay_Objective_C::Text_ObjectiveIntel' has a wrong offset!");

}

