#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_ResultScreen

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SM_ResultScreen.WBP_UI_SM_ResultScreen_C.ExecuteUbergraph_WBP_UI_SM_ResultScreen
// 0x0818 (0x0818 - 0x0000)
struct WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	float                                         K2Node_Event_InNewTime;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMissionState*                       CallFunc_GetSBZMissionState_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZEndMissionResultData               CallFunc_GetMissionResultData_ReturnValue;         // 0x0028(0x0280)(ConstParm)
	float                                         K2Node_Event_InNewTime_1;                          // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AD[0x3];                                      // 0x02AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_InNewTime_2;                          // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B5[0x3];                                      // 0x02B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x02B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x02C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZChallengeManager*                   CallFunc_GetChallengeManager_ReturnValue;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaTexture*                      K2Node_DynamicCast_AsBink_Media_Texture;           // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2FB[0x1];                                      // 0x02FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FSBZChallengeData& ChallengeData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x02FC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaTexture*                      K2Node_DynamicCast_AsBink_Media_Texture_1;         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0322(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0323(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Rewind_ReturnValue;                       // 0x0325(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0326(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0327(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 NewLevel, int32 PreviousLevel)> K2Node_CreateDelegate_OutputDelegate_2;     // 0x032C(0x0014)(ZeroConstructor, NoDestructor)
	class USBZMusicManager*                       CallFunc_GetMusicManager_ReturnValue;              // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x7];                                      // 0x0349(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaTexture*                      K2Node_DynamicCast_AsBink_Media_Texture_2;         // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMissionState*                       CallFunc_GetSBZMissionState_ReturnValue_1;         // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZEndMissionResultData               CallFunc_GetMissionResultData_ReturnValue_1;       // 0x0368(0x0280)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x05E8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5FC[0x4];                                      // 0x05FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable;                              // 0x0600(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0610(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_611[0x7];                                      // 0x0611(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_1;                           // 0x0618(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0628(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenUrl_ReturnValue_1;                    // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_8;               // 0x0640(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x0648(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x0650(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x0658(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x0660(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0668(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable;                              // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_1;                            // 0x0678(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZInfamyManager*                      CallFunc_GetInfamyManager_ReturnValue;             // 0x0680(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewLevel;                       // 0x0688(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PreviousLevel;                  // 0x068C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_2;                            // 0x0690(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          Temp_object_Variable_3;                            // 0x0698(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x06B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetMapName_ReturnValue;                   // 0x06B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPD3HeistDataAsset*                     CallFunc_GetHeistDataFromLevelShortName_ReturnValue; // 0x06C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsActive_IsActive;                     // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputTypeController_ReturnValue;        // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x06D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x06D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D4[0x4];                                      // 0x06D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x06D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1[0x7];                                      // 0x06E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZStorymodeStruct                    Temp_struct_Variable;                              // 0x06E8(0x0058)()
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0740(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0744(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_745[0x3];                                      // 0x0745(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0748(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSoloGame_ReturnValue;                   // 0x0751(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZEndMissionResult                          Temp_byte_Variable_2;                              // 0x0752(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZEndMissionResult                          Temp_byte_Variable_3;                              // 0x0753(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_754[0x4];                                      // 0x0754(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZStorymodeStruct                    K2Node_Select_Default_2;                           // 0x0758(0x0058)()
	class UAkAudioEvent*                          K2Node_Select_Default_3;                           // 0x07B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable_1;                            // 0x07B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x07C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x07C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7CA[0x2];                                      // 0x07CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x07CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_1;                // 0x07D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_2;                // 0x07D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_3;                // 0x07D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZStealthBranch                             CallFunc_StealthBranch_OutputPins;                 // 0x07DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3HeistState                                CallFunc_StealthBranch_ReturnValue;                // 0x07DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7DE[0x2];                                      // 0x07DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x07E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x07E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7E9[0x7];                                      // 0x07E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APD3HeistGameState*                     K2Node_DynamicCast_AsPD3Heist_Game_State;          // 0x07F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x07F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZEndMissionResult                          Temp_byte_Variable_4;                              // 0x07F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x07FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7FB[0x5];                                      // 0x07FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default_4;                           // 0x0800(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_4;                // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_5;                // 0x0814(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen) == 0x000008, "Wrong alignment on WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen");
static_assert(sizeof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen) == 0x000818, "Wrong size on WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_Event_InNewTime) == 0x000018, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_Event_InNewTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetSBZMissionState_ReturnValue) == 0x000020, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetSBZMissionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetMissionResultData_ReturnValue) == 0x000028, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetMissionResultData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_Event_InNewTime_1) == 0x0002A8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_Event_InNewTime_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_SwitchEnum_CmpSuccess) == 0x0002AC, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_Event_InNewTime_2) == 0x0002B0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_Event_InNewTime_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsValid_ReturnValue_1) == 0x0002B4, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_CustomEvent_ActionName) == 0x0002B8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_byte_Variable) == 0x0002C4, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Concat_StrStr_ReturnValue) == 0x0002C8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_byte_Variable_1) == 0x0002D8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetChallengeManager_ReturnValue) == 0x0002E0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetChallengeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_bool_Variable) == 0x0002E8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_DynamicCast_AsBink_Media_Texture) == 0x0002F0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_DynamicCast_AsBink_Media_Texture' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_DynamicCast_bSuccess) == 0x0002F8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_Select_Default) == 0x0002F9, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsValid_ReturnValue_2) == 0x0002FA, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_CreateDelegate_OutputDelegate_1) == 0x0002FC, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_Event_IsDesignTime) == 0x000310, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_DynamicCast_AsBink_Media_Texture_1) == 0x000318, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_DynamicCast_AsBink_Media_Texture_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_DynamicCast_bSuccess_1) == 0x000320, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetIsEnabled_ReturnValue) == 0x000321, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsVisible_ReturnValue) == 0x000322, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Play_ReturnValue) == 0x000323, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_BooleanAND_ReturnValue) == 0x000324, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Rewind_ReturnValue) == 0x000325, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Rewind_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_OpenUrl_ReturnValue) == 0x000326, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Not_PreBool_ReturnValue) == 0x000327, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_BooleanAND_ReturnValue_1) == 0x000328, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_CreateDelegate_OutputDelegate_2) == 0x00032C, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetMusicManager_ReturnValue) == 0x000340, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetMusicManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsEmpty_ReturnValue) == 0x000348, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_DynamicCast_AsBink_Media_Texture_2) == 0x000350, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_DynamicCast_AsBink_Media_Texture_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_DynamicCast_bSuccess_2) == 0x000358, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetSBZMissionState_ReturnValue_1) == 0x000360, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetSBZMissionState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetMissionResultData_ReturnValue_1) == 0x000368, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetMissionResultData_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_CreateDelegate_OutputDelegate_3) == 0x0005E8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_string_Variable) == 0x000600, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_string_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_bool_Variable_1) == 0x000610, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_Select_Default_1) == 0x000618, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000628, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_OpenUrl_ReturnValue_1) == 0x000638, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_OpenUrl_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_ComponentBoundEvent_Button_8) == 0x000640, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_ComponentBoundEvent_Button_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_ComponentBoundEvent_Button_7) == 0x000648, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_ComponentBoundEvent_Button_6) == 0x000650, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_ComponentBoundEvent_Button_5) == 0x000658, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_ComponentBoundEvent_Button_4) == 0x000660, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_ComponentBoundEvent_Button_3) == 0x000668, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_object_Variable) == 0x000670, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_object_Variable_1) == 0x000678, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetInfamyManager_ReturnValue) == 0x000680, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetInfamyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_CustomEvent_NewLevel) == 0x000688, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_CustomEvent_NewLevel' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_CustomEvent_PreviousLevel) == 0x00068C, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_CustomEvent_PreviousLevel' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_object_Variable_2) == 0x000690, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_object_Variable_3) == 0x000698, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_PlayAnimationForward_ReturnValue) == 0x0006A0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_ComponentBoundEvent_Button_2) == 0x0006A8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_ComponentBoundEvent_Button_1) == 0x0006B0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetMapName_ReturnValue) == 0x0006B8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetMapName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetHeistDataFromLevelShortName_ReturnValue) == 0x0006C8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetHeistDataFromLevelShortName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetIsActive_IsActive) == 0x0006D0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetIsActive_IsActive' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsInputTypeController_ReturnValue) == 0x0006D1, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsInputTypeController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Not_PreBool_ReturnValue_1) == 0x0006D2, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_BooleanAND_ReturnValue_2) == 0x0006D3, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_ComponentBoundEvent_Button) == 0x0006D8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Not_PreBool_ReturnValue_2) == 0x0006E0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_struct_Variable) == 0x0006E8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000740, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000744, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetGameStateMachine_ReturnValue) == 0x000748, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_BooleanAND_ReturnValue_3) == 0x000750, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsSoloGame_ReturnValue) == 0x000751, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsSoloGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_byte_Variable_2) == 0x000752, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_byte_Variable_3) == 0x000753, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_Select_Default_2) == 0x000758, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_Select_Default_3) == 0x0007B0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_string_Variable_1) == 0x0007B8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_string_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsValid_ReturnValue_3) == 0x0007C8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsValid_ReturnValue_4) == 0x0007C9, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Play2DSound_ReturnValue) == 0x0007CC, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Play2DSound_ReturnValue_1) == 0x0007D0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Play2DSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Play2DSound_ReturnValue_2) == 0x0007D4, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Play2DSound_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Play2DSound_ReturnValue_3) == 0x0007D8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Play2DSound_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_StealthBranch_OutputPins) == 0x0007DC, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_StealthBranch_OutputPins' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_StealthBranch_ReturnValue) == 0x0007DD, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_StealthBranch_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_GetGameState_ReturnValue) == 0x0007E0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_SwitchEnum_CmpSuccess_1) == 0x0007E8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_DynamicCast_AsPD3Heist_Game_State) == 0x0007F0, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_DynamicCast_AsPD3Heist_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_DynamicCast_bSuccess_3) == 0x0007F8, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, Temp_byte_Variable_4) == 0x0007F9, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_IsValid_ReturnValue_5) == 0x0007FA, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, K2Node_Select_Default_4) == 0x000800, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Play2DSound_ReturnValue_4) == 0x000810, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Play2DSound_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen, CallFunc_Play2DSound_ReturnValue_5) == 0x000814, "Member 'WBP_UI_SM_ResultScreen_C_ExecuteUbergraph_WBP_UI_SM_ResultScreen::CallFunc_Play2DSound_ReturnValue_5' has a wrong offset!");

// Function WBP_UI_SM_ResultScreen.WBP_UI_SM_ResultScreen_C.BndEvt__WBP_UI_SM_ResultScreen_WBP_SocialButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SocialButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SocialButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SocialButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SocialButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SocialButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SocialButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SocialButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_SM_ResultScreen.WBP_UI_SM_ResultScreen_C.BndEvt__WBP_UI_SM_ResultScreen_PreviousButton_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_PreviousButton_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_PreviousButton_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_PreviousButton_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_PreviousButton_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_PreviousButton_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_PreviousButton_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_PreviousButton_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_SM_ResultScreen.WBP_UI_SM_ResultScreen_C.BndEvt__WBP_UI_SM_ResultScreen_NextButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_NextButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_NextButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_NextButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_NextButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_NextButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_NextButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_NextButton_K2Node_ComponentBoundEvent_14_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_SM_ResultScreen.WBP_UI_SM_ResultScreen_C.ShowPreviousRenownLevel
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_ResultScreen_C_ShowPreviousRenownLevel final
{
public:
	int32                                         NewLevel;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreviousLevel;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_ResultScreen_C_ShowPreviousRenownLevel) == 0x000004, "Wrong alignment on WBP_UI_SM_ResultScreen_C_ShowPreviousRenownLevel");
static_assert(sizeof(WBP_UI_SM_ResultScreen_C_ShowPreviousRenownLevel) == 0x000008, "Wrong size on WBP_UI_SM_ResultScreen_C_ShowPreviousRenownLevel");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ShowPreviousRenownLevel, NewLevel) == 0x000000, "Member 'WBP_UI_SM_ResultScreen_C_ShowPreviousRenownLevel::NewLevel' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_ShowPreviousRenownLevel, PreviousLevel) == 0x000004, "Member 'WBP_UI_SM_ResultScreen_C_ShowPreviousRenownLevel::PreviousLevel' has a wrong offset!");

// Function WBP_UI_SM_ResultScreen.WBP_UI_SM_ResultScreen_C.BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Right_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Right_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Right_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Right_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Right_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Right_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Right_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Right_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_SM_ResultScreen.WBP_UI_SM_ResultScreen_C.BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Left_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Left_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Left_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Left_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Left_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Left_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Left_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_WeaponProgress_Left_K2Node_ComponentBoundEvent_11_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_SM_ResultScreen.WBP_UI_SM_ResultScreen_C.BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Right_K2Node_ComponentBoundEvent_10_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Right_K2Node_ComponentBoundEvent_10_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Right_K2Node_ComponentBoundEvent_10_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Right_K2Node_ComponentBoundEvent_10_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Right_K2Node_ComponentBoundEvent_10_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Right_K2Node_ComponentBoundEvent_10_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Right_K2Node_ComponentBoundEvent_10_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Right_K2Node_ComponentBoundEvent_10_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_SM_ResultScreen.WBP_UI_SM_ResultScreen_C.BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Left_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Left_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Left_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Left_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Left_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_ResultScreen_C_BndEvt__WBP_UI_SM_ResultScreen_WBP_SkillProgression_Left_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature");
