#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_3D_Widget

#include "Basic.hpp"

#include "CompState_structs.hpp"


namespace SDK::Params
{

// Function WBP_3D_Widget.WBP_3D_Widget_C.ExecuteUbergraph_WBP_3D_Widget
// 0x0030 (0x0030 - 0x0000)
struct WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ECompState                                    K2Node_CustomEvent_Int_0;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_NewParam_5;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam2;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Int;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam_4;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_NewParam_3;                     // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Selection;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam_2;                     // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchInteger_CmpSuccess_1;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_NewParam_1;                     // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_NewParam;                       // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget) == 0x000008, "Wrong alignment on WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget");
static_assert(sizeof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget) == 0x000030, "Wrong size on WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, EntryPoint) == 0x000000, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_SwitchEnum_CmpSuccess) == 0x000004, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_Int_0) == 0x000005, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_Int_0' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_NewParam_5) == 0x000008, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_NewParam_5' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_NewParam2) == 0x00000C, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_NewParam2' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_Int) == 0x000010, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_Int' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_NewParam_4) == 0x000014, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_NewParam_4' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_SwitchInteger_CmpSuccess) == 0x000015, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_NewParam_3) == 0x000018, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_NewParam_3' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_Selection) == 0x000028, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_Selection' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_NewParam_2) == 0x00002C, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_NewParam_2' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_SwitchInteger_CmpSuccess_1) == 0x00002D, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_SwitchInteger_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_NewParam_1) == 0x00002E, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_NewParam_1' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget, K2Node_CustomEvent_NewParam) == 0x00002F, "Member 'WBP_3D_Widget_C_ExecuteUbergraph_WBP_3D_Widget::K2Node_CustomEvent_NewParam' has a wrong offset!");

// Function WBP_3D_Widget.WBP_3D_Widget_C.SetScrollDownFocus
// 0x0001 (0x0001 - 0x0000)
struct WBP_3D_Widget_C_SetScrollDownFocus final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_3D_Widget_C_SetScrollDownFocus) == 0x000001, "Wrong alignment on WBP_3D_Widget_C_SetScrollDownFocus");
static_assert(sizeof(WBP_3D_Widget_C_SetScrollDownFocus) == 0x000001, "Wrong size on WBP_3D_Widget_C_SetScrollDownFocus");
static_assert(offsetof(WBP_3D_Widget_C_SetScrollDownFocus, NewParam) == 0x000000, "Member 'WBP_3D_Widget_C_SetScrollDownFocus::NewParam' has a wrong offset!");

// Function WBP_3D_Widget.WBP_3D_Widget_C.SetScrollUpFocus
// 0x0001 (0x0001 - 0x0000)
struct WBP_3D_Widget_C_SetScrollUpFocus final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_3D_Widget_C_SetScrollUpFocus) == 0x000001, "Wrong alignment on WBP_3D_Widget_C_SetScrollUpFocus");
static_assert(sizeof(WBP_3D_Widget_C_SetScrollUpFocus) == 0x000001, "Wrong size on WBP_3D_Widget_C_SetScrollUpFocus");
static_assert(offsetof(WBP_3D_Widget_C_SetScrollUpFocus, NewParam) == 0x000000, "Member 'WBP_3D_Widget_C_SetScrollUpFocus::NewParam' has a wrong offset!");

// Function WBP_3D_Widget.WBP_3D_Widget_C.SetActiveButtonFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_3D_Widget_C_SetActiveButtonFocus final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_3D_Widget_C_SetActiveButtonFocus) == 0x000004, "Wrong alignment on WBP_3D_Widget_C_SetActiveButtonFocus");
static_assert(sizeof(WBP_3D_Widget_C_SetActiveButtonFocus) == 0x000008, "Wrong size on WBP_3D_Widget_C_SetActiveButtonFocus");
static_assert(offsetof(WBP_3D_Widget_C_SetActiveButtonFocus, Selection) == 0x000000, "Member 'WBP_3D_Widget_C_SetActiveButtonFocus::Selection' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_SetActiveButtonFocus, NewParam) == 0x000004, "Member 'WBP_3D_Widget_C_SetActiveButtonFocus::NewParam' has a wrong offset!");

// Function WBP_3D_Widget.WBP_3D_Widget_C.SetArtList
// 0x0010 (0x0010 - 0x0000)
struct WBP_3D_Widget_C_SetArtList final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_3D_Widget_C_SetArtList) == 0x000008, "Wrong alignment on WBP_3D_Widget_C_SetArtList");
static_assert(sizeof(WBP_3D_Widget_C_SetArtList) == 0x000010, "Wrong size on WBP_3D_Widget_C_SetArtList");
static_assert(offsetof(WBP_3D_Widget_C_SetArtList, NewParam) == 0x000000, "Member 'WBP_3D_Widget_C_SetArtList::NewParam' has a wrong offset!");

// Function WBP_3D_Widget.WBP_3D_Widget_C.SetBackButtonFocus
// 0x0008 (0x0008 - 0x0000)
struct WBP_3D_Widget_C_SetBackButtonFocus final
{
public:
	int32                                         Int_0;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam;                                          // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_3D_Widget_C_SetBackButtonFocus) == 0x000004, "Wrong alignment on WBP_3D_Widget_C_SetBackButtonFocus");
static_assert(sizeof(WBP_3D_Widget_C_SetBackButtonFocus) == 0x000008, "Wrong size on WBP_3D_Widget_C_SetBackButtonFocus");
static_assert(offsetof(WBP_3D_Widget_C_SetBackButtonFocus, Int_0) == 0x000000, "Member 'WBP_3D_Widget_C_SetBackButtonFocus::Int_0' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_SetBackButtonFocus, NewParam) == 0x000004, "Member 'WBP_3D_Widget_C_SetBackButtonFocus::NewParam' has a wrong offset!");

// Function WBP_3D_Widget.WBP_3D_Widget_C.SetMenuFocusOnButtons
// 0x0008 (0x0008 - 0x0000)
struct WBP_3D_Widget_C_SetMenuFocusOnButtons final
{
public:
	int32                                         NewParam;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NewParam2;                                         // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_3D_Widget_C_SetMenuFocusOnButtons) == 0x000004, "Wrong alignment on WBP_3D_Widget_C_SetMenuFocusOnButtons");
static_assert(sizeof(WBP_3D_Widget_C_SetMenuFocusOnButtons) == 0x000008, "Wrong size on WBP_3D_Widget_C_SetMenuFocusOnButtons");
static_assert(offsetof(WBP_3D_Widget_C_SetMenuFocusOnButtons, NewParam) == 0x000000, "Member 'WBP_3D_Widget_C_SetMenuFocusOnButtons::NewParam' has a wrong offset!");
static_assert(offsetof(WBP_3D_Widget_C_SetMenuFocusOnButtons, NewParam2) == 0x000004, "Member 'WBP_3D_Widget_C_SetMenuFocusOnButtons::NewParam2' has a wrong offset!");

// Function WBP_3D_Widget.WBP_3D_Widget_C.Set State
// 0x0001 (0x0001 - 0x0000)
struct WBP_3D_Widget_C_Set_State final
{
public:
	ECompState                                    Int_0;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_3D_Widget_C_Set_State) == 0x000001, "Wrong alignment on WBP_3D_Widget_C_Set_State");
static_assert(sizeof(WBP_3D_Widget_C_Set_State) == 0x000001, "Wrong size on WBP_3D_Widget_C_Set_State");
static_assert(offsetof(WBP_3D_Widget_C_Set_State, Int_0) == 0x000000, "Member 'WBP_3D_Widget_C_Set_State::Int_0' has a wrong offset!");

}

