#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_Overlay_Right

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "ST_DifficultyBasedValue_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "ST_MissionPayout_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.ExecuteUbergraph_WBP_UI_HUD_Overlay_Right
// 0x0400 (0x0400 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0030(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPD3SecurityCompanyDataAsset*           K2Node_DynamicCast_AsPD3Security_Company_Data_Asset; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FSBZDamageEvent& DamageEventData)> K2Node_CreateDelegate_OutputDelegate_1; // 0x0050(0x0014)(ZeroConstructor, NoDestructor)
	ESBZSecurityCompany                           CallFunc_Array_Get_Item;                           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0080(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0098(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APD3HeistGameState*                     K2Node_DynamicCast_AsPD3Heist_Game_State;          // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESBZSecurityCompany>                   CallFunc_GetSecurityCompanies_ReturnValue;         // 0x00C8(0x0010)(ReferenceParm)
	TSoftObjectPtr<class UPD3SecurityCompanyDataAsset> CallFunc_GetSecurityCompanyData_ReturnValue;  // 0x00D8(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ASBZInstantLoot*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0118(0x0010)(ReferenceParm)
	class ASBZInstantLoot*                        K2Node_CustomEvent_InstantLoot;                    // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerCharacter*                    K2Node_CustomEvent_TakenByPlayer;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZInstantLoot*                        CallFunc_Array_Get_Item_1;                         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetClassDisplayName_ReturnValue;          // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_RegexReplace_ReturnValue;                 // 0x0168(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_MissionPayout                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0198(0x0118)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameEventBroker*                    CallFunc_GetGameEventBroker_ReturnValue;           // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Find_Value;                           // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZDamageEvent                        K2Node_CustomEvent_DamageEventData;                // 0x02D0(0x00C0)(ConstParm)
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZAICharacter*                        K2Node_DynamicCast_AsSBZAICharacter;               // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasMatchingGameplayTag_self_CastInput; // 0x03A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_MatchesTag_ReturnValue;                   // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BB[0x1];                                      // 0x03BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class ASBZInstantLoot* InstantLoot, class ASBZPlayerCharacter* TakenByPlayer)> K2Node_CreateDelegate_OutputDelegate_3; // 0x03BC(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x2];                                      // 0x03D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x03D8(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right) == 0x000400, "Wrong size on WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, EntryPoint) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CustomEvent_Loaded_2) == 0x000008, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, Temp_object_Variable) == 0x000028, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000030, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_DynamicCast_AsPD3Security_Company_Data_Asset) == 0x000038, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_DynamicCast_AsPD3Security_Company_Data_Asset' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, Temp_int_Array_Index_Variable) == 0x000044, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, Temp_int_Loop_Counter_Variable) == 0x000048, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CreateDelegate_OutputDelegate_1) == 0x000050, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Array_Get_Item) == 0x000064, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Array_Length_ReturnValue) == 0x000068, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Array_Length_ReturnValue_1) == 0x00006C, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Greater_IntInt_ReturnValue) == 0x000071, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, Temp_int_Loop_Counter_Variable_1) == 0x000074, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, Temp_int_Array_Index_Variable_1) == 0x00007C, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CreateDelegate_OutputDelegate_2) == 0x000080, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000098, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, Temp_int_Variable) == 0x0000A0, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetUIManager_ReturnValue) == 0x0000A8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetGameState_ReturnValue) == 0x0000B0, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_DynamicCast_AsPD3Heist_Game_State) == 0x0000B8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_DynamicCast_AsPD3Heist_Game_State' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_DynamicCast_bSuccess_1) == 0x0000C0, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetSecurityCompanies_ReturnValue) == 0x0000C8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetSecurityCompanies_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetSecurityCompanyData_ReturnValue) == 0x0000D8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetSecurityCompanyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Array_Length_ReturnValue_2) == 0x000108, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Array_Add_ReturnValue) == 0x00010C, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Array_Length_ReturnValue_3) == 0x000110, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000114, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetAllActorsOfClass_OutActors) == 0x000118, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CustomEvent_InstantLoot) == 0x000128, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CustomEvent_InstantLoot' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CustomEvent_TakenByPlayer) == 0x000130, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CustomEvent_TakenByPlayer' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Array_Get_Item_1) == 0x000138, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetObjectClass_ReturnValue) == 0x000140, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Array_Length_ReturnValue_4) == 0x000148, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetClassDisplayName_ReturnValue) == 0x000150, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetClassDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Less_IntInt_ReturnValue_1) == 0x000160, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_RegexReplace_ReturnValue) == 0x000168, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_RegexReplace_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000178, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Conv_StringToName_ReturnValue) == 0x000188, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetDataTableRowFromName_OutRow) == 0x000198, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0002B0, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetGameEventBroker_ReturnValue) == 0x0002B8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetGameEventBroker_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Map_Find_Value) == 0x0002C0, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Map_Find_ReturnValue) == 0x0002C4, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Add_IntInt_ReturnValue_2) == 0x0002C8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CustomEvent_DamageEventData) == 0x0002D0, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CustomEvent_DamageEventData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x000390, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_DynamicCast_AsSBZAICharacter) == 0x000398, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_DynamicCast_AsSBZAICharacter' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_DynamicCast_bSuccess_2) == 0x0003A0, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0003A1, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_HasMatchingGameplayTag_self_CastInput) == 0x0003A8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_HasMatchingGameplayTag_self_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x0003B8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_BooleanAND_ReturnValue) == 0x0003B9, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_MatchesTag_ReturnValue) == 0x0003BA, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_MatchesTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CreateDelegate_OutputDelegate_3) == 0x0003BC, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_BooleanOR_ReturnValue) == 0x0003D0, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_BooleanAND_ReturnValue_1) == 0x0003D1, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, CallFunc_Add_IntInt_ReturnValue_3) == 0x0003D4, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003D8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CustomEvent_Loaded_1) == 0x0003F0, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right, K2Node_CustomEvent_Loaded) == 0x0003F8, "Member 'WBP_UI_HUD_Overlay_Right_C_ExecuteUbergraph_WBP_UI_HUD_Overlay_Right::K2Node_CustomEvent_Loaded' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.OnLoaded_4C4FF35846BF292DCD0C939019476C7F
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_OnLoaded_4C4FF35846BF292DCD0C939019476C7F final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_OnLoaded_4C4FF35846BF292DCD0C939019476C7F) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_OnLoaded_4C4FF35846BF292DCD0C939019476C7F");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_OnLoaded_4C4FF35846BF292DCD0C939019476C7F) == 0x000008, "Wrong size on WBP_UI_HUD_Overlay_Right_C_OnLoaded_4C4FF35846BF292DCD0C939019476C7F");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_OnLoaded_4C4FF35846BF292DCD0C939019476C7F, Loaded) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_OnLoaded_4C4FF35846BF292DCD0C939019476C7F::Loaded' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.OnLoaded_45950CCB4250C2A3A91CA382B6A32B48
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_OnLoaded_45950CCB4250C2A3A91CA382B6A32B48 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_OnLoaded_45950CCB4250C2A3A91CA382B6A32B48) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_OnLoaded_45950CCB4250C2A3A91CA382B6A32B48");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_OnLoaded_45950CCB4250C2A3A91CA382B6A32B48) == 0x000008, "Wrong size on WBP_UI_HUD_Overlay_Right_C_OnLoaded_45950CCB4250C2A3A91CA382B6A32B48");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_OnLoaded_45950CCB4250C2A3A91CA382B6A32B48, Loaded) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_OnLoaded_45950CCB4250C2A3A91CA382B6A32B48::Loaded' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.DamageTaken
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_DamageTaken final
{
public:
	struct FSBZDamageEvent                        DamageEventData;                                   // 0x0000(0x00C0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_DamageTaken) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_DamageTaken");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_DamageTaken) == 0x0000C0, "Wrong size on WBP_UI_HUD_Overlay_Right_C_DamageTaken");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_DamageTaken, DamageEventData) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_DamageTaken::DamageEventData' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.InstantLootLooted
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_InstantLootLooted final
{
public:
	class ASBZInstantLoot*                        InstantLoot;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerCharacter*                    TakenByPlayer;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_InstantLootLooted) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_InstantLootLooted");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_InstantLootLooted) == 0x000010, "Wrong size on WBP_UI_HUD_Overlay_Right_C_InstantLootLooted");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_InstantLootLooted, InstantLoot) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_InstantLootLooted::InstantLoot' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_InstantLootLooted, TakenByPlayer) == 0x000008, "Member 'WBP_UI_HUD_Overlay_Right_C_InstantLootLooted::TakenByPlayer' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.OnLoaded_F1BFE66E47082A43C1363198541C1669
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_OnLoaded_F1BFE66E47082A43C1363198541C1669 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_OnLoaded_F1BFE66E47082A43C1363198541C1669) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_OnLoaded_F1BFE66E47082A43C1363198541C1669");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_OnLoaded_F1BFE66E47082A43C1363198541C1669) == 0x000008, "Wrong size on WBP_UI_HUD_Overlay_Right_C_OnLoaded_F1BFE66E47082A43C1363198541C1669");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_OnLoaded_F1BFE66E47082A43C1363198541C1669, Loaded) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_OnLoaded_F1BFE66E47082A43C1363198541C1669::Loaded' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.SetSecurityCompanies
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies final
{
public:
	class FString                                 LocalSecCompanyList;                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UPD3SecurityCompanyDataAsset*           SecurityCompanyData;                               // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_CrimeNet_SecurityCompanyDisplay_C* CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZSecurityCompany                           CallFunc_Array_Get_Item;                           // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPD3SecurityCompanyDataAsset> CallFunc_GetSecurityCompanyData_ReturnValue;  // 0x0058(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPD3SecurityCompanyDataAsset*           K2Node_DynamicCast_AsPD3Security_Company_Data_Asset; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies) == 0x0000A0, "Wrong size on WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, LocalSecCompanyList) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::LocalSecCompanyList' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, SecurityCompanyData) == 0x000010, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::SecurityCompanyData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, K2Node_MakeStruct_Margin) == 0x000024, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, CallFunc_AddChildToVerticalBox_ReturnValue) == 0x000040, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::CallFunc_AddChildToVerticalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, CallFunc_Array_Get_Item) == 0x000049, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, CallFunc_Array_Length_ReturnValue) == 0x00004C, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, CallFunc_GetSecurityCompanyData_ReturnValue) == 0x000058, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::CallFunc_GetSecurityCompanyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000088, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, K2Node_DynamicCast_AsPD3Security_Company_Data_Asset) == 0x000090, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::K2Node_DynamicCast_AsPD3Security_Company_Data_Asset' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'WBP_UI_HUD_Overlay_Right_C_SetSecurityCompanies::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.UpdateFavorVisibility
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMissionState*                       CallFunc_GetSBZMissionState_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTutorialLevel_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility) == 0x000018, "Wrong size on WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility, CallFunc_GetSBZMissionState_ReturnValue) == 0x000008, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility::CallFunc_GetSBZMissionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility, CallFunc_IsTutorialLevel_ReturnValue) == 0x000010, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility::CallFunc_IsTutorialLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility, K2Node_Select_Default) == 0x000011, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateFavorVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.UpdateDifficulityVisibility
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMissionState*                       CallFunc_GetSBZMissionState_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsTutorialLevel_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility) == 0x000018, "Wrong size on WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility, CallFunc_GetSBZMissionState_ReturnValue) == 0x000008, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility::CallFunc_GetSBZMissionState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility, CallFunc_IsTutorialLevel_ReturnValue) == 0x000010, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility::CallFunc_IsTutorialLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility, K2Node_Select_Default) == 0x000011, "Member 'WBP_UI_HUD_Overlay_Right_C_UpdateDifficulityVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.SetBags
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_SetBags final
{
public:
	int32                                         TotalBags_0;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_CollectedBagIcon_C*      CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_SetBags) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_SetBags");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_SetBags) == 0x000028, "Wrong size on WBP_UI_HUD_Overlay_Right_C_SetBags");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetBags, TotalBags_0) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_SetBags::TotalBags_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetBags, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_UI_HUD_Overlay_Right_C_SetBags::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetBags, Temp_int_Variable) == 0x000008, "Member 'WBP_UI_HUD_Overlay_Right_C_SetBags::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetBags, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_UI_HUD_Overlay_Right_C_SetBags::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetBags, CallFunc_AddChild_ReturnValue) == 0x000018, "Member 'WBP_UI_HUD_Overlay_Right_C_SetBags::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetBags, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000020, "Member 'WBP_UI_HUD_Overlay_Right_C_SetBags::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetBags, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'WBP_UI_HUD_Overlay_Right_C_SetBags::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_Overlay_Right.WBP_UI_HUD_Overlay_Right_C.SetCollectedBags
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_HUD_Overlay_Right_C_SetCollectedBags final
{
public:
	int32                                         TotalCollectedBags;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_CollectedBagIcon_C*      K2Node_DynamicCast_AsWBP_UI_Widget_Collected_Bag_Icon; // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Overlay_Right_C_SetCollectedBags) == 0x000008, "Wrong alignment on WBP_UI_HUD_Overlay_Right_C_SetCollectedBags");
static_assert(sizeof(WBP_UI_HUD_Overlay_Right_C_SetCollectedBags) == 0x000030, "Wrong size on WBP_UI_HUD_Overlay_Right_C_SetCollectedBags");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetCollectedBags, TotalCollectedBags) == 0x000000, "Member 'WBP_UI_HUD_Overlay_Right_C_SetCollectedBags::TotalCollectedBags' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetCollectedBags, CallFunc_Subtract_IntInt_ReturnValue) == 0x000004, "Member 'WBP_UI_HUD_Overlay_Right_C_SetCollectedBags::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetCollectedBags, Temp_int_Variable) == 0x000008, "Member 'WBP_UI_HUD_Overlay_Right_C_SetCollectedBags::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetCollectedBags, CallFunc_GetChildAt_ReturnValue) == 0x000010, "Member 'WBP_UI_HUD_Overlay_Right_C_SetCollectedBags::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetCollectedBags, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000018, "Member 'WBP_UI_HUD_Overlay_Right_C_SetCollectedBags::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Overlay_Right_C_SetCollectedBags, K2Node_DynamicCast_AsWBP_UI_Widget_Collected_Bag_Icon) == 0x000020, "Member 'WBP_UI_HUD_Overlay_Right_C_SetCollectedBags::K2Node_DynamicCast_AsWBP_UI_Widget_Collected_Bag_Icon' has a wrong offset!");
