#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_WeaponProgressionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_WeaponProgressionWidget.WBP_UI_WeaponProgressionWidget_C.ExecuteUbergraph_WBP_UI_WeaponProgressionWidget
// 0x0140 (0x0140 - 0x0000)
struct WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0038(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0050(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_2;             // 0x0090(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00E8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00F8(0x0018)()
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0114(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_125[0x3];                                      // 0x0125(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0128(0x0018)()
};
static_assert(alignof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget) == 0x000008, "Wrong alignment on WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget");
static_assert(sizeof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget) == 0x000140, "Wrong size on WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, EntryPoint) == 0x000000, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, Temp_bool_Variable) == 0x000004, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, Temp_text_Variable) == 0x000008, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, CallFunc_Conv_IntToText_ReturnValue) == 0x000020, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000038, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, K2Node_MakeStruct_FormatArgumentData) == 0x000050, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, CallFunc_Conv_IntToText_ReturnValue_2) == 0x000090, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::CallFunc_Conv_IntToText_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, K2Node_MakeArray_Array) == 0x0000E8, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, CallFunc_Format_ReturnValue) == 0x0000F8, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000110, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, CallFunc_SelectColor_ReturnValue) == 0x000114, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, CallFunc_Less_IntInt_ReturnValue) == 0x000124, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget, K2Node_Select_Default) == 0x000128, "Member 'WBP_UI_WeaponProgressionWidget_C_ExecuteUbergraph_WBP_UI_WeaponProgressionWidget::K2Node_Select_Default' has a wrong offset!");

}

