#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ButtonCheckBox

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_ButtonCheckBox.WBP_UI_ButtonCheckBox_C
// 0x0038 (0x0398 - 0x0360)
class UWBP_UI_ButtonCheckBox_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_ButtonBackground;                            // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonBackgroundHighlight;                   // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ButtonTickForeground;                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool bNewState)> OnCheckChanged;                                   // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsChecked;                                        // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_ButtonCheckBox(int32 EntryPoint);
	void ButtonSelected();
	void PreConstruct(bool IsDesignTime);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void OnInitialized();
	void SetCheckBox(bool bNewIsChecked);
	void OnFocusChanged(bool bIsFocused);
	void OnHoverChanged(bool bIsHovered);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_ButtonCheckBox_C">();
	}
	static class UWBP_UI_ButtonCheckBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_ButtonCheckBox_C>();
	}
};
static_assert(alignof(UWBP_UI_ButtonCheckBox_C) == 0x000008, "Wrong alignment on UWBP_UI_ButtonCheckBox_C");
static_assert(sizeof(UWBP_UI_ButtonCheckBox_C) == 0x000398, "Wrong size on UWBP_UI_ButtonCheckBox_C");
static_assert(offsetof(UWBP_UI_ButtonCheckBox_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_ButtonCheckBox_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ButtonCheckBox_C, Image_ButtonBackground) == 0x000368, "Member 'UWBP_UI_ButtonCheckBox_C::Image_ButtonBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ButtonCheckBox_C, Image_ButtonBackgroundHighlight) == 0x000370, "Member 'UWBP_UI_ButtonCheckBox_C::Image_ButtonBackgroundHighlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ButtonCheckBox_C, Image_ButtonTickForeground) == 0x000378, "Member 'UWBP_UI_ButtonCheckBox_C::Image_ButtonTickForeground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ButtonCheckBox_C, OnCheckChanged) == 0x000380, "Member 'UWBP_UI_ButtonCheckBox_C::OnCheckChanged' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ButtonCheckBox_C, bIsChecked) == 0x000390, "Member 'UWBP_UI_ButtonCheckBox_C::bIsChecked' has a wrong offset!");

}

