#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_LoadingScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_LoadingScreen.WBP_UI_Widget_LoadingScreen_C
// 0x0038 (0x02D8 - 0x02A0)
class UWBP_UI_Widget_LoadingScreen_C final : public USBZLoadingScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_162;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PaydayLogo;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_38;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Video_Background;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Loading_C*               Widget_Loading;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBinkMediaPlayer*                       BinkMediaPlayer;                                   // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_LoadingScreen(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_LoadingScreen_C">();
	}
	static class UWBP_UI_Widget_LoadingScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_LoadingScreen_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_LoadingScreen_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_LoadingScreen_C");
static_assert(sizeof(UWBP_UI_Widget_LoadingScreen_C) == 0x0002D8, "Wrong size on UWBP_UI_Widget_LoadingScreen_C");
static_assert(offsetof(UWBP_UI_Widget_LoadingScreen_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_UI_Widget_LoadingScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_LoadingScreen_C, Image_162) == 0x0002A8, "Member 'UWBP_UI_Widget_LoadingScreen_C::Image_162' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_LoadingScreen_C, Image_PaydayLogo) == 0x0002B0, "Member 'UWBP_UI_Widget_LoadingScreen_C::Image_PaydayLogo' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_LoadingScreen_C, SafeZone_38) == 0x0002B8, "Member 'UWBP_UI_Widget_LoadingScreen_C::SafeZone_38' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_LoadingScreen_C, Video_Background) == 0x0002C0, "Member 'UWBP_UI_Widget_LoadingScreen_C::Video_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_LoadingScreen_C, Widget_Loading) == 0x0002C8, "Member 'UWBP_UI_Widget_LoadingScreen_C::Widget_Loading' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_LoadingScreen_C, BinkMediaPlayer) == 0x0002D0, "Member 'UWBP_UI_Widget_LoadingScreen_C::BinkMediaPlayer' has a wrong offset!");

}

