#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ConfirmationPopup_InventoryItemDisplay

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_ConfirmationPopup_InventoryItemDisplay.WBP_ConfirmationPopup_InventoryItemDisplay_C.ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay
// 0x0070 (0x0070 - 0x0000)
struct WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZInventoryBaseData*            K2Node_CustomEvent_InventoryItem;                  // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         K2Node_CustomEvent_Cost;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCurrencyCode                              K2Node_CustomEvent_Currency;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         K2Node_CustomEvent_DiscountedPrice;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DiscountedAmount;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DiscountedPercentage;           // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZCoinData*                           K2Node_DynamicCast_AsSBZCoin_Data;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_OutDisplayName;            // 0x0040(0x0018)()
	bool                                          CallFunc_GetDisplayName_OutHasText;                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay) == 0x000008, "Wrong alignment on WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay");
static_assert(sizeof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay) == 0x000070, "Wrong size on WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, EntryPoint) == 0x000000, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, K2Node_CustomEvent_InventoryItem) == 0x000008, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::K2Node_CustomEvent_InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, K2Node_CustomEvent_Cost) == 0x000010, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::K2Node_CustomEvent_Cost' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, K2Node_CustomEvent_Currency) == 0x000018, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::K2Node_CustomEvent_Currency' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, K2Node_CustomEvent_DiscountedPrice) == 0x000020, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::K2Node_CustomEvent_DiscountedPrice' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, K2Node_CustomEvent_DiscountedAmount) == 0x000028, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::K2Node_CustomEvent_DiscountedAmount' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, K2Node_CustomEvent_DiscountedPercentage) == 0x00002C, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::K2Node_CustomEvent_DiscountedPercentage' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, K2Node_DynamicCast_AsSBZCoin_Data) == 0x000030, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::K2Node_DynamicCast_AsSBZCoin_Data' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, CallFunc_GetDisplayName_OutDisplayName) == 0x000040, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::CallFunc_GetDisplayName_OutDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, CallFunc_GetDisplayName_OutHasText) == 0x000058, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::CallFunc_GetDisplayName_OutHasText' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, CallFunc_MakeVector2D_ReturnValue) == 0x00005C, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay, CallFunc_MakeVector2D_ReturnValue_1) == 0x000064, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_ExecuteUbergraph_WBP_ConfirmationPopup_InventoryItemDisplay::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");

// Function WBP_ConfirmationPopup_InventoryItemDisplay.WBP_ConfirmationPopup_InventoryItemDisplay_C.InitializeItem
// 0x0028 (0x0028 - 0x0000)
struct WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem final
{
public:
	const class USBZInventoryBaseData*            InventoryItem;                                     // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         Cost;                                              // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCurrencyCode                              Currency;                                          // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DiscountedPrice;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DiscountedAmount;                                  // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DiscountedPercentage;                              // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem) == 0x000008, "Wrong alignment on WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem");
static_assert(sizeof(WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem) == 0x000028, "Wrong size on WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem, InventoryItem) == 0x000000, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem::InventoryItem' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem, Cost) == 0x000008, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem::Cost' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem, Currency) == 0x000010, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem::Currency' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem, DiscountedPrice) == 0x000018, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem::DiscountedPrice' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem, DiscountedAmount) == 0x000020, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem::DiscountedAmount' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem, DiscountedPercentage) == 0x000024, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_InitializeItem::DiscountedPercentage' has a wrong offset!");

// Function WBP_ConfirmationPopup_InventoryItemDisplay.WBP_ConfirmationPopup_InventoryItemDisplay_C.SetPrice
// 0x0040 (0x0040 - 0x0000)
struct WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice final
{
public:
	int64                                         Price;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZCurrencyCode                              Currency;                                          // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         DiscountedPrice;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DiscountedAmount;                                  // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DiscountedPercentage;                              // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x1];                                       // 0x0023(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x0028(0x0018)()
};
static_assert(alignof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice) == 0x000008, "Wrong alignment on WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice");
static_assert(sizeof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice) == 0x000040, "Wrong size on WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, Price) == 0x000000, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::Price' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, Currency) == 0x000008, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::Currency' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, DiscountedPrice) == 0x000010, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::DiscountedPrice' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, DiscountedAmount) == 0x000018, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::DiscountedAmount' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, DiscountedPercentage) == 0x00001C, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::DiscountedPercentage' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000021, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, CallFunc_BooleanOR_ReturnValue) == 0x000022, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, CallFunc_SelectInt_ReturnValue) == 0x000024, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice, CallFunc_Conv_Int64ToText_ReturnValue) == 0x000028, "Member 'WBP_ConfirmationPopup_InventoryItemDisplay_C_SetPrice::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");

}

