#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud.WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C.ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud
// 0x0058 (0x0058 - 0x0000)
struct WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0014(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud");
static_assert(sizeof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud) == 0x000058, "Wrong size on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud, K2Node_Event_MyGeometry) == 0x000014, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud, K2Node_Event_InDeltaTime) == 0x00004C, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000050, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_ExecuteUbergraph_WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud.WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_Tick) == 0x000004, "Wrong alignment on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_Tick");
static_assert(sizeof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_Tick) == 0x00003C, "Wrong size on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_Tick");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud.WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud.WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C._Update
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0050(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0078(0x0028)()
	uint8                                         Temp_byte_Variable;                                // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_Select_Default;                             // 0x00B0(0x0028)()
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue_1;         // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_FFloor64_ReturnValue;                     // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_Int64ToText_ReturnValue;             // 0x00F0(0x0018)()
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0138(0x0018)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C[0x4];                                      // 0x015C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_FormatIntToTimerText_ReturnValue;         // 0x0160(0x0018)()
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0178(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0190(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update");
static_assert(sizeof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update) == 0x0001A8, "Wrong size on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000001, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x000002, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_SelectColor_ReturnValue_1) == 0x000018, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_SelectColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, K2Node_MakeStruct_SlateColor_1) == 0x000050, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, K2Node_MakeStruct_SlateColor_2) == 0x000078, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, Temp_byte_Variable) == 0x0000A0, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_GetDynamicMaterial_ReturnValue) == 0x0000A8, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_GetDynamicMaterial_ReturnValue_1) == 0x0000D8, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_GetDynamicMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000E0, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_FFloor64_ReturnValue) == 0x0000E8, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_FFloor64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Conv_Int64ToText_ReturnValue) == 0x0000F0, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Conv_Int64ToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000108, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Conv_TextToString_ReturnValue) == 0x000110, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Concat_StrStr_ReturnValue) == 0x000120, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000130, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Conv_StringToText_ReturnValue) == 0x000138, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000150, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Less_FloatFloat_ReturnValue) == 0x000154, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Round_ReturnValue) == 0x000158, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Round_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_FormatIntToTimerText_ReturnValue) == 0x000160, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_FormatIntToTimerText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, CallFunc_Conv_FloatToText_ReturnValue) == 0x000178, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update, K2Node_Select_Default_1) == 0x000190, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C__Update::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud.WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C.SetInitial
// 0x0038 (0x0038 - 0x0000)
struct WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial final
{
public:
	class FString                                 Action;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WarningColorPercentage;                            // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DangerColorPercentage;                             // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
};
static_assert(alignof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial) == 0x000008, "Wrong alignment on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial");
static_assert(sizeof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial) == 0x000038, "Wrong size on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial, Action) == 0x000000, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial::Action' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial, Duration) == 0x000010, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial::Duration' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial, WarningColorPercentage) == 0x000014, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial::WarningColorPercentage' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial, DangerColorPercentage) == 0x000018, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial::DangerColorPercentage' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetInitial::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud.WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C.SetValues
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues final
{
public:
	uint8                                         ColorSelector;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         mainPercentage;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         distance_0;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         fuelPercentage;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues) == 0x000004, "Wrong alignment on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues");
static_assert(sizeof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues) == 0x000010, "Wrong size on WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues, ColorSelector) == 0x000000, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues::ColorSelector' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues, mainPercentage) == 0x000004, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues::mainPercentage' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues, distance_0) == 0x000008, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues::distance_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues, fuelPercentage) == 0x00000C, "Member 'WBP_UI_Widget_BaseTimedActionWzFuel_RinoHud_C_SetValues::fuelPercentage' has a wrong offset!");

}

