#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_WeaponSlotButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_WeaponSlotButton.WBP_UI_Inventory_WeaponSlotButton_C
// 0x00F0 (0x0530 - 0x0440)
class UWBP_UI_Inventory_WeaponSlotButton_C final : public USBZMainMenuLoadoutWeaponSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Equipped_Text;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EquippedB;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_7;                                           // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_98;                                          // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_202;                                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Inventory_HorizontalModGrid_C*  ModGridTest;                                       // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Mods_C;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PurchaseWeapon;                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlayWeaponProgress;                             // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plus_Icon;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Preset_O;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_WeaponProgression;                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TextBlock_Name;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_Icon;                                       // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Inventory_WeaponSlotButton(int32 EntryPoint);
	void SetActiveWeaponSlot(bool bIsActiveWeaponSlot);
	void OnWeaponSlotInitialized();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnHover(bool bIsHovered);
	void OnFocused(bool bIsFocused);
	void InitializeItem(class USBZInventoryBaseData* InInventoryData);
	void SetEquipped(bool bIsEquipped);
	void SetWeaponTextColour(const struct FLinearColor& InColour);
	void SetEmpty();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_WeaponSlotButton_C">();
	}
	static class UWBP_UI_Inventory_WeaponSlotButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_WeaponSlotButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_WeaponSlotButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_WeaponSlotButton_C");
static_assert(sizeof(UWBP_UI_Inventory_WeaponSlotButton_C) == 0x000530, "Wrong size on UWBP_UI_Inventory_WeaponSlotButton_C");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, UberGraphFrame) == 0x000440, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, HoverAnim) == 0x000448, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Border_Highlight) == 0x000450, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Equipped_Text) == 0x000458, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Equipped_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, EquippedB) == 0x000460, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::EquippedB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image) == 0x000468, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_1) == 0x000470, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_2) == 0x000478, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_3) == 0x000480, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_4) == 0x000488, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_5) == 0x000490, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_6) == 0x000498, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_7) == 0x0004A0, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_7' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_8) == 0x0004A8, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_8' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_9) == 0x0004B0, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_9' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_10) == 0x0004B8, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_11) == 0x0004C0, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_11' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_98) == 0x0004C8, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_98' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_202) == 0x0004D0, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_202' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_511) == 0x0004D8, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Image_Background) == 0x0004E0, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, ModGridTest) == 0x0004E8, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::ModGridTest' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Mods_C) == 0x0004F0, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Mods_C' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Overlay_PurchaseWeapon) == 0x0004F8, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Overlay_PurchaseWeapon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, OverlayWeaponProgress) == 0x000500, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::OverlayWeaponProgress' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Plus_Icon) == 0x000508, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Plus_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Preset_O) == 0x000510, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Preset_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Text_WeaponProgression) == 0x000518, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Text_WeaponProgression' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, TextBlock_Name) == 0x000520, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_WeaponSlotButton_C, Widget_Icon) == 0x000528, "Member 'UWBP_UI_Inventory_WeaponSlotButton_C::Widget_Icon' has a wrong offset!");

}

