#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Cosmetic_SlotPartChange

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Cosmetic_SlotPartChange.WBP_UI_Cosmetic_SlotPartChange_C.ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_Int64Int64_ReturnValue;         // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0080(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0090(0x0018)()
	class USBZCurrencyManager*                    CallFunc_GetCurrencyManager_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanAfford_ReturnValue;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue;               // 0x00B4(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00C8(0x0028)()
};
static_assert(alignof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange) == 0x000008, "Wrong alignment on WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange");
static_assert(sizeof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange) == 0x0000F0, "Wrong size on WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, EntryPoint) == 0x000000, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, K2Node_MakeArray_Array) == 0x000008, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, CallFunc_Format_ReturnValue) == 0x000020, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, K2Node_MakeStruct_FormatArgumentData) == 0x000038, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, CallFunc_LessEqual_Int64Int64_ReturnValue) == 0x000078, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::CallFunc_LessEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, K2Node_MakeArray_Array_1) == 0x000080, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, CallFunc_Format_ReturnValue_1) == 0x000090, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, CallFunc_GetCurrencyManager_ReturnValue) == 0x0000A8, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::CallFunc_GetCurrencyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, CallFunc_CanAfford_ReturnValue) == 0x0000B0, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::CallFunc_CanAfford_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, CallFunc_GetGlobalColor_ReturnValue) == 0x0000B4, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::CallFunc_GetGlobalColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange, K2Node_MakeStruct_SlateColor) == 0x0000C8, "Member 'WBP_UI_Cosmetic_SlotPartChange_C_ExecuteUbergraph_WBP_UI_Cosmetic_SlotPartChange::K2Node_MakeStruct_SlateColor' has a wrong offset!");

}

