#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_InteractionModeContainer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_InteractionModeContainer.WBP_UI_InteractionModeContainer_C
// 0x0058 (0x0300 - 0x02A8)
class UWBP_UI_InteractionModeContainer_C final : public USBZInteractionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Observed_Text_Anim;                                // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             Text_Observed;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_InteractionMode_C*              Widget_Front_InteractionMode0;                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_InteractionMode_C*              Widget_Front_InteractionMode1;                     // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_InteractionMode_C*              Widget_Self_InteractionMode0;                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_InteractionMode_C*              Widget_Self_InteractionMode1;                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bIsObserved;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsInteracting;                                    // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E2[0x2];                                      // 0x02E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Mode;                                              // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Casing;                                         // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_InteractionMode_C*              Interacting_Duration_Widget;                       // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Out_Is_Front;                                      // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_InteractionModeContainer(int32 EntryPoint);
	void OnCasingChanged(bool bIsCasing);
	void OnAISeenPlayer(bool bIsSeenByAI);
	void OnPlayerIsInteracting(const class USBZPlayerInteractorComponent* Interactor, bool bIsInteracting_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnNewInteractionCollection(const class USBZPlayerInteractorComponent* Interactor, const struct FSBZInteractDisplayDataCollection& NewInteractionCollection);
	void GetProgress(float* CurrentProgress);
	void HasIllegalInteraction(bool* bIsIllegal);
	void DoWeHaveAnyActiveInteractions(bool* bActiveInteractions);
	void TryDisplayObserved();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_InteractionModeContainer_C">();
	}
	static class UWBP_UI_InteractionModeContainer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_InteractionModeContainer_C>();
	}
};
static_assert(alignof(UWBP_UI_InteractionModeContainer_C) == 0x000008, "Wrong alignment on UWBP_UI_InteractionModeContainer_C");
static_assert(sizeof(UWBP_UI_InteractionModeContainer_C) == 0x000300, "Wrong size on UWBP_UI_InteractionModeContainer_C");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, UberGraphFrame) == 0x0002A8, "Member 'UWBP_UI_InteractionModeContainer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Observed_Text_Anim) == 0x0002B0, "Member 'UWBP_UI_InteractionModeContainer_C::Observed_Text_Anim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Text_Observed) == 0x0002B8, "Member 'UWBP_UI_InteractionModeContainer_C::Text_Observed' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Widget_Front_InteractionMode0) == 0x0002C0, "Member 'UWBP_UI_InteractionModeContainer_C::Widget_Front_InteractionMode0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Widget_Front_InteractionMode1) == 0x0002C8, "Member 'UWBP_UI_InteractionModeContainer_C::Widget_Front_InteractionMode1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Widget_Self_InteractionMode0) == 0x0002D0, "Member 'UWBP_UI_InteractionModeContainer_C::Widget_Self_InteractionMode0' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Widget_Self_InteractionMode1) == 0x0002D8, "Member 'UWBP_UI_InteractionModeContainer_C::Widget_Self_InteractionMode1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, bIsObserved) == 0x0002E0, "Member 'UWBP_UI_InteractionModeContainer_C::bIsObserved' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, bIsInteracting) == 0x0002E1, "Member 'UWBP_UI_InteractionModeContainer_C::bIsInteracting' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Mode) == 0x0002E4, "Member 'UWBP_UI_InteractionModeContainer_C::Mode' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Is_Casing) == 0x0002E8, "Member 'UWBP_UI_InteractionModeContainer_C::Is_Casing' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Interacting_Duration_Widget) == 0x0002F0, "Member 'UWBP_UI_InteractionModeContainer_C::Interacting_Duration_Widget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_InteractionModeContainer_C, Out_Is_Front) == 0x0002F8, "Member 'UWBP_UI_InteractionModeContainer_C::Out_Is_Front' has a wrong offset!");

}

