#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ViewTargetContainer

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_ViewTargetContainer.WBP_UI_ViewTargetContainer_C.ExecuteUbergraph_WBP_UI_ViewTargetContainer
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSecurityCamera;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer) == 0x000008, "Wrong alignment on WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer");
static_assert(sizeof(WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer) == 0x000028, "Wrong size on WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer");
static_assert(offsetof(WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer, EntryPoint) == 0x000000, "Member 'WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer, K2Node_Event_bIsSecurityCamera) == 0x000004, "Member 'WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer::K2Node_Event_bIsSecurityCamera' has a wrong offset!");
static_assert(offsetof(WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000008, "Member 'WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1) == 0x000018, "Member 'WBP_UI_ViewTargetContainer_C_ExecuteUbergraph_WBP_UI_ViewTargetContainer::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1' has a wrong offset!");

// Function WBP_UI_ViewTargetContainer.WBP_UI_ViewTargetContainer_C.IsSecurityCamera
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_ViewTargetContainer_C_IsSecurityCamera final
{
public:
	bool                                          bIsSecurityCamera;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ViewTargetContainer_C_IsSecurityCamera) == 0x000001, "Wrong alignment on WBP_UI_ViewTargetContainer_C_IsSecurityCamera");
static_assert(sizeof(WBP_UI_ViewTargetContainer_C_IsSecurityCamera) == 0x000001, "Wrong size on WBP_UI_ViewTargetContainer_C_IsSecurityCamera");
static_assert(offsetof(WBP_UI_ViewTargetContainer_C_IsSecurityCamera, bIsSecurityCamera) == 0x000000, "Member 'WBP_UI_ViewTargetContainer_C_IsSecurityCamera::bIsSecurityCamera' has a wrong offset!");

}

