#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_CircularCallWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_HUD_CircularCallWidget.WBP_UI_HUD_CircularCallWidget_C.ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget
// 0x01D8 (0x01D8 - 0x0000)
struct WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_CircularIcon_C*          CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_SelectedIndex;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UOverlaySlot*                           K2Node_DynamicCast_AsOverlay_Slot;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameEventBroker*                    CallFunc_GetGameEventBroker_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerState*                        K2Node_DynamicCast_AsSBZPlayer_State;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZPingCallAsset*                      CallFunc_Array_Get_Item;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISBZEmoteInterface>    K2Node_DynamicCast_AsSBZEmote_Interface;           // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerCallEvent                    K2Node_MakeStruct_SBZPlayerCallEvent;              // 0x0080(0x0010)(NoDestructor)
	TScriptInterface<class ISBZEquippableInspectInterface> K2Node_DynamicCast_AsSBZEquippable_Inspect_Interface; // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartCurrentEquippableInspect_ReturnValue; // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerState*                        K2Node_DynamicCast_AsSBZPlayer_State_1;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(int32 SelectedIndex)>          K2Node_CreateDelegate_OutputDelegate;              // 0x00C4(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00DC(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue_2;        // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerState*                        K2Node_DynamicCast_AsSBZPlayer_State_2;            // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform;                 // 0x0140(0x001C)(NoDestructor)
	float                                         CallFunc_HackyFunction_OutAngle;                   // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZPingCallAsset*                      CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_HackyFunction_OutAngle_1;                 // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegSin_ReturnValue;                       // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegCos_ReturnValue;                       // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x018C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FWidgetTransform                       K2Node_MakeStruct_WidgetTransform_1;               // 0x0194(0x001C)(NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DistanceSquared2D_ReturnValue;            // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Square_ReturnValue;                       // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x01D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget) == 0x000008, "Wrong alignment on WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget");
static_assert(sizeof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget) == 0x0001D8, "Wrong size on WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, EntryPoint) == 0x000000, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_AddChild_ReturnValue) == 0x000010, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_CustomEvent_SelectedIndex) == 0x000018, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_CustomEvent_SelectedIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_AsOverlay_Slot) == 0x000020, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_AsOverlay_Slot' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_GetGameEventBroker_ReturnValue) == 0x000030, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_GetGameEventBroker_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000038, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000040, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000048, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_AsSBZPlayer_State) == 0x000050, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_AsSBZPlayer_State' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_bSuccess_1) == 0x000058, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Array_Get_Item) == 0x000060, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_AsSBZEmote_Interface) == 0x000068, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_AsSBZEmote_Interface' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_MakeStruct_SBZPlayerCallEvent) == 0x000080, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_MakeStruct_SBZPlayerCallEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_AsSBZEquippable_Inspect_Interface) == 0x000090, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_AsSBZEquippable_Inspect_Interface' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_bSuccess_3) == 0x0000A0, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_GetLocalPlayerState_ReturnValue_1) == 0x0000A8, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_GetLocalPlayerState_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_StartCurrentEquippableInspect_ReturnValue) == 0x0000B0, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_StartCurrentEquippableInspect_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_AsSBZPlayer_State_1) == 0x0000B8, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_AsSBZPlayer_State_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_bSuccess_4) == 0x0000C0, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_CreateDelegate_OutputDelegate) == 0x0000C4, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_Event_MyGeometry) == 0x0000DC, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_Event_InDeltaTime) == 0x000114, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_Event_IsDesignTime) == 0x000118, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000119, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_GetLocalPlayerState_ReturnValue_2) == 0x000120, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_GetLocalPlayerState_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_AsSBZPlayer_State_2) == 0x000128, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_AsSBZPlayer_State_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_DynamicCast_bSuccess_5) == 0x000130, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Array_Length_ReturnValue_1) == 0x000134, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000138, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_MakeStruct_WidgetTransform) == 0x000140, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_MakeStruct_WidgetTransform' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_HackyFunction_OutAngle) == 0x00015C, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_HackyFunction_OutAngle' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, Temp_int_Array_Index_Variable) == 0x000160, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000164, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Array_Get_Item_1) == 0x000168, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_HackyFunction_OutAngle_1) == 0x000170, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_HackyFunction_OutAngle_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000174, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000178, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_DegSin_ReturnValue) == 0x00017C, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_DegCos_ReturnValue) == 0x000180, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000184, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000188, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_MakeVector2D_ReturnValue) == 0x00018C, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, K2Node_MakeStruct_WidgetTransform_1) == 0x000194, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::K2Node_MakeStruct_WidgetTransform_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_PlayAnimation_ReturnValue) == 0x0001B0, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001B8, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_DistanceSquared2D_ReturnValue) == 0x0001C0, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_DistanceSquared2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, Temp_int_Loop_Counter_Variable) == 0x0001C4, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Square_ReturnValue) == 0x0001C8, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Square_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0001CC, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Less_IntInt_ReturnValue) == 0x0001CD, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_Add_IntInt_ReturnValue) == 0x0001D0, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0001D4, "Member 'WBP_UI_HUD_CircularCallWidget_C_ExecuteUbergraph_WBP_UI_HUD_CircularCallWidget::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_CircularCallWidget.WBP_UI_HUD_CircularCallWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_UI_HUD_CircularCallWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_CircularCallWidget_C_Tick) == 0x000004, "Wrong alignment on WBP_UI_HUD_CircularCallWidget_C_Tick");
static_assert(sizeof(WBP_UI_HUD_CircularCallWidget_C_Tick) == 0x00003C, "Wrong size on WBP_UI_HUD_CircularCallWidget_C_Tick");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_UI_HUD_CircularCallWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_UI_HUD_CircularCallWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_UI_HUD_CircularCallWidget.WBP_UI_HUD_CircularCallWidget_C.OnSelected
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_HUD_CircularCallWidget_C_OnSelected final
{
public:
	int32                                         SelectedIndex;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_CircularCallWidget_C_OnSelected) == 0x000004, "Wrong alignment on WBP_UI_HUD_CircularCallWidget_C_OnSelected");
static_assert(sizeof(WBP_UI_HUD_CircularCallWidget_C_OnSelected) == 0x000004, "Wrong size on WBP_UI_HUD_CircularCallWidget_C_OnSelected");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_OnSelected, SelectedIndex) == 0x000000, "Member 'WBP_UI_HUD_CircularCallWidget_C_OnSelected::SelectedIndex' has a wrong offset!");

// Function WBP_UI_HUD_CircularCallWidget.WBP_UI_HUD_CircularCallWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_HUD_CircularCallWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_CircularCallWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_HUD_CircularCallWidget_C_PreConstruct");
static_assert(sizeof(WBP_UI_HUD_CircularCallWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_HUD_CircularCallWidget_C_PreConstruct");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_HUD_CircularCallWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_HUD_CircularCallWidget.WBP_UI_HUD_CircularCallWidget_C.HackyFunction
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_CircularCallWidget_C_HackyFunction final
{
public:
	float                                         InAngle;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutAngle;                                          // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_CircularCallWidget_C_HackyFunction) == 0x000004, "Wrong alignment on WBP_UI_HUD_CircularCallWidget_C_HackyFunction");
static_assert(sizeof(WBP_UI_HUD_CircularCallWidget_C_HackyFunction) == 0x000018, "Wrong size on WBP_UI_HUD_CircularCallWidget_C_HackyFunction");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_HackyFunction, InAngle) == 0x000000, "Member 'WBP_UI_HUD_CircularCallWidget_C_HackyFunction::InAngle' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_HackyFunction, OutAngle) == 0x000004, "Member 'WBP_UI_HUD_CircularCallWidget_C_HackyFunction::OutAngle' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_CircularCallWidget_C_HackyFunction, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'WBP_UI_HUD_CircularCallWidget_C_HackyFunction::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
