#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Blackmarket_Inspect

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Blackmarket_Inspect.WBP_UI_Blackmarket_Inspect_C.ExecuteUbergraph_WBP_UI_Blackmarket_Inspect
// 0x0F08 (0x0F08 - 0x0000)
struct WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZArmorData*                          K2Node_DynamicCast_AsSBZArmor_Data;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZArmorConfig                        K2Node_MakeStruct_SBZArmorConfig;                  // 0x0018(0x0020)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0038(0x0030)()
	bool                                          CallFunc_IsInputTypeController_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0070(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x00A0(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x00D0(0x0030)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0120(0x0014)(ZeroConstructor, NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup;          // 0x0138(0x0010)(NoDestructor)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0148(0x0028)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue_1;   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x0188(0x0028)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x01B0(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_1;        // 0x01D0(0x0010)(NoDestructor)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_4;     // 0x01E0(0x0030)()
	bool                                          CallFunc_IsInputTypeController_ReturnValue_1;      // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_5;     // 0x0218(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_6;     // 0x0248(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_7;     // 0x0278(0x0030)()
	int32                                         CallFunc_Array_Add_ReturnValue_5;                  // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_6;                  // 0x02AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_7;                  // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x02B4(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_2;    // 0x02C8(0x0028)()
	class FName                                   K2Node_Event_PreviousValue;                        // 0x02F0(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x02FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue;      // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0320(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZBaseWeaponData*                     K2Node_DynamicCast_AsSBZBase_Weapon_Data;          // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_8;     // 0x0340(0x0030)()
	int32                                         CallFunc_Array_Add_ReturnValue_8;                  // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_374[0x4];                                      // 0x0374(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_9;     // 0x0378(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_10;    // 0x03A8(0x0030)()
	int32                                         CallFunc_Array_Add_ReturnValue_9;                  // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_10;                 // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputTypeController_ReturnValue_2;      // 0x03E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E1[0x7];                                      // 0x03E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_11;    // 0x03E8(0x0030)()
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_1;    // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMaskData*                           K2Node_DynamicCast_AsSBZMask_Data;                 // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZMaskConfig                         K2Node_MakeStruct_SBZMaskConfig;                   // 0x0430(0x0070)()
	const class USBZMaskMouldData*                K2Node_DynamicCast_AsSBZMask_Mould_Data;           // 0x04A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x04A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_2;        // 0x04B0(0x0010)(NoDestructor)
	int32                                         CallFunc_Array_Add_ReturnValue_11;                 // 0x04C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USBZModularPartSlotBase*, struct FSBZMaskPartConfigGroup> K2Node_MakeMap_Map;         // 0x04C8(0x0050)()
	struct FSBZMaskConfig                         K2Node_MakeStruct_SBZMaskConfig_1;                 // 0x0518(0x0070)()
	const class USBZMaskVFXData*                  K2Node_DynamicCast_AsSBZMask_VFXData;              // 0x0588(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_591[0x7];                                      // 0x0591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_3;        // 0x0598(0x0010)(NoDestructor)
	const class USBZMaskMaterialData*             K2Node_DynamicCast_AsSBZMask_Material_Data;        // 0x05A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x05B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B1[0x7];                                      // 0x05B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USBZModularPartSlotBase*, struct FSBZMaskPartConfigGroup> K2Node_MakeMap_Map_1;       // 0x05B8(0x0050)()
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_4;        // 0x0608(0x0010)(NoDestructor)
	struct FSBZMaskConfig                         K2Node_MakeStruct_SBZMaskConfig_2;                 // 0x0618(0x0070)()
	TMap<class USBZModularPartSlotBase*, struct FSBZMaskPartConfigGroup> K2Node_MakeMap_Map_2;       // 0x0688(0x0050)()
	struct FSBZMaskConfig                         K2Node_MakeStruct_SBZMaskConfig_3;                 // 0x06D8(0x0070)()
	const class USBZMaskPatternData*              K2Node_DynamicCast_AsSBZMask_Pattern_Data;         // 0x0748(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0750(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_751[0x7];                                      // 0x0751(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_5;        // 0x0758(0x0010)(NoDestructor)
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_6;        // 0x0768(0x0010)(NoDestructor)
	TMap<class USBZModularPartSlotBase*, struct FSBZMaskPartConfigGroup> K2Node_MakeMap_Map_3;       // 0x0778(0x0050)()
	struct FSBZMaskConfig                         K2Node_MakeStruct_SBZMaskConfig_4;                 // 0x07C8(0x0070)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0838(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_839[0x7];                                      // 0x0839(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZWeaponCharmData*              K2Node_DynamicCast_AsSBZWeapon_Charm_Data;         // 0x0840(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0848(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_849[0x7];                                      // 0x0849(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue_2;   // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZEquippablePartConfigGroup          K2Node_MakeStruct_SBZEquippablePartConfigGroup;    // 0x0858(0x0010)(NoDestructor)
	TMap<class USBZModularPartSlotBase*, struct FSBZEquippablePartConfigGroup> K2Node_MakeMap_Map_4; // 0x0868(0x0050)()
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_2;    // 0x08B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZEquippableConfig                   K2Node_MakeStruct_SBZEquippableConfig;             // 0x08C0(0x0070)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0930(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_944[0x4];                                      // 0x0944(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_3;    // 0x0948(0x0028)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x0970(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x097C(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_4;    // 0x0990(0x0028)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_12;    // 0x09B8(0x0030)()
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue_3;   // 0x09E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_12;                 // 0x09F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F4[0x4];                                      // 0x09F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_13;    // 0x09F8(0x0030)()
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_13;                 // 0x0A30(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A34[0x4];                                      // 0x0A34(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu;       // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0A40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A41[0x7];                                      // 0x0A41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_14;    // 0x0A48(0x0030)()
	int32                                         CallFunc_Array_Add_ReturnValue_14;                 // 0x0A78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A7C[0x4];                                      // 0x0A7C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_15;    // 0x0A80(0x0030)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x0AB0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_15;                 // 0x0ABC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_16;    // 0x0AC0(0x0030)()
	int32                                         CallFunc_Array_Add_ReturnValue_16;                 // 0x0AF0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF4[0x4];                                      // 0x0AF4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZWeaponPresetConfigData*             K2Node_DynamicCast_AsSBZWeapon_Preset_Config_Data; // 0x0AF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0B00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B01[0x7];                                      // 0x0B01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_3;    // 0x0B08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZEquippableConfig                   CallFunc_GetEquippableConfig_ReturnValue;          // 0x0B10(0x0070)(ConstParm)
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_4;    // 0x0B80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_17;    // 0x0B88(0x0030)()
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_5;    // 0x0BB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_17;                 // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC4[0x4];                                      // 0x0BC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_18;    // 0x0BC8(0x0030)()
	const class USBZMaskPreconfigData*            K2Node_DynamicCast_AsSBZMask_Preconfig_Data;       // 0x0BF8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0C00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C01[0x3];                                      // 0x0C01(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_18;                 // 0x0C04(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZMaskConfig                         CallFunc_GetMaskConfig_ReturnValue;                // 0x0C08(0x0070)(ConstParm)
	const class USBZSuitBaseData*                 K2Node_DynamicCast_AsSBZSuit_Base_Data;            // 0x0C78(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0C80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C81[0x7];                                      // 0x0C81(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZMaskConfig                         K2Node_MakeStruct_SBZMaskConfig_5;                 // 0x0C88(0x0070)()
	bool                                          CallFunc_IsInputTypeController_ReturnValue_3;      // 0x0CF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputTypeController_ReturnValue_4;      // 0x0CF9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CFA[0x6];                                      // 0x0CFA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZSuitConfig                         CallFunc_GetPreviewSuitConfig_ReturnValue;         // 0x0D00(0x0028)(ConstParm)
	struct FSBZSuitConfig                         K2Node_MakeStruct_SBZSuitConfig;                   // 0x0D28(0x0028)()
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_7;        // 0x0D50(0x0010)(NoDestructor)
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_8;        // 0x0D60(0x0010)(NoDestructor)
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_9;        // 0x0D70(0x0010)(NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0D80(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0D81(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D82[0x6];                                      // 0x0D82(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZMaskPartConfigGroup                K2Node_MakeStruct_SBZMaskPartConfigGroup_10;       // 0x0D88(0x0010)(NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0D98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D99[0x7];                                      // 0x0D99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USBZModularPartSlotBase*, struct FSBZMaskPartConfigGroup> K2Node_MakeMap_Map_5;       // 0x0DA0(0x0050)()
	struct FSBZMaskConfig                         K2Node_MakeStruct_SBZMaskConfig_6;                 // 0x0DF0(0x0070)()
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0E60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0E61(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E62[0x6];                                      // 0x0E62(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGloveData*                          K2Node_DynamicCast_AsSBZGlove_Data;                // 0x0E68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_12;                    // 0x0E70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsLoading;                           // 0x0E71(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0E72(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0E73(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E74[0x4];                                      // 0x0E74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_1;                // 0x0E78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0E80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_1;     // 0x0E88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_13;                    // 0x0E90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E91[0x7];                                      // 0x0E91(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuPlayerCharacter*            CallFunc_GetMainMenuMannequin_ReturnValue;         // 0x0E98(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_19;    // 0x0EA0(0x0030)()
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue_4;   // 0x0ED0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_19;                 // 0x0ED8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EDC[0x4];                                      // 0x0EDC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue_2;                // 0x0EE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZMainMenuPlayerCharacter*            CallFunc_GetMainMenuMannequin_ReturnValue_1;       // 0x0EE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZGameModeMainMenu*                   K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu_2;     // 0x0EF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_14;                    // 0x0EF8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EF9[0x7];                                      // 0x0EF9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_6;    // 0x0F00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect) == 0x000008, "Wrong alignment on WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect");
static_assert(sizeof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect) == 0x000F08, "Wrong size on WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, EntryPoint) == 0x000000, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_AsSBZArmor_Data) == 0x000008, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_AsSBZArmor_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZArmorConfig) == 0x000018, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZArmorConfig' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference) == 0x000038, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_IsInputTypeController_ReturnValue) == 0x000068, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_IsInputTypeController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue) == 0x00006C, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000070, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x0000A0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x0000D0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_MakeLiteralName_ReturnValue) == 0x000100, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_1) == 0x00010C, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_2) == 0x000110, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000118, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_CreateDelegate_OutputDelegate) == 0x000120, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_3) == 0x000134, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskPartConfigGroup) == 0x000138, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskPartConfigGroup' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000148, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000170, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_GetMainMenuCameraManager_ReturnValue_1) == 0x000180, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_GetMainMenuCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlsReference_1) == 0x000188, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlsReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001B0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_MakeLiteralName_ReturnValue_2) == 0x0001C4, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskPartConfigGroup_1) == 0x0001D0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskPartConfigGroup_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_4) == 0x0001E0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_IsInputTypeController_ReturnValue_1) == 0x000210, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_IsInputTypeController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_4) == 0x000214, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_5) == 0x000218, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_6) == 0x000248, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_7) == 0x000278, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_5) == 0x0002A8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_6) == 0x0002AC, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_7) == 0x0002B0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_CreateDelegate_OutputDelegate_2) == 0x0002B4, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlsReference_2) == 0x0002C8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlsReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_Event_PreviousValue) == 0x0002F0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_CustomEvent_ActionName) == 0x0002FC, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_GetCustomizationManager_ReturnValue) == 0x000308, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_GetCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_SwitchName_CmpSuccess) == 0x000310, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_GetUIManager_ReturnValue) == 0x000318, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_PopStack_ReturnValue) == 0x000320, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_AsSBZBase_Weapon_Data) == 0x000330, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_AsSBZBase_Weapon_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_bSuccess_1) == 0x000338, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_8) == 0x000340, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_8) == 0x000370, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_9) == 0x000378, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_10) == 0x0003A8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_9) == 0x0003D8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_10) == 0x0003DC, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_IsInputTypeController_ReturnValue_2) == 0x0003E0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_IsInputTypeController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_11) == 0x0003E8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_11' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_GetCustomizationManager_ReturnValue_1) == 0x000418, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_GetCustomizationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_AsSBZMask_Data) == 0x000420, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_AsSBZMask_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_bSuccess_2) == 0x000428, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskConfig) == 0x000430, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskConfig' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_AsSBZMask_Mould_Data) == 0x0004A0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_AsSBZMask_Mould_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_bSuccess_3) == 0x0004A8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskPartConfigGroup_2) == 0x0004B0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskPartConfigGroup_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_11) == 0x0004C0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeMap_Map) == 0x0004C8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskConfig_1) == 0x000518, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskConfig_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_AsSBZMask_VFXData) == 0x000588, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_AsSBZMask_VFXData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_bSuccess_4) == 0x000590, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskPartConfigGroup_3) == 0x000598, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskPartConfigGroup_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_AsSBZMask_Material_Data) == 0x0005A8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_AsSBZMask_Material_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_bSuccess_5) == 0x0005B0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeMap_Map_1) == 0x0005B8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskPartConfigGroup_4) == 0x000608, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskPartConfigGroup_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskConfig_2) == 0x000618, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskConfig_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeMap_Map_2) == 0x000688, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeMap_Map_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskConfig_3) == 0x0006D8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskConfig_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_AsSBZMask_Pattern_Data) == 0x000748, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_AsSBZMask_Pattern_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_bSuccess_6) == 0x000750, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskPartConfigGroup_5) == 0x000758, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskPartConfigGroup_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskPartConfigGroup_6) == 0x000768, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskPartConfigGroup_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeMap_Map_3) == 0x000778, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeMap_Map_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZMaskConfig_4) == 0x0007C8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZMaskConfig_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000838, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_AsSBZWeapon_Charm_Data) == 0x000840, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_AsSBZWeapon_Charm_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_bSuccess_7) == 0x000848, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_GetMainMenuCameraManager_ReturnValue_2) == 0x000850, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_GetMainMenuCameraManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZEquippablePartConfigGroup) == 0x000858, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZEquippablePartConfigGroup' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeMap_Map_4) == 0x000868, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeMap_Map_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_GetCustomizationManager_ReturnValue_2) == 0x0008B8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_GetCustomizationManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZEquippableConfig) == 0x0008C0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZEquippableConfig' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_CreateDelegate_OutputDelegate_3) == 0x000930, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlsReference_3) == 0x000948, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlsReference_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_MakeLiteralName_ReturnValue_3) == 0x000970, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_CreateDelegate_OutputDelegate_4) == 0x00097C, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlsReference_4) == 0x000990, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlsReference_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_12) == 0x0009B8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_12' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_GetMainMenuCameraManager_ReturnValue_3) == 0x0009E8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_GetMainMenuCameraManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_12) == 0x0009F0, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_MakeStruct_SBZButtonControlReference_13) == 0x0009F8, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_MakeStruct_SBZButtonControlReference_13' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_GetGameMode_ReturnValue) == 0x000A28, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, CallFunc_Array_Add_ReturnValue_13) == 0x000A30, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::CallFunc_Array_Add_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu) == 0x000A38, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_AsSBZGame_Mode_Main_Menu' has a wrong offset!");
static_assert(offsetof(WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect, K2Node_DynamicCast_bSuccess_8) == 0x000A40, "Member 'WBP_UI_Blackmarket_Inspect_C_ExecuteUbergraph_WBP_UI_Blackmarket_Inspect::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
