#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_CrimeNetStoryModeVideoButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_CrimeNetStoryModeVideoButton.WBP_UI_CrimeNetStoryModeVideoButton_C
// 0x0080 (0x0428 - 0x03A8)
class UWBP_UI_CrimeNetStoryModeVideoButton_C final : public USBZMainMenuCrimeNetStoryModeButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LockedPressed;                                     // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       OnFocused;                                         // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URetainerBox*                           BWEffect_RB;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DefaultOutline_B;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Disabled_O;                                        // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Disabled_T;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeistBackground_I;                                 // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Disabled_Overlay;                            // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_TextBackground;                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockIcon;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SelectedOutline_B;                                 // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_HeistName;                                    // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterials;                                  // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_DisabledOverlayDefault;                      // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_CrimeNetStoryModeVideoButton(int32 EntryPoint);
	void OnFocusChanged(bool bIsFocused);
	void ButtonSelected();
	void DisabledButtonSelected();
	void ButtonDisabledChanged(bool bInIsDisabled);
	void Construct();
	void OnHeistDataInitialized();
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void OnLoaded_8C94C37A4CF920479DF0A59BD3C0C3AE(class UObject* Loaded);
	void OnHoverChanged(bool bIsHovered);
	void OnFocusedChanged(bool bIsFocused);
	void InitializeButtonVisuals();
	void OnDisabledChanged(bool InDisabled);
	void SetButtonLocked();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_CrimeNetStoryModeVideoButton_C">();
	}
	static class UWBP_UI_CrimeNetStoryModeVideoButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_CrimeNetStoryModeVideoButton_C>();
	}
};
static_assert(alignof(UWBP_UI_CrimeNetStoryModeVideoButton_C) == 0x000008, "Wrong alignment on UWBP_UI_CrimeNetStoryModeVideoButton_C");
static_assert(sizeof(UWBP_UI_CrimeNetStoryModeVideoButton_C) == 0x000428, "Wrong size on UWBP_UI_CrimeNetStoryModeVideoButton_C");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, UberGraphFrame) == 0x0003A8, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, LockedPressed) == 0x0003B0, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::LockedPressed' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, OnFocused) == 0x0003B8, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, BWEffect_RB) == 0x0003C0, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::BWEffect_RB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, DefaultOutline_B) == 0x0003C8, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::DefaultOutline_B' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, Disabled_O) == 0x0003D0, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::Disabled_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, Disabled_T) == 0x0003D8, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::Disabled_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, HeistBackground_I) == 0x0003E0, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::HeistBackground_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, Image_Disabled_Overlay) == 0x0003E8, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::Image_Disabled_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, Image_TextBackground) == 0x0003F0, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::Image_TextBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, LockIcon) == 0x0003F8, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::LockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, SelectedOutline_B) == 0x000400, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::SelectedOutline_B' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, Text_HeistName) == 0x000408, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::Text_HeistName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, DynamicMaterials) == 0x000410, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::DynamicMaterials' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNetStoryModeVideoButton_C, Color_DisabledOverlayDefault) == 0x000418, "Member 'UWBP_UI_CrimeNetStoryModeVideoButton_C::Color_DisabledOverlayDefault' has a wrong offset!");

}

