#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ActionButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_ActionButton.WBP_UI_ActionButton_C.ExecuteUbergraph_WBP_UI_ActionButton
// 0x0148 (0x0148 - 0x0000)
struct WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue;               // 0x0134(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton) == 0x000008, "Wrong alignment on WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton");
static_assert(sizeof(WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton) == 0x000148, "Wrong size on WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton");
static_assert(offsetof(WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton, EntryPoint) == 0x000000, "Member 'WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton, K2Node_Event_MouseEvent_1) == 0x000040, "Member 'WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton, K2Node_Event_MouseEvent) == 0x0000B8, "Member 'WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton, CallFunc_IsHovered_ReturnValue) == 0x000130, "Member 'WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton, CallFunc_GetGlobalColor_ReturnValue) == 0x000134, "Member 'WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton::CallFunc_GetGlobalColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton, K2Node_Event_IsDesignTime) == 0x000144, "Member 'WBP_UI_ActionButton_C_ExecuteUbergraph_WBP_UI_ActionButton::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_ActionButton.WBP_UI_ActionButton_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct WBP_UI_ActionButton_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_ActionButton_C_OnMouseLeave) == 0x000008, "Wrong alignment on WBP_UI_ActionButton_C_OnMouseLeave");
static_assert(sizeof(WBP_UI_ActionButton_C_OnMouseLeave) == 0x000078, "Wrong size on WBP_UI_ActionButton_C_OnMouseLeave");
static_assert(offsetof(WBP_UI_ActionButton_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'WBP_UI_ActionButton_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function WBP_UI_ActionButton.WBP_UI_ActionButton_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WBP_UI_ActionButton_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_ActionButton_C_OnMouseEnter) == 0x000008, "Wrong alignment on WBP_UI_ActionButton_C_OnMouseEnter");
static_assert(sizeof(WBP_UI_ActionButton_C_OnMouseEnter) == 0x0000B0, "Wrong size on WBP_UI_ActionButton_C_OnMouseEnter");
static_assert(offsetof(WBP_UI_ActionButton_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'WBP_UI_ActionButton_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'WBP_UI_ActionButton_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function WBP_UI_ActionButton.WBP_UI_ActionButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_ActionButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ActionButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_ActionButton_C_PreConstruct");
static_assert(sizeof(WBP_UI_ActionButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_ActionButton_C_PreConstruct");
static_assert(offsetof(WBP_UI_ActionButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_ActionButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_ActionButton.WBP_UI_ActionButton_C.UpdateHover
// 0x0005 (0x0005 - 0x0000)
struct WBP_UI_ActionButton_C_UpdateHover final
{
public:
	bool                                          bIsMouseOver;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ActionButton_C_UpdateHover) == 0x000001, "Wrong alignment on WBP_UI_ActionButton_C_UpdateHover");
static_assert(sizeof(WBP_UI_ActionButton_C_UpdateHover) == 0x000005, "Wrong size on WBP_UI_ActionButton_C_UpdateHover");
static_assert(offsetof(WBP_UI_ActionButton_C_UpdateHover, bIsMouseOver) == 0x000000, "Member 'WBP_UI_ActionButton_C_UpdateHover::bIsMouseOver' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_UpdateHover, Temp_bool_Variable) == 0x000001, "Member 'WBP_UI_ActionButton_C_UpdateHover::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_UpdateHover, Temp_byte_Variable) == 0x000002, "Member 'WBP_UI_ActionButton_C_UpdateHover::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_UpdateHover, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_UI_ActionButton_C_UpdateHover::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_UpdateHover, K2Node_Select_Default) == 0x000004, "Member 'WBP_UI_ActionButton_C_UpdateHover::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_ActionButton.WBP_UI_ActionButton_C.OnMouseButtonDown
// 0x0230 (0x0230 - 0x0000)
struct WBP_UI_ActionButton_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00C0)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x0170(0x00C0)()
};
static_assert(alignof(WBP_UI_ActionButton_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WBP_UI_ActionButton_C_OnMouseButtonDown");
static_assert(sizeof(WBP_UI_ActionButton_C_OnMouseButtonDown) == 0x000230, "Wrong size on WBP_UI_ActionButton_C_OnMouseButtonDown");
static_assert(offsetof(WBP_UI_ActionButton_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WBP_UI_ActionButton_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WBP_UI_ActionButton_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_OnMouseButtonDown, ReturnValue) == 0x0000B0, "Member 'WBP_UI_ActionButton_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ActionButton_C_OnMouseButtonDown, K2Node_MakeStruct_EventReply) == 0x000170, "Member 'WBP_UI_ActionButton_C_OnMouseButtonDown::K2Node_MakeStruct_EventReply' has a wrong offset!");

}

