#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_SM_Matchmaking

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_SM_Matchmaking.WBP_UI_Widget_SM_Matchmaking_C.ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_ClosingActionName;              // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x004C(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0060(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue_1;               // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_1;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0088(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking");
static_assert(sizeof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking) == 0x0000A8, "Wrong size on WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, K2Node_CustomEvent_ClosingActionName) == 0x000018, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::K2Node_CustomEvent_ClosingActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, K2Node_SwitchName_CmpSuccess) == 0x000024, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, CallFunc_GetGameStateMachine_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, CallFunc_GetSBZOnline_ReturnValue) == 0x000030, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::CallFunc_GetSBZOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, K2Node_CreateDelegate_OutputDelegate_2) == 0x00004C, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, K2Node_CreateDelegate_OutputDelegate_3) == 0x000060, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, CallFunc_GetSBZOnline_ReturnValue_1) == 0x000078, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::CallFunc_GetSBZOnline_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, CallFunc_GetGameStateMachine_ReturnValue_1) == 0x000080, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::CallFunc_GetGameStateMachine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, CallFunc_K2_SetTimer_ReturnValue) == 0x000088, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking, K2Node_CreateDelegate_OutputDelegate_4) == 0x000090, "Member 'WBP_UI_Widget_SM_Matchmaking_C_ExecuteUbergraph_WBP_UI_Widget_SM_Matchmaking::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");

// Function WBP_UI_Widget_SM_Matchmaking.WBP_UI_Widget_SM_Matchmaking_C.OnPopUpButtonPressed
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Widget_SM_Matchmaking_C_OnPopUpButtonPressed final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SM_Matchmaking_C_OnPopUpButtonPressed) == 0x000004, "Wrong alignment on WBP_UI_Widget_SM_Matchmaking_C_OnPopUpButtonPressed");
static_assert(sizeof(WBP_UI_Widget_SM_Matchmaking_C_OnPopUpButtonPressed) == 0x00000C, "Wrong size on WBP_UI_Widget_SM_Matchmaking_C_OnPopUpButtonPressed");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_OnPopUpButtonPressed, ClosingActionName) == 0x000000, "Member 'WBP_UI_Widget_SM_Matchmaking_C_OnPopUpButtonPressed::ClosingActionName' has a wrong offset!");

// Function WBP_UI_Widget_SM_Matchmaking.WBP_UI_Widget_SM_Matchmaking_C.GoToLobby
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_SM_Matchmaking_C_GoToLobby final
{
public:
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SM_Matchmaking_C_GoToLobby) == 0x000008, "Wrong alignment on WBP_UI_Widget_SM_Matchmaking_C_GoToLobby");
static_assert(sizeof(WBP_UI_Widget_SM_Matchmaking_C_GoToLobby) == 0x000008, "Wrong size on WBP_UI_Widget_SM_Matchmaking_C_GoToLobby");
static_assert(offsetof(WBP_UI_Widget_SM_Matchmaking_C_GoToLobby, CallFunc_GetGameStateMachine_ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_SM_Matchmaking_C_GoToLobby::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");

}

