#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_Loadout_ModCategoryButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_Loadout_ModCategoryButton.WBP_MainMenu_Loadout_ModCategoryButton_C
// 0x0050 (0x03D8 - 0x0388)
class UWBP_MainMenu_Loadout_ModCategoryButton_C final : public USBZLoadoutModCategoryButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          ItemIcon;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Level_T;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Name_T;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MainMenu_Loadout_ModCategoryButton(int32 EntryPoint);
	void OnInitialized();
	void OnWeaponModCategoryDataIntialized();
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void PreConstruct(bool IsDesignTime);
	void OnHover(bool bIsHovered);
	void On_Focus(bool IsFocused);
	void OnFocusChanged(bool InIsFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_Loadout_ModCategoryButton_C">();
	}
	static class UWBP_MainMenu_Loadout_ModCategoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_Loadout_ModCategoryButton_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_Loadout_ModCategoryButton_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_Loadout_ModCategoryButton_C");
static_assert(sizeof(UWBP_MainMenu_Loadout_ModCategoryButton_C) == 0x0003D8, "Wrong size on UWBP_MainMenu_Loadout_ModCategoryButton_C");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, UberGraphFrame) == 0x000388, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, HoverAnim) == 0x000390, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, Border_Highlight) == 0x000398, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, Image) == 0x0003A0, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, Image_1) == 0x0003A8, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, Image_2) == 0x0003B0, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, Image_511) == 0x0003B8, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, ItemIcon) == 0x0003C0, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::ItemIcon' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, Level_T) == 0x0003C8, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::Level_T' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_Loadout_ModCategoryButton_C, Name_T) == 0x0003D0, "Member 'UWBP_MainMenu_Loadout_ModCategoryButton_C::Name_T' has a wrong offset!");

}

