#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_LoadoutCustomization_WeaponSlotButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_LoadoutCustomization_WeaponSlotButton.WBP_UI_LoadoutCustomization_WeaponSlotButton_C
// 0x0088 (0x04C8 - 0x0440)
class UWBP_UI_LoadoutCustomization_WeaponSlotButton_C final : public USBZMainMenuLoadoutWeaponSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0448(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_8;                                           // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_9;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_10;                                          // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_11;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_InvalidWeaponButton;                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_WeaponProgression;                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TextBlock_ItemType;                                // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TextBlock_Name;                                    // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_Icon;                                       // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_LoadoutCustomization_WeaponSlotButton(int32 EntryPoint);
	void OnWeaponSlotInitialized();
	void OnInitialized();
	void ButtonSelected();
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void PreConstruct(bool IsDesignTime);
	void OnHover(bool bIsHovered);
	void OnFocused(bool bIsFocused);
	void InitializeWeaponVisuals(class USBZInventoryBaseData* InInventoryData);
	void Set_Weapon_Name_Colour(const struct FLinearColor& DesiredColour);
	void RefreshVisuals();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_LoadoutCustomization_WeaponSlotButton_C">();
	}
	static class UWBP_UI_LoadoutCustomization_WeaponSlotButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_LoadoutCustomization_WeaponSlotButton_C>();
	}
};
static_assert(alignof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C) == 0x000008, "Wrong alignment on UWBP_UI_LoadoutCustomization_WeaponSlotButton_C");
static_assert(sizeof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C) == 0x0004C8, "Wrong size on UWBP_UI_LoadoutCustomization_WeaponSlotButton_C");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, UberGraphFrame) == 0x000440, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, HoverAnim) == 0x000448, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Border_Highlight) == 0x000450, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_3) == 0x000458, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_4) == 0x000460, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_5) == 0x000468, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_6) == 0x000470, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_8) == 0x000478, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_8' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_9) == 0x000480, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_9' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_10) == 0x000488, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_10' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_11) == 0x000490, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_11' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_Background) == 0x000498, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Image_InvalidWeaponButton) == 0x0004A0, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Image_InvalidWeaponButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Text_WeaponProgression) == 0x0004A8, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Text_WeaponProgression' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, TextBlock_ItemType) == 0x0004B0, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::TextBlock_ItemType' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, TextBlock_Name) == 0x0004B8, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_UI_LoadoutCustomization_WeaponSlotButton_C, Widget_Icon) == 0x0004C0, "Member 'UWBP_UI_LoadoutCustomization_WeaponSlotButton_C::Widget_Icon' has a wrong offset!");

}

