#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Social_PlayerCard

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.ExecuteUbergraph_WBP_UI_Social_PlayerCard
// 0x0428 (0x0428 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUser                               K2Node_Event_InUserEntry;                          // 0x0008(0x0380)(ConstParm)
	bool                                          K2Node_Event_bInHasFocus_1;                        // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0390(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bInIsDisabled;                        // 0x03A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA[0x6];                                      // 0x03AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollBoxSlot*                         CallFunc_SlotAsScrollBoxSlot_ReturnValue;          // 0x03B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_ComponentBoundEvent_bIsOpen;                // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BB[0x5];                                      // 0x03BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_GetOuterObject_ReturnValue;               // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_GetOuterObject_ReturnValue_1;             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerCardContainer_C*             K2Node_DynamicCast_AsWBP_Player_Card_Container;    // 0x03D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_SocialScreen_C*                 K2Node_DynamicCast_AsWBP_UI_Social_Screen;         // 0x03E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x03EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x03ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x03EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x03EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x03F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3F1[0x3];                                      // 0x03F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x03F4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_404[0x4];                                      // 0x0404(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Social_ContextButton_C*         K2Node_DynamicCast_AsWBP_UI_Social_Context_Button; // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0410(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x0411(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_5;                              // 0x0412(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInHasFocus;                          // 0x0413(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0414(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0415(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_416[0x2];                                      // 0x0416(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0421(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard) == 0x000008, "Wrong alignment on WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard) == 0x000428, "Wrong size on WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, EntryPoint) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_Event_InUserEntry) == 0x000008, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_Event_InUserEntry' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_Event_bInHasFocus_1) == 0x000388, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_Event_bInHasFocus_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_Conv_IntToText_ReturnValue) == 0x000390, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_TextIsEmpty_ReturnValue) == 0x0003A8, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_Event_bInIsDisabled) == 0x0003A9, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_Event_bInIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_SlotAsScrollBoxSlot_ReturnValue) == 0x0003B0, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_SlotAsScrollBoxSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_IsValid_ReturnValue) == 0x0003B8, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_ComponentBoundEvent_bIsOpen) == 0x0003B9, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_ComponentBoundEvent_bIsOpen' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_IsValid_ReturnValue_1) == 0x0003BA, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_GetOuterObject_ReturnValue) == 0x0003C0, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_GetOuterObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_GetOuterObject_ReturnValue_1) == 0x0003C8, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_GetOuterObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_DynamicCast_AsWBP_Player_Card_Container) == 0x0003D0, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_DynamicCast_AsWBP_Player_Card_Container' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_DynamicCast_bSuccess) == 0x0003D8, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_DynamicCast_AsWBP_UI_Social_Screen) == 0x0003E0, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_DynamicCast_AsWBP_UI_Social_Screen' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_DynamicCast_bSuccess_1) == 0x0003E8, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_IsValid_ReturnValue_2) == 0x0003E9, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, Temp_byte_Variable_1) == 0x0003EA, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_IsValid_ReturnValue_3) == 0x0003EB, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, Temp_bool_Variable) == 0x0003EC, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_Select_Default) == 0x0003ED, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, Temp_byte_Variable_2) == 0x0003EE, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, Temp_byte_Variable_3) == 0x0003EF, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, Temp_bool_Variable_1) == 0x0003F0, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_MakeStruct_Margin) == 0x0003F4, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_DynamicCast_AsWBP_UI_Social_Context_Button) == 0x000408, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_DynamicCast_AsWBP_UI_Social_Context_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_DynamicCast_bSuccess_2) == 0x000410, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, Temp_byte_Variable_4) == 0x000411, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, Temp_byte_Variable_5) == 0x000412, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_Event_bInHasFocus) == 0x000413, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_Event_bInHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_IsValid_ReturnValue_4) == 0x000414, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_Select_Default_1) == 0x000415, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, CallFunc_PlayAnimation_ReturnValue) == 0x000418, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, Temp_bool_Variable_2) == 0x000420, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard, K2Node_Select_Default_2) == 0x000421, "Member 'WBP_UI_Social_PlayerCard_C_ExecuteUbergraph_WBP_UI_Social_PlayerCard::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.ButtonFocusChanging
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_ButtonFocusChanging final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_ButtonFocusChanging) == 0x000001, "Wrong alignment on WBP_UI_Social_PlayerCard_C_ButtonFocusChanging");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_ButtonFocusChanging) == 0x000001, "Wrong size on WBP_UI_Social_PlayerCard_C_ButtonFocusChanging");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ButtonFocusChanging, bInHasFocus) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_ButtonFocusChanging::bInHasFocus' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.BndEvt__WBP_UI_Social_PlayerCard_MenuAnchor_112_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_BndEvt__WBP_UI_Social_PlayerCard_MenuAnchor_112_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature final
{
public:
	bool                                          bIsOpen;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_BndEvt__WBP_UI_Social_PlayerCard_MenuAnchor_112_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong alignment on WBP_UI_Social_PlayerCard_C_BndEvt__WBP_UI_Social_PlayerCard_MenuAnchor_112_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_BndEvt__WBP_UI_Social_PlayerCard_MenuAnchor_112_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature) == 0x000001, "Wrong size on WBP_UI_Social_PlayerCard_C_BndEvt__WBP_UI_Social_PlayerCard_MenuAnchor_112_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_BndEvt__WBP_UI_Social_PlayerCard_MenuAnchor_112_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature, bIsOpen) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_BndEvt__WBP_UI_Social_PlayerCard_MenuAnchor_112_K2Node_ComponentBoundEvent_1_OnMenuOpenChangedEvent__DelegateSignature::bIsOpen' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.ButtonDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_ButtonDisabledChanged final
{
public:
	bool                                          bInIsDisabled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_ButtonDisabledChanged) == 0x000001, "Wrong alignment on WBP_UI_Social_PlayerCard_C_ButtonDisabledChanged");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_ButtonDisabledChanged) == 0x000001, "Wrong size on WBP_UI_Social_PlayerCard_C_ButtonDisabledChanged");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ButtonDisabledChanged, bInIsDisabled) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_ButtonDisabledChanged::bInIsDisabled' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.ButtonFocusedChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_ButtonFocusedChanged final
{
public:
	bool                                          bInHasFocus;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_ButtonFocusedChanged) == 0x000001, "Wrong alignment on WBP_UI_Social_PlayerCard_C_ButtonFocusedChanged");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_ButtonFocusedChanged) == 0x000001, "Wrong size on WBP_UI_Social_PlayerCard_C_ButtonFocusedChanged");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_ButtonFocusedChanged, bInHasFocus) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_ButtonFocusedChanged::bInHasFocus' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.OnPlayerDataSet
// 0x0380 (0x0380 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_OnPlayerDataSet final
{
public:
	struct FSBZUser                               InUserEntry;                                       // 0x0000(0x0380)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_OnPlayerDataSet) == 0x000008, "Wrong alignment on WBP_UI_Social_PlayerCard_C_OnPlayerDataSet");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_OnPlayerDataSet) == 0x000380, "Wrong size on WBP_UI_Social_PlayerCard_C_OnPlayerDataSet");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_OnPlayerDataSet, InUserEntry) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_OnPlayerDataSet::InUserEntry' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.PlayerCardHover
// 0x0138 (0x0138 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_PlayerCardHover final
{
public:
	bool                                          InFocus;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0008(0x0030)()
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Social_ContextMenu_C*           CallFunc_IsContextMenuDisplayed_ContextMenu;       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0048(0x0030)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x6];                                       // 0x007A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x0080(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x00B0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_Select_Default_1;                           // 0x00C8(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x00F8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0110(0x0028)()
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_PlayerCardHover) == 0x000008, "Wrong alignment on WBP_UI_Social_PlayerCard_C_PlayerCardHover");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_PlayerCardHover) == 0x000138, "Wrong size on WBP_UI_Social_PlayerCard_C_PlayerCardHover");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, InFocus) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::InFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, Temp_byte_Variable) == 0x000001, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, Temp_bool_Variable) == 0x000003, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, K2Node_MakeStruct_SBZButtonControlReference) == 0x000008, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, K2Node_Select_Default) == 0x000038, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, CallFunc_IsContextMenuDisplayed_ContextMenu) == 0x000040, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::CallFunc_IsContextMenuDisplayed_ContextMenu' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000048, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, Temp_bool_Variable_1) == 0x000079, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x000080, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, K2Node_CreateDelegate_OutputDelegate) == 0x0000B0, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, K2Node_Select_Default_1) == 0x0000C8, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, K2Node_MakeArray_Array) == 0x0000F8, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, CallFunc_IsValid_ReturnValue_1) == 0x000108, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PlayerCardHover, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000110, "Member 'WBP_UI_Social_PlayerCard_C_PlayerCardHover::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.PopulatePlayerData
// 0x01B0 (0x01B0 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_PopulatePlayerData final
{
public:
	struct FSBZFriendListEntry                    SBZFriendListEntry;                                // 0x0000(0x01B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_PopulatePlayerData) == 0x000008, "Wrong alignment on WBP_UI_Social_PlayerCard_C_PopulatePlayerData");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_PopulatePlayerData) == 0x0001B0, "Wrong size on WBP_UI_Social_PlayerCard_C_PopulatePlayerData");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_PopulatePlayerData, SBZFriendListEntry) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_PopulatePlayerData::SBZFriendListEntry' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.DisplayUserStatus
// 0x02A0 (0x02A0 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_DisplayUserStatus final
{
public:
	ESBZUserStatus                                UserStatus;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LevelIdx;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZUserActivity                       UserActivity;                                      // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   HeistName;                                         // 0x00C0(0x0018)(Edit, BlueprintVisible)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        CallFunc_LevelIdxToPath_ReturnValue;               // 0x00E0(0x0020)(ZeroConstructor, HasGetValueTypeHash)
	class UPD3HeistDataAsset*                     CallFunc_GetHeistDataFromLevelPath_ReturnValue;    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BreakSoftObjectPath_PathString;           // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetBaseFilename_ReturnValue;              // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0130(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0148(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0160(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01B0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x01F0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0208(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0218(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0230(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0270(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x7];                                      // 0x0281(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0288(0x0018)()
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus) == 0x000008, "Wrong alignment on WBP_UI_Social_PlayerCard_C_DisplayUserStatus");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus) == 0x0002A0, "Wrong size on WBP_UI_Social_PlayerCard_C_DisplayUserStatus");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, UserStatus) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::UserStatus' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, LevelIdx) == 0x000004, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::LevelIdx' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, UserActivity) == 0x000008, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::UserActivity' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, HeistName) == 0x0000C0, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::HeistName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_Less_IntInt_ReturnValue) == 0x0000D8, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, Temp_bool_Variable) == 0x0000D9, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_LevelIdxToPath_ReturnValue) == 0x0000E0, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_LevelIdxToPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_GetHeistDataFromLevelPath_ReturnValue) == 0x000100, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_GetHeistDataFromLevelPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_BreakSoftObjectPath_PathString) == 0x000108, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_BreakSoftObjectPath_PathString' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_IsValid_ReturnValue) == 0x000118, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_GetBaseFilename_ReturnValue) == 0x000120, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_GetBaseFilename_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_Conv_StringToText_ReturnValue) == 0x000130, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, K2Node_Select_Default) == 0x000148, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, K2Node_MakeStruct_FormatArgumentData) == 0x000160, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, K2Node_MakeArray_Array) == 0x0001A0, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001B0, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_Format_ReturnValue) == 0x0001F0, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, K2Node_MakeArray_Array_1) == 0x000208, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_Format_ReturnValue_1) == 0x000218, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, K2Node_MakeStruct_FormatArgumentData_2) == 0x000230, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, K2Node_MakeArray_Array_2) == 0x000270, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, K2Node_SwitchEnum_CmpSuccess) == 0x000280, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_DisplayUserStatus, CallFunc_Format_ReturnValue_2) == 0x000288, "Member 'WBP_UI_Social_PlayerCard_C_DisplayUserStatus::CallFunc_Format_ReturnValue_2' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.SetPlatformName
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_SetPlatformName final
{
public:
	class FText                                   InPlatformName;                                    // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_SetPlatformName) == 0x000008, "Wrong alignment on WBP_UI_Social_PlayerCard_C_SetPlatformName");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_SetPlatformName) == 0x000018, "Wrong size on WBP_UI_Social_PlayerCard_C_SetPlatformName");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetPlatformName, InPlatformName) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_SetPlatformName::InPlatformName' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.SetLevel
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_SetLevel final
{
public:
	class FText                                   InLevel;                                           // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0068(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0080(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_SetLevel) == 0x000008, "Wrong alignment on WBP_UI_Social_PlayerCard_C_SetLevel");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_SetLevel) == 0x0000A0, "Wrong size on WBP_UI_Social_PlayerCard_C_SetLevel");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetLevel, InLevel) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_SetLevel::InLevel' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetLevel, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_UI_Social_PlayerCard_C_SetLevel::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetLevel, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_UI_Social_PlayerCard_C_SetLevel::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetLevel, CallFunc_Format_ReturnValue) == 0x000068, "Member 'WBP_UI_Social_PlayerCard_C_SetLevel::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetLevel, CallFunc_MakeLiteralText_ReturnValue) == 0x000080, "Member 'WBP_UI_Social_PlayerCard_C_SetLevel::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetLevel, CallFunc_EqualEqual_TextText_ReturnValue) == 0x000098, "Member 'WBP_UI_Social_PlayerCard_C_SetLevel::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.SetPlatformIcon
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_SetPlatformIcon final
{
public:
	class UPaperSprite*                           InPlatformIcon;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_SetPlatformIcon) == 0x000008, "Wrong alignment on WBP_UI_Social_PlayerCard_C_SetPlatformIcon");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_SetPlatformIcon) == 0x000020, "Wrong size on WBP_UI_Social_PlayerCard_C_SetPlatformIcon");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetPlatformIcon, InPlatformIcon) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_SetPlatformIcon::InPlatformIcon' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetPlatformIcon, Temp_bool_Variable) == 0x000008, "Member 'WBP_UI_Social_PlayerCard_C_SetPlatformIcon::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetPlatformIcon, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_UI_Social_PlayerCard_C_SetPlatformIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetPlatformIcon, Temp_byte_Variable) == 0x00000A, "Member 'WBP_UI_Social_PlayerCard_C_SetPlatformIcon::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetPlatformIcon, Temp_byte_Variable_1) == 0x00000B, "Member 'WBP_UI_Social_PlayerCard_C_SetPlatformIcon::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetPlatformIcon, K2Node_Select_Default) == 0x00000C, "Member 'WBP_UI_Social_PlayerCard_C_SetPlatformIcon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetPlatformIcon, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000010, "Member 'WBP_UI_Social_PlayerCard_C_SetPlatformIcon::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.SetStatus
// 0x0450 (0x0450 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_SetStatus final
{
public:
	int32                                         LevelIndex;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUserActivity                       UserActivity;                                      // 0x0008(0x00B8)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsLocalPlayer;                                     // 0x00C0(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsPlatformNameEmpty;                               // 0x00C1(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUserValid_ReturnValue;                  // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUser                               CallFunc_GetUser_ReturnValue;                      // 0x00C8(0x0380)(ConstParm)
	ESBZUserStatus                                CallFunc_GetUserStatus_ReturnValue;                // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0449(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x044A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x044B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_SetStatus) == 0x000008, "Wrong alignment on WBP_UI_Social_PlayerCard_C_SetStatus");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_SetStatus) == 0x000450, "Wrong size on WBP_UI_Social_PlayerCard_C_SetStatus");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, LevelIndex) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::LevelIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, UserActivity) == 0x000008, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::UserActivity' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, IsLocalPlayer) == 0x0000C0, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::IsLocalPlayer' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, IsPlatformNameEmpty) == 0x0000C1, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::IsPlatformNameEmpty' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, CallFunc_IsUserValid_ReturnValue) == 0x0000C2, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::CallFunc_IsUserValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, CallFunc_GetUser_ReturnValue) == 0x0000C8, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::CallFunc_GetUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, CallFunc_GetUserStatus_ReturnValue) == 0x000448, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::CallFunc_GetUserStatus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, K2Node_SwitchEnum_CmpSuccess) == 0x000449, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00044A, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetStatus, CallFunc_BooleanAND_ReturnValue) == 0x00044B, "Member 'WBP_UI_Social_PlayerCard_C_SetStatus::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.SetBlockedIconVisibility
// 0x0007 (0x0007 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility final
{
public:
	bool                                          bIsBlocked;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlatformBlocked;                                // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility) == 0x000001, "Wrong alignment on WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility) == 0x000007, "Wrong size on WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility, bIsBlocked) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility::bIsBlocked' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility, bIsPlatformBlocked) == 0x000001, "Member 'WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility::bIsPlatformBlocked' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility, Temp_bool_Variable) == 0x000002, "Member 'WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility, K2Node_Select_Default) == 0x000006, "Member 'WBP_UI_Social_PlayerCard_C_SetBlockedIconVisibility::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_Social_PlayerCard.WBP_UI_Social_PlayerCard_C.SetHostIconVisibility
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Social_PlayerCard_C_SetHostIconVisibility final
{
public:
	bool                                          IsPartyLeader;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PartySessionMembers;                               // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility) == 0x000004, "Wrong alignment on WBP_UI_Social_PlayerCard_C_SetHostIconVisibility");
static_assert(sizeof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility) == 0x000010, "Wrong size on WBP_UI_Social_PlayerCard_C_SetHostIconVisibility");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility, IsPartyLeader) == 0x000000, "Member 'WBP_UI_Social_PlayerCard_C_SetHostIconVisibility::IsPartyLeader' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility, PartySessionMembers) == 0x000004, "Member 'WBP_UI_Social_PlayerCard_C_SetHostIconVisibility::PartySessionMembers' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility, Temp_bool_Variable) == 0x000008, "Member 'WBP_UI_Social_PlayerCard_C_SetHostIconVisibility::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility, CallFunc_Greater_IntInt_ReturnValue) == 0x000009, "Member 'WBP_UI_Social_PlayerCard_C_SetHostIconVisibility::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility, Temp_byte_Variable) == 0x00000A, "Member 'WBP_UI_Social_PlayerCard_C_SetHostIconVisibility::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility, CallFunc_BooleanAND_ReturnValue) == 0x00000B, "Member 'WBP_UI_Social_PlayerCard_C_SetHostIconVisibility::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility, Temp_byte_Variable_1) == 0x00000C, "Member 'WBP_UI_Social_PlayerCard_C_SetHostIconVisibility::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000D, "Member 'WBP_UI_Social_PlayerCard_C_SetHostIconVisibility::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Social_PlayerCard_C_SetHostIconVisibility, CallFunc_BooleanAND_ReturnValue_1) == 0x00000E, "Member 'WBP_UI_Social_PlayerCard_C_SetHostIconVisibility::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
