#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DailyChallengePreviewItem

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DailyChallengePreviewItem.WBP_DailyChallengePreviewItem_C
// 0x00F8 (0x0388 - 0x0290)
class UWBP_DailyChallengePreviewItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BaseBackground_I;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BaseBackground_I_1;                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Complete_I;                                        // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Description_O;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Description_T;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_117;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressBackground_I;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        ProgressContent_WS;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ProgressValue_T;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSBZChallengeData                      ChallengeData;                                     // 0x02E0(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_DailyChallengePreviewItem(int32 EntryPoint);
	void UpdateProgress(int32 InCurrentVal, int32 InMaxValue);
	void InitItem(const struct FSBZChallengeData& InData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_DailyChallengePreviewItem_C">();
	}
	static class UWBP_DailyChallengePreviewItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DailyChallengePreviewItem_C>();
	}
};
static_assert(alignof(UWBP_DailyChallengePreviewItem_C) == 0x000008, "Wrong alignment on UWBP_DailyChallengePreviewItem_C");
static_assert(sizeof(UWBP_DailyChallengePreviewItem_C) == 0x000388, "Wrong size on UWBP_DailyChallengePreviewItem_C");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, UberGraphFrame) == 0x000290, "Member 'UWBP_DailyChallengePreviewItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, BaseBackground_I) == 0x000298, "Member 'UWBP_DailyChallengePreviewItem_C::BaseBackground_I' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, BaseBackground_I_1) == 0x0002A0, "Member 'UWBP_DailyChallengePreviewItem_C::BaseBackground_I_1' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, Complete_I) == 0x0002A8, "Member 'UWBP_DailyChallengePreviewItem_C::Complete_I' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, Description_O) == 0x0002B0, "Member 'UWBP_DailyChallengePreviewItem_C::Description_O' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, Description_T) == 0x0002B8, "Member 'UWBP_DailyChallengePreviewItem_C::Description_T' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, Image_117) == 0x0002C0, "Member 'UWBP_DailyChallengePreviewItem_C::Image_117' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, ProgressBackground_I) == 0x0002C8, "Member 'UWBP_DailyChallengePreviewItem_C::ProgressBackground_I' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, ProgressContent_WS) == 0x0002D0, "Member 'UWBP_DailyChallengePreviewItem_C::ProgressContent_WS' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, ProgressValue_T) == 0x0002D8, "Member 'UWBP_DailyChallengePreviewItem_C::ProgressValue_T' has a wrong offset!");
static_assert(offsetof(UWBP_DailyChallengePreviewItem_C, ChallengeData) == 0x0002E0, "Member 'UWBP_DailyChallengePreviewItem_C::ChallengeData' has a wrong offset!");

}

