#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_NavBarButton

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_NavBarButton.WBP_UI_Widget_NavBarButton_C.ExecuteUbergraph_WBP_UI_Widget_NavBarButton
// 0x0098 (0x0098 - 0x0000)
struct WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0008(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsHovered;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZNavButtonParameters                K2Node_Event_ButtonParams;                         // 0x0020(0x0070)(ConstParm)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_1;                // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton) == 0x000008, "Wrong alignment on WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton");
static_assert(sizeof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton) == 0x000098, "Wrong size on WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton, CallFunc_IsHovered_ReturnValue) == 0x000004, "Member 'WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton::CallFunc_IsHovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton, K2Node_Event_PreviousValue) == 0x000008, "Member 'WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton, CallFunc_SelectInt_ReturnValue) == 0x000014, "Member 'WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton, K2Node_Event_bIsHovered) == 0x000018, "Member 'WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton::K2Node_Event_bIsHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton, K2Node_Event_ButtonParams) == 0x000020, "Member 'WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton::K2Node_Event_ButtonParams' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton, CallFunc_Play2DSound_ReturnValue) == 0x000090, "Member 'WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton, CallFunc_Play2DSound_ReturnValue_1) == 0x000094, "Member 'WBP_UI_Widget_NavBarButton_C_ExecuteUbergraph_WBP_UI_Widget_NavBarButton::CallFunc_Play2DSound_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_Widget_NavBarButton.WBP_UI_Widget_NavBarButton_C.OnButtonInitialized
// 0x0070 (0x0070 - 0x0000)
struct WBP_UI_Widget_NavBarButton_C_OnButtonInitialized final
{
public:
	struct FSBZNavButtonParameters                ButtonParams;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_Widget_NavBarButton_C_OnButtonInitialized) == 0x000008, "Wrong alignment on WBP_UI_Widget_NavBarButton_C_OnButtonInitialized");
static_assert(sizeof(WBP_UI_Widget_NavBarButton_C_OnButtonInitialized) == 0x000070, "Wrong size on WBP_UI_Widget_NavBarButton_C_OnButtonInitialized");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_OnButtonInitialized, ButtonParams) == 0x000000, "Member 'WBP_UI_Widget_NavBarButton_C_OnButtonInitialized::ButtonParams' has a wrong offset!");

// Function WBP_UI_Widget_NavBarButton.WBP_UI_Widget_NavBarButton_C.OnHovered
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_NavBarButton_C_OnHovered final
{
public:
	bool                                          bIsHovered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_NavBarButton_C_OnHovered) == 0x000001, "Wrong alignment on WBP_UI_Widget_NavBarButton_C_OnHovered");
static_assert(sizeof(WBP_UI_Widget_NavBarButton_C_OnHovered) == 0x000001, "Wrong size on WBP_UI_Widget_NavBarButton_C_OnHovered");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_OnHovered, bIsHovered) == 0x000000, "Member 'WBP_UI_Widget_NavBarButton_C_OnHovered::bIsHovered' has a wrong offset!");

// Function WBP_UI_Widget_NavBarButton.WBP_UI_Widget_NavBarButton_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Widget_NavBarButton_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_NavBarButton_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_Widget_NavBarButton_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_Widget_NavBarButton_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_Widget_NavBarButton_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_Widget_NavBarButton_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_Widget_NavBarButton.WBP_UI_Widget_NavBarButton_C.SetFocused
// 0x0050 (0x0050 - 0x0000)
struct WBP_UI_Widget_NavBarButton_C_SetFocused final
{
public:
	bool                                          InFocused;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUITextBlock*                        K2Node_DynamicCast_AsSBZ_TextBlock;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZTextStyle*                          K2Node_Select_Default;                             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         K2Node_Select_Default_1;                           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_NavBarButton_C_SetFocused) == 0x000008, "Wrong alignment on WBP_UI_Widget_NavBarButton_C_SetFocused");
static_assert(sizeof(WBP_UI_Widget_NavBarButton_C_SetFocused) == 0x000050, "Wrong size on WBP_UI_Widget_NavBarButton_C_SetFocused");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, InFocused) == 0x000000, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::InFocused' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, Temp_bool_Variable) == 0x000001, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, Temp_object_Variable) == 0x000008, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, Temp_object_Variable_1) == 0x000010, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, Temp_bool_Variable_1) == 0x000018, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, Temp_object_Variable_2) == 0x000020, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, Temp_object_Variable_3) == 0x000028, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, K2Node_DynamicCast_AsSBZ_TextBlock) == 0x000030, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::K2Node_DynamicCast_AsSBZ_TextBlock' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, K2Node_Select_Default) == 0x000040, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetFocused, K2Node_Select_Default_1) == 0x000048, "Member 'WBP_UI_Widget_NavBarButton_C_SetFocused::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_UI_Widget_NavBarButton.WBP_UI_Widget_NavBarButton_C.InitializeButton
// 0x0020 (0x0020 - 0x0000)
struct WBP_UI_Widget_NavBarButton_C_InitializeButton final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	float                                         MinWidth_0;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_NavBarButton_C_InitializeButton) == 0x000008, "Wrong alignment on WBP_UI_Widget_NavBarButton_C_InitializeButton");
static_assert(sizeof(WBP_UI_Widget_NavBarButton_C_InitializeButton) == 0x000020, "Wrong size on WBP_UI_Widget_NavBarButton_C_InitializeButton");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_InitializeButton, Text) == 0x000000, "Member 'WBP_UI_Widget_NavBarButton_C_InitializeButton::Text' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_InitializeButton, MinWidth_0) == 0x000018, "Member 'WBP_UI_Widget_NavBarButton_C_InitializeButton::MinWidth_0' has a wrong offset!");

// Function WBP_UI_Widget_NavBarButton.WBP_UI_Widget_NavBarButton_C.SetHovered
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Widget_NavBarButton_C_SetHovered final
{
public:
	bool                                          InHovered;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUITextBlock*                        K2Node_DynamicCast_AsSBZ_TextBlock;                // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_NavBarButton_C_SetHovered) == 0x000008, "Wrong alignment on WBP_UI_Widget_NavBarButton_C_SetHovered");
static_assert(sizeof(WBP_UI_Widget_NavBarButton_C_SetHovered) == 0x000030, "Wrong size on WBP_UI_Widget_NavBarButton_C_SetHovered");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetHovered, InHovered) == 0x000000, "Member 'WBP_UI_Widget_NavBarButton_C_SetHovered::InHovered' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetHovered, Temp_bool_Variable) == 0x000001, "Member 'WBP_UI_Widget_NavBarButton_C_SetHovered::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetHovered, CallFunc_SelectInt_ReturnValue) == 0x000004, "Member 'WBP_UI_Widget_NavBarButton_C_SetHovered::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetHovered, Temp_object_Variable) == 0x000008, "Member 'WBP_UI_Widget_NavBarButton_C_SetHovered::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetHovered, Temp_object_Variable_1) == 0x000010, "Member 'WBP_UI_Widget_NavBarButton_C_SetHovered::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetHovered, K2Node_Select_Default) == 0x000018, "Member 'WBP_UI_Widget_NavBarButton_C_SetHovered::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetHovered, K2Node_DynamicCast_AsSBZ_TextBlock) == 0x000020, "Member 'WBP_UI_Widget_NavBarButton_C_SetHovered::K2Node_DynamicCast_AsSBZ_TextBlock' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_NavBarButton_C_SetHovered, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_UI_Widget_NavBarButton_C_SetHovered::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

