#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ArmorModifierScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_ArmorModifierScreen.WBP_UI_ArmorModifierScreen_C
// 0x0060 (0x0388 - 0x0328)
class UWBP_UI_ArmorModifierScreen_C final : public USBZMainMenuArmorModifierScreen
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Intro;                                             // 0x0330(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USBZUITextBlock*                        ArmorHeader_T;                                     // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Inventory_ItemDescriptionBox_C* Inventory_ItemDescriptionBox;                      // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenTitle_C*                     ScreenTitle;                                       // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TitleHeader_T;                                     // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ArmorChunk_PlateDetails_C*         WBP_ArmorChunk_PlateDetails;                       // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMainMenuArmorChunkButton*           ActiveButton;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZArmorConfig                        ArmorConfig;                                       // 0x0368(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WBP_UI_ArmorModifierScreen(int32 EntryPoint);
	void OnArmorChunkSlotButtonEquipped(const class USBZMainMenuArmorChunkButton* EquippedButton);
	void OnBackPressed();
	void OnControlsReferenceClicked(class FName InActionInput);
	void OnArmorChunkSlotButtonSelected(const class USBZMainMenuArmorChunkButton* SelectedButton);
	void NewArmorChunkSlotFocused(const class USBZMainMenuArmorChunkButton* NewFocusedButton);
	void SetDefaultFocus();
	void OnLostStackFocused();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void PreConstruct(bool IsDesignTime);
	void UpdateActiveButtonControlsReference();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_ArmorModifierScreen_C">();
	}
	static class UWBP_UI_ArmorModifierScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_ArmorModifierScreen_C>();
	}
};
static_assert(alignof(UWBP_UI_ArmorModifierScreen_C) == 0x000008, "Wrong alignment on UWBP_UI_ArmorModifierScreen_C");
static_assert(sizeof(UWBP_UI_ArmorModifierScreen_C) == 0x000388, "Wrong size on UWBP_UI_ArmorModifierScreen_C");
static_assert(offsetof(UWBP_UI_ArmorModifierScreen_C, UberGraphFrame) == 0x000328, "Member 'UWBP_UI_ArmorModifierScreen_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorModifierScreen_C, Intro) == 0x000330, "Member 'UWBP_UI_ArmorModifierScreen_C::Intro' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorModifierScreen_C, ArmorHeader_T) == 0x000338, "Member 'UWBP_UI_ArmorModifierScreen_C::ArmorHeader_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorModifierScreen_C, Inventory_ItemDescriptionBox) == 0x000340, "Member 'UWBP_UI_ArmorModifierScreen_C::Inventory_ItemDescriptionBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorModifierScreen_C, ScreenTitle) == 0x000348, "Member 'UWBP_UI_ArmorModifierScreen_C::ScreenTitle' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorModifierScreen_C, TitleHeader_T) == 0x000350, "Member 'UWBP_UI_ArmorModifierScreen_C::TitleHeader_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorModifierScreen_C, WBP_ArmorChunk_PlateDetails) == 0x000358, "Member 'UWBP_UI_ArmorModifierScreen_C::WBP_ArmorChunk_PlateDetails' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorModifierScreen_C, ActiveButton) == 0x000360, "Member 'UWBP_UI_ArmorModifierScreen_C::ActiveButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ArmorModifierScreen_C, ArmorConfig) == 0x000368, "Member 'UWBP_UI_ArmorModifierScreen_C::ArmorConfig' has a wrong offset!");

}

