#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PartyInviteInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PartyInviteInfo.WBP_PartyInviteInfo_C
// 0x0038 (0x02E8 - 0x02B0)
class UWBP_PartyInviteInfo_C final : public USBZMenuMouseButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       OnFocused;                                         // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_ActionInput_C*           ActionKey;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ActionName_T;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DarkBackground_I;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PartyAmountBkg_I;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        PartyAmountCount_T;                                // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PartyInviteInfo(int32 EntryPoint);
	void ButtonHoveredChanged(bool bInIsHovered);
	void EnableInput(bool InEnable);
	void BndEvt__WBP_PartyInviteInfo_ActionKey_K2Node_ComponentBoundEvent_0_SBZOnActionChanged__DelegateSignature();
	void OnInstallStateChanged(bool bIsGameInstallPending);
	void OnPartyInfoUpdated();
	void OnPlayerPartyChanged(const class FString& PlayerId);
	void OnPrivilegeChanged(ESBZUserPrivilegesProxy Privilege, bool bPrivilegeAllowed);
	void OnInitialized();
	void ButtonSelected();
	void PreConstruct(bool IsDesignTime);
	void UpdateAccessBasedOnPrivilege(bool CanPlayOnline, bool InstallPending);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PartyInviteInfo_C">();
	}
	static class UWBP_PartyInviteInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PartyInviteInfo_C>();
	}
};
static_assert(alignof(UWBP_PartyInviteInfo_C) == 0x000008, "Wrong alignment on UWBP_PartyInviteInfo_C");
static_assert(sizeof(UWBP_PartyInviteInfo_C) == 0x0002E8, "Wrong size on UWBP_PartyInviteInfo_C");
static_assert(offsetof(UWBP_PartyInviteInfo_C, UberGraphFrame) == 0x0002B0, "Member 'UWBP_PartyInviteInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PartyInviteInfo_C, OnFocused) == 0x0002B8, "Member 'UWBP_PartyInviteInfo_C::OnFocused' has a wrong offset!");
static_assert(offsetof(UWBP_PartyInviteInfo_C, ActionKey) == 0x0002C0, "Member 'UWBP_PartyInviteInfo_C::ActionKey' has a wrong offset!");
static_assert(offsetof(UWBP_PartyInviteInfo_C, ActionName_T) == 0x0002C8, "Member 'UWBP_PartyInviteInfo_C::ActionName_T' has a wrong offset!");
static_assert(offsetof(UWBP_PartyInviteInfo_C, DarkBackground_I) == 0x0002D0, "Member 'UWBP_PartyInviteInfo_C::DarkBackground_I' has a wrong offset!");
static_assert(offsetof(UWBP_PartyInviteInfo_C, PartyAmountBkg_I) == 0x0002D8, "Member 'UWBP_PartyInviteInfo_C::PartyAmountBkg_I' has a wrong offset!");
static_assert(offsetof(UWBP_PartyInviteInfo_C, PartyAmountCount_T) == 0x0002E0, "Member 'UWBP_PartyInviteInfo_C::PartyAmountCount_T' has a wrong offset!");

}

