#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_Ping

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_Ping.WBP_UI_Widget_Ping_C
// 0x0038 (0x02F0 - 0x02B8)
class UWBP_UI_Widget_Ping_C final : public USBZPingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_QualityColor;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PingValue;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           HighPingQualityColor;                              // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CriticalPingQualityColor;                          // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_Ping(int32 EntryPoint);
	void OnPingValueChanged(const int32 PingValue);
	void PreConstruct(bool IsDesignTime);
	void OnPingQualityChanged(const EPingQuality PingQuality);
	void UpdateQualityIcon(EPingQuality InPingQuality);
	void UpdateValueText(int32 InPing);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_Ping_C">();
	}
	static class UWBP_UI_Widget_Ping_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_Ping_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_Ping_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_Ping_C");
static_assert(sizeof(UWBP_UI_Widget_Ping_C) == 0x0002F0, "Wrong size on UWBP_UI_Widget_Ping_C");
static_assert(offsetof(UWBP_UI_Widget_Ping_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_UI_Widget_Ping_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Ping_C, Border_QualityColor) == 0x0002C0, "Member 'UWBP_UI_Widget_Ping_C::Border_QualityColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Ping_C, Text_PingValue) == 0x0002C8, "Member 'UWBP_UI_Widget_Ping_C::Text_PingValue' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Ping_C, HighPingQualityColor) == 0x0002D0, "Member 'UWBP_UI_Widget_Ping_C::HighPingQualityColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_Ping_C, CriticalPingQualityColor) == 0x0002E0, "Member 'UWBP_UI_Widget_Ping_C::CriticalPingQualityColor' has a wrong offset!");

}

