#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Skills_Menu

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "ESBZSkillEquipResult_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.ExecuteUbergraph_WBP_UI_Skills_Menu
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsGameInstallPending;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsGameInstallPending)>   K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0014)(ZeroConstructor, NoDestructor)
	TArray<class USBZSkillData*>                  K2Node_CustomEvent_PlayerSkills;                   // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class USBZSkillManager*                       CallFunc_GetSkillManager_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USBZSkillLine*>                  CallFunc_GetPlayerSkills_PlayerSkills;             // 0x0038(0x0010)(ReferenceParm)
	class UWBP_UI_Loadout_SkillsCustomization_C*  K2Node_CustomEvent_parent;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Skills_Line_C*                  CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0088(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0096(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_97[0x1];                                       // 0x0097(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkillLine*                          CallFunc_Array_Get_Item;                           // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Skills_Line_C*                  K2Node_DynamicCast_AsWBP_UI_Skills_Line;           // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Skills_Line_C*                  CallFunc_Create_ReturnValue_1;                     // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGameInstallPending_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu");
static_assert(sizeof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu) == 0x0000F0, "Wrong size on WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, EntryPoint) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, K2Node_CustomEvent_bIsGameInstallPending) == 0x000004, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::K2Node_CustomEvent_bIsGameInstallPending' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, K2Node_CustomEvent_PlayerSkills) == 0x000020, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::K2Node_CustomEvent_PlayerSkills' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_GetSkillManager_ReturnValue) == 0x000030, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_GetSkillManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_GetPlayerSkills_PlayerSkills) == 0x000038, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_GetPlayerSkills_PlayerSkills' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, K2Node_CustomEvent_parent) == 0x000048, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::K2Node_CustomEvent_parent' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, Temp_int_Variable) == 0x000050, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_Create_ReturnValue) == 0x000058, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_Add_IntInt_ReturnValue) == 0x000064, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, Temp_int_Loop_Counter_Variable) == 0x000068, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, K2Node_CustomEvent_ActionName) == 0x00006C, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, K2Node_SwitchName_CmpSuccess) == 0x000078, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_Add_IntInt_ReturnValue_1) == 0x00007C, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_GetUIManager_ReturnValue) == 0x000080, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_PopStack_ReturnValue) == 0x000088, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_IsValid_ReturnValue) == 0x000094, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_IsValid_ReturnValue_1) == 0x000095, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, K2Node_Event_IsDesignTime) == 0x000096, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_Array_Get_Item) == 0x000098, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_Array_Length_ReturnValue) == 0x0000A0, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_Less_IntInt_ReturnValue) == 0x0000A4, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_AddChild_ReturnValue) == 0x0000A8, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, Temp_bool_IsClosed_Variable) == 0x0000B0, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_GetChildAt_ReturnValue) == 0x0000B8, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, K2Node_DynamicCast_AsWBP_UI_Skills_Line) == 0x0000C0, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::K2Node_DynamicCast_AsWBP_UI_Skills_Line' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_IsValid_ReturnValue_2) == 0x0000C9, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_Create_ReturnValue_1) == 0x0000D0, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_AddChild_ReturnValue_1) == 0x0000D8, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_GetUIManager_ReturnValue_1) == 0x0000E0, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu, CallFunc_IsGameInstallPending_ReturnValue) == 0x0000E8, "Member 'WBP_UI_Skills_Menu_C_ExecuteUbergraph_WBP_UI_Skills_Menu::CallFunc_IsGameInstallPending_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.OnInstallStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Menu_C_OnInstallStateChanged final
{
public:
	bool                                          bIsGameInstallPending;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_OnInstallStateChanged) == 0x000001, "Wrong alignment on WBP_UI_Skills_Menu_C_OnInstallStateChanged");
static_assert(sizeof(WBP_UI_Skills_Menu_C_OnInstallStateChanged) == 0x000001, "Wrong size on WBP_UI_Skills_Menu_C_OnInstallStateChanged");
static_assert(offsetof(WBP_UI_Skills_Menu_C_OnInstallStateChanged, bIsGameInstallPending) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_OnInstallStateChanged::bIsGameInstallPending' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Skills_Menu_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Skills_Menu_C_PreConstruct");
static_assert(sizeof(WBP_UI_Skills_Menu_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Skills_Menu_C_PreConstruct");
static_assert(offsetof(WBP_UI_Skills_Menu_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Skills_Menu_C_OnControlsReferenceClicked final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_Skills_Menu_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_Skills_Menu_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_Skills_Menu_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_Skills_Menu_C_OnControlsReferenceClicked, ActionName) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_OnControlsReferenceClicked::ActionName' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.Init
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Skills_Menu_C_Init final
{
public:
	class UWBP_UI_Loadout_SkillsCustomization_C*  parent_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_Init) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_Init");
static_assert(sizeof(WBP_UI_Skills_Menu_C_Init) == 0x000008, "Wrong size on WBP_UI_Skills_Menu_C_Init");
static_assert(offsetof(WBP_UI_Skills_Menu_C_Init, parent_0) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_Init::parent_0' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.ShowScreen
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Skills_Menu_C_ShowScreen final
{
public:
	TArray<class USBZSkillData*>                  PlayerSkills_0;                                    // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_ShowScreen) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_ShowScreen");
static_assert(sizeof(WBP_UI_Skills_Menu_C_ShowScreen) == 0x000010, "Wrong size on WBP_UI_Skills_Menu_C_ShowScreen");
static_assert(offsetof(WBP_UI_Skills_Menu_C_ShowScreen, PlayerSkills_0) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_ShowScreen::PlayerSkills_0' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.SetEquipSkill
// 0x0058 (0x0058 - 0x0000)
struct WBP_UI_Skills_Menu_C_SetEquipSkill final
{
public:
	class USBZSkill*                              Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillState                                SkillState;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkill*                              CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Skills_Button_C*                CallFunc_Map_Find_Value;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x6];                                       // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Skills_Button_C*                CallFunc_Map_Find_Value_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_SetEquipSkill) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_SetEquipSkill");
static_assert(sizeof(WBP_UI_Skills_Menu_C_SetEquipSkill) == 0x000058, "Wrong size on WBP_UI_Skills_Menu_C_SetEquipSkill");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, Skill) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::Skill' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, SkillState) == 0x000008, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::SkillState' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000018, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_Array_Get_Item) == 0x000020, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000028, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_Map_Find_Value) == 0x000030, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_Map_Find_ReturnValue) == 0x000038, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00003A, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_Array_Contains_ReturnValue) == 0x00003B, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_BooleanAND_ReturnValue_1) == 0x000040, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_Map_Find_Value_1) == 0x000048, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_Map_Find_ReturnValue_1) == 0x000050, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetEquipSkill, CallFunc_IsValid_ReturnValue) == 0x000051, "Member 'WBP_UI_Skills_Menu_C_SetEquipSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.DebugSetResearch
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_Skills_Menu_C_DebugSetResearch final
{
public:
	class USBZSkillManager*                       CallFunc_GetSkillManager_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkillLine*                          CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_DebugSetResearch) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_DebugSetResearch");
static_assert(sizeof(WBP_UI_Skills_Menu_C_DebugSetResearch) == 0x000028, "Wrong size on WBP_UI_Skills_Menu_C_DebugSetResearch");
static_assert(offsetof(WBP_UI_Skills_Menu_C_DebugSetResearch, CallFunc_GetSkillManager_ReturnValue) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_DebugSetResearch::CallFunc_GetSkillManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_DebugSetResearch, CallFunc_Array_Length_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Menu_C_DebugSetResearch::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_DebugSetResearch, CallFunc_Array_LastIndex_ReturnValue) == 0x00000C, "Member 'WBP_UI_Skills_Menu_C_DebugSetResearch::CallFunc_Array_LastIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_DebugSetResearch, CallFunc_Greater_IntInt_ReturnValue) == 0x000010, "Member 'WBP_UI_Skills_Menu_C_DebugSetResearch::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_DebugSetResearch, CallFunc_Array_Get_Item) == 0x000018, "Member 'WBP_UI_Skills_Menu_C_DebugSetResearch::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_DebugSetResearch, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_UI_Skills_Menu_C_DebugSetResearch::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.SetSkillLineResearchMarker
// 0x0048 (0x0048 - 0x0000)
struct WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker final
{
public:
	class UWBP_UI_Skills_Line_C*                  SkillLineWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Skills_Line_C*                  K2Node_DynamicCast_AsWBP_UI_Skills_Line;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker");
static_assert(sizeof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker) == 0x000048, "Wrong size on WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, SkillLineWidget) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::SkillLineWidget' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, CallFunc_GetAllChildren_ReturnValue) == 0x000018, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, K2Node_DynamicCast_AsWBP_UI_Skills_Line) == 0x000038, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::K2Node_DynamicCast_AsWBP_UI_Skills_Line' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker, CallFunc_Less_FloatFloat_ReturnValue) == 0x000042, "Member 'WBP_UI_Skills_Menu_C_SetSkillLineResearchMarker::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.SetButtonFocus
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Skills_Menu_C_SetButtonFocus final
{
public:
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Skills_Line_C*                  K2Node_DynamicCast_AsWBP_UI_Skills_Line;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_SetButtonFocus) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_SetButtonFocus");
static_assert(sizeof(WBP_UI_Skills_Menu_C_SetButtonFocus) == 0x000018, "Wrong size on WBP_UI_Skills_Menu_C_SetButtonFocus");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetButtonFocus, CallFunc_GetChildAt_ReturnValue) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_SetButtonFocus::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetButtonFocus, K2Node_DynamicCast_AsWBP_UI_Skills_Line) == 0x000008, "Member 'WBP_UI_Skills_Menu_C_SetButtonFocus::K2Node_DynamicCast_AsWBP_UI_Skills_Line' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetButtonFocus, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_UI_Skills_Menu_C_SetButtonFocus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetButtonFocus, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_UI_Skills_Menu_C_SetButtonFocus::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.SetAcedSkills
// 0x0040 (0x0040 - 0x0000)
struct WBP_UI_Skills_Menu_C_SetAcedSkills final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZSkillLine*                          CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkill*                              CallFunc_Array_Get_Item_1;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZSkill*                              CallFunc_Array_Get_Item_2;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_SetAcedSkills) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_SetAcedSkills");
static_assert(sizeof(WBP_UI_Skills_Menu_C_SetAcedSkills) == 0x000040, "Wrong size on WBP_UI_Skills_Menu_C_SetAcedSkills");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_Array_Get_Item) == 0x000010, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_Array_Get_Item_1) == 0x000020, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_Array_Get_Item_2) == 0x000028, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_Array_Contains_ReturnValue) == 0x000031, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_Array_Length_ReturnValue_1) == 0x000034, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_SetAcedSkills, CallFunc_Greater_IntInt_ReturnValue) == 0x000038, "Member 'WBP_UI_Skills_Menu_C_SetAcedSkills::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.CanSelectSkill
// 0x0040 (0x0040 - 0x0000)
struct WBP_UI_Skills_Menu_C_CanSelectSkill final
{
public:
	class UWBP_UI_Skills_Button_C*                Skill;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZSkillEquipResult                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_5;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_6;        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_7;        // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_8;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_ByteByte_ReturnValue;        // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_9;        // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_10;       // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x001F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocked_IsLocked;                        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkillManager*                       CallFunc_GetSkillManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEarnedSkillPoints_ReturnValue;         // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Skills_Menu_C_CanSelectSkill) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_CanSelectSkill");
static_assert(sizeof(WBP_UI_Skills_Menu_C_CanSelectSkill) == 0x000040, "Wrong size on WBP_UI_Skills_Menu_C_CanSelectSkill");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, Skill) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::Skill' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, Result) == 0x000008, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::Result' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_MakeLiteralByte_ReturnValue) == 0x000009, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_IsValid_ReturnValue) == 0x00000A, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000B, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000C, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x00000D, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_BooleanAND_ReturnValue) == 0x00000E, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00000F, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000010, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_BooleanAND_ReturnValue_1) == 0x000011, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_BooleanOR_ReturnValue) == 0x000012, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x000013, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_5) == 0x000014, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x000015, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_6) == 0x000016, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_7) == 0x000017, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_8) == 0x000018, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_BooleanAND_ReturnValue_2) == 0x000019, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_GreaterEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_GreaterEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_BooleanAND_ReturnValue_3) == 0x00001B, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_9) == 0x00001C, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_BooleanOR_ReturnValue_1) == 0x00001D, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_EqualEqual_ByteByte_ReturnValue_10) == 0x00001E, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_EqualEqual_ByteByte_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_BooleanAND_ReturnValue_4) == 0x00001F, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_IsLocked_IsLocked) == 0x000020, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_IsLocked_IsLocked' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_Not_PreBool_ReturnValue) == 0x000021, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_GetSkillManager_ReturnValue) == 0x000028, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_GetSkillManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_GetEarnedSkillPoints_ReturnValue) == 0x000034, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_GetEarnedSkillPoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_CanSelectSkill, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_UI_Skills_Menu_C_CanSelectSkill::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_Skills_Menu.WBP_UI_Skills_Menu_C.UpdateSkillPoints
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_UI_Skills_Menu_C_UpdateSkillPoints final
{
public:
	class USBZSkillManager*                       CallFunc_GetSkillManager_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetEarnedSkillPoints_ReturnValue;         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0050(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0090(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00A0(0x0018)()
};
static_assert(alignof(WBP_UI_Skills_Menu_C_UpdateSkillPoints) == 0x000008, "Wrong alignment on WBP_UI_Skills_Menu_C_UpdateSkillPoints");
static_assert(sizeof(WBP_UI_Skills_Menu_C_UpdateSkillPoints) == 0x0000B8, "Wrong size on WBP_UI_Skills_Menu_C_UpdateSkillPoints");
static_assert(offsetof(WBP_UI_Skills_Menu_C_UpdateSkillPoints, CallFunc_GetSkillManager_ReturnValue) == 0x000000, "Member 'WBP_UI_Skills_Menu_C_UpdateSkillPoints::CallFunc_GetSkillManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Skills_Menu_C_UpdateSkillPoints, CallFunc_GetEarnedSkillPoints_ReturnValue) == 0x000008, "Member 'WBP_UI_Skills_Menu_C_UpdateSkillPoints::CallFunc_GetEarnedSkillPoints_ReturnValue' has a wrong offset!");
