#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_SubObjective

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_SubObjective.WBP_UI_Widget_SubObjective_C.ExecuteUbergraph_WBP_UI_Widget_SubObjective
// 0x0078 (0x0078 - 0x0000)
struct WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZObjective*                          K2Node_Event_ObjectiveInit;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSubObjective;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZObjective*                          K2Node_Event_ObjectiveActivated;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          K2Node_Event_ObjectiveCompleted;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          K2Node_Event_ObjectiveFailed;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor_1;                   // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZObjective*                          K2Node_Event_ObjectiveDisabled;                    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective) == 0x000008, "Wrong alignment on WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective");
static_assert(sizeof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective) == 0x000078, "Wrong size on WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, K2Node_Event_ObjectiveInit) == 0x000008, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::K2Node_Event_ObjectiveInit' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, K2Node_Event_bIsSubObjective) == 0x000010, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::K2Node_Event_bIsSubObjective' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, CallFunc_IsActive_ReturnValue) == 0x000011, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::CallFunc_IsActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, K2Node_Event_ObjectiveActivated) == 0x000018, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::K2Node_Event_ObjectiveActivated' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, K2Node_Event_ObjectiveCompleted) == 0x000020, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::K2Node_Event_ObjectiveCompleted' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, K2Node_Event_ObjectiveFailed) == 0x000028, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::K2Node_Event_ObjectiveFailed' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, K2Node_MakeStruct_LinearColor) == 0x000030, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, K2Node_MakeStruct_LinearColor_1) == 0x000040, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::K2Node_MakeStruct_LinearColor_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, K2Node_Event_ObjectiveDisabled) == 0x000050, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::K2Node_Event_ObjectiveDisabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, CallFunc_PlayAnimation_ReturnValue_1) == 0x000060, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, K2Node_Event_IsDesignTime) == 0x000068, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000070, "Member 'WBP_UI_Widget_SubObjective_C_ExecuteUbergraph_WBP_UI_Widget_SubObjective::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");

// Function WBP_UI_Widget_SubObjective.WBP_UI_Widget_SubObjective_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_SubObjective_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_SubObjective_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_SubObjective_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_SubObjective_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_SubObjective_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_SubObjective_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_SubObjective.WBP_UI_Widget_SubObjective_C.ObjectiveDisabled
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_SubObjective_C_ObjectiveDisabled final
{
public:
	class ASBZObjective*                          Param_ObjectiveDisabled_0;                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SubObjective_C_ObjectiveDisabled) == 0x000008, "Wrong alignment on WBP_UI_Widget_SubObjective_C_ObjectiveDisabled");
static_assert(sizeof(WBP_UI_Widget_SubObjective_C_ObjectiveDisabled) == 0x000008, "Wrong size on WBP_UI_Widget_SubObjective_C_ObjectiveDisabled");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ObjectiveDisabled, Param_ObjectiveDisabled_0) == 0x000000, "Member 'WBP_UI_Widget_SubObjective_C_ObjectiveDisabled::Param_ObjectiveDisabled_0' has a wrong offset!");

// Function WBP_UI_Widget_SubObjective.WBP_UI_Widget_SubObjective_C.ObjectiveFailed
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_SubObjective_C_ObjectiveFailed final
{
public:
	class ASBZObjective*                          Param_ObjectiveFailed_0;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SubObjective_C_ObjectiveFailed) == 0x000008, "Wrong alignment on WBP_UI_Widget_SubObjective_C_ObjectiveFailed");
static_assert(sizeof(WBP_UI_Widget_SubObjective_C_ObjectiveFailed) == 0x000008, "Wrong size on WBP_UI_Widget_SubObjective_C_ObjectiveFailed");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ObjectiveFailed, Param_ObjectiveFailed_0) == 0x000000, "Member 'WBP_UI_Widget_SubObjective_C_ObjectiveFailed::Param_ObjectiveFailed_0' has a wrong offset!");

// Function WBP_UI_Widget_SubObjective.WBP_UI_Widget_SubObjective_C.ObjectiveCompleted
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_SubObjective_C_ObjectiveCompleted final
{
public:
	class ASBZObjective*                          Param_ObjectiveCompleted_0;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SubObjective_C_ObjectiveCompleted) == 0x000008, "Wrong alignment on WBP_UI_Widget_SubObjective_C_ObjectiveCompleted");
static_assert(sizeof(WBP_UI_Widget_SubObjective_C_ObjectiveCompleted) == 0x000008, "Wrong size on WBP_UI_Widget_SubObjective_C_ObjectiveCompleted");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ObjectiveCompleted, Param_ObjectiveCompleted_0) == 0x000000, "Member 'WBP_UI_Widget_SubObjective_C_ObjectiveCompleted::Param_ObjectiveCompleted_0' has a wrong offset!");

// Function WBP_UI_Widget_SubObjective.WBP_UI_Widget_SubObjective_C.ObjectiveActivated
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_SubObjective_C_ObjectiveActivated final
{
public:
	class ASBZObjective*                          Param_ObjectiveActivated_0;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_SubObjective_C_ObjectiveActivated) == 0x000008, "Wrong alignment on WBP_UI_Widget_SubObjective_C_ObjectiveActivated");
static_assert(sizeof(WBP_UI_Widget_SubObjective_C_ObjectiveActivated) == 0x000008, "Wrong size on WBP_UI_Widget_SubObjective_C_ObjectiveActivated");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_ObjectiveActivated, Param_ObjectiveActivated_0) == 0x000000, "Member 'WBP_UI_Widget_SubObjective_C_ObjectiveActivated::Param_ObjectiveActivated_0' has a wrong offset!");

// Function WBP_UI_Widget_SubObjective.WBP_UI_Widget_SubObjective_C.OnObjectiveInitialized
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_SubObjective_C_OnObjectiveInitialized final
{
public:
	class ASBZObjective*                          ObjectiveInit;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSubObjective;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_SubObjective_C_OnObjectiveInitialized) == 0x000008, "Wrong alignment on WBP_UI_Widget_SubObjective_C_OnObjectiveInitialized");
static_assert(sizeof(WBP_UI_Widget_SubObjective_C_OnObjectiveInitialized) == 0x000010, "Wrong size on WBP_UI_Widget_SubObjective_C_OnObjectiveInitialized");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_OnObjectiveInitialized, ObjectiveInit) == 0x000000, "Member 'WBP_UI_Widget_SubObjective_C_OnObjectiveInitialized::ObjectiveInit' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_SubObjective_C_OnObjectiveInitialized, bIsSubObjective) == 0x000008, "Member 'WBP_UI_Widget_SubObjective_C_OnObjectiveInitialized::bIsSubObjective' has a wrong offset!");

}

