#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ArmorChunk_PlateDetails

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ArmorChunk_PlateDetails.WBP_ArmorChunk_PlateDetails_C
// 0x0030 (0x02C0 - 0x0290)
class UWBP_ArmorChunk_PlateDetails_C final : public UUserWidget
{
public:
	class USBZUITextBlock*                        Description_T;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        DownsAmount_T;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_68;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        PlateType_T;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        RegenAmount_T;                                     // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Speical_T;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetPlateInfo(ESBZArmorChunkType PlateType);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ArmorChunk_PlateDetails_C">();
	}
	static class UWBP_ArmorChunk_PlateDetails_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ArmorChunk_PlateDetails_C>();
	}
};
static_assert(alignof(UWBP_ArmorChunk_PlateDetails_C) == 0x000008, "Wrong alignment on UWBP_ArmorChunk_PlateDetails_C");
static_assert(sizeof(UWBP_ArmorChunk_PlateDetails_C) == 0x0002C0, "Wrong size on UWBP_ArmorChunk_PlateDetails_C");
static_assert(offsetof(UWBP_ArmorChunk_PlateDetails_C, Description_T) == 0x000290, "Member 'UWBP_ArmorChunk_PlateDetails_C::Description_T' has a wrong offset!");
static_assert(offsetof(UWBP_ArmorChunk_PlateDetails_C, DownsAmount_T) == 0x000298, "Member 'UWBP_ArmorChunk_PlateDetails_C::DownsAmount_T' has a wrong offset!");
static_assert(offsetof(UWBP_ArmorChunk_PlateDetails_C, Image_68) == 0x0002A0, "Member 'UWBP_ArmorChunk_PlateDetails_C::Image_68' has a wrong offset!");
static_assert(offsetof(UWBP_ArmorChunk_PlateDetails_C, PlateType_T) == 0x0002A8, "Member 'UWBP_ArmorChunk_PlateDetails_C::PlateType_T' has a wrong offset!");
static_assert(offsetof(UWBP_ArmorChunk_PlateDetails_C, RegenAmount_T) == 0x0002B0, "Member 'UWBP_ArmorChunk_PlateDetails_C::RegenAmount_T' has a wrong offset!");
static_assert(offsetof(UWBP_ArmorChunk_PlateDetails_C, Speical_T) == 0x0002B8, "Member 'UWBP_ArmorChunk_PlateDetails_C::Speical_T' has a wrong offset!");

}

