#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_LoadoutDisplayPanel

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel
// 0x0128 (0x0128 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_8;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_7;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_6;           // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_5;           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_4;           // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_3;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZPlayerLoadoutConfig                K2Node_Event_PlayerLoadoutConfig;                  // 0x0080(0x0098)(ConstParm)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel) == 0x000128, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, EntryPoint) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_Button_8) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_Button_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_bIsEnabled_7) == 0x000010, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_bIsEnabled_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_Button_7) == 0x000018, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_bIsEnabled_6) == 0x000020, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_bIsEnabled_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_Button_6) == 0x000028, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_bIsEnabled_5) == 0x000030, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_bIsEnabled_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_Button_5) == 0x000038, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_bIsEnabled_4) == 0x000040, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_bIsEnabled_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_Button_4) == 0x000048, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_bIsEnabled_3) == 0x000050, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_bIsEnabled_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_Button_3) == 0x000058, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x000060, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_Button_2) == 0x000068, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000070, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_Button_1) == 0x000078, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_Event_PlayerLoadoutConfig) == 0x000080, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_Event_PlayerLoadoutConfig' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_Button) == 0x000118, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000120, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_ExecuteUbergraph_WBP_UI_Inventory_LoadoutDisplayPanel::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_OverkillWeapon_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.OnNewConfigUpdated
// 0x0098 (0x0098 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_OnNewConfigUpdated final
{
public:
	struct FSBZPlayerLoadoutConfig                PlayerLoadoutConfig;                               // 0x0000(0x0098)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_OnNewConfigUpdated) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_OnNewConfigUpdated");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_OnNewConfigUpdated) == 0x000098, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_OnNewConfigUpdated");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_OnNewConfigUpdated, PlayerLoadoutConfig) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_OnNewConfigUpdated::PlayerLoadoutConfig' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_8_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Skills_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Placeable_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Tool_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Throwable_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_Armour_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_SecondaryWeapon_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_BndEvt__WBP_UI_Inventory_LoadoutDisplayPanel_Button_PrimaryWeapon_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Inventory_LoadoutDisplayPanel.WBP_UI_Inventory_LoadoutDisplayPanel_C.NavFromSkills
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Inventory_LoadoutDisplayPanel_C_NavFromSkills final
{
public:
	EUINavigation                                 Navigation_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_LoadoutDisplayPanel_C_NavFromSkills) == 0x000008, "Wrong alignment on WBP_UI_Inventory_LoadoutDisplayPanel_C_NavFromSkills");
static_assert(sizeof(WBP_UI_Inventory_LoadoutDisplayPanel_C_NavFromSkills) == 0x000018, "Wrong size on WBP_UI_Inventory_LoadoutDisplayPanel_C_NavFromSkills");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_NavFromSkills, Navigation_0) == 0x000000, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_NavFromSkills::Navigation_0' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_LoadoutDisplayPanel_C_NavFromSkills, ReturnValue) == 0x000008, "Member 'WBP_UI_Inventory_LoadoutDisplayPanel_C_NavFromSkills::ReturnValue' has a wrong offset!");
