#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_GamepadBindingButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_GamepadBindingButton.WBP_Settings_GamepadBindingButton_C
// 0x0030 (0x0450 - 0x0420)
class UWBP_Settings_GamepadBindingButton_C final : public USBZSettingsButtonGamepadBinding
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputKeySelector*                      InputKeySelector_PrimaryKey;                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SettingName;                                  // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SBZInputKeySelector_C*             WBP_SBZInputKeySelector;                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Settings_GamepadBindingButton(int32 EntryPoint);
	void BndEvt__WBP_Settings_GamepadBindingButton_WBP_SBZInputKeySelector_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void BndEvt__WBP_Settings_KeyboardBindingButton_InputKeySelector_PrimaryKey_K2Node_ComponentBoundEvent_3_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void SettingChanged();
	void SelectionNameChanged();
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RefreshVisuals();
	void OnHoverVisuals(bool bIsHovered);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void InitializeVisuals();
	void UpdateSettingNameText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_GamepadBindingButton_C">();
	}
	static class UWBP_Settings_GamepadBindingButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_GamepadBindingButton_C>();
	}
};
static_assert(alignof(UWBP_Settings_GamepadBindingButton_C) == 0x000008, "Wrong alignment on UWBP_Settings_GamepadBindingButton_C");
static_assert(sizeof(UWBP_Settings_GamepadBindingButton_C) == 0x000450, "Wrong size on UWBP_Settings_GamepadBindingButton_C");
static_assert(offsetof(UWBP_Settings_GamepadBindingButton_C, UberGraphFrame) == 0x000420, "Member 'UWBP_Settings_GamepadBindingButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GamepadBindingButton_C, Image_Background) == 0x000428, "Member 'UWBP_Settings_GamepadBindingButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GamepadBindingButton_C, Image_Hover) == 0x000430, "Member 'UWBP_Settings_GamepadBindingButton_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GamepadBindingButton_C, InputKeySelector_PrimaryKey) == 0x000438, "Member 'UWBP_Settings_GamepadBindingButton_C::InputKeySelector_PrimaryKey' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GamepadBindingButton_C, Text_SettingName) == 0x000440, "Member 'UWBP_Settings_GamepadBindingButton_C::Text_SettingName' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_GamepadBindingButton_C, WBP_SBZInputKeySelector) == 0x000448, "Member 'UWBP_Settings_GamepadBindingButton_C::WBP_SBZInputKeySelector' has a wrong offset!");

}

