#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ModeSelect_Options

#include "Basic.hpp"

#include "E_ButtonLockedState_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.ExecuteUbergraph_WBP_UI_ModeSelect_Options
// 0x02E8 (0x02E8 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x002C(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0050(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0080(0x0030)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_3;           // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x00D0(0x0028)()
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0144(0x0014)(ZeroConstructor, NoDestructor)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_4;            // 0x0190(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZOnlineSession*                      CallFunc_GetSBZOnline_ReturnValue;                 // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x01C0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_4;               // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bIsGameInstallPending)>   K2Node_CreateDelegate_OutputDelegate_3;            // 0x01E0(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameEventBroker*                    CallFunc_GetGameEventBroker_ReturnValue;           // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESBZUserPrivilegesProxy Privilege, bool bPrivilegeAllowed)> K2Node_CreateDelegate_OutputDelegate_4; // 0x0200(0x0014)(ZeroConstructor, NoDestructor)
	ESBZUserPrivilegesProxy                       K2Node_CustomEvent_Privilege;                      // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bPrivilegeAllowed;              // 0x0215(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsGameInstallPending;          // 0x0216(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_217[0x1];                                      // 0x0217(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZPartyManager*                       CallFunc_GetPartyManager_ReturnValue;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& PlayerId)> K2Node_CreateDelegate_OutputDelegate_5;           // 0x0220(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_PlayerId;                       // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_5;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_6;               // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_1;              // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_SM_GameStart_C*                 K2Node_DynamicCast_AsWBP_UI_SM_Game_Start;         // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_SM_GameStart_C*                 K2Node_DynamicCast_AsWBP_UI_SM_Game_Start_1;       // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_7;               // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_8;               // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_2;              // 0x02A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue_3;              // 0x02A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_SM_GameStart_C*                 K2Node_DynamicCast_AsWBP_UI_SM_Game_Start_2;       // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x7];                                      // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_SM_GameStart_C*                 K2Node_DynamicCast_AsWBP_UI_SM_Game_Start_3;       // 0x02C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x02C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C9[0x3];                                      // 0x02C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x02CC(0x0014)(ZeroConstructor, NoDestructor)
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options) == 0x0002E8, "Wrong size on WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, EntryPoint) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000010, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetUIManager_ReturnValue) == 0x000018, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000020, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_Event_PreviousValue) == 0x00002C, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_MakeStruct_SBZButtonControlReference) == 0x000050, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000080, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_Button_4) == 0x0000B0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_bIsEnabled_3) == 0x0000B8, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_bIsEnabled_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_MakeStruct_SBZButtonControlsReference) == 0x0000D0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_Button_3) == 0x0000F8, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x000100, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_Button_2) == 0x000108, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000110, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_Button_7) == 0x000118, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_IsValid_ReturnValue) == 0x000120, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetUIManager_ReturnValue_1) == 0x000128, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000130, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_MakeLiteralName_ReturnValue_2) == 0x000138, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CreateDelegate_OutputDelegate_1) == 0x000144, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_Button_5) == 0x000158, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_Button_6) == 0x000160, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetUIManager_ReturnValue_2) == 0x000168, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_MakeLiteralName_ReturnValue_3) == 0x000170, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_Button_1) == 0x000180, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetUIManager_ReturnValue_3) == 0x000188, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_MakeLiteralName_ReturnValue_4) == 0x000190, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_MakeLiteralName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_Button) == 0x0001A0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_ComponentBoundEvent_bIsEnabled) == 0x0001A8, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_PlayAnimation_ReturnValue) == 0x0001B0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetSBZOnline_ReturnValue) == 0x0001B8, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetSBZOnline_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001C0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetUIManager_ReturnValue_4) == 0x0001D8, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetUIManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CreateDelegate_OutputDelegate_3) == 0x0001E0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetGameEventBroker_ReturnValue) == 0x0001F8, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetGameEventBroker_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CreateDelegate_OutputDelegate_4) == 0x000200, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CustomEvent_Privilege) == 0x000214, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CustomEvent_Privilege' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CustomEvent_bPrivilegeAllowed) == 0x000215, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CustomEvent_bPrivilegeAllowed' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CustomEvent_bIsGameInstallPending) == 0x000216, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CustomEvent_bIsGameInstallPending' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetPartyManager_ReturnValue) == 0x000218, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetPartyManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CreateDelegate_OutputDelegate_5) == 0x000220, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CustomEvent_PlayerId) == 0x000238, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CustomEvent_PlayerId' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_Play2DSound_ReturnValue) == 0x000248, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetUIManager_ReturnValue_5) == 0x000250, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetUIManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetUIManager_ReturnValue_6) == 0x000258, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetUIManager_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetMenuWidget_ReturnValue) == 0x000260, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetMenuWidget_ReturnValue_1) == 0x000268, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetMenuWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_DynamicCast_AsWBP_UI_SM_Game_Start) == 0x000270, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_DynamicCast_AsWBP_UI_SM_Game_Start' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_DynamicCast_bSuccess) == 0x000278, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_DynamicCast_AsWBP_UI_SM_Game_Start_1) == 0x000280, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_DynamicCast_AsWBP_UI_SM_Game_Start_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_DynamicCast_bSuccess_1) == 0x000288, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetUIManager_ReturnValue_7) == 0x000290, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetUIManager_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetUIManager_ReturnValue_8) == 0x000298, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetUIManager_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetMenuWidget_ReturnValue_2) == 0x0002A0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetMenuWidget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetMenuWidget_ReturnValue_3) == 0x0002A8, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetMenuWidget_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_DynamicCast_AsWBP_UI_SM_Game_Start_2) == 0x0002B0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_DynamicCast_AsWBP_UI_SM_Game_Start_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_DynamicCast_bSuccess_2) == 0x0002B8, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_DynamicCast_AsWBP_UI_SM_Game_Start_3) == 0x0002C0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_DynamicCast_AsWBP_UI_SM_Game_Start_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_DynamicCast_bSuccess_3) == 0x0002C8, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002CC, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options, CallFunc_GetGameStateMachine_ReturnValue) == 0x0002E0, "Member 'WBP_UI_ModeSelect_Options_C_ExecuteUbergraph_WBP_UI_ModeSelect_Options::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.OnPlayerPartyChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_OnPlayerPartyChanged final
{
public:
	class FString                                 PlayerId;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_OnPlayerPartyChanged) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_OnPlayerPartyChanged");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_OnPlayerPartyChanged) == 0x000010, "Wrong size on WBP_UI_ModeSelect_Options_C_OnPlayerPartyChanged");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_OnPlayerPartyChanged, PlayerId) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_OnPlayerPartyChanged::PlayerId' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.OnInstallStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_OnInstallStateChanged final
{
public:
	bool                                          bIsGameInstallPending;                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_OnInstallStateChanged) == 0x000001, "Wrong alignment on WBP_UI_ModeSelect_Options_C_OnInstallStateChanged");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_OnInstallStateChanged) == 0x000001, "Wrong size on WBP_UI_ModeSelect_Options_C_OnInstallStateChanged");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_OnInstallStateChanged, bIsGameInstallPending) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_OnInstallStateChanged::bIsGameInstallPending' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.OnPrivilegeChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_OnPrivilegeChanged final
{
public:
	ESBZUserPrivilegesProxy                       Privilege;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPrivilegeAllowed;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_OnPrivilegeChanged) == 0x000001, "Wrong alignment on WBP_UI_ModeSelect_Options_C_OnPrivilegeChanged");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_OnPrivilegeChanged) == 0x000002, "Wrong size on WBP_UI_ModeSelect_Options_C_OnPrivilegeChanged");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_OnPrivilegeChanged, Privilege) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_OnPrivilegeChanged::Privilege' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_OnPrivilegeChanged, bPrivilegeAllowed) == 0x000001, "Member 'WBP_UI_ModeSelect_Options_C_OnPrivilegeChanged::bPrivilegeAllowed' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_ModeSelect_Options_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_ModeSelect_Options_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_ModeSelect_Options_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_2_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_2_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_2_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_2_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_2_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_2_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_2_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_2_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_1_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_1_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_1_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_1_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_1_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_1_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_1_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_1_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.OnControlRefPressed
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_OnControlRefPressed final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0018(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_OnControlRefPressed) == 0x000008, "Wrong alignment on WBP_UI_ModeSelect_Options_C_OnControlRefPressed");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_OnControlRefPressed) == 0x000028, "Wrong size on WBP_UI_ModeSelect_Options_C_OnControlRefPressed");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_OnControlRefPressed, ActionName) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_OnControlRefPressed::ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_OnControlRefPressed, K2Node_SwitchName_CmpSuccess) == 0x00000C, "Member 'WBP_UI_ModeSelect_Options_C_OnControlRefPressed::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_OnControlRefPressed, CallFunc_GetUIManager_ReturnValue) == 0x000010, "Member 'WBP_UI_ModeSelect_Options_C_OnControlRefPressed::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_OnControlRefPressed, CallFunc_PopStack_ReturnValue) == 0x000018, "Member 'WBP_UI_ModeSelect_Options_C_OnControlRefPressed::CallFunc_PopStack_ReturnValue' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.ShowHideAdditionalInfo
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo final
{
public:
	bool                                          ForceHide;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo) == 0x000001, "Wrong alignment on WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo");
static_assert(sizeof(WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo) == 0x000004, "Wrong size on WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo, ForceHide) == 0x000000, "Member 'WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo::ForceHide' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo, CallFunc_GetVisibility_ReturnValue) == 0x000001, "Member 'WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000002, "Member 'WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo, CallFunc_BooleanOR_ReturnValue) == 0x000003, "Member 'WBP_UI_ModeSelect_Options_C_ShowHideAdditionalInfo::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C.ResetButtonsVisuals
// 0x0040 (0x0040 - 0x0000)
struct WBP_UI_ModeSelect_Options_C_ResetButtonsVisuals final
{
public:
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin_1;                        // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_1;    // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_2;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue_3;    // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
