#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_AbilityActionInput

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_HUD_AbilityActionInput.WBP_UI_HUD_AbilityActionInput_C.ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput
// 0x001C (0x001C - 0x0000)
struct WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetGlobalColor_ReturnValue;               // 0x0004(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInCanActivate;                       // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput) == 0x000004, "Wrong alignment on WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput");
static_assert(sizeof(WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput) == 0x00001C, "Wrong size on WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput");
static_assert(offsetof(WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput, EntryPoint) == 0x000000, "Member 'WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput, CallFunc_GetGlobalColor_ReturnValue) == 0x000004, "Member 'WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput::CallFunc_GetGlobalColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput, K2Node_Event_bInCanActivate) == 0x000014, "Member 'WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput::K2Node_Event_bInCanActivate' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'WBP_UI_HUD_AbilityActionInput_C_ExecuteUbergraph_WBP_UI_HUD_AbilityActionInput::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_AbilityActionInput.WBP_UI_HUD_AbilityActionInput_C.OnActivateAbilityStateChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_HUD_AbilityActionInput_C_OnActivateAbilityStateChanged final
{
public:
	bool                                          bInCanActivate;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_AbilityActionInput_C_OnActivateAbilityStateChanged) == 0x000001, "Wrong alignment on WBP_UI_HUD_AbilityActionInput_C_OnActivateAbilityStateChanged");
static_assert(sizeof(WBP_UI_HUD_AbilityActionInput_C_OnActivateAbilityStateChanged) == 0x000001, "Wrong size on WBP_UI_HUD_AbilityActionInput_C_OnActivateAbilityStateChanged");
static_assert(offsetof(WBP_UI_HUD_AbilityActionInput_C_OnActivateAbilityStateChanged, bInCanActivate) == 0x000000, "Member 'WBP_UI_HUD_AbilityActionInput_C_OnActivateAbilityStateChanged::bInCanActivate' has a wrong offset!");

}

