#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Social_ContextButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Social_ContextButton.WBP_UI_Social_ContextButton_C
// 0x0088 (0x03E8 - 0x0360)
class UWBP_UI_Social_ContextButton_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ButtonColor;                                       // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonOutline;                                     // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_ButtonText;                                   // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ButtonText;                                        // 0x0380(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           DefaultButton;                                     // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           SelectedText;                                      // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              ContextButtonSelected;                             // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           SelectedButton;                                    // 0x03C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultText;                                       // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Social_ContextButton(int32 EntryPoint);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonSelected();
	void PreConstruct(bool IsDesignTime);
	void OnGainFocus(bool isFocused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Social_ContextButton_C">();
	}
	static class UWBP_UI_Social_ContextButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Social_ContextButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Social_ContextButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Social_ContextButton_C");
static_assert(sizeof(UWBP_UI_Social_ContextButton_C) == 0x0003E8, "Wrong size on UWBP_UI_Social_ContextButton_C");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_Social_ContextButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, ButtonColor) == 0x000368, "Member 'UWBP_UI_Social_ContextButton_C::ButtonColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, ButtonOutline) == 0x000370, "Member 'UWBP_UI_Social_ContextButton_C::ButtonOutline' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, Text_ButtonText) == 0x000378, "Member 'UWBP_UI_Social_ContextButton_C::Text_ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, ButtonText) == 0x000380, "Member 'UWBP_UI_Social_ContextButton_C::ButtonText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, DefaultButton) == 0x000398, "Member 'UWBP_UI_Social_ContextButton_C::DefaultButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, SelectedText) == 0x0003A8, "Member 'UWBP_UI_Social_ContextButton_C::SelectedText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, ContextButtonSelected) == 0x0003B8, "Member 'UWBP_UI_Social_ContextButton_C::ContextButtonSelected' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, SelectedButton) == 0x0003C8, "Member 'UWBP_UI_Social_ContextButton_C::SelectedButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Social_ContextButton_C, DefaultText) == 0x0003D8, "Member 'UWBP_UI_Social_ContextButton_C::DefaultText' has a wrong offset!");

}

