#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_Credits

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_MainMenu_Credits.WBP_UI_MainMenu_Credits_C.ExecuteUbergraph_WBP_UI_MainMenu_Credits
// 0x0108 (0x0108 - 0x0000)
struct WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0018(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InActionInput;                  // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0034(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0058(0x0030)()
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue_1;   // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0090(0x0030)()
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x00C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x00E0(0x0028)()
};
static_assert(alignof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits) == 0x000008, "Wrong alignment on WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits");
static_assert(sizeof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits) == 0x000108, "Wrong size on WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, EntryPoint) == 0x000000, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000008, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, CallFunc_GetUIManager_ReturnValue) == 0x000010, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, CallFunc_PopStack_ReturnValue) == 0x000018, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, K2Node_CustomEvent_InActionInput) == 0x000024, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::K2Node_CustomEvent_InActionInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, K2Node_SwitchName_CmpSuccess) == 0x000030, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, K2Node_Event_PreviousValue) == 0x000034, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, K2Node_MakeStruct_SBZButtonControlReference) == 0x000058, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, CallFunc_GetMainMenuCameraManager_ReturnValue_1) == 0x000088, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::CallFunc_GetMainMenuCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000090, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, CallFunc_MakeLiteralName_ReturnValue) == 0x0000C0, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits, K2Node_MakeStruct_SBZButtonControlsReference) == 0x0000E0, "Member 'WBP_UI_MainMenu_Credits_C_ExecuteUbergraph_WBP_UI_MainMenu_Credits::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");

// Function WBP_UI_MainMenu_Credits.WBP_UI_MainMenu_Credits_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_MainMenu_Credits_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_Credits_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_MainMenu_Credits_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_MainMenu_Credits_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_MainMenu_Credits_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_MainMenu_Credits_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_MainMenu_Credits.WBP_UI_MainMenu_Credits_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_MainMenu_Credits_C_OnControlsReferenceClicked final
{
public:
	class FName                                   InActionInput;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_MainMenu_Credits_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_MainMenu_Credits_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_MainMenu_Credits_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_MainMenu_Credits_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_MainMenu_Credits_C_OnControlsReferenceClicked, InActionInput) == 0x000000, "Member 'WBP_UI_MainMenu_Credits_C_OnControlsReferenceClicked::InActionInput' has a wrong offset!");

}

