#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser_ContractorOptions

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "S_ContractorHeists_structs.hpp"


namespace SDK::Params
{

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions
// 0x0198 (0x0198 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PopulateOwnedHeistMap_FoundHeists;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_HeistTitle_1;                   // 0x0018(0x0018)()
	bool                                          K2Node_CustomEvent_IsHeistActive_1;                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_HeistTitle;                     // 0x0038(0x0018)()
	bool                                          K2Node_CustomEvent_IsHeistActive;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class FText HeistTitle, bool IsHeistActive)> K2Node_CreateDelegate_OutputDelegate; // 0x0068(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0080(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_YesNo_LineItem_MenuButton_C*       K2Node_DynamicCast_AsWBP_Yes_No_Line_Item_Menu_Button; // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_NewIndex_2;             // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetButtonName_ButtonName;                 // 0x00D0(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_StriStri_ReturnValue;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetButtonName_ButtonName_1;               // 0x0110(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex_1;             // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZServerBrowserHeistLevel>    CallFunc_GetHeistDataForActiveHeists_ActiveHeistData; // 0x0158(0x0010)(ReferenceParm)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue_1;             // 0x0168(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_HasFocusedDescendants_ReturnValue;        // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x7];                                      // 0x0179(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item_1;                         // 0x0180(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_YesNo_LineItem_MenuButton_C*       K2Node_DynamicCast_AsWBP_Yes_No_Line_Item_Menu_Button_1; // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue_1;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions) == 0x000008, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions) == 0x000198, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, EntryPoint) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_PopulateOwnedHeistMap_FoundHeists) == 0x000010, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_PopulateOwnedHeistMap_FoundHeists' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_CustomEvent_HeistTitle_1) == 0x000018, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_CustomEvent_HeistTitle_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_CustomEvent_IsHeistActive_1) == 0x000030, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_CustomEvent_IsHeistActive_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_CustomEvent_HeistTitle) == 0x000038, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_CustomEvent_HeistTitle' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_CustomEvent_IsHeistActive) == 0x000050, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_CustomEvent_IsHeistActive' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_Conv_TextToString_ReturnValue) == 0x000058, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_Event_IsDesignTime) == 0x00007C, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_GetAllChildren_ReturnValue) == 0x000080, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_DynamicCast_AsWBP_Yes_No_Line_Item_Menu_Button) == 0x0000A0, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_DynamicCast_AsWBP_Yes_No_Line_Item_Menu_Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_Less_IntInt_ReturnValue) == 0x0000A9, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_GetDisplayName_ReturnValue) == 0x0000B0, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_IsVisible_ReturnValue) == 0x0000C0, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_ComponentBoundEvent_NewIndex_2) == 0x0000C4, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_ComponentBoundEvent_NewIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_ComponentBoundEvent_Button) == 0x0000C8, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_GetButtonName_ButtonName) == 0x0000D0, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_GetButtonName_ButtonName' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000E8, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_GetDisplayName_ReturnValue_1) == 0x0000F8, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_NotEqual_StriStri_ReturnValue) == 0x000108, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_NotEqual_StriStri_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_GetButtonName_ButtonName_1) == 0x000110, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_GetButtonName_ButtonName_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_BooleanAND_ReturnValue) == 0x000128, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000130, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_ComponentBoundEvent_NewIndex_1) == 0x000140, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_ComponentBoundEvent_NewIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000148, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_ComponentBoundEvent_NewIndex) == 0x000150, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_GetHeistDataForActiveHeists_ActiveHeistData) == 0x000158, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_GetHeistDataForActiveHeists_ActiveHeistData' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_GetAllChildren_ReturnValue_1) == 0x000168, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_GetAllChildren_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_HasFocusedDescendants_ReturnValue) == 0x000178, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_HasFocusedDescendants_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_Array_Get_Item_1) == 0x000180, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_DynamicCast_AsWBP_Yes_No_Line_Item_Menu_Button_1) == 0x000188, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_DynamicCast_AsWBP_Yes_No_Line_Item_Menu_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, K2Node_DynamicCast_bSuccess_1) == 0x000190, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions, CallFunc_IsVisible_ReturnValue_1) == 0x000191, "Member 'WBP_ServerBrowser_ContractorOptions_C_ExecuteUbergraph_WBP_ServerBrowser_ContractorOptions::CallFunc_IsVisible_ReturnValue_1' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.BndEvt__WBP_ServerBrowser_ContractorOptions_TacticFilter_K2Node_ComponentBoundEvent_3_SBZOnSelectorOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_TacticFilter_K2Node_ComponentBoundEvent_3_SBZOnSelectorOptionChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_TacticFilter_K2Node_ComponentBoundEvent_3_SBZOnSelectorOptionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_TacticFilter_K2Node_ComponentBoundEvent_3_SBZOnSelectorOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_TacticFilter_K2Node_ComponentBoundEvent_3_SBZOnSelectorOptionChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_TacticFilter_K2Node_ComponentBoundEvent_3_SBZOnSelectorOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_TacticFilter_K2Node_ComponentBoundEvent_3_SBZOnSelectorOptionChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_TacticFilter_K2Node_ComponentBoundEvent_3_SBZOnSelectorOptionChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.BndEvt__WBP_ServerBrowser_ContractorOptions_DifficultyFilter_K2Node_ComponentBoundEvent_0_SBZOnSelectorOptionChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_DifficultyFilter_K2Node_ComponentBoundEvent_0_SBZOnSelectorOptionChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_DifficultyFilter_K2Node_ComponentBoundEvent_0_SBZOnSelectorOptionChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_DifficultyFilter_K2Node_ComponentBoundEvent_0_SBZOnSelectorOptionChanged__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_DifficultyFilter_K2Node_ComponentBoundEvent_0_SBZOnSelectorOptionChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_DifficultyFilter_K2Node_ComponentBoundEvent_0_SBZOnSelectorOptionChanged__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_DifficultyFilter_K2Node_ComponentBoundEvent_0_SBZOnSelectorOptionChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_DifficultyFilter_K2Node_ComponentBoundEvent_0_SBZOnSelectorOptionChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_InspectButton_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_InspectButton_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_InspectButton_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_InspectButton_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_InspectButton_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_InspectButton_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_InspectButton_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_InspectButton_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_Navbar_K2Node_ComponentBoundEvent_1_OnIndexChanged__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_Navbar_K2Node_ComponentBoundEvent_1_OnIndexChanged__DelegateSignature final
{
public:
	int32                                         NewIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_Navbar_K2Node_ComponentBoundEvent_1_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_Navbar_K2Node_ComponentBoundEvent_1_OnIndexChanged__DelegateSignature");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_Navbar_K2Node_ComponentBoundEvent_1_OnIndexChanged__DelegateSignature) == 0x000004, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_Navbar_K2Node_ComponentBoundEvent_1_OnIndexChanged__DelegateSignature");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_Navbar_K2Node_ComponentBoundEvent_1_OnIndexChanged__DelegateSignature, NewIndex) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_BndEvt__WBP_ServerBrowser_ContractorOptions_WBP_ServerBrowser_Navbar_K2Node_ComponentBoundEvent_1_OnIndexChanged__DelegateSignature::NewIndex' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_PreConstruct");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_PreConstruct) == 0x000001, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_PreConstruct");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.AllHeistsUpdated
// 0x0020 (0x0020 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_AllHeistsUpdated final
{
public:
	class FText                                   HeistTitle;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsHeistActive;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_AllHeistsUpdated) == 0x000008, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_AllHeistsUpdated");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_AllHeistsUpdated) == 0x000020, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_AllHeistsUpdated");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AllHeistsUpdated, HeistTitle) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_AllHeistsUpdated::HeistTitle' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AllHeistsUpdated, IsHeistActive) == 0x000018, "Member 'WBP_ServerBrowser_ContractorOptions_C_AllHeistsUpdated::IsHeistActive' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.HeistLineItemUpdated
// 0x0020 (0x0020 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_HeistLineItemUpdated final
{
public:
	class FText                                   HeistTitle;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsHeistActive;                                     // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_HeistLineItemUpdated) == 0x000008, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_HeistLineItemUpdated");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_HeistLineItemUpdated) == 0x000020, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_HeistLineItemUpdated");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_HeistLineItemUpdated, HeistTitle) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_HeistLineItemUpdated::HeistTitle' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_HeistLineItemUpdated, IsHeistActive) == 0x000018, "Member 'WBP_ServerBrowser_ContractorOptions_C_HeistLineItemUpdated::IsHeistActive' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.PopulateOwnedHeistMap
// 0x0188 (0x0188 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap final
{
public:
	bool                                          FoundHeists;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPD3HeistDataAsset*>             TempLocalArray;                                    // 0x0008(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ContractorHeists                    K2Node_MakeStruct_S_ContractorHeists;              // 0x0030(0x0010)(HasGetValueTypeHash)
	TArray<struct FSBZHeistDataLevelPair>         CallFunc_GetAllHeistData_ReturnValue;              // 0x0040(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZHeistDataLevelPair                 CallFunc_Array_Get_Item;                           // 0x0058(0x0028)()
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckOwnedHeists_Found;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZServerBrowserHeistLevel            CallFunc_CheckOwnedHeists_HeistData;               // 0x00B0(0x00B8)()
	struct FS_ContractorHeists                    CallFunc_Map_Find_Value;                           // 0x0168(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap) == 0x000008, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap) == 0x000188, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, FoundHeists) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::FoundHeists' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, TempLocalArray) == 0x000008, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::TempLocalArray' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, Temp_int_Loop_Counter_Variable) == 0x00001C, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Map_Length_ReturnValue) == 0x000024, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Greater_IntInt_ReturnValue) == 0x000028, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, K2Node_MakeStruct_S_ContractorHeists) == 0x000030, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::K2Node_MakeStruct_S_ContractorHeists' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_GetAllHeistData_ReturnValue) == 0x000040, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_GetAllHeistData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Array_Length_ReturnValue) == 0x000050, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Array_AddUnique_ReturnValue) == 0x000084, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Conv_TextToString_ReturnValue) == 0x000088, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000098, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_CheckOwnedHeists_Found) == 0x0000A8, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_CheckOwnedHeists_Found' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_CheckOwnedHeists_HeistData) == 0x0000B0, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_CheckOwnedHeists_HeistData' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Map_Find_Value) == 0x000168, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Map_Find_ReturnValue) == 0x000178, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Len_ReturnValue) == 0x00017C, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000180, "Member 'WBP_ServerBrowser_ContractorOptions_C_PopulateOwnedHeistMap::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.AddDataToSelector
// 0x00E8 (0x00E8 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector final
{
public:
	TArray<class FText>                           LocalNavigationButtonNames;                        // 0x0000(0x0010)(Edit, BlueprintVisible)
	TMap<class FString, TSoftObjectPtr<class UPaperSprite>> LocalContractorIconMap;                  // 0x0010(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0078(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_ContractorHeists                    CallFunc_Map_Find_Value;                           // 0x00C8(0x0010)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPD3HeistDataAsset*                     CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector) == 0x000008, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector) == 0x0000E8, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, LocalNavigationButtonNames) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::LocalNavigationButtonNames' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, LocalContractorIconMap) == 0x000010, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::LocalContractorIconMap' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, Temp_int_Array_Index_Variable) == 0x000060, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, Temp_int_Loop_Counter_Variable) == 0x000064, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000070, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Map_Keys_Keys) == 0x000078, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Array_Length_ReturnValue) == 0x000088, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Array_Get_Item) == 0x000090, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Conv_StringToText_ReturnValue) == 0x0000A8, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Array_AddUnique_ReturnValue) == 0x0000C0, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Map_Find_Value) == 0x0000C8, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Map_Find_ReturnValue) == 0x0000D8, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector, CallFunc_Array_Get_Item_1) == 0x0000E0, "Member 'WBP_ServerBrowser_ContractorOptions_C_AddDataToSelector::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.SetOwnedHeists
// 0x0018 (0x0018 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_SetOwnedHeists final
{
public:
	TArray<struct FSBZServerBrowserHeistCollection> InOwnedHeists;                                   // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          LocalFoundInOwned;                                 // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_SetOwnedHeists) == 0x000008, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_SetOwnedHeists");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_SetOwnedHeists) == 0x000018, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_SetOwnedHeists");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_SetOwnedHeists, InOwnedHeists) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_SetOwnedHeists::InOwnedHeists' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_SetOwnedHeists, LocalFoundInOwned) == 0x000010, "Member 'WBP_ServerBrowser_ContractorOptions_C_SetOwnedHeists::LocalFoundInOwned' has a wrong offset!");

// Function WBP_ServerBrowser_ContractorOptions.WBP_ServerBrowser_ContractorOptions_C.CheckOwnedHeists
// 0x01F8 (0x01F8 - 0x0000)
struct WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists final
{
public:
	class FString                                 InHeistToFind;                                     // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZServerBrowserHeistLevel            HeistData;                                         // 0x0018(0x00B8)(Parm, OutParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZServerBrowserHeistCollection       CallFunc_Array_Get_Item;                           // 0x00E8(0x0030)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZServerBrowserHeistLevel            CallFunc_Array_Get_Item_1;                         // 0x0120(0x00B8)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x01E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F2[0x2];                                      // 0x01F2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists) == 0x000008, "Wrong alignment on WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists");
static_assert(sizeof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists) == 0x0001F8, "Wrong size on WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, InHeistToFind) == 0x000000, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::InHeistToFind' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, Found) == 0x000010, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::Found' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, HeistData) == 0x000018, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::HeistData' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, Temp_int_Loop_Counter_Variable) == 0x0000D0, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, CallFunc_Add_IntInt_ReturnValue) == 0x0000D4, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, Temp_int_Array_Index_Variable) == 0x0000D8, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, Temp_int_Array_Index_Variable_1) == 0x0000DC, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, Temp_int_Loop_Counter_Variable_1) == 0x0000E0, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, CallFunc_Array_Get_Item) == 0x0000E8, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, CallFunc_Less_IntInt_ReturnValue) == 0x00011C, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, CallFunc_Array_Get_Item_1) == 0x000120, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists, CallFunc_Array_Length_ReturnValue_1) == 0x0001D8, "Member 'WBP_ServerBrowser_ContractorOptions_C_CheckOwnedHeists::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
