#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SM_JobOverview

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.ExecuteUbergraph_WBP_UI_SM_JobOverview
// 0x0238 (0x0238 - 0x0000)
struct WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EBlackScreenTransitionType BlackScreenTransitionType)> K2Node_CreateDelegate_OutputDelegate; // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	EBlackScreenTransitionType                    K2Node_CustomEvent_BlackScreenTransitionType;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_ReadyTimeoutTime;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 ReadyTimeoutTime)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0014)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FSBZUIStackChangedEvent& StackEvent)> K2Node_CreateDelegate_OutputDelegate_2; // 0x00A8(0x0014)(ZeroConstructor, NoDestructor)
	struct FSBZUIStackChangedEvent                K2Node_CustomEvent_StackEvent;                     // 0x00BC(0x001C)(NoDestructor)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTableEntrySourceString_ReturnValue;    // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0100(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10C[0x4];                                      // 0x010C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetTableEntrySourceString_ReturnValue_1;  // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0120(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaTexture*                      K2Node_DynamicCast_AsBink_Media_Texture;           // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Play_ReturnValue;                         // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14A[0x6];                                      // 0x014A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenUrl_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Rewind_ReturnValue;                       // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_162[0x6];                                      // 0x0162(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZGameStateMachine*                   CallFunc_GetGameStateMachine_ReturnValue_2;        // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0174(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_ActionName_1;                   // 0x0188(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsStandalone_ReturnValue_1;               // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0196(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0197(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandalone_ReturnValue_2;               // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x019B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBinkMediaTexture*                      K2Node_DynamicCast_AsBink_Media_Texture_1;         // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x3];                                      // 0x01A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x01AC(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1CD[0x3];                                      // 0x01CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetMapName_ReturnValue;                   // 0x01D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPD3HeistDataAsset*                     CallFunc_GetHeistDataFromLevelShortName_ReturnValue; // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x01E8(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerState*                        K2Node_Event_PlayerState_1;                        // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerState*                        K2Node_Event_PlayerState;                          // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0218(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bIsStarted;                           // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview) == 0x000008, "Wrong alignment on WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview) == 0x000238, "Wrong size on WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, EntryPoint) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetGameStateMachine_ReturnValue) == 0x000008, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetGameStateMachine_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_PlayAnimationForward_ReturnValue) == 0x000010, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CreateDelegate_OutputDelegate) == 0x000018, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CustomEvent_BlackScreenTransitionType) == 0x00002C, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CustomEvent_BlackScreenTransitionType' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CustomEvent_ReadyTimeoutTime) == 0x000030, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CustomEvent_ReadyTimeoutTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000048, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetGameStateMachine_ReturnValue_1) == 0x000050, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetGameStateMachine_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_Event_MyGeometry) == 0x000058, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_Event_InDeltaTime) == 0x000090, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000094, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000098, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetUIManager_ReturnValue) == 0x0000A0, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000A8, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CustomEvent_StackEvent) == 0x0000BC, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CustomEvent_StackEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetLocalPlayerController_ReturnValue) == 0x0000D8, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_ComponentBoundEvent_Button) == 0x0000E0, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetVisibility_ReturnValue) == 0x0000E8, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000E9, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetTableEntrySourceString_ReturnValue) == 0x0000F0, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetTableEntrySourceString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_Conv_StringToName_ReturnValue) == 0x000100, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetTableEntrySourceString_ReturnValue_1) == 0x000110, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetTableEntrySourceString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_MakeLiteralName_ReturnValue) == 0x000120, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_Conv_StringToName_ReturnValue_1) == 0x00012C, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000138, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_DynamicCast_AsBink_Media_Texture) == 0x000140, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_DynamicCast_AsBink_Media_Texture' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_DynamicCast_bSuccess) == 0x000148, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_Play_ReturnValue) == 0x000149, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_Concat_StrStr_ReturnValue) == 0x000150, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_OpenUrl_ReturnValue) == 0x000160, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_OpenUrl_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_Rewind_ReturnValue) == 0x000161, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_Rewind_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetGameStateMachine_ReturnValue_2) == 0x000168, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetGameStateMachine_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsStandalone_ReturnValue) == 0x000170, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CreateDelegate_OutputDelegate_3) == 0x000174, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CustomEvent_ActionName_1) == 0x000188, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CustomEvent_ActionName_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsStandalone_ReturnValue_1) == 0x000194, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsStandalone_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsValid_ReturnValue) == 0x000195, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsValid_ReturnValue_1) == 0x000196, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsEmpty_ReturnValue) == 0x000197, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_Not_PreBool_ReturnValue) == 0x000198, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_BooleanAND_ReturnValue) == 0x000199, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsStandalone_ReturnValue_2) == 0x00019A, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsStandalone_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsEmpty_ReturnValue_1) == 0x00019B, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsValid_ReturnValue_2) == 0x00019C, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_DynamicCast_AsBink_Media_Texture_1) == 0x0001A0, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_DynamicCast_AsBink_Media_Texture_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_DynamicCast_bSuccess_1) == 0x0001A8, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CreateDelegate_OutputDelegate_4) == 0x0001AC, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CustomEvent_ActionName) == 0x0001C0, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsValid_ReturnValue_3) == 0x0001CC, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetMapName_ReturnValue) == 0x0001D0, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetMapName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_GetHeistDataFromLevelShortName_ReturnValue) == 0x0001E0, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_GetHeistDataFromLevelShortName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CreateDelegate_OutputDelegate_5) == 0x0001E8, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsValid_ReturnValue_4) == 0x0001FC, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_Play2DSound_ReturnValue) == 0x000200, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_Event_PlayerState_1) == 0x000208, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_Event_PlayerState_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_Event_PlayerState) == 0x000210, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_Event_PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_CreateDelegate_OutputDelegate_6) == 0x000218, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, K2Node_Event_bIsStarted) == 0x00022C, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::K2Node_Event_bIsStarted' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_IsVisible_ReturnValue) == 0x00022D, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000230, "Member 'WBP_UI_SM_JobOverview_C_ExecuteUbergraph_WBP_UI_SM_JobOverview::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.BP_OnIntroSequenceChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_SM_JobOverview_C_BP_OnIntroSequenceChanged final
{
public:
	bool                                          bIsStarted;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_BP_OnIntroSequenceChanged) == 0x000001, "Wrong alignment on WBP_UI_SM_JobOverview_C_BP_OnIntroSequenceChanged");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_BP_OnIntroSequenceChanged) == 0x000001, "Wrong size on WBP_UI_SM_JobOverview_C_BP_OnIntroSequenceChanged");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_BP_OnIntroSequenceChanged, bIsStarted) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_BP_OnIntroSequenceChanged::bIsStarted' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.BP_OnPlayerStateCountChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_JobOverview_C_BP_OnPlayerStateCountChanged final
{
public:
	class ASBZPlayerState*                        PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_BP_OnPlayerStateCountChanged) == 0x000008, "Wrong alignment on WBP_UI_SM_JobOverview_C_BP_OnPlayerStateCountChanged");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_BP_OnPlayerStateCountChanged) == 0x000008, "Wrong size on WBP_UI_SM_JobOverview_C_BP_OnPlayerStateCountChanged");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_BP_OnPlayerStateCountChanged, PlayerState) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_BP_OnPlayerStateCountChanged::PlayerState' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.BP_OnPlayerStateSkipIntroSequenceChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_JobOverview_C_BP_OnPlayerStateSkipIntroSequenceChanged final
{
public:
	class ASBZPlayerState*                        PlayerState;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_BP_OnPlayerStateSkipIntroSequenceChanged) == 0x000008, "Wrong alignment on WBP_UI_SM_JobOverview_C_BP_OnPlayerStateSkipIntroSequenceChanged");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_BP_OnPlayerStateSkipIntroSequenceChanged) == 0x000008, "Wrong size on WBP_UI_SM_JobOverview_C_BP_OnPlayerStateSkipIntroSequenceChanged");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_BP_OnPlayerStateSkipIntroSequenceChanged, PlayerState) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_BP_OnPlayerStateSkipIntroSequenceChanged::PlayerState' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.Dummy
// 0x000C (0x000C - 0x0000)
struct WBP_UI_SM_JobOverview_C_Dummy final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_Dummy) == 0x000004, "Wrong alignment on WBP_UI_SM_JobOverview_C_Dummy");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_Dummy) == 0x00000C, "Wrong size on WBP_UI_SM_JobOverview_C_Dummy");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_Dummy, ActionName) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_Dummy::ActionName' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.OnSkipInput
// 0x000C (0x000C - 0x0000)
struct WBP_UI_SM_JobOverview_C_OnSkipInput final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_OnSkipInput) == 0x000004, "Wrong alignment on WBP_UI_SM_JobOverview_C_OnSkipInput");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_OnSkipInput) == 0x00000C, "Wrong size on WBP_UI_SM_JobOverview_C_OnSkipInput");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_OnSkipInput, ActionName) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_OnSkipInput::ActionName' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.BndEvt__WBP_UI_SM_JobOverview_Button_PlayerReady_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SM_JobOverview_C_BndEvt__WBP_UI_SM_JobOverview_Button_PlayerReady_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_BndEvt__WBP_UI_SM_JobOverview_Button_PlayerReady_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_SM_JobOverview_C_BndEvt__WBP_UI_SM_JobOverview_Button_PlayerReady_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_BndEvt__WBP_UI_SM_JobOverview_Button_PlayerReady_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_SM_JobOverview_C_BndEvt__WBP_UI_SM_JobOverview_Button_PlayerReady_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_BndEvt__WBP_UI_SM_JobOverview_Button_PlayerReady_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_BndEvt__WBP_UI_SM_JobOverview_Button_PlayerReady_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.OnStackChanged
// 0x001C (0x001C - 0x0000)
struct WBP_UI_SM_JobOverview_C_OnStackChanged final
{
public:
	struct FSBZUIStackChangedEvent                StackEvent;                                        // 0x0000(0x001C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_OnStackChanged) == 0x000004, "Wrong alignment on WBP_UI_SM_JobOverview_C_OnStackChanged");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_OnStackChanged) == 0x00001C, "Wrong size on WBP_UI_SM_JobOverview_C_OnStackChanged");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_OnStackChanged, StackEvent) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_OnStackChanged::StackEvent' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_UI_SM_JobOverview_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_Tick) == 0x000004, "Wrong alignment on WBP_UI_SM_JobOverview_C_Tick");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_Tick) == 0x00003C, "Wrong size on WBP_UI_SM_JobOverview_C_Tick");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_UI_SM_JobOverview_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.SetPlayerReadyTimeOut
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_SM_JobOverview_C_SetPlayerReadyTimeOut final
{
public:
	int32                                         ReadyTimeoutTime;                                  // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_SetPlayerReadyTimeOut) == 0x000004, "Wrong alignment on WBP_UI_SM_JobOverview_C_SetPlayerReadyTimeOut");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_SetPlayerReadyTimeOut) == 0x000004, "Wrong size on WBP_UI_SM_JobOverview_C_SetPlayerReadyTimeOut");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_SetPlayerReadyTimeOut, ReadyTimeoutTime) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_SetPlayerReadyTimeOut::ReadyTimeoutTime' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.OnJobOverviewComplete
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_SM_JobOverview_C_OnJobOverviewComplete final
{
public:
	EBlackScreenTransitionType                    BlackScreenTransitionType;                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_OnJobOverviewComplete) == 0x000001, "Wrong alignment on WBP_UI_SM_JobOverview_C_OnJobOverviewComplete");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_OnJobOverviewComplete) == 0x000001, "Wrong size on WBP_UI_SM_JobOverview_C_OnJobOverviewComplete");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_OnJobOverviewComplete, BlackScreenTransitionType) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_OnJobOverviewComplete::BlackScreenTransitionType' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.UpdateTimer
// 0x0088 (0x0088 - 0x0000)
struct WBP_UI_SM_JobOverview_C_UpdateTimer final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0028(0x0028)()
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x2];                                       // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_FormatIntToTimerText_ReturnValue;         // 0x0058(0x0018)()
	class FText                                   CallFunc_FormatIntToTimerText_ReturnValue_1;       // 0x0070(0x0018)()
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_UpdateTimer) == 0x000008, "Wrong alignment on WBP_UI_SM_JobOverview_C_UpdateTimer");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_UpdateTimer) == 0x000088, "Wrong size on WBP_UI_SM_JobOverview_C_UpdateTimer");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateTimer, K2Node_MakeStruct_SlateColor) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_UpdateTimer::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateTimer, K2Node_MakeStruct_SlateColor_1) == 0x000028, "Member 'WBP_UI_SM_JobOverview_C_UpdateTimer::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateTimer, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'WBP_UI_SM_JobOverview_C_UpdateTimer::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateTimer, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000051, "Member 'WBP_UI_SM_JobOverview_C_UpdateTimer::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateTimer, CallFunc_FTrunc_ReturnValue) == 0x000054, "Member 'WBP_UI_SM_JobOverview_C_UpdateTimer::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateTimer, CallFunc_FormatIntToTimerText_ReturnValue) == 0x000058, "Member 'WBP_UI_SM_JobOverview_C_UpdateTimer::CallFunc_FormatIntToTimerText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateTimer, CallFunc_FormatIntToTimerText_ReturnValue_1) == 0x000070, "Member 'WBP_UI_SM_JobOverview_C_UpdateTimer::CallFunc_FormatIntToTimerText_ReturnValue_1' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.IsSoloIntroVideo
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_SM_JobOverview_C_IsSoloIntroVideo final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_IsSoloIntroVideo) == 0x000001, "Wrong alignment on WBP_UI_SM_JobOverview_C_IsSoloIntroVideo");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_IsSoloIntroVideo) == 0x000001, "Wrong size on WBP_UI_SM_JobOverview_C_IsSoloIntroVideo");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_IsSoloIntroVideo, ReturnValue) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_IsSoloIntroVideo::ReturnValue' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.UpdateSkipText
// 0x01E0 (0x01E0 - 0x0000)
struct WBP_UI_SM_JobOverview_C_UpdateSkipText final
{
public:
	bool                                          bIsSkip;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SkipCount;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0030(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0070(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_IsSkipIntroSequence_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerState*                           CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x00D0(0x0040)(HasGetValueTypeHash)
	class ASBZPlayerState*                        K2Node_DynamicCast_AsSBZPlayer_State;              // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsSkipIntroSequence_ReturnValue_1;        // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0138(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0150(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0198(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B0(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x01C8(0x0018)()
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_UpdateSkipText) == 0x000008, "Wrong alignment on WBP_UI_SM_JobOverview_C_UpdateSkipText");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_UpdateSkipText) == 0x0001E0, "Wrong size on WBP_UI_SM_JobOverview_C_UpdateSkipText");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, bIsSkip) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::bIsSkip' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, SkipCount) == 0x000004, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::SkipCount' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, Temp_int_Variable) == 0x000008, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, Temp_bool_Variable) == 0x000018, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000020, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, K2Node_MakeStruct_FormatArgumentData) == 0x000030, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, K2Node_MakeStruct_FormatArgumentData_1) == 0x000070, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_IsSkipIntroSequence_ReturnValue) == 0x0000B0, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_IsSkipIntroSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B4, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_GetGameState_ReturnValue) == 0x0000B8, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_Array_Length_ReturnValue) == 0x0000C0, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_Array_Get_Item) == 0x0000C8, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, K2Node_MakeStruct_FormatArgumentData_2) == 0x0000D0, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, K2Node_DynamicCast_AsSBZPlayer_State) == 0x000110, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::K2Node_DynamicCast_AsSBZPlayer_State' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, K2Node_MakeArray_Array) == 0x000120, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_IsSkipIntroSequence_ReturnValue_1) == 0x000130, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_IsSkipIntroSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_Format_ReturnValue) == 0x000138, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, K2Node_MakeStruct_FormatArgumentData_3) == 0x000150, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_Array_Length_ReturnValue_1) == 0x000190, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, K2Node_MakeArray_Array_1) == 0x000198, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_Less_IntInt_ReturnValue) == 0x0001A8, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, CallFunc_Format_ReturnValue_1) == 0x0001B0, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_UpdateSkipText, K2Node_Select_Default) == 0x0001C8, "Member 'WBP_UI_SM_JobOverview_C_UpdateSkipText::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_SM_JobOverview.WBP_UI_SM_JobOverview_C.ToggleSkip
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_SM_JobOverview_C_ToggleSkip final
{
public:
	class ASBZPlayerState*                        PlayerState;                                       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSkipIntroSequence_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_SM_JobOverview_C_ToggleSkip) == 0x000008, "Wrong alignment on WBP_UI_SM_JobOverview_C_ToggleSkip");
static_assert(sizeof(WBP_UI_SM_JobOverview_C_ToggleSkip) == 0x000018, "Wrong size on WBP_UI_SM_JobOverview_C_ToggleSkip");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ToggleSkip, PlayerState) == 0x000000, "Member 'WBP_UI_SM_JobOverview_C_ToggleSkip::PlayerState' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ToggleSkip, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000008, "Member 'WBP_UI_SM_JobOverview_C_ToggleSkip::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_SM_JobOverview_C_ToggleSkip, CallFunc_IsSkipIntroSequence_ReturnValue) == 0x000010, "Member 'WBP_UI_SM_JobOverview_C_ToggleSkip::CallFunc_IsSkipIntroSequence_ReturnValue' has a wrong offset!");
