#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_GoldItemButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_GoldItemButton.WBP_UI_MainMenu_GoldItemButton_C
// 0x00C0 (0x0538 - 0x0478)
class UWBP_UI_MainMenu_GoldItemButton_C final : public USBZBlackMarketStoreItemButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LockedAnimation;                                   // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Purchasing;                                        // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Disabled;                                  // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_DisplayTransaction;                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_ItemName;                                     // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_Timer;                                        // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Locked;                                  // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Timer_Highlight;                                   // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Widget_CurrencyWidget_C*           WBP_Widget_CurrencyWidget;                         // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_Icon;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_Blackmarket_PurchaseCount_C*       Widget_PurchaseCount;                              // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bHasDisplayTextData;                               // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Available_At_Infamy_Level;                         // 0x0534(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_GoldItemButton(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void DisabledButtonSelected();
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void OnTransactionProgressChanged(bool bInIsTransactionInProgress);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void OnPlayerStoreItemDataIntialized();
	void PreConstruct(bool IsDesignTime);
	void OnFocused(bool bIsFocused);
	void OnTransactionInProgress(bool bIsTransactionInProgress);
	void OnHover(bool bIsHovered);
	void SetPrice(int64 Price, ESBZCurrencyCode Currency);
	void InitializeItemData(class USBZInventoryBaseData* InItemData);
	void RefreshVisuals();
	void OnDisabled(bool bIsDisabled_0);
	void SetGoldProgress();
	void SetTimer();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_GoldItemButton_C">();
	}
	static class UWBP_UI_MainMenu_GoldItemButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_GoldItemButton_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_GoldItemButton_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_GoldItemButton_C");
static_assert(sizeof(UWBP_UI_MainMenu_GoldItemButton_C) == 0x000538, "Wrong size on UWBP_UI_MainMenu_GoldItemButton_C");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, UberGraphFrame) == 0x000478, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, HoverAnim) == 0x000480, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, LockedAnimation) == 0x000488, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::LockedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Purchasing) == 0x000490, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Purchasing' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Border_Highlight) == 0x000498, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Image) == 0x0004A0, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Image_1) == 0x0004A8, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Image_2) == 0x0004B0, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Image_3) == 0x0004B8, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Image_4) == 0x0004C0, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Image_5) == 0x0004C8, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Image_6) == 0x0004D0, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Image_511) == 0x0004D8, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Image_Background) == 0x0004E0, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Overlay_Disabled) == 0x0004E8, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Overlay_Disabled' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Text_DisplayTransaction) == 0x0004F0, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Text_DisplayTransaction' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Text_ItemName) == 0x0004F8, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Text_Timer) == 0x000500, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Text_Timer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, TextBlock_Locked) == 0x000508, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::TextBlock_Locked' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Timer_Highlight) == 0x000510, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Timer_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, WBP_Widget_CurrencyWidget) == 0x000518, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::WBP_Widget_CurrencyWidget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Widget_Icon) == 0x000520, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Widget_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Widget_PurchaseCount) == 0x000528, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Widget_PurchaseCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, bHasDisplayTextData) == 0x000530, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::bHasDisplayTextData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_GoldItemButton_C, Available_At_Infamy_Level) == 0x000534, "Member 'UWBP_UI_MainMenu_GoldItemButton_C::Available_At_Infamy_Level' has a wrong offset!");

}

