#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_WeaponModiferScreen

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_WeaponModiferScreen.WBP_UI_WeaponModiferScreen_C.ExecuteUbergraph_WBP_UI_WeaponModiferScreen
// 0x0288 (0x0288 - 0x0000)
struct WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZEquippableLoadoutSlot                     CallFunc_GetWeaponSlotInfo_OutEquippableSlot;      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWeaponSlotInfo_OutWeaponSlotIndex;     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZWeaponInventorySlot                CallFunc_GetWeaponConfigSlot_ReturnValue;          // 0x0018(0x00D8)(ConstParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZRangedWeaponData*                   K2Node_DynamicCast_AsSBZRanged_Weapon_Data;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZWeaponPartSlot*               CallFunc_GetCurrentWeaponPartSlot_ReturnValue;     // 0x0108(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_OutDisplayName;            // 0x0110(0x0018)()
	bool                                          CallFunc_GetDisplayName_OutHasText;                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x012A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12B[0x1];                                      // 0x012B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Step_Size_Variable;                       // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_WeaponPartProgressionButton_C*  CallFunc_Create_ReturnValue;                       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue;      // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZMainMenuWeaponPartProgressionButton* K2Node_Event_NewFocusedButton;              // 0x0148(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZWeaponPartDataAsset*          CallFunc_GetWeaponPart_ReturnValue;                // 0x0150(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZWeaponPartDataAsset*          CallFunc_GetWeaponPart_ReturnValue_1;              // 0x0158(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZWeaponPartSlot*               CallFunc_GetCurrentWeaponPartSlot_ReturnValue_1;   // 0x0168(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_InActionInput;                  // 0x0178(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0184(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_192[0x6];                                      // 0x0192(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZMainMenuWeaponPartProgressionButton* K2Node_Event_SelectedButton;                // 0x0198(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZWeaponPartSlot*               CallFunc_GetCurrentWeaponPartSlot_ReturnValue_2;   // 0x01A8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZMainMenuWeaponPartProgressionButton* K2Node_Event_EquippedButton;                // 0x01B8(0x0008)(ConstParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZEquippableLoadoutSlot                     CallFunc_GetWeaponSlotInfo_OutEquippableSlot_1;    // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C2[0x2];                                      // 0x01C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetWeaponSlotInfo_OutWeaponSlotIndex_1;   // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x01C8(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Index_Variable;                           // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x01D8(0x0018)()
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x3];                                      // 0x01F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FD[0x3];                                      // 0x01FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0200(0x0018)()
	ESBZEquippableLoadoutSlot                     Temp_byte_Variable;                                // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0220(0x0018)()
	bool                                          Temp_bool_Variable;                                // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPopupShowing_ReturnValue;               // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0261(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_262[0x6];                                      // 0x0262(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_Select_Default_1;                           // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_2;                           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen) == 0x000008, "Wrong alignment on WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen");
static_assert(sizeof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen) == 0x000288, "Wrong size on WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, EntryPoint) == 0x000000, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetWeaponSlotInfo_OutEquippableSlot) == 0x000011, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetWeaponSlotInfo_OutEquippableSlot' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetWeaponSlotInfo_OutWeaponSlotIndex) == 0x000014, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetWeaponSlotInfo_OutWeaponSlotIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetWeaponConfigSlot_ReturnValue) == 0x000018, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetWeaponConfigSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_Less_IntInt_ReturnValue) == 0x0000F0, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_DynamicCast_AsSBZRanged_Weapon_Data) == 0x0000F8, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_DynamicCast_AsSBZRanged_Weapon_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetCurrentWeaponPartSlot_ReturnValue) == 0x000108, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetCurrentWeaponPartSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetDisplayName_OutDisplayName) == 0x000110, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetDisplayName_OutDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetDisplayName_OutHasText) == 0x000128, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetDisplayName_OutHasText' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_Event_IsDesignTime) == 0x000129, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_IsValid_ReturnValue_1) == 0x00012A, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_Abs_Int_ReturnValue) == 0x00012C, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_Max_ReturnValue) == 0x000130, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, Temp_int_Step_Size_Variable) == 0x000134, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::Temp_int_Step_Size_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_Create_ReturnValue) == 0x000138, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetCustomizationManager_ReturnValue) == 0x000140, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_Event_NewFocusedButton) == 0x000148, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_Event_NewFocusedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetWeaponPart_ReturnValue) == 0x000150, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetWeaponPart_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetWeaponPart_ReturnValue_1) == 0x000158, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetWeaponPart_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_IsValid_ReturnValue_2) == 0x000160, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetCurrentWeaponPartSlot_ReturnValue_1) == 0x000168, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetCurrentWeaponPartSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetUIManager_ReturnValue) == 0x000170, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_CustomEvent_InActionInput) == 0x000178, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_CustomEvent_InActionInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_PopStack_ReturnValue) == 0x000184, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_SwitchName_CmpSuccess) == 0x000190, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_IsValid_ReturnValue_3) == 0x000191, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_Event_SelectedButton) == 0x000198, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_Event_SelectedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_IsVisible_ReturnValue) == 0x0001A0, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetCurrentWeaponPartSlot_ReturnValue_2) == 0x0001A8, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetCurrentWeaponPartSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_Not_PreBool_ReturnValue) == 0x0001B0, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_Event_EquippedButton) == 0x0001B8, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_Event_EquippedButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_BooleanAND_ReturnValue) == 0x0001C0, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetWeaponSlotInfo_OutEquippableSlot_1) == 0x0001C1, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetWeaponSlotInfo_OutEquippableSlot_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetWeaponSlotInfo_OutWeaponSlotIndex_1) == 0x0001C4, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetWeaponSlotInfo_OutWeaponSlotIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_Event_PreviousValue) == 0x0001C8, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, Temp_int_Index_Variable) == 0x0001D4, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::Temp_int_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, Temp_text_Variable) == 0x0001D8, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0001F0, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001F4, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_Add_IntInt_ReturnValue) == 0x0001F8, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0001FC, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, Temp_text_Variable_1) == 0x000200, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, Temp_byte_Variable) == 0x000218, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_Select_Default) == 0x000220, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, Temp_bool_Variable) == 0x000238, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetUIManager_ReturnValue_1) == 0x000240, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_IsPopupShowing_ReturnValue) == 0x000248, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_IsPopupShowing_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_AddChild_ReturnValue) == 0x000250, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetChildAt_ReturnValue) == 0x000258, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_IsValid_ReturnValue_4) == 0x000260, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, Temp_bool_Variable_1) == 0x000261, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_Select_Default_1) == 0x000268, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, K2Node_Select_Default_2) == 0x000270, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000278, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000280, "Member 'WBP_UI_WeaponModiferScreen_C_ExecuteUbergraph_WBP_UI_WeaponModiferScreen::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");

// Function WBP_UI_WeaponModiferScreen.WBP_UI_WeaponModiferScreen_C.OnWeaponPartButtonEquipped
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonEquipped final
{
public:
	const class USBZMainMenuWeaponPartProgressionButton* EquippedButton;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonEquipped) == 0x000008, "Wrong alignment on WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonEquipped");
static_assert(sizeof(WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonEquipped) == 0x000008, "Wrong size on WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonEquipped");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonEquipped, EquippedButton) == 0x000000, "Member 'WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonEquipped::EquippedButton' has a wrong offset!");

// Function WBP_UI_WeaponModiferScreen.WBP_UI_WeaponModiferScreen_C.OnWeaponPartButtonSelected
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonSelected final
{
public:
	const class USBZMainMenuWeaponPartProgressionButton* SelectedButton;                             // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonSelected) == 0x000008, "Wrong alignment on WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonSelected");
static_assert(sizeof(WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonSelected) == 0x000008, "Wrong size on WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonSelected");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonSelected, SelectedButton) == 0x000000, "Member 'WBP_UI_WeaponModiferScreen_C_OnWeaponPartButtonSelected::SelectedButton' has a wrong offset!");

// Function WBP_UI_WeaponModiferScreen.WBP_UI_WeaponModiferScreen_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_WeaponModiferScreen_C_OnControlsReferenceClicked final
{
public:
	class FName                                   InActionInput;                                     // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponModiferScreen_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_WeaponModiferScreen_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_WeaponModiferScreen_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_WeaponModiferScreen_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_OnControlsReferenceClicked, InActionInput) == 0x000000, "Member 'WBP_UI_WeaponModiferScreen_C_OnControlsReferenceClicked::InActionInput' has a wrong offset!");

// Function WBP_UI_WeaponModiferScreen.WBP_UI_WeaponModiferScreen_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_WeaponModiferScreen_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_WeaponModiferScreen_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_WeaponModiferScreen_C_PreConstruct");
static_assert(sizeof(WBP_UI_WeaponModiferScreen_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_WeaponModiferScreen_C_PreConstruct");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_WeaponModiferScreen_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_WeaponModiferScreen.WBP_UI_WeaponModiferScreen_C.NewWeaponPartFocused
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_WeaponModiferScreen_C_NewWeaponPartFocused final
{
public:
	const class USBZMainMenuWeaponPartProgressionButton* NewFocusedButton;                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponModiferScreen_C_NewWeaponPartFocused) == 0x000008, "Wrong alignment on WBP_UI_WeaponModiferScreen_C_NewWeaponPartFocused");
static_assert(sizeof(WBP_UI_WeaponModiferScreen_C_NewWeaponPartFocused) == 0x000008, "Wrong size on WBP_UI_WeaponModiferScreen_C_NewWeaponPartFocused");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_NewWeaponPartFocused, NewFocusedButton) == 0x000000, "Member 'WBP_UI_WeaponModiferScreen_C_NewWeaponPartFocused::NewFocusedButton' has a wrong offset!");

// Function WBP_UI_WeaponModiferScreen.WBP_UI_WeaponModiferScreen_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_WeaponModiferScreen_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_WeaponModiferScreen_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_WeaponModiferScreen_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_WeaponModiferScreen_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_WeaponModiferScreen_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_WeaponModiferScreen_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_WeaponModiferScreen.WBP_UI_WeaponModiferScreen_C.ConstructBlotSlotTexts
// 0x0128 (0x0128 - 0x0000)
struct WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts final
{
public:
	const class USBZWeaponPartDataAsset*          InWeaponPart;                                      // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   OutSlotNames;                                      // 0x0008(0x0018)(Parm, OutParm)
	bool                                          bHasValues;                                        // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OutText;                                           // 0x0028(0x0018)(Edit, BlueprintVisible)
	TArray<class FText>                           CallFunc_GetBlockedSlotNamesForWeaponPart_OutSlotNames; // 0x0040(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0058(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0110(0x0018)()
};
static_assert(alignof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts) == 0x000008, "Wrong alignment on WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts");
static_assert(sizeof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts) == 0x000128, "Wrong size on WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, InWeaponPart) == 0x000000, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::InWeaponPart' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, OutSlotNames) == 0x000008, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::OutSlotNames' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, bHasValues) == 0x000020, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::bHasValues' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, OutText) == 0x000028, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::OutText' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, CallFunc_GetBlockedSlotNamesForWeaponPart_OutSlotNames) == 0x000040, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::CallFunc_GetBlockedSlotNamesForWeaponPart_OutSlotNames' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, Temp_int_Array_Index_Variable) == 0x000050, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, CallFunc_Array_Length_ReturnValue) == 0x000054, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, CallFunc_Array_Get_Item) == 0x000058, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, CallFunc_Array_Length_ReturnValue_1) == 0x0000B0, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, Temp_int_Loop_Counter_Variable) == 0x0000B4, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B8, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, CallFunc_Less_IntInt_ReturnValue) == 0x0000B9, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C0, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, K2Node_MakeArray_Array) == 0x000100, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts, CallFunc_Format_ReturnValue) == 0x000110, "Member 'WBP_UI_WeaponModiferScreen_C_ConstructBlotSlotTexts::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WBP_UI_WeaponModiferScreen.WBP_UI_WeaponModiferScreen_C.UpdateActiveButtonControlsReference
// 0x03F8 (0x03F8 - 0x0000)
struct WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZWeaponPartApplyStatus                     Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0050(0x0018)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x0068(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0098(0x0030)()
	bool                                          CallFunc_IsInputTypeController_ReturnValue;        // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_2;     // 0x00D0(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_3;     // 0x0100(0x0030)()
	bool                                          CallFunc_IsInputTypeController_ReturnValue_1;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_4;     // 0x0138(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_5;     // 0x0168(0x0030)()
	bool                                          CallFunc_IsInputTypeController_ReturnValue_2;      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_6;     // 0x01A0(0x0030)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_7;     // 0x01D0(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0200(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0218(0x0010)(ReferenceParm)
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_1;                          // 0x0228(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable_2;                              // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default;                             // 0x0240(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0250(0x0028)()
	bool                                          Temp_bool_Variable_3;                              // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_8;     // 0x0280(0x0030)()
	bool                                          CallFunc_IsDefaultButton_ReturnValue;              // 0x02B0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_2;                          // 0x02B8(0x0010)(ReferenceParm)
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_3;                          // 0x02C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default_1;                           // 0x02E0(0x0010)(ReferenceParm)
	ESBZWeaponPartApplyStatus                     CallFunc_GetPartApplyStatus_ReturnValue;           // 0x02F0(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_9;     // 0x02F8(0x0030)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x0330(0x0018)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0348(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_10;    // 0x0360(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_4;                          // 0x0390(0x0010)(ReferenceParm)
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array_5;                          // 0x03A0(0x0010)(ReferenceParm)
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default_3;                           // 0x03B0(0x0010)(ReferenceParm)
	TArray<struct FSBZButtonControlReference>     K2Node_Select_Default_4;                           // 0x03C0(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference_1;    // 0x03D0(0x0028)()
};
static_assert(alignof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference) == 0x000008, "Wrong alignment on WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference");
static_assert(sizeof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference) == 0x0003F8, "Wrong size on WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, Temp_bool_Variable) == 0x000000, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, Temp_bool_Variable_1) == 0x000001, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, Temp_byte_Variable) == 0x000002, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, Temp_text_Variable) == 0x000008, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, Temp_text_Variable_1) == 0x000020, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, Temp_text_Variable_2) == 0x000038, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, Temp_text_Variable_3) == 0x000050, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::Temp_text_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlReference) == 0x000068, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000098, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, CallFunc_IsInputTypeController_ReturnValue) == 0x0000C8, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::CallFunc_IsInputTypeController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlReference_2) == 0x0000D0, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlReference_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlReference_3) == 0x000100, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlReference_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, CallFunc_IsInputTypeController_ReturnValue_1) == 0x000130, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::CallFunc_IsInputTypeController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlReference_4) == 0x000138, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlReference_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlReference_5) == 0x000168, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlReference_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, CallFunc_IsInputTypeController_ReturnValue_2) == 0x000198, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::CallFunc_IsInputTypeController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlReference_6) == 0x0001A0, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlReference_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlReference_7) == 0x0001D0, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlReference_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_CreateDelegate_OutputDelegate) == 0x000200, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeArray_Array) == 0x000218, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeArray_Array_1) == 0x000228, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, Temp_bool_Variable_2) == 0x000238, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_Select_Default) == 0x000240, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000250, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, Temp_bool_Variable_3) == 0x000278, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeStruct_SBZButtonControlReference_8) == 0x000280, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeStruct_SBZButtonControlReference_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, CallFunc_IsDefaultButton_ReturnValue) == 0x0002B0, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::CallFunc_IsDefaultButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeArray_Array_2) == 0x0002B8, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_MakeArray_Array_3) == 0x0002C8, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, CallFunc_IsValid_ReturnValue) == 0x0002D8, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference, K2Node_Select_Default_1) == 0x0002E0, "Member 'WBP_UI_WeaponModiferScreen_C_UpdateActiveButtonControlsReference::K2Node_Select_Default_1' has a wrong offset!");
