#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SuitCosmeticPurchasePopUp

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_UI_SuitCosmeticPurchasePopUp.WBP_UI_SuitCosmeticPurchasePopUp_C.ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_SuitCosmeticPurchasePopUp_C_ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPaperSprite*                           K2Node_Event_OutLoadedSprite;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SuitCosmeticPurchasePopUp_C_ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp) == 0x000008, "Wrong alignment on WBP_UI_SuitCosmeticPurchasePopUp_C_ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp");
static_assert(sizeof(WBP_UI_SuitCosmeticPurchasePopUp_C_ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp) == 0x000010, "Wrong size on WBP_UI_SuitCosmeticPurchasePopUp_C_ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp");
static_assert(offsetof(WBP_UI_SuitCosmeticPurchasePopUp_C_ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp, EntryPoint) == 0x000000, "Member 'WBP_UI_SuitCosmeticPurchasePopUp_C_ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_SuitCosmeticPurchasePopUp_C_ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp, K2Node_Event_OutLoadedSprite) == 0x000008, "Member 'WBP_UI_SuitCosmeticPurchasePopUp_C_ExecuteUbergraph_WBP_UI_SuitCosmeticPurchasePopUp::K2Node_Event_OutLoadedSprite' has a wrong offset!");

// Function WBP_UI_SuitCosmeticPurchasePopUp.WBP_UI_SuitCosmeticPurchasePopUp_C.SpriteLoaded
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_SuitCosmeticPurchasePopUp_C_SpriteLoaded final
{
public:
	class UPaperSprite*                           OutLoadedSprite;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_SuitCosmeticPurchasePopUp_C_SpriteLoaded) == 0x000008, "Wrong alignment on WBP_UI_SuitCosmeticPurchasePopUp_C_SpriteLoaded");
static_assert(sizeof(WBP_UI_SuitCosmeticPurchasePopUp_C_SpriteLoaded) == 0x000008, "Wrong size on WBP_UI_SuitCosmeticPurchasePopUp_C_SpriteLoaded");
static_assert(offsetof(WBP_UI_SuitCosmeticPurchasePopUp_C_SpriteLoaded, OutLoadedSprite) == 0x000000, "Member 'WBP_UI_SuitCosmeticPurchasePopUp_C_SpriteLoaded::OutLoadedSprite' has a wrong offset!");

}

