#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_CrewCarryStatusItem

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_CrewCarryStatusItem.WBP_UI_Widget_CrewCarryStatusItem_C.OnChanged
// 0x0028 (0x0028 - 0x0000)
struct WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged final
{
public:
	class USBZCarryType*                          Type;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAdded;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged) == 0x000008, "Wrong alignment on WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged");
static_assert(sizeof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged) == 0x000028, "Wrong size on WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged");
static_assert(offsetof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged, Type) == 0x000000, "Member 'WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged::Type' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged, IsAdded) == 0x000008, "Member 'WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged::IsAdded' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged, Temp_byte_Variable) == 0x000009, "Member 'WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged, Temp_bool_Variable) == 0x00000B, "Member 'WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged, K2Node_Select_Default) == 0x00000C, "Member 'WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged, CallFunc_IsValid_ReturnValue) == 0x00000D, "Member 'WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000010, "Member 'WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_UI_Widget_CrewCarryStatusItem_C_OnChanged::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

