#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_CreateAccount

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_CreateAccount.WBP_UI_CreateAccount_C
// 0x00F8 (0x0398 - 0x02A0)
class UWBP_UI_CreateAccount_C final : public USBZMenuStackWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWBP_UI_Menu_ActionInputButton_C*       Button_Back;                                       // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   Button_CreateAccount;                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TextButton_C*                   Button_VerifyAccount;                              // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               CanvasPanel_Verify;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_ConfirmPassword;                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_Country;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_Displayname;                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_DOB;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_Email;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_Password;                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_Username;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_VerifyInput;                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_FormBackground;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_VerifyFormBackground;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Overlay_AccountCreationForm;                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Missmatch;                                    // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSBZRegistrationFieldInfo              RegistrationField;                                 // 0x0330(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bIsPopUpShowing;                                   // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_CreateAccount(int32 EntryPoint);
	void BndEvt__WBP_UI_CreateAccount_Button_VerifyAccount_K2Node_ComponentBoundEvent_12_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_CreateAccount_Button_CreateAccount_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__EditableTextBox_Country_K2Node_ComponentBoundEvent_11_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__EditableTextBox_DOB_K2Node_ComponentBoundEvent_10_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__EditableTextBox_VerifyInput_K2Node_ComponentBoundEvent_2_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__EditableTextBox_Displayname_K2Node_ComponentBoundEvent_8_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__EditableTextBox_Username_K2Node_ComponentBoundEvent_5_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void OnGainedStackFocused(const class FName& PreviousValue);
	void BndEvt__EditableTextBox_Email_K2Node_ComponentBoundEvent_6_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__EditableTextBox_ConfirmPassword_K2Node_ComponentBoundEvent_3_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__EditableTextBox_Password_K2Node_ComponentBoundEvent_4_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text, ETextCommit CommitMethod);
	void BndEvt__Button_Back_K2Node_ComponentBoundEvent_1_OnButtonClicked__DelegateSignature();
	void OnLostStackFocused();
	void OnBackPressed();
	void TogglePopUp();
	void SubmitRegistrationForm(bool* bWasSuccessful);
	void PasswordCheck();
	void GetDefaultUsername();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_CreateAccount_C">();
	}
	static class UWBP_UI_CreateAccount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_CreateAccount_C>();
	}
};
static_assert(alignof(UWBP_UI_CreateAccount_C) == 0x000008, "Wrong alignment on UWBP_UI_CreateAccount_C");
static_assert(sizeof(UWBP_UI_CreateAccount_C) == 0x000398, "Wrong size on UWBP_UI_CreateAccount_C");
static_assert(offsetof(UWBP_UI_CreateAccount_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_UI_CreateAccount_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, Button_Back) == 0x0002A8, "Member 'UWBP_UI_CreateAccount_C::Button_Back' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, Button_CreateAccount) == 0x0002B0, "Member 'UWBP_UI_CreateAccount_C::Button_CreateAccount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, Button_VerifyAccount) == 0x0002B8, "Member 'UWBP_UI_CreateAccount_C::Button_VerifyAccount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, CanvasPanel_Verify) == 0x0002C0, "Member 'UWBP_UI_CreateAccount_C::CanvasPanel_Verify' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, EditableTextBox_ConfirmPassword) == 0x0002C8, "Member 'UWBP_UI_CreateAccount_C::EditableTextBox_ConfirmPassword' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, EditableTextBox_Country) == 0x0002D0, "Member 'UWBP_UI_CreateAccount_C::EditableTextBox_Country' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, EditableTextBox_Displayname) == 0x0002D8, "Member 'UWBP_UI_CreateAccount_C::EditableTextBox_Displayname' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, EditableTextBox_DOB) == 0x0002E0, "Member 'UWBP_UI_CreateAccount_C::EditableTextBox_DOB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, EditableTextBox_Email) == 0x0002E8, "Member 'UWBP_UI_CreateAccount_C::EditableTextBox_Email' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, EditableTextBox_Password) == 0x0002F0, "Member 'UWBP_UI_CreateAccount_C::EditableTextBox_Password' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, EditableTextBox_Username) == 0x0002F8, "Member 'UWBP_UI_CreateAccount_C::EditableTextBox_Username' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, EditableTextBox_VerifyInput) == 0x000300, "Member 'UWBP_UI_CreateAccount_C::EditableTextBox_VerifyInput' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, Image_Background) == 0x000308, "Member 'UWBP_UI_CreateAccount_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, Image_FormBackground) == 0x000310, "Member 'UWBP_UI_CreateAccount_C::Image_FormBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, Image_VerifyFormBackground) == 0x000318, "Member 'UWBP_UI_CreateAccount_C::Image_VerifyFormBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, Overlay_AccountCreationForm) == 0x000320, "Member 'UWBP_UI_CreateAccount_C::Overlay_AccountCreationForm' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, Text_Missmatch) == 0x000328, "Member 'UWBP_UI_CreateAccount_C::Text_Missmatch' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, RegistrationField) == 0x000330, "Member 'UWBP_UI_CreateAccount_C::RegistrationField' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CreateAccount_C, bIsPopUpShowing) == 0x000390, "Member 'UWBP_UI_CreateAccount_C::bIsPopUpShowing' has a wrong offset!");

}

