#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Results_Reward_WeaponProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Results_Reward_WeaponProgress.WBP_UI_Results_Reward_WeaponProgress_C
// 0x0108 (0x0398 - 0x0290)
class UWBP_UI_Results_Reward_WeaponProgress_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LeveledUp;                                         // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       FadeInWeapon;                                      // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Frame;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_403;                                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        LevelProg_Text;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        LevelUp_T;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         ModItems;                                          // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        NewLevel_T;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ProgressBarAnimate_C*           ProgressBar;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NumberCounter_C*                   WBP_Diff;                                          // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        WeaponName_T;                                      // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSBZWeaponProgressionUpdateData        ResultData;                                        // 0x0338(0x0030)(Edit, BlueprintVisible, ExposeOnSpawn)
	TArray<class UWBP_UI_Results_Reward_InventoryReward_C*> UnlockedMods;                            // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         NumModsShown;                                      // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              ModAdded;                                          // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         DelayRewardTime;                                   // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void OnLoaded_BE567583454F8E94170EB98A814612C2(class UObject* Loaded);
	void PlayAppearAnim();
	void AddModUnlocks();
	void ShowMods();
	void AnimateBarsAndText();
	void PlayLevelUpAnim();
	void SequenceEvent__ENTRYPOINTWBP_UI_Results_Reward_WeaponProgress_0();
	void SequenceEvent__ENTRYPOINTWBP_UI_Results_Reward_WeaponProgress_1();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Results_Reward_WeaponProgress_C">();
	}
	static class UWBP_UI_Results_Reward_WeaponProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Results_Reward_WeaponProgress_C>();
	}
};
static_assert(alignof(UWBP_UI_Results_Reward_WeaponProgress_C) == 0x000008, "Wrong alignment on UWBP_UI_Results_Reward_WeaponProgress_C");
static_assert(sizeof(UWBP_UI_Results_Reward_WeaponProgress_C) == 0x000398, "Wrong size on UWBP_UI_Results_Reward_WeaponProgress_C");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, LeveledUp) == 0x000298, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::LeveledUp' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, FadeInWeapon) == 0x0002A0, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::FadeInWeapon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Border_Frame) == 0x0002A8, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Border_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Icon) == 0x0002B0, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Image) == 0x0002B8, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Image_1) == 0x0002C0, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Image_2) == 0x0002C8, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Image_3) == 0x0002D0, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Image_4) == 0x0002D8, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Image_5) == 0x0002E0, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Image_6) == 0x0002E8, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Image_403) == 0x0002F0, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Image_403' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, Image_511) == 0x0002F8, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, LevelProg_Text) == 0x000300, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::LevelProg_Text' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, LevelUp_T) == 0x000308, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::LevelUp_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, ModItems) == 0x000310, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::ModItems' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, NewLevel_T) == 0x000318, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::NewLevel_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, ProgressBar) == 0x000320, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, WBP_Diff) == 0x000328, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::WBP_Diff' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, WeaponName_T) == 0x000330, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::WeaponName_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, ResultData) == 0x000338, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::ResultData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, UnlockedMods) == 0x000368, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::UnlockedMods' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, NumModsShown) == 0x000378, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::NumModsShown' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, ModAdded) == 0x000380, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::ModAdded' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_WeaponProgress_C, DelayRewardTime) == 0x000390, "Member 'UWBP_UI_Results_Reward_WeaponProgress_C::DelayRewardTime' has a wrong offset!");

}

