#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_DownedCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_DownedCounter.WBP_UI_Widget_DownedCounter_C
// 0x0048 (0x0350 - 0x0308)
class UWBP_UI_Widget_DownedCounter_C final : public USBZDoubleAttributeWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0308(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Down;                                              // 0x0310(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Up;                                                // 0x0318(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                CounterBorder;                                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CounterText;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TransitionText;                                    // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Current;                                           // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Max;                                               // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Old;                                               // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_DownedCounter(int32 EntryPoint);
	void OnSetup(float PrimaryValue, float SecondaryValue);
	void OnSecondaryAttributeUpdate(float NewValue, float OldValue);
	void OnPrimaryAttributeUpdate(float NewValue, float OldValue);
	void ChangeValueWithAnim(int32 NewValue, int32 OldValue);
	void ChangeValueWithoutAnim(int32 Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_DownedCounter_C">();
	}
	static class UWBP_UI_Widget_DownedCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_DownedCounter_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_DownedCounter_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_DownedCounter_C");
static_assert(sizeof(UWBP_UI_Widget_DownedCounter_C) == 0x000350, "Wrong size on UWBP_UI_Widget_DownedCounter_C");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, UberGraphFrame) == 0x000308, "Member 'UWBP_UI_Widget_DownedCounter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, Down) == 0x000310, "Member 'UWBP_UI_Widget_DownedCounter_C::Down' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, Up) == 0x000318, "Member 'UWBP_UI_Widget_DownedCounter_C::Up' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, CounterBorder) == 0x000320, "Member 'UWBP_UI_Widget_DownedCounter_C::CounterBorder' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, CounterText) == 0x000328, "Member 'UWBP_UI_Widget_DownedCounter_C::CounterText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, Icon) == 0x000330, "Member 'UWBP_UI_Widget_DownedCounter_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, TransitionText) == 0x000338, "Member 'UWBP_UI_Widget_DownedCounter_C::TransitionText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, Current) == 0x000340, "Member 'UWBP_UI_Widget_DownedCounter_C::Current' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, Max) == 0x000344, "Member 'UWBP_UI_Widget_DownedCounter_C::Max' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_DownedCounter_C, Old) == 0x000348, "Member 'UWBP_UI_Widget_DownedCounter_C::Old' has a wrong offset!");

}

