#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Cosmetic

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.ExecuteUbergraph_WBP_UI_Cosmetic
// 0x07A0 (0x07A0 - 0x0000)
struct WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Cosmetic_SlotPartChange_C*      CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZEquippableLoadoutSlot                     Temp_byte_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZInventoryEquipmentType                    Temp_byte_Variable_1;                              // 0x0019(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESBZInventoryEquipmentType                    Temp_byte_Variable_2;                              // 0x001A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_4;                              // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F[0x1];                                       // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate;             // 0x0020(0x0014)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0034(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_NewIndex_3;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex_2;             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_NewIndex_1;             // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A[0x2];                                       // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_NewIndex;               // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZStandaloneWeaponDisplay*            CallFunc_GetActorOfClass_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_1;               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue;                     // 0x0090(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSuccess_1;                         // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZMetaRequestResult                         K2Node_Event_Result_1;                             // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9F[0x1];                                       // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0040)(HasGetValueTypeHash)
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_1;    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0100(0x0018)()
	class FName                                   K2Node_CustomEvent_ClosingActionName_5;            // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData;                  // 0x0128(0x0060)(ContainsInstancedReference)
	bool                                          K2Node_SwitchName_CmpSuccess_1;                    // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData_1;                // 0x0190(0x0060)(ContainsInstancedReference)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate_1;           // 0x01F0(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetIsEnabled_ReturnValue;                 // 0x0204(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_205[0x3];                                      // 0x0205(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZMainMenuCameraManager*              CallFunc_GetMainMenuCameraManager_ReturnValue;     // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0210(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_2;    // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ClosingActionName_4;            // 0x0228(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_2;               // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess_2;                    // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x3];                                      // 0x0241(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_PopStack_ReturnValue_1;                   // 0x0244(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_3;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_PopStack_ReturnValue_2;                   // 0x0258(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_4;               // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_5;               // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ClosingActionName_3;            // 0x0280(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate_2;           // 0x028C(0x0014)(ZeroConstructor, NoDestructor)
	const class USBZCosmeticsDataAsset*           K2Node_Event_AssetData;                            // 0x02A0(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZStoreBaseItem                      K2Node_Event_StoreData;                            // 0x02A8(0x00D8)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class USBZCosmeticsPartSlot*, class USBZModularPartDataAsset*> CallFunc_GetFilteredEquippableDataMap_OutFilteredDataMap; // 0x0388(0x0050)()
	bool                                          K2Node_Event_bIsSuccess;                           // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZMetaRequestResult                         K2Node_Event_Result;                               // 0x03D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3DA[0x2];                                      // 0x03DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue_1;             // 0x03DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x03E0(0x0040)(HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_6;               // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_ClosingActionName_2;            // 0x0428(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate_3;           // 0x0434(0x0014)(ZeroConstructor, NoDestructor)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0448(0x0040)(HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_7;               // 0x0488(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0490(0x0010)(ReferenceParm)
	class FName                                   K2Node_CustomEvent_ClosingActionName_1;            // 0x04A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x04B0(0x0018)()
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_8;               // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData_2;                // 0x04D0(0x0060)(ContainsInstancedReference)
	class FName                                   K2Node_CustomEvent_ClosingActionName;              // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_53C[0x4];                                      // 0x053C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData_3;                // 0x0540(0x0060)(ContainsInstancedReference)
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData_4;                // 0x05A0(0x0060)(ContainsInstancedReference)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_9;               // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZPopupWidget*                        CallFunc_GetPopUpWidget_ReturnValue;               // 0x0608(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0610(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_PopUpWidget_C*                  K2Node_DynamicCast_AsWBP_UI_Pop_Up_Widget;         // 0x0618(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Cosmetic_SlotPartChange_C*      K2Node_DynamicCast_AsWBP_UI_Cosmetic_Slot_Part_Change; // 0x0628(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0630(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_631[0x7];                                      // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0638(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x0640(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0648(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x064C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Cosmetic_SummedCost_C*          CallFunc_CreateSummedCost_SummedCost;              // 0x0650(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0658(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_659[0x7];                                      // 0x0659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0660(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZUIManager*                          CallFunc_GetUIManager_ReturnValue_10;              // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate_4;           // 0x0670(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_684[0x4];                                      // 0x0684(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZPopupWidget*                        CallFunc_GetPopUpWidget_ReturnValue_1;             // 0x0688(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_PopUpWidget_C*                  K2Node_DynamicCast_AsWBP_UI_Pop_Up_Widget_1;       // 0x0690(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0698(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZInventoryEquipmentType                    K2Node_Select_Default;                             // 0x0699(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x069A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x069B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69C[0x4];                                      // 0x069C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_GetChildAt_ReturnValue_1;                 // 0x06A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_Select_Default_1;                           // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x06B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6B1[0x7];                                      // 0x06B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x06B8(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x06D0(0x0018)()
	ESBZMainMenuCosmeticType                      Temp_byte_Variable_5;                              // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E9[0x7];                                      // 0x06E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default_2;                           // 0x06F0(0x0018)()
	struct FSBZUIPopupData                        K2Node_MakeStruct_SBZUIPopupData_5;                // 0x0708(0x0060)(ContainsInstancedReference)
	TDelegate<void(class FName ClosingActionName)> K2Node_CreateDelegate_OutputDelegate_5;           // 0x0768(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_77C[0x4];                                      // 0x077C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationTimeRange_ReturnValue;       // 0x0780(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x0788(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZCustomizationManager*               CallFunc_GetCustomizationManager_ReturnValue_3;    // 0x0790(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0798(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0799(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic) == 0x000008, "Wrong alignment on WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic");
static_assert(sizeof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic) == 0x0007A0, "Wrong size on WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, EntryPoint) == 0x000000, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetCustomizationManager_ReturnValue) == 0x000008, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetCustomizationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_Create_ReturnValue) == 0x000010, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_byte_Variable) == 0x000018, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_byte_Variable_1) == 0x000019, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_byte_Variable_2) == 0x00001A, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_bool_Variable) == 0x00001B, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_bool_Variable_1) == 0x00001C, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_byte_Variable_3) == 0x00001D, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_byte_Variable_4) == 0x00001E, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Event_PreviousValue) == 0x000034, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CustomEvent_ActionName) == 0x000040, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue) == 0x000050, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_SwitchName_CmpSuccess) == 0x000058, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_ComponentBoundEvent_NewIndex_3) == 0x00005C, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_ComponentBoundEvent_NewIndex_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_ComponentBoundEvent_NewIndex_2) == 0x000060, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_ComponentBoundEvent_NewIndex_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_ComponentBoundEvent_NewIndex_1) == 0x000064, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_ComponentBoundEvent_NewIndex_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_SwitchEnum_CmpSuccess) == 0x000068, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_IsVisible_ReturnValue) == 0x000069, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_ComponentBoundEvent_NewIndex) == 0x00006C, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_ComponentBoundEvent_NewIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetActorOfClass_ReturnValue) == 0x000070, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_int_Variable) == 0x00007C, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_1) == 0x000088, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_PopStack_ReturnValue) == 0x000090, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_PopStack_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Event_bIsSuccess_1) == 0x00009C, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Event_bIsSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Event_Result_1) == 0x00009D, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Event_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_SwitchEnum_CmpSuccess_1) == 0x00009E, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000A0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeStruct_FormatArgumentData) == 0x0000A8, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetCustomizationManager_ReturnValue_1) == 0x0000E8, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetCustomizationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeArray_Array) == 0x0000F0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_Format_ReturnValue) == 0x000100, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CustomEvent_ClosingActionName_5) == 0x000118, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CustomEvent_ClosingActionName_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeStruct_SBZUIPopupData) == 0x000128, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeStruct_SBZUIPopupData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_SwitchName_CmpSuccess_1) == 0x000188, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_SwitchName_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeStruct_SBZUIPopupData_1) == 0x000190, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeStruct_SBZUIPopupData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CreateDelegate_OutputDelegate_1) == 0x0001F0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetIsEnabled_ReturnValue) == 0x000204, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetIsEnabled_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetMainMenuCameraManager_ReturnValue) == 0x000208, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetMainMenuCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_MakeLiteralName_ReturnValue) == 0x000210, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetCustomizationManager_ReturnValue_2) == 0x000220, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetCustomizationManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CustomEvent_ClosingActionName_4) == 0x000228, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CustomEvent_ClosingActionName_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_2) == 0x000238, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_SwitchName_CmpSuccess_2) == 0x000240, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_SwitchName_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_PopStack_ReturnValue_1) == 0x000244, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_PopStack_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_3) == 0x000250, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_PopStack_ReturnValue_2) == 0x000258, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_PopStack_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_4) == 0x000268, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_PlayAnimationForward_ReturnValue) == 0x000270, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_5) == 0x000278, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CustomEvent_ClosingActionName_3) == 0x000280, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CustomEvent_ClosingActionName_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CreateDelegate_OutputDelegate_2) == 0x00028C, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Event_AssetData) == 0x0002A0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Event_AssetData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Event_StoreData) == 0x0002A8, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Event_StoreData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_SwitchEnum_CmpSuccess_2) == 0x000380, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetFilteredEquippableDataMap_OutFilteredDataMap) == 0x000388, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetFilteredEquippableDataMap_OutFilteredDataMap' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Event_bIsSuccess) == 0x0003D8, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Event_bIsSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Event_Result) == 0x0003D9, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_Conv_ByteToInt_ReturnValue_1) == 0x0003DC, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_Conv_ByteToInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeStruct_FormatArgumentData_1) == 0x0003E0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_6) == 0x000420, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CustomEvent_ClosingActionName_2) == 0x000428, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CustomEvent_ClosingActionName_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CreateDelegate_OutputDelegate_3) == 0x000434, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeStruct_FormatArgumentData_2) == 0x000448, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_7) == 0x000488, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeArray_Array_1) == 0x000490, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CustomEvent_ClosingActionName_1) == 0x0004A0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CustomEvent_ClosingActionName_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_Format_ReturnValue_1) == 0x0004B0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_8) == 0x0004C8, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeStruct_SBZUIPopupData_2) == 0x0004D0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeStruct_SBZUIPopupData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CustomEvent_ClosingActionName) == 0x000530, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CustomEvent_ClosingActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeStruct_SBZUIPopupData_3) == 0x000540, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeStruct_SBZUIPopupData_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeStruct_SBZUIPopupData_4) == 0x0005A0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeStruct_SBZUIPopupData_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_9) == 0x000600, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetPopUpWidget_ReturnValue) == 0x000608, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetPopUpWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetChildAt_ReturnValue) == 0x000610, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_DynamicCast_AsWBP_UI_Pop_Up_Widget) == 0x000618, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_DynamicCast_AsWBP_UI_Pop_Up_Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_DynamicCast_bSuccess) == 0x000620, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_DynamicCast_AsWBP_UI_Cosmetic_Slot_Part_Change) == 0x000628, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_DynamicCast_AsWBP_UI_Cosmetic_Slot_Part_Change' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_DynamicCast_bSuccess_1) == 0x000630, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_AddChild_ReturnValue) == 0x000638, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x000640, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetChildrenCount_ReturnValue) == 0x000648, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_Subtract_IntInt_ReturnValue) == 0x00064C, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_CreateSummedCost_SummedCost) == 0x000650, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_CreateSummedCost_SummedCost' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000658, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_AddChild_ReturnValue_1) == 0x000660, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetUIManager_ReturnValue_10) == 0x000668, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetUIManager_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CreateDelegate_OutputDelegate_4) == 0x000670, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetPopUpWidget_ReturnValue_1) == 0x000688, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetPopUpWidget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_DynamicCast_AsWBP_UI_Pop_Up_Widget_1) == 0x000690, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_DynamicCast_AsWBP_UI_Pop_Up_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_DynamicCast_bSuccess_2) == 0x000698, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Select_Default) == 0x000699, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_SwitchEnum_CmpSuccess_3) == 0x00069A, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_IsValid_ReturnValue_1) == 0x00069B, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetChildAt_ReturnValue_1) == 0x0006A0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetChildAt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Select_Default_1) == 0x0006A8, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_IsValid_ReturnValue_2) == 0x0006B0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_text_Variable) == 0x0006B8, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_text_Variable_1) == 0x0006D0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, Temp_byte_Variable_5) == 0x0006E8, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Select_Default_2) == 0x0006F0, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_MakeStruct_SBZUIPopupData_5) == 0x000708, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_MakeStruct_SBZUIPopupData_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_CreateDelegate_OutputDelegate_5) == 0x000768, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_PlayAnimationTimeRange_ReturnValue) == 0x000780, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_PlayAnimationTimeRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x000788, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_GetCustomizationManager_ReturnValue_3) == 0x000790, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_GetCustomizationManager_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000798, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic, K2Node_Select_Default_3) == 0x000799, "Member 'WBP_UI_Cosmetic_C_ExecuteUbergraph_WBP_UI_Cosmetic::K2Node_Select_Default_3' has a wrong offset!");

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.OnConfirmNotEnoughLevel
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Cosmetic_C_OnConfirmNotEnoughLevel final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Cosmetic_C_OnConfirmNotEnoughLevel) == 0x000004, "Wrong alignment on WBP_UI_Cosmetic_C_OnConfirmNotEnoughLevel");
static_assert(sizeof(WBP_UI_Cosmetic_C_OnConfirmNotEnoughLevel) == 0x00000C, "Wrong size on WBP_UI_Cosmetic_C_OnConfirmNotEnoughLevel");
static_assert(offsetof(WBP_UI_Cosmetic_C_OnConfirmNotEnoughLevel, ClosingActionName) == 0x000000, "Member 'WBP_UI_Cosmetic_C_OnConfirmNotEnoughLevel::ClosingActionName' has a wrong offset!");

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.OnConfirmNotEnoughResources
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Cosmetic_C_OnConfirmNotEnoughResources final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Cosmetic_C_OnConfirmNotEnoughResources) == 0x000004, "Wrong alignment on WBP_UI_Cosmetic_C_OnConfirmNotEnoughResources");
static_assert(sizeof(WBP_UI_Cosmetic_C_OnConfirmNotEnoughResources) == 0x00000C, "Wrong size on WBP_UI_Cosmetic_C_OnConfirmNotEnoughResources");
static_assert(offsetof(WBP_UI_Cosmetic_C_OnConfirmNotEnoughResources, ClosingActionName) == 0x000000, "Member 'WBP_UI_Cosmetic_C_OnConfirmNotEnoughResources::ClosingActionName' has a wrong offset!");

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.OnConfirmBuyError
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Cosmetic_C_OnConfirmBuyError final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Cosmetic_C_OnConfirmBuyError) == 0x000004, "Wrong alignment on WBP_UI_Cosmetic_C_OnConfirmBuyError");
static_assert(sizeof(WBP_UI_Cosmetic_C_OnConfirmBuyError) == 0x00000C, "Wrong size on WBP_UI_Cosmetic_C_OnConfirmBuyError");
static_assert(offsetof(WBP_UI_Cosmetic_C_OnConfirmBuyError, ClosingActionName) == 0x000000, "Member 'WBP_UI_Cosmetic_C_OnConfirmBuyError::ClosingActionName' has a wrong offset!");

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.BP_OnBuyDone
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_Cosmetic_C_BP_OnBuyDone final
{
public:
	bool                                          bIsSuccess;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZMetaRequestResult                         Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Cosmetic_C_BP_OnBuyDone) == 0x000001, "Wrong alignment on WBP_UI_Cosmetic_C_BP_OnBuyDone");
static_assert(sizeof(WBP_UI_Cosmetic_C_BP_OnBuyDone) == 0x000002, "Wrong size on WBP_UI_Cosmetic_C_BP_OnBuyDone");
static_assert(offsetof(WBP_UI_Cosmetic_C_BP_OnBuyDone, bIsSuccess) == 0x000000, "Member 'WBP_UI_Cosmetic_C_BP_OnBuyDone::bIsSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_BP_OnBuyDone, Result) == 0x000001, "Member 'WBP_UI_Cosmetic_C_BP_OnBuyDone::Result' has a wrong offset!");

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.OnAddStoreItem
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_UI_Cosmetic_C_OnAddStoreItem final
{
public:
	const class USBZCosmeticsDataAsset*           AssetData;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZStoreBaseItem                      StoreData;                                         // 0x0008(0x00D8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_Cosmetic_C_OnAddStoreItem) == 0x000008, "Wrong alignment on WBP_UI_Cosmetic_C_OnAddStoreItem");
static_assert(sizeof(WBP_UI_Cosmetic_C_OnAddStoreItem) == 0x0000E0, "Wrong size on WBP_UI_Cosmetic_C_OnAddStoreItem");
static_assert(offsetof(WBP_UI_Cosmetic_C_OnAddStoreItem, AssetData) == 0x000000, "Member 'WBP_UI_Cosmetic_C_OnAddStoreItem::AssetData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Cosmetic_C_OnAddStoreItem, StoreData) == 0x000008, "Member 'WBP_UI_Cosmetic_C_OnAddStoreItem::StoreData' has a wrong offset!");

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.OnConfirmApplyError
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Cosmetic_C_OnConfirmApplyError final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Cosmetic_C_OnConfirmApplyError) == 0x000004, "Wrong alignment on WBP_UI_Cosmetic_C_OnConfirmApplyError");
static_assert(sizeof(WBP_UI_Cosmetic_C_OnConfirmApplyError) == 0x00000C, "Wrong size on WBP_UI_Cosmetic_C_OnConfirmApplyError");
static_assert(offsetof(WBP_UI_Cosmetic_C_OnConfirmApplyError, ClosingActionName) == 0x000000, "Member 'WBP_UI_Cosmetic_C_OnConfirmApplyError::ClosingActionName' has a wrong offset!");

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.OnConfirmBack
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Cosmetic_C_OnConfirmBack final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Cosmetic_C_OnConfirmBack) == 0x000004, "Wrong alignment on WBP_UI_Cosmetic_C_OnConfirmBack");
static_assert(sizeof(WBP_UI_Cosmetic_C_OnConfirmBack) == 0x00000C, "Wrong size on WBP_UI_Cosmetic_C_OnConfirmBack");
static_assert(offsetof(WBP_UI_Cosmetic_C_OnConfirmBack, ClosingActionName) == 0x000000, "Member 'WBP_UI_Cosmetic_C_OnConfirmBack::ClosingActionName' has a wrong offset!");

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.OnConfirmApply
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Cosmetic_C_OnConfirmApply final
{
public:
	class FName                                   ClosingActionName;                                 // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Cosmetic_C_OnConfirmApply) == 0x000004, "Wrong alignment on WBP_UI_Cosmetic_C_OnConfirmApply");
static_assert(sizeof(WBP_UI_Cosmetic_C_OnConfirmApply) == 0x00000C, "Wrong size on WBP_UI_Cosmetic_C_OnConfirmApply");
static_assert(offsetof(WBP_UI_Cosmetic_C_OnConfirmApply, ClosingActionName) == 0x000000, "Member 'WBP_UI_Cosmetic_C_OnConfirmApply::ClosingActionName' has a wrong offset!");

// Function WBP_UI_Cosmetic.WBP_UI_Cosmetic_C.BP_OnApplyPreviewDone
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_Cosmetic_C_BP_OnApplyPreviewDone final
{
public:
	bool                                          bIsSuccess;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZMetaRequestResult                         Result;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Cosmetic_C_BP_OnApplyPreviewDone) == 0x000001, "Wrong alignment on WBP_UI_Cosmetic_C_BP_OnApplyPreviewDone");
static_assert(sizeof(WBP_UI_Cosmetic_C_BP_OnApplyPreviewDone) == 0x000002, "Wrong size on WBP_UI_Cosmetic_C_BP_OnApplyPreviewDone");
static_assert(offsetof(WBP_UI_Cosmetic_C_BP_OnApplyPreviewDone, bIsSuccess) == 0x000000, "Member 'WBP_UI_Cosmetic_C_BP_OnApplyPreviewDone::bIsSuccess' has a wrong offset!");
