#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser_SecurityCompanyDisplay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerBrowser_SecurityCompanyDisplay.WBP_ServerBrowser_SecurityCompanyDisplay_C
// 0x0030 (0x02E0 - 0x02B0)
class UWBP_ServerBrowser_SecurityCompanyDisplay_C final : public USBZSecurityCompanyVisualsWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_SecurityCompanyLogo;                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_SecurityCompanyDescription;                   // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_SecurityCompanyName;                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPaperSprite*                           DefaultIcon;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseTitleOnly;                                     // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_ServerBrowser_SecurityCompanyDisplay(int32 EntryPoint);
	void OnSecurityCompanyAssetStartedLoad();
	void OnEmptySet();
	void OnSecurityCompanyAssetLoaded();
	void SetCompanyNameAndDescription(const class FText& InSecurityCompanyName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerBrowser_SecurityCompanyDisplay_C">();
	}
	static class UWBP_ServerBrowser_SecurityCompanyDisplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerBrowser_SecurityCompanyDisplay_C>();
	}
};
static_assert(alignof(UWBP_ServerBrowser_SecurityCompanyDisplay_C) == 0x000008, "Wrong alignment on UWBP_ServerBrowser_SecurityCompanyDisplay_C");
static_assert(sizeof(UWBP_ServerBrowser_SecurityCompanyDisplay_C) == 0x0002E0, "Wrong size on UWBP_ServerBrowser_SecurityCompanyDisplay_C");
static_assert(offsetof(UWBP_ServerBrowser_SecurityCompanyDisplay_C, UberGraphFrame) == 0x0002B0, "Member 'UWBP_ServerBrowser_SecurityCompanyDisplay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_SecurityCompanyDisplay_C, Image_SecurityCompanyLogo) == 0x0002B8, "Member 'UWBP_ServerBrowser_SecurityCompanyDisplay_C::Image_SecurityCompanyLogo' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_SecurityCompanyDisplay_C, Text_SecurityCompanyDescription) == 0x0002C0, "Member 'UWBP_ServerBrowser_SecurityCompanyDisplay_C::Text_SecurityCompanyDescription' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_SecurityCompanyDisplay_C, Text_SecurityCompanyName) == 0x0002C8, "Member 'UWBP_ServerBrowser_SecurityCompanyDisplay_C::Text_SecurityCompanyName' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_SecurityCompanyDisplay_C, DefaultIcon) == 0x0002D0, "Member 'UWBP_ServerBrowser_SecurityCompanyDisplay_C::DefaultIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_SecurityCompanyDisplay_C, bUseTitleOnly) == 0x0002D8, "Member 'UWBP_ServerBrowser_SecurityCompanyDisplay_C::bUseTitleOnly' has a wrong offset!");

}

