#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_SuitComseticCustomization

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Inventory_SuitComseticCustomization.WBP_UI_Inventory_SuitComseticCustomization_C.ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization
// 0x01A0 (0x01A0 - 0x0000)
struct WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMainMenuCosmeticItemButton*         K2Node_ComponentBoundEvent_CosmeticButton;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZCosmeticsDataAsset*           CallFunc_GetCosmeticItemData_ReturnValue;          // 0x0018(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDefaultItem_ReturnValue;                // 0x0022(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZCosmeticsDataAsset*           K2Node_Event_InEquippedItem;                       // 0x0028(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_OutDisplayName;            // 0x0030(0x0018)()
	bool                                          CallFunc_GetDisplayName_OutHasText;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
	class FName                                   K2Node_Event_PreviousValue;                        // 0x0088(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0098(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x00B0(0x0018)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference;       // 0x00C8(0x0030)()
	TDelegate<void(class FName ActionName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_ActionName;                     // 0x0110(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchName_CmpSuccess;                      // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0120(0x0018)()
	struct FSBZButtonControlReference             K2Node_MakeStruct_SBZButtonControlReference_1;     // 0x0138(0x0030)()
	TArray<struct FSBZButtonControlReference>     K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ReferenceParm)
	struct FSBZButtonControlsReference            K2Node_MakeStruct_SBZButtonControlsReference;      // 0x0178(0x0028)()
};
static_assert(alignof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization) == 0x000008, "Wrong alignment on WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization");
static_assert(sizeof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization) == 0x0001A0, "Wrong size on WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, EntryPoint) == 0x000000, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_ComponentBoundEvent_CosmeticButton) == 0x000008, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_ComponentBoundEvent_CosmeticButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000010, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, CallFunc_GetCosmeticItemData_ReturnValue) == 0x000018, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::CallFunc_GetCosmeticItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, CallFunc_IsDefaultItem_ReturnValue) == 0x000022, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::CallFunc_IsDefaultItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, CallFunc_BooleanAND_ReturnValue) == 0x000023, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_Event_InEquippedItem) == 0x000028, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_Event_InEquippedItem' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, CallFunc_GetDisplayName_OutDisplayName) == 0x000030, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::CallFunc_GetDisplayName_OutDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, CallFunc_GetDisplayName_OutHasText) == 0x000048, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::CallFunc_GetDisplayName_OutHasText' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, CallFunc_SelectColor_ReturnValue) == 0x00004C, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, CallFunc_IsValid_ReturnValue_2) == 0x00005C, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_Event_PreviousValue) == 0x000088, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_Event_PreviousValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, Temp_text_Variable) == 0x000098, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, Temp_text_Variable_1) == 0x0000B0, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_MakeStruct_SBZButtonControlReference) == 0x0000C8, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_MakeStruct_SBZButtonControlReference' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, Temp_bool_Variable) == 0x00010C, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_CustomEvent_ActionName) == 0x000110, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_CustomEvent_ActionName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_SwitchName_CmpSuccess) == 0x00011C, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_SwitchName_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_Select_Default) == 0x000120, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_MakeStruct_SBZButtonControlReference_1) == 0x000138, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_MakeStruct_SBZButtonControlReference_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_MakeArray_Array) == 0x000168, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization, K2Node_MakeStruct_SBZButtonControlsReference) == 0x000178, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_ExecuteUbergraph_WBP_UI_Inventory_SuitComseticCustomization::K2Node_MakeStruct_SBZButtonControlsReference' has a wrong offset!");

// Function WBP_UI_Inventory_SuitComseticCustomization.WBP_UI_Inventory_SuitComseticCustomization_C.OnControlsReferenceClicked
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Inventory_SuitComseticCustomization_C_OnControlsReferenceClicked final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_SuitComseticCustomization_C_OnControlsReferenceClicked) == 0x000004, "Wrong alignment on WBP_UI_Inventory_SuitComseticCustomization_C_OnControlsReferenceClicked");
static_assert(sizeof(WBP_UI_Inventory_SuitComseticCustomization_C_OnControlsReferenceClicked) == 0x00000C, "Wrong size on WBP_UI_Inventory_SuitComseticCustomization_C_OnControlsReferenceClicked");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_OnControlsReferenceClicked, ActionName) == 0x000000, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_OnControlsReferenceClicked::ActionName' has a wrong offset!");

// Function WBP_UI_Inventory_SuitComseticCustomization.WBP_UI_Inventory_SuitComseticCustomization_C.BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Inventory_SuitComseticCustomization_C_BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature final
{
public:
	class USBZMainMenuCosmeticItemButton*         CosmeticButton;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Inventory_SuitComseticCustomization_C_BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Inventory_SuitComseticCustomization_C_BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Inventory_SuitComseticCustomization_C_BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Inventory_SuitComseticCustomization_C_BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature, CosmeticButton) == 0x000000, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature::CosmeticButton' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_BndEvt__WBP_UI_Inventory_SuitComseticCustomization_Widget_CosmeticPanel_K2Node_ComponentBoundEvent_0_OnCosmeticButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Inventory_SuitComseticCustomization.WBP_UI_Inventory_SuitComseticCustomization_C.EquippedItemChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Inventory_SuitComseticCustomization_C_EquippedItemChanged final
{
public:
	const class USBZCosmeticsDataAsset*           InEquippedItem;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_SuitComseticCustomization_C_EquippedItemChanged) == 0x000008, "Wrong alignment on WBP_UI_Inventory_SuitComseticCustomization_C_EquippedItemChanged");
static_assert(sizeof(WBP_UI_Inventory_SuitComseticCustomization_C_EquippedItemChanged) == 0x000008, "Wrong size on WBP_UI_Inventory_SuitComseticCustomization_C_EquippedItemChanged");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_EquippedItemChanged, InEquippedItem) == 0x000000, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_EquippedItemChanged::InEquippedItem' has a wrong offset!");

// Function WBP_UI_Inventory_SuitComseticCustomization.WBP_UI_Inventory_SuitComseticCustomization_C.OnGainedStackFocused
// 0x000C (0x000C - 0x0000)
struct WBP_UI_Inventory_SuitComseticCustomization_C_OnGainedStackFocused final
{
public:
	class FName                                   PreviousValue;                                     // 0x0000(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Inventory_SuitComseticCustomization_C_OnGainedStackFocused) == 0x000004, "Wrong alignment on WBP_UI_Inventory_SuitComseticCustomization_C_OnGainedStackFocused");
static_assert(sizeof(WBP_UI_Inventory_SuitComseticCustomization_C_OnGainedStackFocused) == 0x00000C, "Wrong size on WBP_UI_Inventory_SuitComseticCustomization_C_OnGainedStackFocused");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_OnGainedStackFocused, PreviousValue) == 0x000000, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_OnGainedStackFocused::PreviousValue' has a wrong offset!");

// Function WBP_UI_Inventory_SuitComseticCustomization.WBP_UI_Inventory_SuitComseticCustomization_C.InitializeVisuals
// 0x0130 (0x0130 - 0x0000)
struct WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals final
{
public:
	uint8                                         Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0038(0x0018)()
	class FText                                   CallFunc_GetDisplayName_OutDisplayName;            // 0x0050(0x0018)()
	bool                                          CallFunc_GetDisplayName_OutHasText;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0070(0x0040)(HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default;                             // 0x00B0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00C8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0108(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0118(0x0018)()
};
static_assert(alignof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals) == 0x000008, "Wrong alignment on WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals");
static_assert(sizeof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals) == 0x000130, "Wrong size on WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, Temp_byte_Variable) == 0x000000, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, Temp_text_Variable) == 0x000008, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, Temp_text_Variable_1) == 0x000020, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, Temp_text_Variable_2) == 0x000038, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::Temp_text_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, CallFunc_GetDisplayName_OutDisplayName) == 0x000050, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::CallFunc_GetDisplayName_OutDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, CallFunc_GetDisplayName_OutHasText) == 0x000068, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::CallFunc_GetDisplayName_OutHasText' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, K2Node_MakeStruct_FormatArgumentData) == 0x000070, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, K2Node_Select_Default) == 0x0000B0, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000C8, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, K2Node_MakeArray_Array) == 0x000108, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals, CallFunc_Format_ReturnValue) == 0x000118, "Member 'WBP_UI_Inventory_SuitComseticCustomization_C_InitializeVisuals::CallFunc_Format_ReturnValue' has a wrong offset!");

}

