#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_ItemDescriptionBox

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_ItemDescriptionBox.WBP_UI_Inventory_ItemDescriptionBox_C
// 0x0040 (0x02D0 - 0x0290)
class UWBP_UI_Inventory_ItemDescriptionBox_C final : public USBZWidgetBase
{
public:
	class UWBP_ArmorChunk_EquippedDisplay_C*      ArmorChunk_EquippedDisplay;                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Text_ItemDescription;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_ItemName;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Inventory_ItemDescription_WeaponModule_C* WBP_UI_Inventory_ItemDescription_WeaponModule_343; // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Overskill_Container_C*          WBP_UI_Inventory_OverskillBox;                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Inventory_ControlsReference_C*  Widget_ControlsReference;                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_Icon;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetInventoryItem(class USBZInventoryBaseData* InInventoryItem, const struct FSBZArmorConfig& ArmorConfig);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_ItemDescriptionBox_C">();
	}
	static class UWBP_UI_Inventory_ItemDescriptionBox_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_ItemDescriptionBox_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_ItemDescriptionBox_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_ItemDescriptionBox_C");
static_assert(sizeof(UWBP_UI_Inventory_ItemDescriptionBox_C) == 0x0002D0, "Wrong size on UWBP_UI_Inventory_ItemDescriptionBox_C");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescriptionBox_C, ArmorChunk_EquippedDisplay) == 0x000290, "Member 'UWBP_UI_Inventory_ItemDescriptionBox_C::ArmorChunk_EquippedDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescriptionBox_C, Image_Background) == 0x000298, "Member 'UWBP_UI_Inventory_ItemDescriptionBox_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescriptionBox_C, Text_ItemDescription) == 0x0002A0, "Member 'UWBP_UI_Inventory_ItemDescriptionBox_C::Text_ItemDescription' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescriptionBox_C, Text_ItemName) == 0x0002A8, "Member 'UWBP_UI_Inventory_ItemDescriptionBox_C::Text_ItemName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescriptionBox_C, WBP_UI_Inventory_ItemDescription_WeaponModule_343) == 0x0002B0, "Member 'UWBP_UI_Inventory_ItemDescriptionBox_C::WBP_UI_Inventory_ItemDescription_WeaponModule_343' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescriptionBox_C, WBP_UI_Inventory_OverskillBox) == 0x0002B8, "Member 'UWBP_UI_Inventory_ItemDescriptionBox_C::WBP_UI_Inventory_OverskillBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescriptionBox_C, Widget_ControlsReference) == 0x0002C0, "Member 'UWBP_UI_Inventory_ItemDescriptionBox_C::Widget_ControlsReference' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemDescriptionBox_C, Widget_Icon) == 0x0002C8, "Member 'UWBP_UI_Inventory_ItemDescriptionBox_C::Widget_Icon' has a wrong offset!");

}

