#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ContentPanel

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ContentPanel.WBP_ContentPanel_C
// 0x0030 (0x02C0 - 0x0290)
class UWBP_ContentPanel_C final : public UUserWidget
{
public:
	class UNamedSlot*                             Background;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             ControlReferences;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             FullScreen;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             Main;                                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             TopPanel;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PaddingLeftRight;                                  // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         PaddingTopBottom;                                  // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void UpdateSafezone();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ContentPanel_C">();
	}
	static class UWBP_ContentPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ContentPanel_C>();
	}
};
static_assert(alignof(UWBP_ContentPanel_C) == 0x000008, "Wrong alignment on UWBP_ContentPanel_C");
static_assert(sizeof(UWBP_ContentPanel_C) == 0x0002C0, "Wrong size on UWBP_ContentPanel_C");
static_assert(offsetof(UWBP_ContentPanel_C, Background) == 0x000290, "Member 'UWBP_ContentPanel_C::Background' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPanel_C, ControlReferences) == 0x000298, "Member 'UWBP_ContentPanel_C::ControlReferences' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPanel_C, FullScreen) == 0x0002A0, "Member 'UWBP_ContentPanel_C::FullScreen' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPanel_C, Main) == 0x0002A8, "Member 'UWBP_ContentPanel_C::Main' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPanel_C, TopPanel) == 0x0002B0, "Member 'UWBP_ContentPanel_C::TopPanel' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPanel_C, PaddingLeftRight) == 0x0002B8, "Member 'UWBP_ContentPanel_C::PaddingLeftRight' has a wrong offset!");
static_assert(offsetof(UWBP_ContentPanel_C, PaddingTopBottom) == 0x0002BC, "Member 'UWBP_ContentPanel_C::PaddingTopBottom' has a wrong offset!");

}

