#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_KeyItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_KeyItem.WBP_UI_Widget_KeyItem_C
// 0x0030 (0x02E0 - 0x02B0)
class UWBP_UI_Widget_KeyItem_C final : public UPD3HUDKeyItemWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ItemPickedUp;                                      // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_KeyItemAnimation;                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_KeyItemStack;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_StackCount;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         StackCount_MoveToCode_;                            // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Widget_KeyItem(int32 EntryPoint);
	void OnKeyItemDataCleared();
	void OnKeyItemCountChanged(int32 InKeyItemCount);
	void OnKeyItemPickedUp(class USBZKeyItemData* InKeyItemData, int32 InitialCount);
	void UpdateStackCount(int32 InStackCount);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_KeyItem_C">();
	}
	static class UWBP_UI_Widget_KeyItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_KeyItem_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_KeyItem_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_KeyItem_C");
static_assert(sizeof(UWBP_UI_Widget_KeyItem_C) == 0x0002E0, "Wrong size on UWBP_UI_Widget_KeyItem_C");
static_assert(offsetof(UWBP_UI_Widget_KeyItem_C, UberGraphFrame) == 0x0002B0, "Member 'UWBP_UI_Widget_KeyItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_KeyItem_C, ItemPickedUp) == 0x0002B8, "Member 'UWBP_UI_Widget_KeyItem_C::ItemPickedUp' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_KeyItem_C, Image_KeyItemAnimation) == 0x0002C0, "Member 'UWBP_UI_Widget_KeyItem_C::Image_KeyItemAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_KeyItem_C, Image_KeyItemStack) == 0x0002C8, "Member 'UWBP_UI_Widget_KeyItem_C::Image_KeyItemStack' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_KeyItem_C, Text_StackCount) == 0x0002D0, "Member 'UWBP_UI_Widget_KeyItem_C::Text_StackCount' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_KeyItem_C, StackCount_MoveToCode_) == 0x0002D8, "Member 'UWBP_UI_Widget_KeyItem_C::StackCount_MoveToCode_' has a wrong offset!");

}

