#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_WidgetDebugPing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_WidgetDebugPing.WBP_UI_WidgetDebugPing_C
// 0x0018 (0x02D0 - 0x02B8)
class UWBP_UI_WidgetDebugPing_C final : public USBZPingWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Text_PingText;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NewVar_0;                                          // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_WidgetDebugPing(int32 EntryPoint);
	void OnPingValueChanged(const int32 PingValue);
	void OnInitialized();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_WidgetDebugPing_C">();
	}
	static class UWBP_UI_WidgetDebugPing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_WidgetDebugPing_C>();
	}
};
static_assert(alignof(UWBP_UI_WidgetDebugPing_C) == 0x000008, "Wrong alignment on UWBP_UI_WidgetDebugPing_C");
static_assert(sizeof(UWBP_UI_WidgetDebugPing_C) == 0x0002D0, "Wrong size on UWBP_UI_WidgetDebugPing_C");
static_assert(offsetof(UWBP_UI_WidgetDebugPing_C, UberGraphFrame) == 0x0002B8, "Member 'UWBP_UI_WidgetDebugPing_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_WidgetDebugPing_C, Text_PingText) == 0x0002C0, "Member 'UWBP_UI_WidgetDebugPing_C::Text_PingText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_WidgetDebugPing_C, NewVar_0) == 0x0002C8, "Member 'UWBP_UI_WidgetDebugPing_C::NewVar_0' has a wrong offset!");

}

