#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_MainMenu_NetInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_MainMenu_NetInfo.WBP_MainMenu_NetInfo_C
// 0x0018 (0x02F0 - 0x02D8)
class UWBP_MainMenu_NetInfo_C final : public USBZNetInfoWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HorizontalRegionBox;                               // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             RegionValue;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_MainMenu_NetInfo(int32 EntryPoint);
	void BP_OnServerRegionChanged();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_MainMenu_NetInfo_C">();
	}
	static class UWBP_MainMenu_NetInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_MainMenu_NetInfo_C>();
	}
};
static_assert(alignof(UWBP_MainMenu_NetInfo_C) == 0x000008, "Wrong alignment on UWBP_MainMenu_NetInfo_C");
static_assert(sizeof(UWBP_MainMenu_NetInfo_C) == 0x0002F0, "Wrong size on UWBP_MainMenu_NetInfo_C");
static_assert(offsetof(UWBP_MainMenu_NetInfo_C, UberGraphFrame) == 0x0002D8, "Member 'UWBP_MainMenu_NetInfo_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_NetInfo_C, HorizontalRegionBox) == 0x0002E0, "Member 'UWBP_MainMenu_NetInfo_C::HorizontalRegionBox' has a wrong offset!");
static_assert(offsetof(UWBP_MainMenu_NetInfo_C, RegionValue) == 0x0002E8, "Member 'UWBP_MainMenu_NetInfo_C::RegionValue' has a wrong offset!");

}

