#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CheckmarkWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_CheckmarkWidget.WBP_CheckmarkWidget_C.ExecuteUbergraph_WBP_CheckmarkWidget
// 0x0018 (0x0018 - 0x0000)
struct WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget) == 0x000008, "Wrong alignment on WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget");
static_assert(sizeof(WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget) == 0x000018, "Wrong size on WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget");
static_assert(offsetof(WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget, EntryPoint) == 0x000000, "Member 'WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget, K2Node_Event_IsDesignTime) == 0x000010, "Member 'WBP_CheckmarkWidget_C_ExecuteUbergraph_WBP_CheckmarkWidget::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_CheckmarkWidget.WBP_CheckmarkWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_CheckmarkWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CheckmarkWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_CheckmarkWidget_C_PreConstruct");
static_assert(sizeof(WBP_CheckmarkWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_CheckmarkWidget_C_PreConstruct");
static_assert(offsetof(WBP_CheckmarkWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_CheckmarkWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_CheckmarkWidget.WBP_CheckmarkWidget_C.SetChecked
// 0x0006 (0x0006 - 0x0000)
struct WBP_CheckmarkWidget_C_SetChecked final
{
public:
	bool                                          InIsChecked;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_CheckmarkWidget_C_SetChecked) == 0x000001, "Wrong alignment on WBP_CheckmarkWidget_C_SetChecked");
static_assert(sizeof(WBP_CheckmarkWidget_C_SetChecked) == 0x000006, "Wrong size on WBP_CheckmarkWidget_C_SetChecked");
static_assert(offsetof(WBP_CheckmarkWidget_C_SetChecked, InIsChecked) == 0x000000, "Member 'WBP_CheckmarkWidget_C_SetChecked::InIsChecked' has a wrong offset!");
static_assert(offsetof(WBP_CheckmarkWidget_C_SetChecked, Temp_byte_Variable) == 0x000001, "Member 'WBP_CheckmarkWidget_C_SetChecked::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CheckmarkWidget_C_SetChecked, Temp_byte_Variable_1) == 0x000002, "Member 'WBP_CheckmarkWidget_C_SetChecked::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_CheckmarkWidget_C_SetChecked, Temp_bool_Variable) == 0x000003, "Member 'WBP_CheckmarkWidget_C_SetChecked::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CheckmarkWidget_C_SetChecked, K2Node_Select_Default) == 0x000004, "Member 'WBP_CheckmarkWidget_C_SetChecked::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_CheckmarkWidget_C_SetChecked, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000005, "Member 'WBP_CheckmarkWidget_C_SetChecked::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");

}

