#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PlayerDefeatState

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Widget_PlayerDefeatState.WBP_UI_Widget_PlayerDefeatState_C
// 0x00B8 (0x0350 - 0x0298)
class UWBP_UI_Widget_PlayerDefeatState_C final : public UPD3HUDPlayerDefeatStateWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       SubduedAnimation;                                  // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CuffedAnimation;                                   // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       TasedAnimation;                                    // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CustodyAnimation;                                  // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       KnockedAnimation;                                  // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             Counter_NS;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cuffed_I;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CustodyIcon_I;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Default_O;                                         // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DefeatBottomCuffed_O;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DefeatBottomCustody_O;                             // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DefeatBottomKnocked_O;                             // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DefeatBottomSubdued_O;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DefeatBottomTased_O;                               // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DefeatStateBottom_WS;                              // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               DefeatStateBottomDefault_O;                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        DefeatStateTop_WS;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 KnockedIcon_I;                                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Subdued_I;                                         // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TasedIcon_I;                                       // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EPD3DefeatState Old, EPD3DefeatState New)> OnStateChanged;         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_UI_Widget_PlayerDefeatState(int32 EntryPoint);
	void OnDefeatStateChanged(EPD3DefeatState OldState, EPD3DefeatState NewState);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Widget_PlayerDefeatState_C">();
	}
	static class UWBP_UI_Widget_PlayerDefeatState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Widget_PlayerDefeatState_C>();
	}
};
static_assert(alignof(UWBP_UI_Widget_PlayerDefeatState_C) == 0x000008, "Wrong alignment on UWBP_UI_Widget_PlayerDefeatState_C");
static_assert(sizeof(UWBP_UI_Widget_PlayerDefeatState_C) == 0x000350, "Wrong size on UWBP_UI_Widget_PlayerDefeatState_C");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, UberGraphFrame) == 0x000298, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, SubduedAnimation) == 0x0002A0, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::SubduedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, CuffedAnimation) == 0x0002A8, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::CuffedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, TasedAnimation) == 0x0002B0, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::TasedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, CustodyAnimation) == 0x0002B8, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::CustodyAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, KnockedAnimation) == 0x0002C0, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::KnockedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, Counter_NS) == 0x0002C8, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::Counter_NS' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, Cuffed_I) == 0x0002D0, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::Cuffed_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, CustodyIcon_I) == 0x0002D8, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::CustodyIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, Default_O) == 0x0002E0, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::Default_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, DefeatBottomCuffed_O) == 0x0002E8, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::DefeatBottomCuffed_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, DefeatBottomCustody_O) == 0x0002F0, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::DefeatBottomCustody_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, DefeatBottomKnocked_O) == 0x0002F8, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::DefeatBottomKnocked_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, DefeatBottomSubdued_O) == 0x000300, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::DefeatBottomSubdued_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, DefeatBottomTased_O) == 0x000308, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::DefeatBottomTased_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, DefeatStateBottom_WS) == 0x000310, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::DefeatStateBottom_WS' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, DefeatStateBottomDefault_O) == 0x000318, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::DefeatStateBottomDefault_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, DefeatStateTop_WS) == 0x000320, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::DefeatStateTop_WS' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, KnockedIcon_I) == 0x000328, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::KnockedIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, Subdued_I) == 0x000330, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::Subdued_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, TasedIcon_I) == 0x000338, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::TasedIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Widget_PlayerDefeatState_C, OnStateChanged) == 0x000340, "Member 'UWBP_UI_Widget_PlayerDefeatState_C::OnStateChanged' has a wrong offset!");

}

