#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_BlackMarketVendorButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_BlackMarketVendorButton.WBP_UI_MainMenu_BlackMarketVendorButton_C
// 0x0060 (0x03D0 - 0x0370)
class UWBP_UI_MainMenu_BlackMarketVendorButton_C final : public USBZBlackMarketVendorButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_Background;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Highlight_1;                                 // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Highlight_2;                                 // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Highlight_3;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Highlight_4;                                 // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_IsActive;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_VendorIcon;                                  // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Highlight;                                 // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Widget;                                    // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_VendorName;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UThrobber*                              Throbber_ImageLoader;                              // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_BlackMarketVendorButton(int32 EntryPoint);
	void OnActiveVendorSet(bool bInIsActiveVendor);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnInitialized();
	void OnVendorDataInitialized(const class USBZVendorData* InVendorData);
	void PreConstruct(bool IsDesignTime);
	void OnLoaded_6B23B8934B1A0D62B1E7C882C71AC4AA(class UObject* Loaded);
	void OnHoverChanged(bool bIsHovered);
	void OnFocusedChanged(bool bIsFocused);
	void RefreshVisuals();
	void InitIcon(class UPaperSprite* NewParam);
	void SetNameColour(const struct FLinearColor& InColor);
	void OnActiveChanged(bool bIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_BlackMarketVendorButton_C">();
	}
	static class UWBP_UI_MainMenu_BlackMarketVendorButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_BlackMarketVendorButton_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_BlackMarketVendorButton_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_BlackMarketVendorButton_C");
static_assert(sizeof(UWBP_UI_MainMenu_BlackMarketVendorButton_C) == 0x0003D0, "Wrong size on UWBP_UI_MainMenu_BlackMarketVendorButton_C");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, UberGraphFrame) == 0x000370, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Image_Background) == 0x000378, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Image_Highlight_1) == 0x000380, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Image_Highlight_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Image_Highlight_2) == 0x000388, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Image_Highlight_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Image_Highlight_3) == 0x000390, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Image_Highlight_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Image_Highlight_4) == 0x000398, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Image_Highlight_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Image_IsActive) == 0x0003A0, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Image_IsActive' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Image_VendorIcon) == 0x0003A8, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Image_VendorIcon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Overlay_Highlight) == 0x0003B0, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Overlay_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Overlay_Widget) == 0x0003B8, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Overlay_Widget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Text_VendorName) == 0x0003C0, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Text_VendorName' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_BlackMarketVendorButton_C, Throbber_ImageLoader) == 0x0003C8, "Member 'UWBP_UI_MainMenu_BlackMarketVendorButton_C::Throbber_ImageLoader' has a wrong offset!");

}

