#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_KeyboardBindingButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_Settings_KeyboardBindingButton.WBP_Settings_KeyboardBindingButton_C
// 0x0048 (0x04C0 - 0x0478)
class UWBP_Settings_KeyboardBindingButton_C final : public USBZSettingsButtonKeyboardBinding
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Border_Image;                                      // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Warning;                                     // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputKeySelector*                      InputKeySelector_PrimaryKey;                       // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputKeySelector*                      InputKeySelector_SecondaryKey;                     // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SBZInputKeySelector_C*             SBZInputKeySelector_PrimaryKey;                    // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_SBZInputKeySelector_C*             SBZInputKeySelector_SecondaryKey;                  // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SettingName;                                  // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_Settings_KeyboardBindingButton(int32 EntryPoint);
	void BndEvt__WBP_Settings_KeyboardBindingButton_SBZInputKeySelector_PrimaryKey_K2Node_ComponentBoundEvent_1_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void BndEvt__WBP_Settings_KeyboardBindingButton_WBP_SBZInputKeySelector_154_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void BndEvt__WBP_Settings_KeyboardBindingButton_InputKeySelector_PrimaryKey_K2Node_ComponentBoundEvent_3_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void BndEvt__WBP_Settings_KeyboardBindingButton_InputKeySelector_SecondaryKey_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void SettingChanged();
	void SelectionNameChanged();
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RefreshVisuals();
	void OnHoverVisuals(bool bIsHovered);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void InitializeVisuals();
	void UpdateSettingNameText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_Settings_KeyboardBindingButton_C">();
	}
	static class UWBP_Settings_KeyboardBindingButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_Settings_KeyboardBindingButton_C>();
	}
};
static_assert(alignof(UWBP_Settings_KeyboardBindingButton_C) == 0x000008, "Wrong alignment on UWBP_Settings_KeyboardBindingButton_C");
static_assert(sizeof(UWBP_Settings_KeyboardBindingButton_C) == 0x0004C0, "Wrong size on UWBP_Settings_KeyboardBindingButton_C");
static_assert(offsetof(UWBP_Settings_KeyboardBindingButton_C, UberGraphFrame) == 0x000478, "Member 'UWBP_Settings_KeyboardBindingButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_KeyboardBindingButton_C, Border_Image) == 0x000480, "Member 'UWBP_Settings_KeyboardBindingButton_C::Border_Image' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_KeyboardBindingButton_C, Image_Background) == 0x000488, "Member 'UWBP_Settings_KeyboardBindingButton_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_KeyboardBindingButton_C, Image_Warning) == 0x000490, "Member 'UWBP_Settings_KeyboardBindingButton_C::Image_Warning' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_KeyboardBindingButton_C, InputKeySelector_PrimaryKey) == 0x000498, "Member 'UWBP_Settings_KeyboardBindingButton_C::InputKeySelector_PrimaryKey' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_KeyboardBindingButton_C, InputKeySelector_SecondaryKey) == 0x0004A0, "Member 'UWBP_Settings_KeyboardBindingButton_C::InputKeySelector_SecondaryKey' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_KeyboardBindingButton_C, SBZInputKeySelector_PrimaryKey) == 0x0004A8, "Member 'UWBP_Settings_KeyboardBindingButton_C::SBZInputKeySelector_PrimaryKey' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_KeyboardBindingButton_C, SBZInputKeySelector_SecondaryKey) == 0x0004B0, "Member 'UWBP_Settings_KeyboardBindingButton_C::SBZInputKeySelector_SecondaryKey' has a wrong offset!");
static_assert(offsetof(UWBP_Settings_KeyboardBindingButton_C, Text_SettingName) == 0x0004B8, "Member 'UWBP_Settings_KeyboardBindingButton_C::Text_SettingName' has a wrong offset!");

}

