#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Results_Reward_WeaponProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Results_Reward_WeaponProgress.WBP_UI_Results_Reward_WeaponProgress_C.ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress
// 0x0170 (0x0170 - 0x0000)
struct WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0014)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0040(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0080(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x00F8(0x0018)()
	class USBZBaseWeaponData*                     K2Node_DynamicCast_AsSBZBase_Weapon_Data;          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Tooltip_C*                         CallFunc_Create_ReturnValue;                       // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x013C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue_1;                 // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0148(0x0028)()
};
static_assert(alignof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress");
static_assert(sizeof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress) == 0x000170, "Wrong size on WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, EntryPoint) == 0x000000, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, Temp_object_Variable) == 0x000008, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_CustomEvent_Loaded) == 0x000018, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000020, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_Event_IsDesignTime) == 0x00003C, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_MakeStruct_FormatArgumentData) == 0x000040, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_MakeStruct_FormatArgumentData_1) == 0x000080, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_MakeArray_Array) == 0x0000C0, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_MakeArray_Array_1) == 0x0000D0, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_Format_ReturnValue_1) == 0x0000F8, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_DynamicCast_AsSBZBase_Weapon_Data) == 0x000110, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_DynamicCast_AsSBZBase_Weapon_Data' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_DynamicCast_bSuccess) == 0x000118, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_IsValid_ReturnValue_1) == 0x000119, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_Create_ReturnValue) == 0x000120, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000128, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x00012C, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000130, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_Conv_IntToFloat_ReturnValue_2) == 0x000134, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_Conv_IntToFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_Conv_IntToFloat_ReturnValue_3) == 0x000138, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_Conv_IntToFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_SafeDivide_ReturnValue) == 0x00013C, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_SafeDivide_ReturnValue_1) == 0x000140, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, CallFunc_SelectFloat_ReturnValue) == 0x000144, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress, K2Node_MakeStruct_SlateColor) == 0x000148, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ExecuteUbergraph_WBP_UI_Results_Reward_WeaponProgress::K2Node_MakeStruct_SlateColor' has a wrong offset!");

// Function WBP_UI_Results_Reward_WeaponProgress.WBP_UI_Results_Reward_WeaponProgress_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Results_Reward_WeaponProgress_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Results_Reward_WeaponProgress_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Results_Reward_WeaponProgress_C_PreConstruct");
static_assert(sizeof(WBP_UI_Results_Reward_WeaponProgress_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Results_Reward_WeaponProgress_C_PreConstruct");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Results_Reward_WeaponProgress.WBP_UI_Results_Reward_WeaponProgress_C.OnLoaded_BE567583454F8E94170EB98A814612C2
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Results_Reward_WeaponProgress_C_OnLoaded_BE567583454F8E94170EB98A814612C2 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Results_Reward_WeaponProgress_C_OnLoaded_BE567583454F8E94170EB98A814612C2) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_WeaponProgress_C_OnLoaded_BE567583454F8E94170EB98A814612C2");
static_assert(sizeof(WBP_UI_Results_Reward_WeaponProgress_C_OnLoaded_BE567583454F8E94170EB98A814612C2) == 0x000008, "Wrong size on WBP_UI_Results_Reward_WeaponProgress_C_OnLoaded_BE567583454F8E94170EB98A814612C2");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_OnLoaded_BE567583454F8E94170EB98A814612C2, Loaded) == 0x000000, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_OnLoaded_BE567583454F8E94170EB98A814612C2::Loaded' has a wrong offset!");

// Function WBP_UI_Results_Reward_WeaponProgress.WBP_UI_Results_Reward_WeaponProgress_C.PlayAppearAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Results_Reward_WeaponProgress_C_PlayAppearAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Results_Reward_WeaponProgress_C_PlayAppearAnim) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_WeaponProgress_C_PlayAppearAnim");
static_assert(sizeof(WBP_UI_Results_Reward_WeaponProgress_C_PlayAppearAnim) == 0x000008, "Wrong size on WBP_UI_Results_Reward_WeaponProgress_C_PlayAppearAnim");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_PlayAppearAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_PlayAppearAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

// Function WBP_UI_Results_Reward_WeaponProgress.WBP_UI_Results_Reward_WeaponProgress_C.AddModUnlocks
// 0x0050 (0x0050 - 0x0000)
struct WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0014)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Results_Reward_InventoryReward_C* CallFunc_Create_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class USBZWeaponPartDataAsset*          CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks");
static_assert(sizeof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks) == 0x000050, "Wrong size on WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, CallFunc_Create_ReturnValue) == 0x000028, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, CallFunc_Array_Add_ReturnValue) == 0x000030, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, CallFunc_Array_Length_ReturnValue) == 0x000034, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, CallFunc_Greater_IntInt_ReturnValue) == 0x000040, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, CallFunc_Array_Length_ReturnValue_1) == 0x000044, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AddModUnlocks::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_Results_Reward_WeaponProgress.WBP_UI_Results_Reward_WeaponProgress_C.ShowMods
// 0x0058 (0x0058 - 0x0000)
struct WBP_UI_Results_Reward_WeaponProgress_C_ShowMods final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Results_Reward_InventoryReward_C* CallFunc_Array_Get_Item;                         // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_WeaponProgress_C_ShowMods");
static_assert(sizeof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods) == 0x000058, "Wrong size on WBP_UI_Results_Reward_WeaponProgress_C_ShowMods");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, Temp_int_Variable) == 0x000024, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, CallFunc_Array_Get_Item) == 0x000028, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, K2Node_MakeStruct_Margin) == 0x000030, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::K2Node_MakeStruct_Margin' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000040, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, CallFunc_Play2DSound_ReturnValue) == 0x00004C, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_ShowMods, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_ShowMods::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_UI_Results_Reward_WeaponProgress.WBP_UI_Results_Reward_WeaponProgress_C.AnimateBarsAndText
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText");
static_assert(sizeof(WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText) == 0x000030, "Wrong size on WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText, CallFunc_Subtract_IntInt_ReturnValue) == 0x000020, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000028, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_AnimateBarsAndText::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");

// Function WBP_UI_Results_Reward_WeaponProgress.WBP_UI_Results_Reward_WeaponProgress_C.PlayLevelUpAnim
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Results_Reward_WeaponProgress_C_PlayLevelUpAnim final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Results_Reward_WeaponProgress_C_PlayLevelUpAnim) == 0x000008, "Wrong alignment on WBP_UI_Results_Reward_WeaponProgress_C_PlayLevelUpAnim");
static_assert(sizeof(WBP_UI_Results_Reward_WeaponProgress_C_PlayLevelUpAnim) == 0x000008, "Wrong size on WBP_UI_Results_Reward_WeaponProgress_C_PlayLevelUpAnim");
static_assert(offsetof(WBP_UI_Results_Reward_WeaponProgress_C_PlayLevelUpAnim, CallFunc_PlayAnimationForward_ReturnValue) == 0x000000, "Member 'WBP_UI_Results_Reward_WeaponProgress_C_PlayLevelUpAnim::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");

}

