#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_TextButton_02

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_TextButton_02.WBP_UI_TextButton_02_C
// 0x0080 (0x03E0 - 0x0360)
class UWBP_UI_TextButton_02_C final : public USBZMenuButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       DisabledSelectedAnimation;                         // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       SelectedAnimation;                                 // 0x0370(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_BorderButton;                                // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Button;                                    // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_DisplayText;                                  // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   DefaultTextValue;                                  // 0x0398(0x0018)(Edit, BlueprintVisible)
	struct FVector2D                              InititalSize;                                      // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FontSize;                                          // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Font_Family;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UObject*                                Font_Material;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   Typeface;                                          // 0x03D0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_TextButton_02(int32 EntryPoint);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonSelected();
	void DisabledButtonSelected();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnHoverVisuals(bool bIsHovered);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void RefreshVisual();
	void SetButtonText(const class FText& InButtonText);
	void ResetToDefaultButtonText();
	void GetText(class FText* OutText);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_TextButton_02_C">();
	}
	static class UWBP_UI_TextButton_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_TextButton_02_C>();
	}
};
static_assert(alignof(UWBP_UI_TextButton_02_C) == 0x000008, "Wrong alignment on UWBP_UI_TextButton_02_C");
static_assert(sizeof(UWBP_UI_TextButton_02_C) == 0x0003E0, "Wrong size on UWBP_UI_TextButton_02_C");
static_assert(offsetof(UWBP_UI_TextButton_02_C, UberGraphFrame) == 0x000360, "Member 'UWBP_UI_TextButton_02_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, DisabledSelectedAnimation) == 0x000368, "Member 'UWBP_UI_TextButton_02_C::DisabledSelectedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, SelectedAnimation) == 0x000370, "Member 'UWBP_UI_TextButton_02_C::SelectedAnimation' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, Image_Background) == 0x000378, "Member 'UWBP_UI_TextButton_02_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, Image_BorderButton) == 0x000380, "Member 'UWBP_UI_TextButton_02_C::Image_BorderButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, Overlay_Button) == 0x000388, "Member 'UWBP_UI_TextButton_02_C::Overlay_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, Text_DisplayText) == 0x000390, "Member 'UWBP_UI_TextButton_02_C::Text_DisplayText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, DefaultTextValue) == 0x000398, "Member 'UWBP_UI_TextButton_02_C::DefaultTextValue' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, InititalSize) == 0x0003B0, "Member 'UWBP_UI_TextButton_02_C::InititalSize' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, FontSize) == 0x0003B8, "Member 'UWBP_UI_TextButton_02_C::FontSize' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, Font_Family) == 0x0003C0, "Member 'UWBP_UI_TextButton_02_C::Font_Family' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, Font_Material) == 0x0003C8, "Member 'UWBP_UI_TextButton_02_C::Font_Material' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TextButton_02_C, Typeface) == 0x0003D0, "Member 'UWBP_UI_TextButton_02_C::Typeface' has a wrong offset!");

}

