#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Tooltip

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Tooltip.WBP_Tooltip_C.InitData
// 0x0030 (0x0030 - 0x0000)
struct WBP_Tooltip_C_InitData final
{
public:
	class USBZInventoryBaseData*                  InData;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZSkillData*                          K2Node_DynamicCast_AsSBZSkill_Data;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetFormattedDescriptionText_ReturnValue;  // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Tooltip_C_InitData) == 0x000008, "Wrong alignment on WBP_Tooltip_C_InitData");
static_assert(sizeof(WBP_Tooltip_C_InitData) == 0x000030, "Wrong size on WBP_Tooltip_C_InitData");
static_assert(offsetof(WBP_Tooltip_C_InitData, InData) == 0x000000, "Member 'WBP_Tooltip_C_InitData::InData' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitData, K2Node_DynamicCast_AsSBZSkill_Data) == 0x000008, "Member 'WBP_Tooltip_C_InitData::K2Node_DynamicCast_AsSBZSkill_Data' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitData, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_Tooltip_C_InitData::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitData, CallFunc_GetFormattedDescriptionText_ReturnValue) == 0x000018, "Member 'WBP_Tooltip_C_InitData::CallFunc_GetFormattedDescriptionText_ReturnValue' has a wrong offset!");

// Function WBP_Tooltip.WBP_Tooltip_C.InitText
// 0x0040 (0x0040 - 0x0000)
struct WBP_Tooltip_C_InitText final
{
public:
	class FText                                   InName;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   InDescription;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	bool                                          IsDescription;                                     // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsName;                                            // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0036(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0037(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Tooltip_C_InitText) == 0x000008, "Wrong alignment on WBP_Tooltip_C_InitText");
static_assert(sizeof(WBP_Tooltip_C_InitText) == 0x000040, "Wrong size on WBP_Tooltip_C_InitText");
static_assert(offsetof(WBP_Tooltip_C_InitText, InName) == 0x000000, "Member 'WBP_Tooltip_C_InitText::InName' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, InDescription) == 0x000018, "Member 'WBP_Tooltip_C_InitText::InDescription' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, IsDescription) == 0x000030, "Member 'WBP_Tooltip_C_InitText::IsDescription' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, IsName) == 0x000031, "Member 'WBP_Tooltip_C_InitText::IsName' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, Temp_byte_Variable) == 0x000032, "Member 'WBP_Tooltip_C_InitText::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, Temp_byte_Variable_1) == 0x000033, "Member 'WBP_Tooltip_C_InitText::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, Temp_bool_Variable) == 0x000034, "Member 'WBP_Tooltip_C_InitText::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, Temp_byte_Variable_2) == 0x000035, "Member 'WBP_Tooltip_C_InitText::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, Temp_byte_Variable_3) == 0x000036, "Member 'WBP_Tooltip_C_InitText::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, CallFunc_BooleanAND_ReturnValue) == 0x000037, "Member 'WBP_Tooltip_C_InitText::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, K2Node_Select_Default) == 0x000038, "Member 'WBP_Tooltip_C_InitText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, CallFunc_TextIsEmpty_ReturnValue) == 0x000039, "Member 'WBP_Tooltip_C_InitText::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, CallFunc_TextIsEmpty_ReturnValue_1) == 0x00003A, "Member 'WBP_Tooltip_C_InitText::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, Temp_bool_Variable_1) == 0x00003B, "Member 'WBP_Tooltip_C_InitText::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Tooltip_C_InitText, K2Node_Select_Default_1) == 0x00003C, "Member 'WBP_Tooltip_C_InitText::K2Node_Select_Default_1' has a wrong offset!");

}

