#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_HUD_Chat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.ExecuteUbergraph_WBP_UI_HUD_Chat
// 0x02B0 (0x02B0 - 0x0000)
struct WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_JoinedPlayerName;                     // 0x0008(0x0018)(ConstParm)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_1;                // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0080(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bHasFocus;                            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x00B0(0x0018)()
	int32                                         CallFunc_Play2DSound_ReturnValue_2;                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00D0(0x0018)(ConstParm)
	int32                                         CallFunc_Play2DSound_ReturnValue_3;                // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Len_ReturnValue;                          // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetSubstring_ReturnValue;                 // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0118(0x0018)()
	int32                                         CallFunc_Play2DSound_ReturnValue_4;                // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsDisabled;                          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13A[0x6];                                      // 0x013A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerChatEvent                    K2Node_Event_ChatEventData_3;                      // 0x0140(0x0018)(ConstParm)
	int32                                         CallFunc_Play2DSound_ReturnValue_5;                // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_6;                // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSBZVotingChatEvent                    K2Node_Event_ChatEventData_2;                      // 0x0160(0x0010)(ConstParm)
	struct FSBZPlayerDefeatStateChangedData       K2Node_Event_InData_1;                             // 0x0170(0x0010)(ConstParm, NoDestructor)
	struct FSBZAICrewDefeatStateChangedData       K2Node_Event_InData;                               // 0x0180(0x0010)(ConstParm, NoDestructor)
	struct FSBZPlayerPingEvent                    K2Node_Event_PingEventData;                        // 0x0190(0x0010)(ConstParm, NoDestructor, ContainsInstancedReference)
	struct FSBZAICrewChatEvent                    K2Node_Event_ChatEventData_1;                      // 0x01A0(0x0018)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B9[0x7];                                      // 0x01B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZSystemChatEvent                    K2Node_Event_ChatEventData;                        // 0x01C0(0x0010)(ConstParm)
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x01D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D2[0x6];                                      // 0x01D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZKeyItemCountChangedEvent           K2Node_Event_KeyItemCountChangedEventData;         // 0x01D8(0x0030)(ConstParm, NoDestructor)
	struct FSBZPlayerCallEvent                    K2Node_Event_CallEventData;                        // 0x0208(0x0010)(ConstParm, NoDestructor)
	struct FSBZPlayerStateRemovedEvent            K2Node_Event_PlayerStateRemovedData;               // 0x0218(0x0040)(ConstParm)
	struct FSBZPlayerChatEvent                    K2Node_MakeStruct_SBZPlayerChatEvent;              // 0x0258(0x0018)()
	int32                                         CallFunc_Play2DSound_ReturnValue_7;                // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable_1;                              // 0x0278(0x0018)()
	int32                                         CallFunc_Play2DSound_ReturnValue_8;                // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0298(0x0018)()
};
static_assert(alignof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat");
static_assert(sizeof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat) == 0x0002B0, "Wrong size on WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, EntryPoint) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_JoinedPlayerName) == 0x000008, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_JoinedPlayerName' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue) == 0x000020, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_1) == 0x000024, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_MyGeometry) == 0x000028, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_InDeltaTime) == 0x000060, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000064, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000068, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Format_ReturnValue) == 0x000080, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Conv_TextToString_ReturnValue) == 0x000098, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_bHasFocus) == 0x0000A8, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_bHasFocus' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, Temp_text_Variable) == 0x0000B0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::Temp_text_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_2) == 0x0000C8, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_ComponentBoundEvent_Text) == 0x0000D0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_3) == 0x0000E8, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Conv_TextToString_ReturnValue_1) == 0x0000F0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Len_ReturnValue) == 0x000100, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Len_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Greater_IntInt_ReturnValue) == 0x000104, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_GetSubstring_ReturnValue) == 0x000108, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_GetSubstring_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Conv_StringToText_ReturnValue) == 0x000118, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_4) == 0x000130, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Subtract_IntInt_ReturnValue) == 0x000134, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000138, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_bIsDisabled) == 0x000139, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_bIsDisabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_ChatEventData_3) == 0x000140, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_ChatEventData_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_5) == 0x000158, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_6) == 0x00015C, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_ChatEventData_2) == 0x000160, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_ChatEventData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_InData_1) == 0x000170, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_InData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_InData) == 0x000180, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_InData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_PingEventData) == 0x000190, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_PingEventData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_ChatEventData_1) == 0x0001A0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_ChatEventData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_TextIsEmpty_ReturnValue) == 0x0001B8, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_ChatEventData) == 0x0001C0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_ChatEventData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0001D0, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_BooleanAND_ReturnValue) == 0x0001D1, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_KeyItemCountChangedEventData) == 0x0001D8, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_KeyItemCountChangedEventData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_CallEventData) == 0x000208, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_CallEventData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Event_PlayerStateRemovedData) == 0x000218, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Event_PlayerStateRemovedData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_MakeStruct_SBZPlayerChatEvent) == 0x000258, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_MakeStruct_SBZPlayerChatEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_7) == 0x000270, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, Temp_text_Variable_1) == 0x000278, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::Temp_text_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, CallFunc_Play2DSound_ReturnValue_8) == 0x000290, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::CallFunc_Play2DSound_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, Temp_bool_Variable) == 0x000294, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat, K2Node_Select_Default) == 0x000298, "Member 'WBP_UI_HUD_Chat_C_ExecuteUbergraph_WBP_UI_HUD_Chat::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnPlayerJoinedTheHeist
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnPlayerJoinedTheHeist final
{
public:
	class FText                                   JoinedPlayerName;                                  // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnPlayerJoinedTheHeist) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_OnPlayerJoinedTheHeist");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnPlayerJoinedTheHeist) == 0x000018, "Wrong size on WBP_UI_HUD_Chat_C_OnPlayerJoinedTheHeist");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnPlayerJoinedTheHeist, JoinedPlayerName) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnPlayerJoinedTheHeist::JoinedPlayerName' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnPlayerStateRemoved
// 0x0040 (0x0040 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnPlayerStateRemoved final
{
public:
	struct FSBZPlayerStateRemovedEvent            PlayerStateRemovedData;                            // 0x0000(0x0040)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnPlayerStateRemoved) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_OnPlayerStateRemoved");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnPlayerStateRemoved) == 0x000040, "Wrong size on WBP_UI_HUD_Chat_C_OnPlayerStateRemoved");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnPlayerStateRemoved, PlayerStateRemovedData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnPlayerStateRemoved::PlayerStateRemovedData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.CallReceived
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_CallReceived final
{
public:
	struct FSBZPlayerCallEvent                    CallEventData;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_CallReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_CallReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_CallReceived) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_CallReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_CallReceived, CallEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_CallReceived::CallEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.KeyItemCountChanged
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_HUD_Chat_C_KeyItemCountChanged final
{
public:
	struct FSBZKeyItemCountChangedEvent           KeyItemCountChangedEventData;                      // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_KeyItemCountChanged) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_KeyItemCountChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_KeyItemCountChanged) == 0x000030, "Wrong size on WBP_UI_HUD_Chat_C_KeyItemCountChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_KeyItemCountChanged, KeyItemCountChangedEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_KeyItemCountChanged::KeyItemCountChangedEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.SystemMessageReceived
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_SystemMessageReceived final
{
public:
	struct FSBZSystemChatEvent                    ChatEventData;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_SystemMessageReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_SystemMessageReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_SystemMessageReceived) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_SystemMessageReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_SystemMessageReceived, ChatEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_SystemMessageReceived::ChatEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.CrewAIMessageReceived
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_Chat_C_CrewAIMessageReceived final
{
public:
	struct FSBZAICrewChatEvent                    ChatEventData;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_CrewAIMessageReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_CrewAIMessageReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_CrewAIMessageReceived) == 0x000018, "Wrong size on WBP_UI_HUD_Chat_C_CrewAIMessageReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_CrewAIMessageReceived, ChatEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_CrewAIMessageReceived::ChatEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.PingReceived
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_PingReceived final
{
public:
	struct FSBZPlayerPingEvent                    PingEventData;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_PingReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_PingReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_PingReceived) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_PingReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_PingReceived, PingEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_PingReceived::PingEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnAICrewDefeatStateChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged final
{
public:
	struct FSBZAICrewDefeatStateChangedData       InData;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged, InData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnAICrewDefeatStateChanged::InData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnPlayerDefeatStateChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged final
{
public:
	struct FSBZPlayerDefeatStateChangedData       InData;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged, InData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnPlayerDefeatStateChanged::InData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.VotingMessageReceived
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_HUD_Chat_C_VotingMessageReceived final
{
public:
	struct FSBZVotingChatEvent                    ChatEventData;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_VotingMessageReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_VotingMessageReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_VotingMessageReceived) == 0x000010, "Wrong size on WBP_UI_HUD_Chat_C_VotingMessageReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_VotingMessageReceived, ChatEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_VotingMessageReceived::ChatEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.PlayerMessageReceived
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_Chat_C_PlayerMessageReceived final
{
public:
	struct FSBZPlayerChatEvent                    ChatEventData;                                     // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_PlayerMessageReceived) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_PlayerMessageReceived");
static_assert(sizeof(WBP_UI_HUD_Chat_C_PlayerMessageReceived) == 0x000018, "Wrong size on WBP_UI_HUD_Chat_C_PlayerMessageReceived");
static_assert(offsetof(WBP_UI_HUD_Chat_C_PlayerMessageReceived, ChatEventData) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_PlayerMessageReceived::ChatEventData' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnChatDisabledChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnChatDisabledChanged final
{
public:
	bool                                          bIsDisabled;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnChatDisabledChanged) == 0x000001, "Wrong alignment on WBP_UI_HUD_Chat_C_OnChatDisabledChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnChatDisabledChanged) == 0x000001, "Wrong size on WBP_UI_HUD_Chat_C_OnChatDisabledChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnChatDisabledChanged, bIsDisabled) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnChatDisabledChanged::bIsDisabled' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(sizeof(WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature) == 0x000018, "Wrong size on WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature");
static_assert(offsetof(WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature, Text) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_BndEvt__WBP_UI_HUD_Chat_Text_InputText_K2Node_ComponentBoundEvent_0_OnEditableTextBoxChangedEvent__DelegateSignature::Text' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.OnChatFocusChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_HUD_Chat_C_OnChatFocusChanged final
{
public:
	bool                                          bHasFocus;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_OnChatFocusChanged) == 0x000001, "Wrong alignment on WBP_UI_HUD_Chat_C_OnChatFocusChanged");
static_assert(sizeof(WBP_UI_HUD_Chat_C_OnChatFocusChanged) == 0x000001, "Wrong size on WBP_UI_HUD_Chat_C_OnChatFocusChanged");
static_assert(offsetof(WBP_UI_HUD_Chat_C_OnChatFocusChanged, bHasFocus) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_OnChatFocusChanged::bHasFocus' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_UI_HUD_Chat_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_HUD_Chat_C_Tick) == 0x000004, "Wrong alignment on WBP_UI_HUD_Chat_C_Tick");
static_assert(sizeof(WBP_UI_HUD_Chat_C_Tick) == 0x00003C, "Wrong size on WBP_UI_HUD_Chat_C_Tick");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_UI_HUD_Chat_C_Tick::InDeltaTime' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.Process Player Message
// 0x0250 (0x0250 - 0x0000)
struct WBP_UI_HUD_Chat_C_Process_Player_Message final
{
public:
	struct FSBZPlayerChatEvent                    InMessageChat;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FString                                 Message;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0028(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0040)(HasGetValueTypeHash)
	class ASBZPlayerState*                        K2Node_DynamicCast_AsSBZPlayer_State;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x00E8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0150(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0168(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x01A8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01B8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01D0(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0210(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0220(0x0018)()
	class FText                                   CallFunc_GetShortenText_ReturnValue;               // 0x0238(0x0018)()
};
static_assert(alignof(WBP_UI_HUD_Chat_C_Process_Player_Message) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_Process_Player_Message");
static_assert(sizeof(WBP_UI_HUD_Chat_C_Process_Player_Message) == 0x000250, "Wrong size on WBP_UI_HUD_Chat_C_Process_Player_Message");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, InMessageChat) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::InMessageChat' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, Message) == 0x000018, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::Message' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, CallFunc_GetText_ReturnValue) == 0x000028, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_DynamicCast_AsSBZPlayer_State) == 0x0000D8, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_DynamicCast_AsSBZPlayer_State' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x0000E8, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_MakeArray_Array) == 0x000140, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, CallFunc_Format_ReturnValue) == 0x000150, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_MakeStruct_FormatArgumentData_3) == 0x000168, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_MakeArray_Array_1) == 0x0001A8, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, CallFunc_Format_ReturnValue_1) == 0x0001B8, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001D0, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, K2Node_MakeArray_Array_2) == 0x000210, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, CallFunc_Format_ReturnValue_2) == 0x000220, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_Process_Player_Message, CallFunc_GetShortenText_ReturnValue) == 0x000238, "Member 'WBP_UI_HUD_Chat_C_Process_Player_Message::CallFunc_GetShortenText_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.ProcessPing
// 0x0398 (0x0398 - 0x0000)
struct WBP_UI_HUD_Chat_C_ProcessPing final
{
public:
	struct FSBZPlayerPingEvent                    PIngEvent;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
	int32                                         Lineindex;                                         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0018(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0058(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00A0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00B0(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue_1;                // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ASBZPlayerState*                        K2Node_DynamicCast_AsSBZPlayer_State;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x00E0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0140(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0150(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0168(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0180(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0198(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01D8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0218(0x0010)(ReferenceParm)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0228(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0268(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0290(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x02A8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x02C0(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0300(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0318(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0358(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x0368(0x0018)()
	class FText                                   CallFunc_GetShortenText_ReturnValue;               // 0x0380(0x0018)()
};
static_assert(alignof(WBP_UI_HUD_Chat_C_ProcessPing) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_ProcessPing");
static_assert(sizeof(WBP_UI_HUD_Chat_C_ProcessPing) == 0x000398, "Wrong size on WBP_UI_HUD_Chat_C_ProcessPing");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, PIngEvent) == 0x000000, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::PIngEvent' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, Lineindex) == 0x000010, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::Lineindex' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, Temp_bool_Variable) == 0x000014, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, Temp_bool_Variable_1) == 0x000015, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeStruct_FormatArgumentData) == 0x000018, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeStruct_FormatArgumentData_1) == 0x000058, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_TextIsEmpty_ReturnValue) == 0x000098, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeArray_Array) == 0x0000A0, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_Format_ReturnValue) == 0x0000B0, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_TextIsEmpty_ReturnValue_1) == 0x0000C8, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_TextIsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_DynamicCast_AsSBZPlayer_State) == 0x0000D0, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_DynamicCast_AsSBZPlayer_State' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_GetPlayerDisplayName_ReturnValue) == 0x0000E0, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_GetPlayerDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeStruct_FormatArgumentData_2) == 0x000100, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeArray_Array_1) == 0x000140, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_MakeLiteralText_ReturnValue) == 0x000150, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_Format_ReturnValue_1) == 0x000168, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_Select_Default) == 0x000180, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeStruct_FormatArgumentData_3) == 0x000198, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeStruct_FormatArgumentData_4) == 0x0001D8, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeStruct_FormatArgumentData_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeArray_Array_2) == 0x000218, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeStruct_FormatArgumentData_5) == 0x000228, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeStruct_FormatArgumentData_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_Format_ReturnValue_2) == 0x000268, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeArray_Array_3) == 0x000280, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_Format_ReturnValue_3) == 0x000290, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_Format_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_Select_Default_1) == 0x0002A8, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeStruct_FormatArgumentData_6) == 0x0002C0, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeStruct_FormatArgumentData_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_GetText_ReturnValue) == 0x000300, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeStruct_FormatArgumentData_7) == 0x000318, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeStruct_FormatArgumentData_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, K2Node_MakeArray_Array_4) == 0x000358, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_Format_ReturnValue_4) == 0x000368, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_Format_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_HUD_Chat_C_ProcessPing, CallFunc_GetShortenText_ReturnValue) == 0x000380, "Member 'WBP_UI_HUD_Chat_C_ProcessPing::CallFunc_GetShortenText_ReturnValue' has a wrong offset!");

// Function WBP_UI_HUD_Chat.WBP_UI_HUD_Chat_C.ProcessKeyItemPickUp
// 0x0420 (0x0420 - 0x0000)
struct WBP_UI_HUD_Chat_C_ProcessKeyItemPickUp final
{
public:
	struct FSBZKeyItemCountChangedEvent           InKeyItemEvent;                                    // 0x0000(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ReferenceParm)
	bool                                          Temp_bool_Variable;                                // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0048(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0068(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0088(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00A8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00E8(0x0040)(HasGetValueTypeHash)
	class ASBZPlayerState*                        K2Node_DynamicCast_AsSBZPlayer_State;              // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPlayerDisplayName_ReturnValue;         // 0x0138(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0150(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_1;                          // 0x0190(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x01A0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x01B8(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_4;            // 0x01F8(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x0238(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0248(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x0258(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_3;                     // 0x0270(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_5;            // 0x0288(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_6;            // 0x02C8(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0308(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_7;            // 0x0320(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_8;            // 0x0360(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x03A0(0x0010)(ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_5;                          // 0x03B0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_4;                     // 0x03C0(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_5;                     // 0x03D8(0x0018)()
	class FText                                   CallFunc_GetShortenText_ReturnValue;               // 0x03F0(0x0018)()
	class FText                                   CallFunc_GetShortenText_ReturnValue_1;             // 0x0408(0x0018)()
};
static_assert(alignof(WBP_UI_HUD_Chat_C_ProcessKeyItemPickUp) == 0x000008, "Wrong alignment on WBP_UI_HUD_Chat_C_ProcessKeyItemPickUp");
