#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Settings_HelperPanel_ButtonDescription

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_Settings_HelperPanel_ButtonDescription.WBP_Settings_HelperPanel_ButtonDescription_C.ExecuteUbergraph_WBP_Settings_HelperPanel_ButtonDescription
// 0x0004 (0x0004 - 0x0000)
struct WBP_Settings_HelperPanel_ButtonDescription_C_ExecuteUbergraph_WBP_Settings_HelperPanel_ButtonDescription final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Settings_HelperPanel_ButtonDescription_C_ExecuteUbergraph_WBP_Settings_HelperPanel_ButtonDescription) == 0x000004, "Wrong alignment on WBP_Settings_HelperPanel_ButtonDescription_C_ExecuteUbergraph_WBP_Settings_HelperPanel_ButtonDescription");
static_assert(sizeof(WBP_Settings_HelperPanel_ButtonDescription_C_ExecuteUbergraph_WBP_Settings_HelperPanel_ButtonDescription) == 0x000004, "Wrong size on WBP_Settings_HelperPanel_ButtonDescription_C_ExecuteUbergraph_WBP_Settings_HelperPanel_ButtonDescription");
static_assert(offsetof(WBP_Settings_HelperPanel_ButtonDescription_C_ExecuteUbergraph_WBP_Settings_HelperPanel_ButtonDescription, EntryPoint) == 0x000000, "Member 'WBP_Settings_HelperPanel_ButtonDescription_C_ExecuteUbergraph_WBP_Settings_HelperPanel_ButtonDescription::EntryPoint' has a wrong offset!");

// Function WBP_Settings_HelperPanel_ButtonDescription.WBP_Settings_HelperPanel_ButtonDescription_C.UpdatePanelDescriptions
// 0x0003 (0x0003 - 0x0000)
struct WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions final
{
public:
	ESlateVisibility                              CallFunc_GetVisibility_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions) == 0x000001, "Wrong alignment on WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions");
static_assert(sizeof(WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions) == 0x000003, "Wrong size on WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions");
static_assert(offsetof(WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions, CallFunc_GetVisibility_ReturnValue) == 0x000000, "Member 'WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions::CallFunc_GetVisibility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000001, "Member 'WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WBP_Settings_HelperPanel_ButtonDescription_C_UpdatePanelDescriptions::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_Settings_HelperPanel_ButtonDescription.WBP_Settings_HelperPanel_ButtonDescription_C.ButtonFocusChanged
// 0x0010 (0x0010 - 0x0000)
struct WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged final
{
public:
	class USBZSettingsButton*                     Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFocused;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged) == 0x000008, "Wrong alignment on WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged");
static_assert(sizeof(WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged) == 0x000010, "Wrong size on WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged");
static_assert(offsetof(WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged, Button) == 0x000000, "Member 'WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged::Button' has a wrong offset!");
static_assert(offsetof(WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged, IsFocused) == 0x000008, "Member 'WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged::IsFocused' has a wrong offset!");
static_assert(offsetof(WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_Settings_HelperPanel_ButtonDescription_C_ButtonFocusChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

