#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_SharedHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_SharedHUD.WBP_UI_SharedHUD_C
// 0x0040 (0x02D0 - 0x0290)
class UWBP_UI_SharedHUD_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URetainerBox*                           HUDGlitchRetainer;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_HeistState_C*            Widget_HeistState;                                 // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_MarkerContainer_C*       Widget_MarkerContainer;                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_ObjectiveContainer_C*    Widget_ObjectiveContainer;                         // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_HUD_Overlay_C*                  Widget_Overlay;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_PartyContainerWidget_C*  Widget_PartyWidget;                                // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Widget_Timer_C*                 Widget_Timer;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_SharedHUD(int32 EntryPoint);
	void OnInitialized();
	void SetFullHUD(bool bIsFullHUD);
	void SetHUDOverlayActive(bool bIsActive);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_SharedHUD_C">();
	}
	static class UWBP_UI_SharedHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_SharedHUD_C>();
	}
};
static_assert(alignof(UWBP_UI_SharedHUD_C) == 0x000008, "Wrong alignment on UWBP_UI_SharedHUD_C");
static_assert(sizeof(UWBP_UI_SharedHUD_C) == 0x0002D0, "Wrong size on UWBP_UI_SharedHUD_C");
static_assert(offsetof(UWBP_UI_SharedHUD_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_SharedHUD_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SharedHUD_C, HUDGlitchRetainer) == 0x000298, "Member 'UWBP_UI_SharedHUD_C::HUDGlitchRetainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SharedHUD_C, Widget_HeistState) == 0x0002A0, "Member 'UWBP_UI_SharedHUD_C::Widget_HeistState' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SharedHUD_C, Widget_MarkerContainer) == 0x0002A8, "Member 'UWBP_UI_SharedHUD_C::Widget_MarkerContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SharedHUD_C, Widget_ObjectiveContainer) == 0x0002B0, "Member 'UWBP_UI_SharedHUD_C::Widget_ObjectiveContainer' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SharedHUD_C, Widget_Overlay) == 0x0002B8, "Member 'UWBP_UI_SharedHUD_C::Widget_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SharedHUD_C, Widget_PartyWidget) == 0x0002C0, "Member 'UWBP_UI_SharedHUD_C::Widget_PartyWidget' has a wrong offset!");
static_assert(offsetof(UWBP_UI_SharedHUD_C, Widget_Timer) == 0x0002C8, "Member 'UWBP_UI_SharedHUD_C::Widget_Timer' has a wrong offset!");

}

