#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_Menu_1

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_Menu_1.WBP_Menu_1_C.ExecuteUbergraph_WBP_Menu_1
// 0x0030 (0x0030 - 0x0000)
struct WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_NewParam_1;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_NewParam;                       // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
};
static_assert(alignof(WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1) == 0x000008, "Wrong alignment on WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1");
static_assert(sizeof(WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1) == 0x000030, "Wrong size on WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1");
static_assert(offsetof(WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1, EntryPoint) == 0x000000, "Member 'WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1, K2Node_CustomEvent_NewParam_1) == 0x000004, "Member 'WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1::K2Node_CustomEvent_NewParam_1' has a wrong offset!");
static_assert(offsetof(WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1, K2Node_CustomEvent_NewParam) == 0x000008, "Member 'WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WBP_Menu_1_C_ExecuteUbergraph_WBP_Menu_1::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function WBP_Menu_1.WBP_Menu_1_C.Set Numbers
// 0x0010 (0x0010 - 0x0000)
struct WBP_Menu_1_C_Set_Numbers final
{
public:
	class FString                                 NewParam;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Menu_1_C_Set_Numbers) == 0x000008, "Wrong alignment on WBP_Menu_1_C_Set_Numbers");
static_assert(sizeof(WBP_Menu_1_C_Set_Numbers) == 0x000010, "Wrong size on WBP_Menu_1_C_Set_Numbers");
static_assert(offsetof(WBP_Menu_1_C_Set_Numbers, NewParam) == 0x000000, "Member 'WBP_Menu_1_C_Set_Numbers::NewParam' has a wrong offset!");

// Function WBP_Menu_1.WBP_Menu_1_C.SetBackFocus
// 0x0001 (0x0001 - 0x0000)
struct WBP_Menu_1_C_SetBackFocus final
{
public:
	bool                                          NewParam;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_Menu_1_C_SetBackFocus) == 0x000001, "Wrong alignment on WBP_Menu_1_C_SetBackFocus");
static_assert(sizeof(WBP_Menu_1_C_SetBackFocus) == 0x000001, "Wrong size on WBP_Menu_1_C_SetBackFocus");
static_assert(offsetof(WBP_Menu_1_C_SetBackFocus, NewParam) == 0x000000, "Member 'WBP_Menu_1_C_SetBackFocus::NewParam' has a wrong offset!");

}

