#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Preplanning_MainMenu_LoadoutButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Preplanning_MainMenu_LoadoutButton.WBP_UI_Preplanning_MainMenu_LoadoutButton_C.ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton
// 0x02C8 (0x02C8 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable;                              // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsWidgetActuallyVisible_ReturnValue;      // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_1;                            // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         Temp_object_Variable_1;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_2;                            // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_3;                            // 0x0054(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_4;                            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_5;                            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              Temp_struct_Variable_6;                            // 0x007C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Temp_struct_Variable_7;                            // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_8;                            // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActivePlayerLoadoutIndex_ReturnValue;  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue; // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue;  // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSBZPlayerLoadoutConfig                K2Node_Event_NewPlayerLoadout;                     // 0x00B0(0x0098)(ConstParm)
	int32                                         K2Node_Event_NewActiveLoadoutIndex;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsGamepad;                           // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_1; // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalClientReady_ReturnValue;           // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x015C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15D[0x3];                                      // 0x015D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_2; // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalClientReady_ReturnValue_1;         // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_165[0x3];                                      // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x016C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x016D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InVisibility;           // 0x016E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x016F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x0170(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_3;           // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_179[0x3];                                      // 0x0179(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_9;                            // 0x017C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default;                             // 0x01B4(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_Select_Default_1;                           // 0x01C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CC[0x4];                                      // 0x01CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_Select_Default_2;                           // 0x01DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_5;                              // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E5[0x3];                                      // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_3;                           // 0x01E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZBaseMenuWidget*                     CallFunc_GetMenuWidget_ReturnValue;                // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMainMenuWidget*                     K2Node_DynamicCast_AsSBZMain_Menu_Widget;          // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           Temp_struct_Variable_10;                           // 0x020C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_3; // 0x021C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Temp_struct_Variable_11;                           // 0x0220(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x0230(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         K2Node_Select_Default_4;                           // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default_5;                           // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_6;                              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_Select_Default_6;                           // 0x025C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_26C[0x4];                                      // 0x026C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZLoadoutManager*                     CallFunc_GetLoadoutManager_ReturnValue;            // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_4; // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue_1; // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESBZMetaRequestResult                         CallFunc_SetActiveLoadoutIndex_ReturnValue;        // 0x0285(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_286[0x2];                                      // 0x0286(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_2;                            // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_7;                              // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         Temp_object_Variable_3;                            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_8;                              // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x02A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A2[0x6];                                      // 0x02A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZColorStyle*                         K2Node_Select_Default_7;                           // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue;            // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOverlaySlot*                           CallFunc_SlotAsOverlaySlot_ReturnValue_1;          // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasKeyboardFocus_ReturnValue;             // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x02C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_8;                           // 0x02C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInputTypeController_ReturnValue;        // 0x02C5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x02C6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton) == 0x0002C8, "Wrong size on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, EntryPoint) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable) == 0x000004, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_IsWidgetActuallyVisible_ReturnValue) == 0x000014, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_IsWidgetActuallyVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_1) == 0x000018, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_bool_Variable) == 0x000028, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_object_Variable) == 0x000030, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_object_Variable_1) == 0x000038, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_bool_Variable_1) == 0x000040, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_2) == 0x000044, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_3) == 0x000054, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_bool_Variable_2) == 0x000064, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_4) == 0x000068, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_5) == 0x000070, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_bool_Variable_3) == 0x000078, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_6) == 0x00007C, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_7) == 0x000084, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_bool_Variable_4) == 0x00008C, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_8) == 0x000090, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_GetActivePlayerLoadoutIndex_ReturnValue) == 0x0000A0, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_GetActivePlayerLoadoutIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue) == 0x0000A4, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue) == 0x0000A8, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A9, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Event_NewPlayerLoadout) == 0x0000B0, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Event_NewPlayerLoadout' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Event_NewActiveLoadoutIndex) == 0x000148, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Event_NewActiveLoadoutIndex' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Event_bIsGamepad) == 0x00014C, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Event_bIsGamepad' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_1) == 0x000150, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_IsLocalClientReady_ReturnValue) == 0x000154, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_IsLocalClientReady_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_Add_IntInt_ReturnValue) == 0x000158, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_Not_PreBool_ReturnValue) == 0x00015C, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_2) == 0x000160, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_IsLocalClientReady_ReturnValue_1) == 0x000164, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_IsLocalClientReady_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_Subtract_IntInt_ReturnValue) == 0x000168, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_Not_PreBool_ReturnValue_1) == 0x00016C, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Event_IsDesignTime) == 0x00016D, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_InVisibility) == 0x00016E, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00016F, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_Button_7) == 0x000170, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_bIsEnabled_3) == 0x000178, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_bIsEnabled_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_9) == 0x00017C, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_Button_6) == 0x000190, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_Button_5) == 0x000198, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_Button_4) == 0x0001A0, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_Button_3) == 0x0001A8, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x0001B0, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Select_Default) == 0x0001B4, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Select_Default_1) == 0x0001C4, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_Button_2) == 0x0001D0, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x0001D8, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Select_Default_2) == 0x0001DC, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_bool_Variable_5) == 0x0001E4, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_bool_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Select_Default_3) == 0x0001E8, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_GetMenuWidget_ReturnValue) == 0x0001F8, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_GetMenuWidget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_DynamicCast_AsSBZMain_Menu_Widget) == 0x000200, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_DynamicCast_AsSBZMain_Menu_Widget' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_10) == 0x00020C, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_3) == 0x00021C, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_struct_Variable_11) == 0x000220, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_struct_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_Button_1) == 0x000230, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_bIsEnabled) == 0x000238, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Select_Default_4) == 0x000240, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Select_Default_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Select_Default_5) == 0x000248, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Select_Default_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_bool_Variable_6) == 0x000258, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_bool_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Select_Default_6) == 0x00025C, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Select_Default_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_ComponentBoundEvent_Button) == 0x000270, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_GetLoadoutManager_ReturnValue) == 0x000278, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_GetLoadoutManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_4) == 0x000280, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_GetFocusedPlayerLoadoutIndex_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue_1) == 0x000284, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_IsFocusedPlayerLoadoutValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_SetActiveLoadoutIndex_ReturnValue) == 0x000285, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_SetActiveLoadoutIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_object_Variable_2) == 0x000288, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_bool_Variable_7) == 0x000290, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_bool_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_object_Variable_3) == 0x000298, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_bool_Variable_8) == 0x0002A0, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_bool_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_byte_Variable) == 0x0002A1, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Select_Default_7) == 0x0002A8, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Select_Default_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_SlotAsOverlaySlot_ReturnValue) == 0x0002B0, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_SlotAsOverlaySlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_SlotAsOverlaySlot_ReturnValue_1) == 0x0002B8, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_SlotAsOverlaySlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_HasKeyboardFocus_ReturnValue) == 0x0002C0, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_HasKeyboardFocus_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_IsValid_ReturnValue) == 0x0002C1, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, Temp_byte_Variable_1) == 0x0002C2, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, K2Node_Select_Default_8) == 0x0002C3, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::K2Node_Select_Default_8' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_IsValid_ReturnValue_1) == 0x0002C4, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_IsInputTypeController_ReturnValue) == 0x0002C5, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_IsInputTypeController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton, CallFunc_Not_PreBool_ReturnValue_2) == 0x0002C6, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_ExecuteUbergraph_WBP_UI_Preplanning_MainMenu_LoadoutButton::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_LoadoutButton.WBP_UI_Preplanning_MainMenu_LoadoutButton_C.BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_LoadoutButton.WBP_UI_Preplanning_MainMenu_LoadoutButton_C.BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_SetActive_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_LoadoutButton.WBP_UI_Preplanning_MainMenu_LoadoutButton_C.BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavLeft_B_K2Node_ComponentBoundEvent_16_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_LoadoutButton.WBP_UI_Preplanning_MainMenu_LoadoutButton_C.BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_15_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_UI_Preplanning_MainMenu_LoadoutButton.WBP_UI_Preplanning_MainMenu_LoadoutButton_C.BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_UI_Preplanning_MainMenu_LoadoutButton_C_BndEvt__WBP_UI_Preplanning_MainMenu_LoadoutButton_NavRight_B_K2Node_ComponentBoundEvent_13_OnMenuButtonSelected__DelegateSignature");
