#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Inventory_ItemSlotButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Inventory_ItemSlotButton.WBP_UI_Inventory_ItemSlotButton_C
// 0x00A8 (0x0430 - 0x0388)
class UWBP_UI_Inventory_ItemSlotButton_C final : public USBZMainMenuInventoryItemSlotButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HoverAnim;                                         // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         ArmorChunks_Hb;                                    // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_Highlight;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Chunk1_I;                                          // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Chunk2_I;                                          // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Chunk3_I;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Chunk4_I;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               EquippedB;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_147;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        InfamyLevelReqText;                                // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockedBackground;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Button;                                    // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Locked;                                    // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_PurchaseWeapon;                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Overskill_Level_C*              Overskill_Level;                                   // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Plus_Icon;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        TextBlock_Name;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_InventoryBaseData_Icon_C*          Widget_Icon;                                       // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZInventoryBaseData*                  InventoryItem;                                     // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEmpty;                                          // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_Inventory_ItemSlotButton(int32 EntryPoint);
	void OnItemDataInitialized();
	void SetActiveItem(bool bIsActiveItem);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	void OnHover(bool bIsHovered);
	void OnFocused(bool bIsFocused);
	void InitializeItemVisuals(class USBZInventoryBaseData* InInventoryData);
	void SetItemNameColour(const struct FLinearColor& DesiredColour);
	void RefreshVisuals();
	void SetArmorChunkImages(class USBZArmorData* ArmorData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Inventory_ItemSlotButton_C">();
	}
	static class UWBP_UI_Inventory_ItemSlotButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Inventory_ItemSlotButton_C>();
	}
};
static_assert(alignof(UWBP_UI_Inventory_ItemSlotButton_C) == 0x000008, "Wrong alignment on UWBP_UI_Inventory_ItemSlotButton_C");
static_assert(sizeof(UWBP_UI_Inventory_ItemSlotButton_C) == 0x000430, "Wrong size on UWBP_UI_Inventory_ItemSlotButton_C");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, UberGraphFrame) == 0x000388, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, HoverAnim) == 0x000390, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::HoverAnim' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, ArmorChunks_Hb) == 0x000398, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::ArmorChunks_Hb' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Border_Highlight) == 0x0003A0, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Border_Highlight' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Chunk1_I) == 0x0003A8, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Chunk1_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Chunk2_I) == 0x0003B0, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Chunk2_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Chunk3_I) == 0x0003B8, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Chunk3_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Chunk4_I) == 0x0003C0, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Chunk4_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, EquippedB) == 0x0003C8, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::EquippedB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Image_147) == 0x0003D0, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Image_147' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, InfamyLevelReqText) == 0x0003D8, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::InfamyLevelReqText' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, LockedBackground) == 0x0003E0, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::LockedBackground' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Overlay_Button) == 0x0003E8, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Overlay_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Overlay_Locked) == 0x0003F0, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Overlay_Locked' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Overlay_PurchaseWeapon) == 0x0003F8, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Overlay_PurchaseWeapon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Overskill_Level) == 0x000400, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Overskill_Level' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Plus_Icon) == 0x000408, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Plus_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, TextBlock_Name) == 0x000410, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::TextBlock_Name' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, Widget_Icon) == 0x000418, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::Widget_Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, InventoryItem) == 0x000420, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::InventoryItem' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Inventory_ItemSlotButton_C, bIsEmpty) == 0x000428, "Member 'UWBP_UI_Inventory_ItemSlotButton_C::bIsEmpty' has a wrong offset!");

}

