#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_PagerWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_PagerWidget.WBP_UI_PagerWidget_C
// 0x0048 (0x02D8 - 0x0290)
class UWBP_UI_PagerWidget_C final : public UPD3HUDPagerWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Updated;                                           // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_BG;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ProgressBar;                                 // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Radio;                                       // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NumberOfRadios;                                    // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          OnRadioUsagesSpent;                                // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Material;                                          // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHeistInStealth;                                  // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_UI_PagerWidget(int32 EntryPoint);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void OnHeistStateChanged(EPD3HeistState NewState);
	void OnAnswerPagerValueChanged(int32 AnswerPagerValue, int32 MaxAnswerPagerValue);
	void UpdatePagerStatus(int32 InPagerCount, int32 InPagerMax);
	void CreateMaterial();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_PagerWidget_C">();
	}
	static class UWBP_UI_PagerWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_PagerWidget_C>();
	}
};
static_assert(alignof(UWBP_UI_PagerWidget_C) == 0x000008, "Wrong alignment on UWBP_UI_PagerWidget_C");
static_assert(sizeof(UWBP_UI_PagerWidget_C) == 0x0002D8, "Wrong size on UWBP_UI_PagerWidget_C");
static_assert(offsetof(UWBP_UI_PagerWidget_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_PagerWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_C, Updated) == 0x000298, "Member 'UWBP_UI_PagerWidget_C::Updated' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_C, Image_BG) == 0x0002A0, "Member 'UWBP_UI_PagerWidget_C::Image_BG' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_C, Image_ProgressBar) == 0x0002A8, "Member 'UWBP_UI_PagerWidget_C::Image_ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_C, Image_Radio) == 0x0002B0, "Member 'UWBP_UI_PagerWidget_C::Image_Radio' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_C, NumberOfRadios) == 0x0002B8, "Member 'UWBP_UI_PagerWidget_C::NumberOfRadios' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_C, OnRadioUsagesSpent) == 0x0002C0, "Member 'UWBP_UI_PagerWidget_C::OnRadioUsagesSpent' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_C, Material) == 0x0002C8, "Member 'UWBP_UI_PagerWidget_C::Material' has a wrong offset!");
static_assert(offsetof(UWBP_UI_PagerWidget_C, IsHeistInStealth) == 0x0002D0, "Member 'UWBP_UI_PagerWidget_C::IsHeistInStealth' has a wrong offset!");

}

