#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_TutorialPopUpBody

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_TutorialPopUpBody.WBP_UI_TutorialPopUpBody_C
// 0x0020 (0x02E0 - 0x02C0)
class UWBP_UI_TutorialPopUpBody_C final : public USBZTutorialPopUpBody
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_TutorialImage;                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZScrollBox*                          SBZScrollBox_Content;                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_TutorialDescription;                          // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_TutorialPopUpBody(int32 EntryPoint);
	void OnTutorialPopUpInitialized(const class USBZTutorialPopUpDataAsset* InPopUpDataAsset);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_TutorialPopUpBody_C">();
	}
	static class UWBP_UI_TutorialPopUpBody_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_TutorialPopUpBody_C>();
	}
};
static_assert(alignof(UWBP_UI_TutorialPopUpBody_C) == 0x000008, "Wrong alignment on UWBP_UI_TutorialPopUpBody_C");
static_assert(sizeof(UWBP_UI_TutorialPopUpBody_C) == 0x0002E0, "Wrong size on UWBP_UI_TutorialPopUpBody_C");
static_assert(offsetof(UWBP_UI_TutorialPopUpBody_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UI_TutorialPopUpBody_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TutorialPopUpBody_C, Image_TutorialImage) == 0x0002C8, "Member 'UWBP_UI_TutorialPopUpBody_C::Image_TutorialImage' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TutorialPopUpBody_C, SBZScrollBox_Content) == 0x0002D0, "Member 'UWBP_UI_TutorialPopUpBody_C::SBZScrollBox_Content' has a wrong offset!");
static_assert(offsetof(UWBP_UI_TutorialPopUpBody_C, Text_TutorialDescription) == 0x0002D8, "Member 'UWBP_UI_TutorialPopUpBody_C::Text_TutorialDescription' has a wrong offset!");

}

