#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_MainMenu_ActionControlReference

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_MainMenu_ActionControlReference.WBP_UI_MainMenu_ActionControlReference_C
// 0x0070 (0x0380 - 0x0310)
class UWBP_UI_MainMenu_ActionControlReference_C final : public USBZControlsReferenceActionWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0310(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_ReferenceBorder;                             // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundIdleColor;                               // 0x0320(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BackgroundHoverColor;                              // 0x0330(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextIdleColor;                                     // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           TextHoverColor;                                    // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BorderIdleColor;                                   // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BorderHoverColor;                                  // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_MainMenu_ActionControlReference(int32 EntryPoint);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnHover(bool bIsHovered);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_MainMenu_ActionControlReference_C">();
	}
	static class UWBP_UI_MainMenu_ActionControlReference_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_MainMenu_ActionControlReference_C>();
	}
};
static_assert(alignof(UWBP_UI_MainMenu_ActionControlReference_C) == 0x000008, "Wrong alignment on UWBP_UI_MainMenu_ActionControlReference_C");
static_assert(sizeof(UWBP_UI_MainMenu_ActionControlReference_C) == 0x000380, "Wrong size on UWBP_UI_MainMenu_ActionControlReference_C");
static_assert(offsetof(UWBP_UI_MainMenu_ActionControlReference_C, UberGraphFrame) == 0x000310, "Member 'UWBP_UI_MainMenu_ActionControlReference_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_ActionControlReference_C, Image_ReferenceBorder) == 0x000318, "Member 'UWBP_UI_MainMenu_ActionControlReference_C::Image_ReferenceBorder' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_ActionControlReference_C, BackgroundIdleColor) == 0x000320, "Member 'UWBP_UI_MainMenu_ActionControlReference_C::BackgroundIdleColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_ActionControlReference_C, BackgroundHoverColor) == 0x000330, "Member 'UWBP_UI_MainMenu_ActionControlReference_C::BackgroundHoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_ActionControlReference_C, TextIdleColor) == 0x000340, "Member 'UWBP_UI_MainMenu_ActionControlReference_C::TextIdleColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_ActionControlReference_C, TextHoverColor) == 0x000350, "Member 'UWBP_UI_MainMenu_ActionControlReference_C::TextHoverColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_ActionControlReference_C, BorderIdleColor) == 0x000360, "Member 'UWBP_UI_MainMenu_ActionControlReference_C::BorderIdleColor' has a wrong offset!");
static_assert(offsetof(UWBP_UI_MainMenu_ActionControlReference_C, BorderHoverColor) == 0x000370, "Member 'UWBP_UI_MainMenu_ActionControlReference_C::BorderHoverColor' has a wrong offset!");

}

