#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_PlayerStatusWidget

#include "Basic.hpp"

#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_PlayerStatusWidget.WBP_UI_Widget_PlayerStatusWidget_C.ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               Temp_byte_Variable_2;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               Temp_byte_Variable_3;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPD3GameIntensityAnalyzer*              CallFunc_GetGameIntensityAnalyzer_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_Event_InNewHeisterIcon;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1; // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	EPD3DefeatState                               K2Node_CustomEvent_Old;                            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               K2Node_CustomEvent_New;                            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPD3DefeatState Old, EPD3DefeatState New)> K2Node_CreateDelegate_OutputDelegate;  // 0x0044(0x0014)(ZeroConstructor, NoDestructor)
	class UWBP_UI_Widget_PlayerDefeatState_C*     K2Node_DynamicCast_AsWBP_UI_Widget_Player_Defeat_State; // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_PlayerDefeatState_C*     K2Node_DynamicCast_AsWBP_UI_Widget_Player_Defeat_State_1; // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_73[0x5];                                       // 0x0073(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default;                             // 0x0078(0x0028)()
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_Select_Default_2;                           // 0x00A8(0x0028)()
};
static_assert(alignof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget) == 0x000008, "Wrong alignment on WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget");
static_assert(sizeof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget) == 0x0000D0, "Wrong size on WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, Temp_byte_Variable) == 0x000004, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, Temp_byte_Variable_2) == 0x000006, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, Temp_byte_Variable_3) == 0x000007, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, CallFunc_GetGameIntensityAnalyzer_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::CallFunc_GetGameIntensityAnalyzer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_Event_InNewHeisterIcon) == 0x000010, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_Event_InNewHeisterIcon' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000018, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1) == 0x000030, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_CustomEvent_Old) == 0x000040, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_CustomEvent_Old' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_CustomEvent_New) == 0x000041, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_CustomEvent_New' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000044, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_DynamicCast_AsWBP_UI_Widget_Player_Defeat_State) == 0x000058, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_DynamicCast_AsWBP_UI_Widget_Player_Defeat_State' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_DynamicCast_AsWBP_UI_Widget_Player_Defeat_State_1) == 0x000068, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_DynamicCast_AsWBP_UI_Widget_Player_Defeat_State_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_DynamicCast_bSuccess_1) == 0x000070, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_Event_IsDesignTime) == 0x000071, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, Temp_bool_Variable) == 0x000072, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_Select_Default) == 0x000078, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_Select_Default_1) == 0x0000A0, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget, K2Node_Select_Default_2) == 0x0000A8, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_ExecuteUbergraph_WBP_UI_Widget_PlayerStatusWidget::K2Node_Select_Default_2' has a wrong offset!");

// Function WBP_UI_Widget_PlayerStatusWidget.WBP_UI_Widget_PlayerStatusWidget_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_PlayerStatusWidget_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_PlayerStatusWidget_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_PlayerStatusWidget_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_PlayerStatusWidget_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_PlayerStatusWidget_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_PlayerStatusWidget.WBP_UI_Widget_PlayerStatusWidget_C.OnStateChanged
// 0x0002 (0x0002 - 0x0000)
struct WBP_UI_Widget_PlayerStatusWidget_C_OnStateChanged final
{
public:
	EPD3DefeatState                               Old;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPD3DefeatState                               New;                                               // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PlayerStatusWidget_C_OnStateChanged) == 0x000001, "Wrong alignment on WBP_UI_Widget_PlayerStatusWidget_C_OnStateChanged");
static_assert(sizeof(WBP_UI_Widget_PlayerStatusWidget_C_OnStateChanged) == 0x000002, "Wrong size on WBP_UI_Widget_PlayerStatusWidget_C_OnStateChanged");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_OnStateChanged, Old) == 0x000000, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_OnStateChanged::Old' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_OnStateChanged, New) == 0x000001, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_OnStateChanged::New' has a wrong offset!");

// Function WBP_UI_Widget_PlayerStatusWidget.WBP_UI_Widget_PlayerStatusWidget_C.OnHeisterIconChangedEvent
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_PlayerStatusWidget_C_OnHeisterIconChangedEvent final
{
public:
	class UPaperSprite*                           InNewHeisterIcon;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PlayerStatusWidget_C_OnHeisterIconChangedEvent) == 0x000008, "Wrong alignment on WBP_UI_Widget_PlayerStatusWidget_C_OnHeisterIconChangedEvent");
static_assert(sizeof(WBP_UI_Widget_PlayerStatusWidget_C_OnHeisterIconChangedEvent) == 0x000008, "Wrong size on WBP_UI_Widget_PlayerStatusWidget_C_OnHeisterIconChangedEvent");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_OnHeisterIconChangedEvent, InNewHeisterIcon) == 0x000000, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_OnHeisterIconChangedEvent::InNewHeisterIcon' has a wrong offset!");

// Function WBP_UI_Widget_PlayerStatusWidget.WBP_UI_Widget_PlayerStatusWidget_C.SetEOSProdUID
// 0x0018 (0x0018 - 0x0000)
struct WBP_UI_Widget_PlayerStatusWidget_C_SetEOSProdUID final
{
public:
	class ASBZPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEOSProductUserId_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_PlayerStatusWidget_C_SetEOSProdUID) == 0x000008, "Wrong alignment on WBP_UI_Widget_PlayerStatusWidget_C_SetEOSProdUID");
static_assert(sizeof(WBP_UI_Widget_PlayerStatusWidget_C_SetEOSProdUID) == 0x000018, "Wrong size on WBP_UI_Widget_PlayerStatusWidget_C_SetEOSProdUID");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_SetEOSProdUID, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000000, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_SetEOSProdUID::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_PlayerStatusWidget_C_SetEOSProdUID, CallFunc_GetEOSProductUserId_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_PlayerStatusWidget_C_SetEOSProdUID::CallFunc_GetEOSProductUserId_ReturnValue' has a wrong offset!");

}

