#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Results_Reward_SkillProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Results_Reward_SkillProgress.WBP_UI_Results_Reward_SkillProgress_C
// 0x00B8 (0x0348 - 0x0290)
class UWBP_UI_Results_Reward_SkillProgress_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unlocked;                                          // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Research;                                          // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Frame;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ExpPoints_T;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_403;                                         // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_511;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ProgressBarAnimate_C*           ProgressBar;                                       // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Research_O;                                        // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SkillName_T;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Unlocked_T;                                        // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NumberCounter_C*                   WBP_XpDiff;                                        // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZSkill*                              Skill;                                             // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         ExperienceDiff;                                    // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsResearch;                                        // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WBP_UI_Results_Reward_SkillProgress(int32 EntryPoint);
	void PlayLevelUpAnimation();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnLoaded_4365A4A44829CA194ACBEB912D0DDA4C(class UObject* Loaded);
	void SetProgress();
	void PlayAppearAnim();
	void AnimateBarsAndText();
	void GetExperienceValues(bool IncludeExpDiff, int32* CurrentExp, int32* TargetExp);
	void SequenceEvent__ENTRYPOINTWBP_UI_Results_Reward_SkillProgress_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Results_Reward_SkillProgress_C">();
	}
	static class UWBP_UI_Results_Reward_SkillProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Results_Reward_SkillProgress_C>();
	}
};
static_assert(alignof(UWBP_UI_Results_Reward_SkillProgress_C) == 0x000008, "Wrong alignment on UWBP_UI_Results_Reward_SkillProgress_C");
static_assert(sizeof(UWBP_UI_Results_Reward_SkillProgress_C) == 0x000348, "Wrong size on UWBP_UI_Results_Reward_SkillProgress_C");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, FadeIn) == 0x000298, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Unlocked) == 0x0002A0, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Unlocked' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Research) == 0x0002A8, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Research' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Border_Frame) == 0x0002B0, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Border_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, ExpPoints_T) == 0x0002B8, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::ExpPoints_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Icon) == 0x0002C0, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Image) == 0x0002C8, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Image_1) == 0x0002D0, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Image_1' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Image_2) == 0x0002D8, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Image_2' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Image_3) == 0x0002E0, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Image_3' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Image_4) == 0x0002E8, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Image_4' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Image_5) == 0x0002F0, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Image_5' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Image_6) == 0x0002F8, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Image_6' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Image_403) == 0x000300, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Image_403' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Image_511) == 0x000308, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Image_511' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, ProgressBar) == 0x000310, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Research_O) == 0x000318, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Research_O' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, SkillName_T) == 0x000320, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::SkillName_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Unlocked_T) == 0x000328, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Unlocked_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, WBP_XpDiff) == 0x000330, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::WBP_XpDiff' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, Skill) == 0x000338, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::Skill' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, ExperienceDiff) == 0x000340, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::ExperienceDiff' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_SkillProgress_C, IsResearch) == 0x000344, "Member 'UWBP_UI_Results_Reward_SkillProgress_C::IsResearch' has a wrong offset!");

}

