#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_MaskOnNotification

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_MaskOnNotification.WBP_UI_Widget_MaskOnNotification_C.ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InProgress;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInIsPuttingOnMask;                   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification) == 0x000004, "Wrong alignment on WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification");
static_assert(sizeof(WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification) == 0x000010, "Wrong size on WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification");
static_assert(offsetof(WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification, K2Node_Event_InProgress) == 0x000004, "Member 'WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification::K2Node_Event_InProgress' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification, Temp_bool_Variable) == 0x000008, "Member 'WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification, Temp_byte_Variable) == 0x000009, "Member 'WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification, Temp_byte_Variable_1) == 0x00000A, "Member 'WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification, K2Node_Event_bInIsPuttingOnMask) == 0x00000B, "Member 'WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification::K2Node_Event_bInIsPuttingOnMask' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification, K2Node_Select_Default) == 0x00000C, "Member 'WBP_UI_Widget_MaskOnNotification_C_ExecuteUbergraph_WBP_UI_Widget_MaskOnNotification::K2Node_Select_Default' has a wrong offset!");

// Function WBP_UI_Widget_MaskOnNotification.WBP_UI_Widget_MaskOnNotification_C.OnProgressChanged
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_Widget_MaskOnNotification_C_OnProgressChanged final
{
public:
	float                                         InProgress;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_MaskOnNotification_C_OnProgressChanged) == 0x000004, "Wrong alignment on WBP_UI_Widget_MaskOnNotification_C_OnProgressChanged");
static_assert(sizeof(WBP_UI_Widget_MaskOnNotification_C_OnProgressChanged) == 0x000004, "Wrong size on WBP_UI_Widget_MaskOnNotification_C_OnProgressChanged");
static_assert(offsetof(WBP_UI_Widget_MaskOnNotification_C_OnProgressChanged, InProgress) == 0x000000, "Member 'WBP_UI_Widget_MaskOnNotification_C_OnProgressChanged::InProgress' has a wrong offset!");

// Function WBP_UI_Widget_MaskOnNotification.WBP_UI_Widget_MaskOnNotification_C.MaskOnChanged
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_MaskOnNotification_C_MaskOnChanged final
{
public:
	bool                                          bInIsPuttingOnMask;                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_MaskOnNotification_C_MaskOnChanged) == 0x000001, "Wrong alignment on WBP_UI_Widget_MaskOnNotification_C_MaskOnChanged");
static_assert(sizeof(WBP_UI_Widget_MaskOnNotification_C_MaskOnChanged) == 0x000001, "Wrong size on WBP_UI_Widget_MaskOnNotification_C_MaskOnChanged");
static_assert(offsetof(WBP_UI_Widget_MaskOnNotification_C_MaskOnChanged, bInIsPuttingOnMask) == 0x000000, "Member 'WBP_UI_Widget_MaskOnNotification_C_MaskOnChanged::bInIsPuttingOnMask' has a wrong offset!");

}

