#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PlayerCardContainer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Starbreeze_structs.hpp"


namespace SDK::Params
{

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.ExecuteUbergraph_WBP_PlayerCardContainer
// 0x01E0 (0x01E0 - 0x0000)
struct WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_11;              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_10;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_9;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_8;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_7;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_6;               // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_5;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FText& Text)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0014)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_SocialScreen_C*                 K2Node_DynamicCast_AsWBP_UI_Social_Screen;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_4;               // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_3;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_2;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_2;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled_1;           // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                K2Node_MakeMap_Map;                                // 0x0098(0x0050)()
	TMap<class FName, class FText>                K2Node_MakeMap_Map_1;                              // 0x00E8(0x0050)()
	class UWBP_UI_SocialScreen_C*                 K2Node_DynamicCast_AsWBP_UI_Social_Screen_1;       // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                K2Node_MakeMap_Map_2;                              // 0x0148(0x0050)()
	class UWBP_UI_SocialScreen_C*                 K2Node_DynamicCast_AsWBP_UI_Social_Screen_2;       // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_CurrentOffset_1;        // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_ComponentBoundEvent_CurrentOffset;          // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button_1;               // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bIsEnabled;             // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BA[0x6];                                      // 0x01BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_ComponentBoundEvent_Button;                 // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZMenuButton*                         K2Node_Event_MenuButton;                           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsFocused;                           // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable_1;                              // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x01DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer");
static_assert(sizeof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer) == 0x0001E0, "Wrong size on WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, EntryPoint) == 0x000000, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, Temp_byte_Variable) == 0x000004, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, Temp_bool_Variable) == 0x000005, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_SwitchEnum_CmpSuccess) == 0x000008, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000009, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, Temp_byte_Variable_3) == 0x00000A, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_11) == 0x000010, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_11' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_10) == 0x000018, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_10' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_9) == 0x000020, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_9' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_8) == 0x000028, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_8' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_7) == 0x000030, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_7' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_6) == 0x000038, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_6' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_5) == 0x000040, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_DynamicCast_AsWBP_UI_Social_Screen) == 0x000060, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_DynamicCast_AsWBP_UI_Social_Screen' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_4) == 0x000070, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_3) == 0x000078, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_bIsEnabled_2) == 0x000080, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_bIsEnabled_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_2) == 0x000088, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_bIsEnabled_1) == 0x000090, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_bIsEnabled_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_MakeMap_Map) == 0x000098, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_MakeMap_Map_1) == 0x0000E8, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_MakeMap_Map_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_DynamicCast_AsWBP_UI_Social_Screen_1) == 0x000138, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_DynamicCast_AsWBP_UI_Social_Screen_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_DynamicCast_bSuccess_1) == 0x000140, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_MakeMap_Map_2) == 0x000148, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_MakeMap_Map_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_DynamicCast_AsWBP_UI_Social_Screen_2) == 0x000198, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_DynamicCast_AsWBP_UI_Social_Screen_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_DynamicCast_bSuccess_2) == 0x0001A0, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_Event_IsDesignTime) == 0x0001A1, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_CurrentOffset_1) == 0x0001A4, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_CurrentOffset_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_CurrentOffset) == 0x0001A8, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_CurrentOffset' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button_1) == 0x0001B0, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_bIsEnabled) == 0x0001B8, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_bIsEnabled' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0001B9, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_ComponentBoundEvent_Button) == 0x0001C0, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_Select_Default) == 0x0001C8, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_Event_MenuButton) == 0x0001D0, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_Event_MenuButton' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_Event_bIsFocused) == 0x0001D8, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_Event_bIsFocused' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, Temp_bool_Variable_1) == 0x0001D9, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer, K2Node_Select_Default_1) == 0x0001DA, "Member 'WBP_PlayerCardContainer_C_ExecuteUbergraph_WBP_PlayerCardContainer::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.OnPlayerCardFocused
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCardContainer_C_OnPlayerCardFocused final
{
public:
	class USBZMenuButton*                         MenuButton;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFocused;                                        // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlayerCardContainer_C_OnPlayerCardFocused) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_OnPlayerCardFocused");
static_assert(sizeof(WBP_PlayerCardContainer_C_OnPlayerCardFocused) == 0x000010, "Wrong size on WBP_PlayerCardContainer_C_OnPlayerCardFocused");
static_assert(offsetof(WBP_PlayerCardContainer_C_OnPlayerCardFocused, MenuButton) == 0x000000, "Member 'WBP_PlayerCardContainer_C_OnPlayerCardFocused::MenuButton' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_OnPlayerCardFocused, bIsFocused) == 0x000008, "Member 'WBP_PlayerCardContainer_C_OnPlayerCardFocused::bIsFocused' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_9_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_AddContactButton_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_SBZScrollBox_110_K2Node_ComponentBoundEvent_8_OnUserScrolledEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_SBZScrollBox_110_K2Node_ComponentBoundEvent_8_OnUserScrolledEvent__DelegateSignature final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_SBZScrollBox_110_K2Node_ComponentBoundEvent_8_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_SBZScrollBox_110_K2Node_ComponentBoundEvent_8_OnUserScrolledEvent__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_SBZScrollBox_110_K2Node_ComponentBoundEvent_8_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_SBZScrollBox_110_K2Node_ComponentBoundEvent_8_OnUserScrolledEvent__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_SBZScrollBox_110_K2Node_ComponentBoundEvent_8_OnUserScrolledEvent__DelegateSignature, CurrentOffset) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_SBZScrollBox_110_K2Node_ComponentBoundEvent_8_OnUserScrolledEvent__DelegateSignature::CurrentOffset' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_ScrollBox_PlayerCardList_Horizontal_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ScrollBox_PlayerCardList_Horizontal_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature final
{
public:
	float                                         CurrentOffset;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ScrollBox_PlayerCardList_Horizontal_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ScrollBox_PlayerCardList_Horizontal_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ScrollBox_PlayerCardList_Horizontal_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature) == 0x000004, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ScrollBox_PlayerCardList_Horizontal_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ScrollBox_PlayerCardList_Horizontal_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature, CurrentOffset) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ScrollBox_PlayerCardList_Horizontal_K2Node_ComponentBoundEvent_6_OnUserScrolledEvent__DelegateSignature::CurrentOffset' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PlayerCardContainer_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlayerCardContainer_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PlayerCardContainer_C_PreConstruct");
static_assert(sizeof(WBP_PlayerCardContainer_C_PreConstruct) == 0x000001, "Wrong size on WBP_PlayerCardContainer_C_PreConstruct");
static_assert(offsetof(WBP_PlayerCardContainer_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PlayerCardContainer_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnabled_0;                                      // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature) == 0x000010, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature::Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature, bIsEnabled_0) == 0x000008, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature::bIsEnabled_0' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_LeaveParty_Button_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_24_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_24_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_24_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_24_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_24_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_24_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_24_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_24_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Windows_Filter_K2Node_ComponentBoundEvent_23_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_20_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_20_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_20_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_20_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_20_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_20_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_20_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_20_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_19_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_19_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_19_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_19_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_19_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_19_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_19_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_19_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Playstation_Filter_K2Node_ComponentBoundEvent_18_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_17_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_17_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_17_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_17_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_17_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_17_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_17_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_Xbox_Filter_K2Node_ComponentBoundEvent_17_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature");
static_assert(sizeof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature) == 0x000008, "Wrong size on WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature");
static_assert(offsetof(WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_BndEvt__WBP_PlayerCardContainer_ContainerFilter_K2Node_ComponentBoundEvent_7_OnMenuButtonSelected__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.HideOpenedContextMenu
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerCardContainer_C_HideOpenedContextMenu final
{
public:
	class UWBP_UI_SocialScreen_C*                 K2Node_DynamicCast_AsWBP_UI_Social_Screen;         // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Social_ContextMenu_C*           CallFunc_IsContextMenuDisplayed_ContextMenu;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlayerCardContainer_C_HideOpenedContextMenu) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_HideOpenedContextMenu");
static_assert(sizeof(WBP_PlayerCardContainer_C_HideOpenedContextMenu) == 0x000020, "Wrong size on WBP_PlayerCardContainer_C_HideOpenedContextMenu");
static_assert(offsetof(WBP_PlayerCardContainer_C_HideOpenedContextMenu, K2Node_DynamicCast_AsWBP_UI_Social_Screen) == 0x000000, "Member 'WBP_PlayerCardContainer_C_HideOpenedContextMenu::K2Node_DynamicCast_AsWBP_UI_Social_Screen' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HideOpenedContextMenu, K2Node_DynamicCast_bSuccess) == 0x000008, "Member 'WBP_PlayerCardContainer_C_HideOpenedContextMenu::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HideOpenedContextMenu, CallFunc_IsContextMenuDisplayed_ContextMenu) == 0x000010, "Member 'WBP_PlayerCardContainer_C_HideOpenedContextMenu::CallFunc_IsContextMenuDisplayed_ContextMenu' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HideOpenedContextMenu, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WBP_PlayerCardContainer_C_HideOpenedContextMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.HandleButtonFocusChanged
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_PlayerCardContainer_C_HandleButtonFocusChanged final
{
public:
	class USBZMenuButton*                         Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsButtonEnabled;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FText>                ButtonActionDisplayText;                           // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	TMap<class FName, class FText>                EmptyButtonActionDisplayText;                      // 0x0060(0x0050)(Edit, BlueprintVisible)
	class UWBP_UI_SocialScreen_C*                 K2Node_DynamicCast_AsWBP_UI_Social_Screen;         // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlayerCardContainer_C_HandleButtonFocusChanged) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_HandleButtonFocusChanged");
static_assert(sizeof(WBP_PlayerCardContainer_C_HandleButtonFocusChanged) == 0x0000C0, "Wrong size on WBP_PlayerCardContainer_C_HandleButtonFocusChanged");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleButtonFocusChanged, Button) == 0x000000, "Member 'WBP_PlayerCardContainer_C_HandleButtonFocusChanged::Button' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleButtonFocusChanged, IsButtonEnabled) == 0x000008, "Member 'WBP_PlayerCardContainer_C_HandleButtonFocusChanged::IsButtonEnabled' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleButtonFocusChanged, ButtonActionDisplayText) == 0x000010, "Member 'WBP_PlayerCardContainer_C_HandleButtonFocusChanged::ButtonActionDisplayText' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleButtonFocusChanged, EmptyButtonActionDisplayText) == 0x000060, "Member 'WBP_PlayerCardContainer_C_HandleButtonFocusChanged::EmptyButtonActionDisplayText' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleButtonFocusChanged, K2Node_DynamicCast_AsWBP_UI_Social_Screen) == 0x0000B0, "Member 'WBP_PlayerCardContainer_C_HandleButtonFocusChanged::K2Node_DynamicCast_AsWBP_UI_Social_Screen' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleButtonFocusChanged, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'WBP_PlayerCardContainer_C_HandleButtonFocusChanged::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleButtonFocusChanged, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000B9, "Member 'WBP_PlayerCardContainer_C_HandleButtonFocusChanged::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.HandleFocusUpdateRequested
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCardContainer_C_HandleFocusUpdateRequested final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_SocialScreen_C*                 K2Node_DynamicCast_AsWBP_UI_Social_Screen;         // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateFocus_bIsFocusUpdated;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlayerCardContainer_C_HandleFocusUpdateRequested) == 0x000008, "Wrong alignment on WBP_PlayerCardContainer_C_HandleFocusUpdateRequested");
static_assert(sizeof(WBP_PlayerCardContainer_C_HandleFocusUpdateRequested) == 0x000018, "Wrong size on WBP_PlayerCardContainer_C_HandleFocusUpdateRequested");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleFocusUpdateRequested, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WBP_PlayerCardContainer_C_HandleFocusUpdateRequested::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleFocusUpdateRequested, K2Node_DynamicCast_AsWBP_UI_Social_Screen) == 0x000008, "Member 'WBP_PlayerCardContainer_C_HandleFocusUpdateRequested::K2Node_DynamicCast_AsWBP_UI_Social_Screen' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleFocusUpdateRequested, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_PlayerCardContainer_C_HandleFocusUpdateRequested::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerCardContainer_C_HandleFocusUpdateRequested, CallFunc_UpdateFocus_bIsFocusUpdated) == 0x000011, "Member 'WBP_PlayerCardContainer_C_HandleFocusUpdateRequested::CallFunc_UpdateFocus_bIsFocusUpdated' has a wrong offset!");

// Function WBP_PlayerCardContainer.WBP_PlayerCardContainer_C.SetResultsWidgetSwitcherIndex
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerCardContainer_C_SetResultsWidgetSwitcherIndex final
{
public:
	bool                                          VisibleResults;                                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_PlayerCardContainer_C_SetResultsWidgetSwitcherIndex) == 0x000004, "Wrong alignment on WBP_PlayerCardContainer_C_SetResultsWidgetSwitcherIndex");
static_assert(sizeof(WBP_PlayerCardContainer_C_SetResultsWidgetSwitcherIndex) == 0x000018, "Wrong size on WBP_PlayerCardContainer_C_SetResultsWidgetSwitcherIndex");
