#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_PrintWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_PrintWidget.WBP_PrintWidget_C
// 0x0098 (0x0328 - 0x0290)
class UWBP_PrintWidget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                CloseButton;                                       // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CloseText;                                         // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Color;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           MainCanvas;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             MainScrollBox;                                     // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                MinimizeButton;                                    // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             MinimizeText;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ScalingButton;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMultiLineEditableText*                 TextBox;                                           // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TopBackground;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                TopWindowButton;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              MousePosition;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              DeltaPosition;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Minimized_;                                        // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              MaximizedScale;                                    // 0x0304(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LimitPosition;                                     // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              In_Position;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ValueX;                                            // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ValueY;                                            // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Return_Value_X;                                    // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Return_Value_Y;                                    // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_PrintWidget(int32 EntryPoint);
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MinimizeButton_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__MinimizeButton_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__PauseButton_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ScalingButton_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__ScalingButton_K2Node_ComponentBoundEvent_1_OnButtonReleasedEvent__DelegateSignature();
	void StartScalingTimer();
	void StopScalingTimer();
	void BndEvt__Button_41_K2Node_ComponentBoundEvent_161_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Button_41_K2Node_ComponentBoundEvent_174_OnButtonReleasedEvent__DelegateSignature();
	void StartPositionTimer();
	void StopPositionTimer();
	void PrintText(const class FString& TextToAdd);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_PrintWidget_C">();
	}
	static class UWBP_PrintWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_PrintWidget_C>();
	}
};
static_assert(alignof(UWBP_PrintWidget_C) == 0x000008, "Wrong alignment on UWBP_PrintWidget_C");
static_assert(sizeof(UWBP_PrintWidget_C) == 0x000328, "Wrong size on UWBP_PrintWidget_C");
static_assert(offsetof(UWBP_PrintWidget_C, UberGraphFrame) == 0x000290, "Member 'UWBP_PrintWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, CloseButton) == 0x000298, "Member 'UWBP_PrintWidget_C::CloseButton' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, CloseText) == 0x0002A0, "Member 'UWBP_PrintWidget_C::CloseText' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, Color) == 0x0002A8, "Member 'UWBP_PrintWidget_C::Color' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, MainCanvas) == 0x0002B0, "Member 'UWBP_PrintWidget_C::MainCanvas' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, MainScrollBox) == 0x0002B8, "Member 'UWBP_PrintWidget_C::MainScrollBox' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, MinimizeButton) == 0x0002C0, "Member 'UWBP_PrintWidget_C::MinimizeButton' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, MinimizeText) == 0x0002C8, "Member 'UWBP_PrintWidget_C::MinimizeText' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, ScalingButton) == 0x0002D0, "Member 'UWBP_PrintWidget_C::ScalingButton' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, TextBox) == 0x0002D8, "Member 'UWBP_PrintWidget_C::TextBox' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, TopBackground) == 0x0002E0, "Member 'UWBP_PrintWidget_C::TopBackground' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, TopWindowButton) == 0x0002E8, "Member 'UWBP_PrintWidget_C::TopWindowButton' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, MousePosition) == 0x0002F0, "Member 'UWBP_PrintWidget_C::MousePosition' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, DeltaPosition) == 0x0002F8, "Member 'UWBP_PrintWidget_C::DeltaPosition' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, Minimized_) == 0x000300, "Member 'UWBP_PrintWidget_C::Minimized_' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, MaximizedScale) == 0x000304, "Member 'UWBP_PrintWidget_C::MaximizedScale' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, LimitPosition) == 0x00030C, "Member 'UWBP_PrintWidget_C::LimitPosition' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, In_Position) == 0x000310, "Member 'UWBP_PrintWidget_C::In_Position' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, ValueX) == 0x000318, "Member 'UWBP_PrintWidget_C::ValueX' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, ValueY) == 0x00031C, "Member 'UWBP_PrintWidget_C::ValueY' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, Return_Value_X) == 0x000320, "Member 'UWBP_PrintWidget_C::Return_Value_X' has a wrong offset!");
static_assert(offsetof(UWBP_PrintWidget_C, Return_Value_Y) == 0x000324, "Member 'UWBP_PrintWidget_C::Return_Value_Y' has a wrong offset!");

}

