#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TextEntry_Button

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TextEntry_Button.WBP_TextEntry_Button_C
// 0x0058 (0x03E0 - 0x0388)
class UWBP_TextEntry_Button_C final : public USBZTextEntryButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_TextBorder;                                 // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BorderEdge_I;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Background;                                  // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Editing;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Hover;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsEditingText;                                     // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B9[0x7];                                      // 0x03B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text_Hint_Override;                                // 0x03C0(0x0018)(Edit, BlueprintVisible)
	bool                                          IsPasswordOverride;                                // 0x03D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_TextEntry_Button(int32 EntryPoint);
	void EditingText(bool bInIsEditingText);
	void ButtonHoveredChanged(bool bInIsHovered);
	void ButtonFocusedChanged(bool bInHasFocus);
	void ButtonDisabledChanged(bool bInIsDisabled);
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void RefreshVisuals();
	void OnHoverVisuals(bool bIsHovered);
	void OnFocusedVisuals(bool bIsFocused);
	void OnDisabledVisuals(bool bIsDisabled_0);
	void ToggleEditingText();
	void ClearText();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_TextEntry_Button_C">();
	}
	static class UWBP_TextEntry_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TextEntry_Button_C>();
	}
};
static_assert(alignof(UWBP_TextEntry_Button_C) == 0x000008, "Wrong alignment on UWBP_TextEntry_Button_C");
static_assert(sizeof(UWBP_TextEntry_Button_C) == 0x0003E0, "Wrong size on UWBP_TextEntry_Button_C");
static_assert(offsetof(UWBP_TextEntry_Button_C, UberGraphFrame) == 0x000388, "Member 'UWBP_TextEntry_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_TextEntry_Button_C, Border_TextBorder) == 0x000390, "Member 'UWBP_TextEntry_Button_C::Border_TextBorder' has a wrong offset!");
static_assert(offsetof(UWBP_TextEntry_Button_C, BorderEdge_I) == 0x000398, "Member 'UWBP_TextEntry_Button_C::BorderEdge_I' has a wrong offset!");
static_assert(offsetof(UWBP_TextEntry_Button_C, Image_Background) == 0x0003A0, "Member 'UWBP_TextEntry_Button_C::Image_Background' has a wrong offset!");
static_assert(offsetof(UWBP_TextEntry_Button_C, Image_Editing) == 0x0003A8, "Member 'UWBP_TextEntry_Button_C::Image_Editing' has a wrong offset!");
static_assert(offsetof(UWBP_TextEntry_Button_C, Image_Hover) == 0x0003B0, "Member 'UWBP_TextEntry_Button_C::Image_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_TextEntry_Button_C, IsEditingText) == 0x0003B8, "Member 'UWBP_TextEntry_Button_C::IsEditingText' has a wrong offset!");
static_assert(offsetof(UWBP_TextEntry_Button_C, Text_Hint_Override) == 0x0003C0, "Member 'UWBP_TextEntry_Button_C::Text_Hint_Override' has a wrong offset!");
static_assert(offsetof(UWBP_TextEntry_Button_C, IsPasswordOverride) == 0x0003D8, "Member 'UWBP_TextEntry_Button_C::IsPasswordOverride' has a wrong offset!");

}

