#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_NumberCounter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_NumberCounter.WBP_NumberCounter_C
// 0x0090 (0x0320 - 0x0290)
class UWBP_NumberCounter_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Pop;                                               // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USBZUITextBlock*                        NumberDisplay;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int64                                         StartingValue;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         GoalValue;                                         // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Prefix;                                            // 0x02B8(0x0018)(Edit, BlueprintVisible)
	class FText                                   Suffix;                                            // 0x02D0(0x0018)(Edit, BlueprintVisible)
	bool                                          AnimateNumbers;                                    // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         RunningValue;                                      // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZColorStyle*                         ColorStyle;                                        // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USBZTextStyle*                          Style;                                             // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          RunUpAudio;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          EndAudio;                                          // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentSoundId;                                    // 0x0318(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_NumberCounter(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void RunUpNumber(int64 StartingValue_0, int64 GoalValue_0);
	void OnRunUpEnded();
	void SetDisplayValue(int64 value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_NumberCounter_C">();
	}
	static class UWBP_NumberCounter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_NumberCounter_C>();
	}
};
static_assert(alignof(UWBP_NumberCounter_C) == 0x000008, "Wrong alignment on UWBP_NumberCounter_C");
static_assert(sizeof(UWBP_NumberCounter_C) == 0x000320, "Wrong size on UWBP_NumberCounter_C");
static_assert(offsetof(UWBP_NumberCounter_C, UberGraphFrame) == 0x000290, "Member 'UWBP_NumberCounter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, Pop) == 0x000298, "Member 'UWBP_NumberCounter_C::Pop' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, NumberDisplay) == 0x0002A0, "Member 'UWBP_NumberCounter_C::NumberDisplay' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, StartingValue) == 0x0002A8, "Member 'UWBP_NumberCounter_C::StartingValue' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, GoalValue) == 0x0002B0, "Member 'UWBP_NumberCounter_C::GoalValue' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, Prefix) == 0x0002B8, "Member 'UWBP_NumberCounter_C::Prefix' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, Suffix) == 0x0002D0, "Member 'UWBP_NumberCounter_C::Suffix' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, AnimateNumbers) == 0x0002E8, "Member 'UWBP_NumberCounter_C::AnimateNumbers' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, RunningValue) == 0x0002F0, "Member 'UWBP_NumberCounter_C::RunningValue' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, ColorStyle) == 0x0002F8, "Member 'UWBP_NumberCounter_C::ColorStyle' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, Style) == 0x000300, "Member 'UWBP_NumberCounter_C::Style' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, RunUpAudio) == 0x000308, "Member 'UWBP_NumberCounter_C::RunUpAudio' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, EndAudio) == 0x000310, "Member 'UWBP_NumberCounter_C::EndAudio' has a wrong offset!");
static_assert(offsetof(UWBP_NumberCounter_C, CurrentSoundId) == 0x000318, "Member 'UWBP_NumberCounter_C::CurrentSoundId' has a wrong offset!");

}

