#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_Groups_Deployed

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_Groups_Deployed.WBP_UI_Widget_Groups_Deployed_C.ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_Groups_Deployed_C_ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_Groups_Deployed_C_ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed) == 0x000004, "Wrong alignment on WBP_UI_Widget_Groups_Deployed_C_ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed");
static_assert(sizeof(WBP_UI_Widget_Groups_Deployed_C_ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed) == 0x000008, "Wrong size on WBP_UI_Widget_Groups_Deployed_C_ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_Groups_Deployed_C_ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_Widget_Groups_Deployed_C_ExecuteUbergraph_WBP_UI_Widget_Groups_Deployed::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_Groups_Deployed.WBP_UI_Widget_Groups_Deployed_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_Groups_Deployed_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_Groups_Deployed_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_Groups_Deployed_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_Groups_Deployed_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_Groups_Deployed_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_Groups_Deployed_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_Groups_Deployed.WBP_UI_Widget_Groups_Deployed_C.update
// 0x0278 (0x0278 - 0x0000)
struct WBP_UI_Widget_Groups_Deployed_C_update final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C* CallFunc_Create_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_SentryGun_C*>                CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_SentryGun_C*>                CallFunc_Map_Keys_Keys;                            // 0x0040(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C* CallFunc_Create_ReturnValue_1;                 // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Placeable_DoctorBag_C*>      CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0060(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Placeable_DoctorBag_C*              CallFunc_Array_Get_Item;                           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_86[0x2];                                       // 0x0086(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue;                // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C* CallFunc_Create_ReturnValue_2;                 // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C* CallFunc_Map_Find_Value;                       // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Placeable_DoctorBag_C*>      CallFunc_Map_Keys_Keys_1;                          // 0x00C0(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue;                 // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D5[0x3];                                       // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C* CallFunc_Create_ReturnValue_3;            // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Placeable_ArmorBag_C*>       CallFunc_GetAllActorsOfClass_OutActors_2;          // 0x00F8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Placeable_ArmorBag_C*               CallFunc_Array_Get_Item_1;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11E[0x2];                                      // 0x011E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_2;         // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue_1;              // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SentryGun_C*                        CallFunc_Array_Get_Item_2;                         // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C* CallFunc_Map_Find_Value_1;                // 0x0138(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x3];                                      // 0x0149(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C* CallFunc_Map_Find_Value_2;                     // 0x0150(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_2;                   // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Placeable_ArmorBag_C*>       CallFunc_Map_Keys_Keys_2;                          // 0x0160(0x0010)(ReferenceParm)
	bool                                          CallFunc_Map_Contains_ReturnValue_1;               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Placeable_AmmoBag_C*>        CallFunc_GetAllActorsOfClass_OutActors_3;          // 0x0180(0x0010)(ReferenceParm)
	class ABP_Placeable_AmmoBag_C*                CallFunc_Array_Get_Item_3;                         // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x019C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19D[0x3];                                      // 0x019D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_FTrunc_ReturnValue_2;                     // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x01A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x01A6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A7[0x1];                                      // 0x01A7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue_2;               // 0x01AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1AD[0x3];                                      // 0x01AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B4[0x4];                                      // 0x01B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SentryGun_C*                        CallFunc_Array_Get_Item_4;                         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Contains_ReturnValue_3;               // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_BaseDistancePercentage_RinoHud_C* CallFunc_Map_Find_Value_3;                // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_3;                   // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D1[0x3];                                      // 0x01D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDistanceTo_ReturnValue_2;              // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Placeable_DoctorBag_C*              CallFunc_Array_Get_Item_5;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C* CallFunc_Map_Find_Value_4;                     // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_4;                   // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_202[0x2];                                      // 0x0202(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C* CallFunc_Map_Find_Value_5;                     // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_5;                   // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Placeable_ArmorBag_C*               CallFunc_Array_Get_Item_6;                         // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C* CallFunc_Map_Find_Value_6;                     // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_6;                   // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x6];                                      // 0x022A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetLocalPlayerPawn_ReturnValue_3;         // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDistanceTo_ReturnValue_3;              // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Placeable_AmmoBag_C*>        CallFunc_Map_Keys_Keys_3;                          // 0x0240(0x0010)(ReferenceParm)
	class ABP_Placeable_AmmoBag_C*                CallFunc_Array_Get_Item_7;                         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_UI_Widget_BaseDistanceCount_RinoHud_C* CallFunc_Map_Find_Value_7;                     // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_7;                   // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x0269(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x026A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26B[0x1];                                      // 0x026B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_Groups_Deployed_C_update) == 0x000008, "Wrong alignment on WBP_UI_Widget_Groups_Deployed_C_update");
static_assert(sizeof(WBP_UI_Widget_Groups_Deployed_C_update) == 0x000278, "Wrong size on WBP_UI_Widget_Groups_Deployed_C_update");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Array_Index_Variable) == 0x000000, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Add_IntInt_ReturnValue) == 0x000028, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetLocalPlayerPawn_ReturnValue) == 0x000030, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetLocalPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Array_Index_Variable_1) == 0x000038, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Keys_Keys) == 0x000040, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Length_ReturnValue_1) == 0x000050, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Create_ReturnValue_1) == 0x000058, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000060, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Array_Index_Variable_2) == 0x000070, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Get_Item) == 0x000078, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_FTrunc_ReturnValue) == 0x000080, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000084, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000085, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Length_ReturnValue_2) == 0x000088, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetLocalPlayerPawn_ReturnValue_1) == 0x000090, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetLocalPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Loop_Counter_Variable_1) == 0x000098, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetDistanceTo_ReturnValue) == 0x00009C, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetDistanceTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Less_IntInt_ReturnValue) == 0x0000A0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000A4, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Create_ReturnValue_2) == 0x0000A8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_Value) == 0x0000B0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_ReturnValue) == 0x0000B8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Keys_Keys_1) == 0x0000C0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Keys_Keys_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Length_ReturnValue_3) == 0x0000D0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Contains_ReturnValue) == 0x0000D4, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Loop_Counter_Variable_2) == 0x0000D8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000DC, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Loop_Counter_Variable_3) == 0x0000E0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Create_ReturnValue_3) == 0x0000E8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000F0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000F4, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetAllActorsOfClass_OutActors_2) == 0x0000F8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetAllActorsOfClass_OutActors_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Array_Index_Variable_3) == 0x000108, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Length_ReturnValue_4) == 0x00010C, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Get_Item_1) == 0x000110, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_FTrunc_ReturnValue_1) == 0x000118, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00011C, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00011D, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetLocalPlayerPawn_ReturnValue_2) == 0x000120, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetLocalPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Array_Index_Variable_4) == 0x000128, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetDistanceTo_ReturnValue_1) == 0x00012C, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetDistanceTo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Get_Item_2) == 0x000130, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_Value_1) == 0x000138, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_ReturnValue_1) == 0x000140, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_IsValid_ReturnValue) == 0x000141, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Loop_Counter_Variable_4) == 0x000144, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Less_IntInt_ReturnValue_2) == 0x000148, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Add_IntInt_ReturnValue_4) == 0x00014C, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_Value_2) == 0x000150, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_Value_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_ReturnValue_2) == 0x000158, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Keys_Keys_2) == 0x000160, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Keys_Keys_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Contains_ReturnValue_1) == 0x000170, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Length_ReturnValue_5) == 0x000174, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Loop_Counter_Variable_5) == 0x000178, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetAllActorsOfClass_OutActors_3) == 0x000180, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetAllActorsOfClass_OutActors_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Get_Item_3) == 0x000190, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Length_ReturnValue_6) == 0x000198, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Less_IntInt_ReturnValue_3) == 0x00019C, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_FTrunc_ReturnValue_2) == 0x0001A0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_FTrunc_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Greater_FloatFloat_ReturnValue_2) == 0x0001A4, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Greater_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0001A5, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Less_IntInt_ReturnValue_4) == 0x0001A6, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Add_IntInt_ReturnValue_5) == 0x0001A8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Contains_ReturnValue_2) == 0x0001AC, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Array_Index_Variable_5) == 0x0001B0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Get_Item_4) == 0x0001B8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Contains_ReturnValue_3) == 0x0001C0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_Value_3) == 0x0001C8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_Value_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_ReturnValue_3) == 0x0001D0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetDistanceTo_ReturnValue_2) == 0x0001D4, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetDistanceTo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0001D8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Loop_Counter_Variable_6) == 0x0001DC, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Less_IntInt_ReturnValue_5) == 0x0001E0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Add_IntInt_ReturnValue_6) == 0x0001E4, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Array_Index_Variable_6) == 0x0001E8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Get_Item_5) == 0x0001F0, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_Value_4) == 0x0001F8, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_Value_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_ReturnValue_4) == 0x000200, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_IsValid_ReturnValue_1) == 0x000201, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Array_Index_Variable_7) == 0x000204, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Array_Index_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_Value_5) == 0x000208, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_Value_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_ReturnValue_5) == 0x000210, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Get_Item_6) == 0x000218, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_Value_6) == 0x000220, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_Value_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_ReturnValue_6) == 0x000228, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_IsValid_ReturnValue_2) == 0x000229, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetLocalPlayerPawn_ReturnValue_3) == 0x000230, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetLocalPlayerPawn_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_GetDistanceTo_ReturnValue_3) == 0x000238, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_GetDistanceTo_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Keys_Keys_3) == 0x000240, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Keys_Keys_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Get_Item_7) == 0x000250, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Array_Length_ReturnValue_7) == 0x000258, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Array_Length_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_Value_7) == 0x000260, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_Value_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Map_Find_ReturnValue_7) == 0x000268, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Map_Find_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Less_IntInt_ReturnValue_6) == 0x000269, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_IsValid_ReturnValue_3) == 0x00026A, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, Temp_int_Loop_Counter_Variable_7) == 0x00026C, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::Temp_int_Loop_Counter_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Less_IntInt_ReturnValue_7) == 0x000270, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Less_IntInt_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_update, CallFunc_Add_IntInt_ReturnValue_7) == 0x000274, "Member 'WBP_UI_Widget_Groups_Deployed_C_update::CallFunc_Add_IntInt_ReturnValue_7' has a wrong offset!");

// Function WBP_UI_Widget_Groups_Deployed.WBP_UI_Widget_Groups_Deployed_C.SetPlayerWidgetColor
// 0x0040 (0x0040 - 0x0000)
struct WBP_UI_Widget_Groups_Deployed_C_SetPlayerWidgetColor final
{
public:
	class AActor*                                 Placeable;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASBZPlayerCharacter*                    K2Node_DynamicCast_AsSBZPlayer_Character;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Array_Get_Item;                           // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_Groups_Deployed_C_SetPlayerWidgetColor) == 0x000008, "Wrong alignment on WBP_UI_Widget_Groups_Deployed_C_SetPlayerWidgetColor");
static_assert(sizeof(WBP_UI_Widget_Groups_Deployed_C_SetPlayerWidgetColor) == 0x000040, "Wrong size on WBP_UI_Widget_Groups_Deployed_C_SetPlayerWidgetColor");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_SetPlayerWidgetColor, Placeable) == 0x000000, "Member 'WBP_UI_Widget_Groups_Deployed_C_SetPlayerWidgetColor::Placeable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_Groups_Deployed_C_SetPlayerWidgetColor, Widget) == 0x000008, "Member 'WBP_UI_Widget_Groups_Deployed_C_SetPlayerWidgetColor::Widget' has a wrong offset!");
