#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_DetectionWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_DetectionWidget.WBP_UI_DetectionWidget_C
// 0x0028 (0x02C8 - 0x02A0)
class UWBP_UI_DetectionWidget_C final : public UPD3DetectionMeter
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       pop;                                               // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_ProgressBar;                                 // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Material;                                          // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NewVar_0;                                          // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_DetectionWidget(int32 EntryPoint);
	void OnStoppedBeingDetected();
	void OnPlayerDetected();
	void OnNewDetector(class AActor* InDetectingActor, float InDetectionValue);
	void OnDetectionValueUpdated(float InDetectionValue);
	void PreConstruct(bool IsDesignTime);
	void OnInitialized();
	void UpdateBarVisuals(float InPercent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_DetectionWidget_C">();
	}
	static class UWBP_UI_DetectionWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_DetectionWidget_C>();
	}
};
static_assert(alignof(UWBP_UI_DetectionWidget_C) == 0x000008, "Wrong alignment on UWBP_UI_DetectionWidget_C");
static_assert(sizeof(UWBP_UI_DetectionWidget_C) == 0x0002C8, "Wrong size on UWBP_UI_DetectionWidget_C");
static_assert(offsetof(UWBP_UI_DetectionWidget_C, UberGraphFrame) == 0x0002A0, "Member 'UWBP_UI_DetectionWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_DetectionWidget_C, pop) == 0x0002A8, "Member 'UWBP_UI_DetectionWidget_C::pop' has a wrong offset!");
static_assert(offsetof(UWBP_UI_DetectionWidget_C, Image_ProgressBar) == 0x0002B0, "Member 'UWBP_UI_DetectionWidget_C::Image_ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_DetectionWidget_C, Material) == 0x0002B8, "Member 'UWBP_UI_DetectionWidget_C::Material' has a wrong offset!");
static_assert(offsetof(UWBP_UI_DetectionWidget_C, NewVar_0) == 0x0002C0, "Member 'UWBP_UI_DetectionWidget_C::NewVar_0' has a wrong offset!");

}

