#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ServerBrowser_StoryButton

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ServerBrowser_StoryButton.WBP_ServerBrowser_StoryButton_C
// 0x00A0 (0x0450 - 0x03B0)
class UWBP_ServerBrowser_StoryButton_C final : public USBZServerBrowserStoryModeButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LockedPressed;                                     // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URetainerBox*                           BWEffect_RB;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CircleBorder_I;                                    // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CircleBorder_Texture;                              // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                DefaultOutline_B;                                  // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Disabled_O;                                        // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HeistBackground_I;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 LockIcon;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LockTextDisable_O;                                 // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PlayIcon_I;                                        // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Root_SizeB;                                        // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                SelectedOutline_B;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_Disabled;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DynamicMaterials;                                  // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_DisabledOverlayDefault;                      // 0x0428(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSmallerButton;                                   // 0x0438(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_439[0x7];                                      // 0x0439(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          Selected;                                          // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ClickLockedSound;                                  // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_ServerBrowser_StoryButton(int32 EntryPoint);
	void ButtonHoveredChanged(bool bInIsHovered);
	void PreConstruct(bool IsDesignTime);
	void OnFocusChanged(bool bIsFocused);
	void ButtonSelected();
	void DisabledButtonSelected();
	void ButtonDisabledChanged(bool bInIsDisabled);
	void Construct();
	void OnHeistDataInitialized();
	void ButtonFocusedChanged(bool bInHasFocus);
	void OnLoaded_2AEE3D384A6280472CCD6BB641BB60CC(class UObject* Loaded);
	void OnFocusedChanged(bool bIsFocused);
	void OnDisabledChanged(bool InDisabled);
	void SetButtonLocked();
	void SetBWEffect(bool bHasSubFocus);
	void ResetDisabledState();
	void SetMaterialProperties();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_ServerBrowser_StoryButton_C">();
	}
	static class UWBP_ServerBrowser_StoryButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ServerBrowser_StoryButton_C>();
	}
};
static_assert(alignof(UWBP_ServerBrowser_StoryButton_C) == 0x000008, "Wrong alignment on UWBP_ServerBrowser_StoryButton_C");
static_assert(sizeof(UWBP_ServerBrowser_StoryButton_C) == 0x000450, "Wrong size on UWBP_ServerBrowser_StoryButton_C");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, UberGraphFrame) == 0x0003B0, "Member 'UWBP_ServerBrowser_StoryButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, LockedPressed) == 0x0003B8, "Member 'UWBP_ServerBrowser_StoryButton_C::LockedPressed' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, BWEffect_RB) == 0x0003C0, "Member 'UWBP_ServerBrowser_StoryButton_C::BWEffect_RB' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, CircleBorder_I) == 0x0003C8, "Member 'UWBP_ServerBrowser_StoryButton_C::CircleBorder_I' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, CircleBorder_Texture) == 0x0003D0, "Member 'UWBP_ServerBrowser_StoryButton_C::CircleBorder_Texture' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, DefaultOutline_B) == 0x0003D8, "Member 'UWBP_ServerBrowser_StoryButton_C::DefaultOutline_B' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, Disabled_O) == 0x0003E0, "Member 'UWBP_ServerBrowser_StoryButton_C::Disabled_O' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, HeistBackground_I) == 0x0003E8, "Member 'UWBP_ServerBrowser_StoryButton_C::HeistBackground_I' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, LockIcon) == 0x0003F0, "Member 'UWBP_ServerBrowser_StoryButton_C::LockIcon' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, LockTextDisable_O) == 0x0003F8, "Member 'UWBP_ServerBrowser_StoryButton_C::LockTextDisable_O' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, PlayIcon_I) == 0x000400, "Member 'UWBP_ServerBrowser_StoryButton_C::PlayIcon_I' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, Root_SizeB) == 0x000408, "Member 'UWBP_ServerBrowser_StoryButton_C::Root_SizeB' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, SelectedOutline_B) == 0x000410, "Member 'UWBP_ServerBrowser_StoryButton_C::SelectedOutline_B' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, Text_Disabled) == 0x000418, "Member 'UWBP_ServerBrowser_StoryButton_C::Text_Disabled' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, DynamicMaterials) == 0x000420, "Member 'UWBP_ServerBrowser_StoryButton_C::DynamicMaterials' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, Color_DisabledOverlayDefault) == 0x000428, "Member 'UWBP_ServerBrowser_StoryButton_C::Color_DisabledOverlayDefault' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, IsSmallerButton) == 0x000438, "Member 'UWBP_ServerBrowser_StoryButton_C::IsSmallerButton' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, Selected) == 0x000440, "Member 'UWBP_ServerBrowser_StoryButton_C::Selected' has a wrong offset!");
static_assert(offsetof(UWBP_ServerBrowser_StoryButton_C, ClickLockedSound) == 0x000448, "Member 'UWBP_ServerBrowser_StoryButton_C::ClickLockedSound' has a wrong offset!");

}

