#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_CharacterDisplayPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_CharacterDisplayPanel.WBP_UI_CharacterDisplayPanel_C.ExecuteUbergraph_WBP_UI_CharacterDisplayPanel
// 0x0010 (0x0010 - 0x0000)
struct WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	const class USBZPlayerCharacterData*          K2Node_Event_InCharacterData;                      // 0x0008(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel) == 0x000008, "Wrong alignment on WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel");
static_assert(sizeof(WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel) == 0x000010, "Wrong size on WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel, EntryPoint) == 0x000000, "Member 'WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel, K2Node_Event_IsDesignTime) == 0x000004, "Member 'WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel, K2Node_Event_InCharacterData) == 0x000008, "Member 'WBP_UI_CharacterDisplayPanel_C_ExecuteUbergraph_WBP_UI_CharacterDisplayPanel::K2Node_Event_InCharacterData' has a wrong offset!");

// Function WBP_UI_CharacterDisplayPanel.WBP_UI_CharacterDisplayPanel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_CharacterDisplayPanel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_CharacterDisplayPanel_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_CharacterDisplayPanel_C_PreConstruct");
static_assert(sizeof(WBP_UI_CharacterDisplayPanel_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_CharacterDisplayPanel_C_PreConstruct");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_CharacterDisplayPanel_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_CharacterDisplayPanel.WBP_UI_CharacterDisplayPanel_C.OnCharacterDataChanged
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_CharacterDisplayPanel_C_OnCharacterDataChanged final
{
public:
	const class USBZPlayerCharacterData*          InCharacterData;                                   // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_CharacterDisplayPanel_C_OnCharacterDataChanged) == 0x000008, "Wrong alignment on WBP_UI_CharacterDisplayPanel_C_OnCharacterDataChanged");
static_assert(sizeof(WBP_UI_CharacterDisplayPanel_C_OnCharacterDataChanged) == 0x000008, "Wrong size on WBP_UI_CharacterDisplayPanel_C_OnCharacterDataChanged");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_OnCharacterDataChanged, InCharacterData) == 0x000000, "Member 'WBP_UI_CharacterDisplayPanel_C_OnCharacterDataChanged::InCharacterData' has a wrong offset!");

// Function WBP_UI_CharacterDisplayPanel.WBP_UI_CharacterDisplayPanel_C.InitializeCharacterData
// 0x0100 (0x0100 - 0x0000)
struct WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData final
{
public:
	class USBZPlayerCharacterData*                InCharacterData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_ClampText_ReturnValue;                    // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_OutDisplayName;            // 0x0060(0x0018)()
	bool                                          CallFunc_GetDisplayName_OutHasText;                // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0080(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0098(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
};
static_assert(alignof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData) == 0x000008, "Wrong alignment on WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData");
static_assert(sizeof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData) == 0x000100, "Wrong size on WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData, InCharacterData) == 0x000000, "Member 'WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData::InCharacterData' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData, CallFunc_ClampText_ReturnValue) == 0x000008, "Member 'WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData::CallFunc_ClampText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData, K2Node_MakeStruct_FormatArgumentData) == 0x000020, "Member 'WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData, CallFunc_GetDisplayName_OutDisplayName) == 0x000060, "Member 'WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData::CallFunc_GetDisplayName_OutDisplayName' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData, CallFunc_GetDisplayName_OutHasText) == 0x000078, "Member 'WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData::CallFunc_GetDisplayName_OutHasText' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData, CallFunc_MakeLiteralText_ReturnValue) == 0x000080, "Member 'WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData, K2Node_MakeStruct_FormatArgumentData_1) == 0x000098, "Member 'WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData, K2Node_MakeArray_Array) == 0x0000D8, "Member 'WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData, CallFunc_Format_ReturnValue) == 0x0000E8, "Member 'WBP_UI_CharacterDisplayPanel_C_InitializeCharacterData::CallFunc_Format_ReturnValue' has a wrong offset!");

}

