#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_ModeSelect_Options

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "E_ButtonLockedState_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_ModeSelect_Options.WBP_UI_ModeSelect_Options_C
// 0x0088 (0x0348 - 0x02C0)
class UWBP_UI_ModeSelect_Options_C final : public USBZMenuStackScreenWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Show_Level_Helper;                                 // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ShowButtons;                                       // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                AdditionalInfo_Border;                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBackgroundBlur*                        Background_Blur;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Buttons_HB;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ModeSelect_ModeButton_C*        FindHeist_Button;                                  // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_173;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               LVL5_Overlay;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ModeSelect_ModeButton_C*        Quickplay_Button;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenTitle_C*                     ScreenTitle;                                       // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ModeSelect_ModeButton_C*        SoloMode_Button;                                   // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ModeSelect_ModeButton_C*        Tutorial_Button;                                   // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMenuButton*                         CurrentModeFocused;                                // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ButtonShownAudioEvent;                             // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_ModeSelect_Options(int32 EntryPoint);
	void OnGameStartEntered();
	void OnPlayerPartyChanged(const class FString& PlayerId);
	void OnInstallStateChanged(bool bIsGameInstallPending);
	void OnPrivilegeChanged(ESBZUserPrivilegesProxy Privilege, bool bPrivilegeAllowed);
	void OnPartyCreated();
	void OnInitialized();
	void Construct();
	void BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_9_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_ModeSelect_Options_Quickplay_Button_K2Node_ComponentBoundEvent_6_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_7_OnShowAdditionalInfo__DelegateSignature();
	void ClearFocusedButton();
	void OnButtonFullyShown();
	void BndEvt__WBP_UI_ModeSelect_Options_Tutorial_Button_K2Node_ComponentBoundEvent_5_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_ModeSelect_Options_SoloMode_Button_K2Node_ComponentBoundEvent_4_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_ModeSelect_Options_FindHeist_Button_K2Node_ComponentBoundEvent_3_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void OnLostStackFocused();
	void OnGainedStackFocused(const class FName& PreviousValue);
	void BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_2_K2Node_ComponentBoundEvent_2_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_1_K2Node_ComponentBoundEvent_1_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_ModeSelect_Options_WBP_UI_ModeSelect_ModeButton_K2Node_ComponentBoundEvent_0_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void OnControlRefPressed(class FName ActionName);
	void ShowHideAdditionalInfo(bool ForceHide);
	void ResetButtonsVisuals();
	void UpdateButtonsBasedOnAccess();
	void CheckIfNewPlayer();
	void SequenceEvent__ENTRYPOINTWBP_UI_ModeSelect_Options_0();
	void SequenceEvent__ENTRYPOINTWBP_UI_ModeSelect_Options_1();
	void SequenceEvent__ENTRYPOINTWBP_UI_ModeSelect_Options_2();
	void SequenceEvent__ENTRYPOINTWBP_UI_ModeSelect_Options_3();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_ModeSelect_Options_C">();
	}
	static class UWBP_UI_ModeSelect_Options_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_ModeSelect_Options_C>();
	}
};
static_assert(alignof(UWBP_UI_ModeSelect_Options_C) == 0x000008, "Wrong alignment on UWBP_UI_ModeSelect_Options_C");
static_assert(sizeof(UWBP_UI_ModeSelect_Options_C) == 0x000348, "Wrong size on UWBP_UI_ModeSelect_Options_C");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, UberGraphFrame) == 0x0002C0, "Member 'UWBP_UI_ModeSelect_Options_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, Show_Level_Helper) == 0x0002C8, "Member 'UWBP_UI_ModeSelect_Options_C::Show_Level_Helper' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, ShowButtons) == 0x0002D0, "Member 'UWBP_UI_ModeSelect_Options_C::ShowButtons' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, AdditionalInfo_Border) == 0x0002D8, "Member 'UWBP_UI_ModeSelect_Options_C::AdditionalInfo_Border' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, Background_Blur) == 0x0002E0, "Member 'UWBP_UI_ModeSelect_Options_C::Background_Blur' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, Background_I) == 0x0002E8, "Member 'UWBP_UI_ModeSelect_Options_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, Buttons_HB) == 0x0002F0, "Member 'UWBP_UI_ModeSelect_Options_C::Buttons_HB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, FindHeist_Button) == 0x0002F8, "Member 'UWBP_UI_ModeSelect_Options_C::FindHeist_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, Image) == 0x000300, "Member 'UWBP_UI_ModeSelect_Options_C::Image' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, Image_173) == 0x000308, "Member 'UWBP_UI_ModeSelect_Options_C::Image_173' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, LVL5_Overlay) == 0x000310, "Member 'UWBP_UI_ModeSelect_Options_C::LVL5_Overlay' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, Quickplay_Button) == 0x000318, "Member 'UWBP_UI_ModeSelect_Options_C::Quickplay_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, ScreenTitle) == 0x000320, "Member 'UWBP_UI_ModeSelect_Options_C::ScreenTitle' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, SoloMode_Button) == 0x000328, "Member 'UWBP_UI_ModeSelect_Options_C::SoloMode_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, Tutorial_Button) == 0x000330, "Member 'UWBP_UI_ModeSelect_Options_C::Tutorial_Button' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, CurrentModeFocused) == 0x000338, "Member 'UWBP_UI_ModeSelect_Options_C::CurrentModeFocused' has a wrong offset!");
static_assert(offsetof(UWBP_UI_ModeSelect_Options_C, ButtonShownAudioEvent) == 0x000340, "Member 'UWBP_UI_ModeSelect_Options_C::ButtonShownAudioEvent' has a wrong offset!");

}

