#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Onboarding_Intro_Choice_PopUpWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Onboarding_Intro_Choice_PopUpWidget.WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C
// 0x0088 (0x0318 - 0x0290)
class UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C final : public USBZWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Accept_All_Outro;                                  // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Crossplay_Selected;                                // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Telemetry_Selected;                                // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gamesight_Selected;                                // 0x02B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Crossplay_Hover;                                   // 0x02B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Telemetry_Hover;                                   // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Gamesight_Hover;                                   // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWBP_UI_ButtonCheckBox_C*               Crossplay_CheckBox;                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           CrossPlay_VB;                                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ButtonCheckBox_C*               Gamesight_CheckBox;                                // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Line_Breaks2_VB;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ButtonCheckBox_C*               Telemetry_CheckBox;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Description;                                  // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Header;                                       // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ButtonCheckBox_C*               FocusedCheckbox;                                   // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Onboarding_Intro_Choice_PopUpWidget(int32 EntryPoint);
	void OnPopupHidden();
	void OnPopupShown();
	void BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_8_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_7_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_6_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void ActionInput(class FName InputName);
	void OnDisplayPopUp_1();
	void BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_5_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_4_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_3_OnMenuButtonSelected__DelegateSignature(class USBZMenuButton* Button);
	void BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Crossplay_CheckBox_K2Node_ComponentBoundEvent_2_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Telemetry_CheckBox_K2Node_ComponentBoundEvent_1_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void BndEvt__WBP_UI_Onboarding_Intro_Choice_PopUpWidget_Gamesight_CheckBox_K2Node_ComponentBoundEvent_0_OnMenuButtonStateChanged__DelegateSignature(class USBZMenuButton* Button, bool bIsEnabled_0);
	void SetCheckboxFocusChanged(class USBZMenuButton* CheckboxButton, bool Focused);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Onboarding_Intro_Choice_PopUpWidget_C">();
	}
	static class UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C>();
	}
};
static_assert(alignof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C) == 0x000008, "Wrong alignment on UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C");
static_assert(sizeof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C) == 0x000318, "Wrong size on UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Accept_All_Outro) == 0x000298, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Accept_All_Outro' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Crossplay_Selected) == 0x0002A0, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Crossplay_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Telemetry_Selected) == 0x0002A8, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Telemetry_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Gamesight_Selected) == 0x0002B0, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Gamesight_Selected' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Crossplay_Hover) == 0x0002B8, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Crossplay_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Telemetry_Hover) == 0x0002C0, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Telemetry_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Gamesight_Hover) == 0x0002C8, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Gamesight_Hover' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Show) == 0x0002D0, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Show' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Crossplay_CheckBox) == 0x0002D8, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Crossplay_CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, CrossPlay_VB) == 0x0002E0, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::CrossPlay_VB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Gamesight_CheckBox) == 0x0002E8, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Gamesight_CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Line_Breaks2_VB) == 0x0002F0, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Line_Breaks2_VB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Telemetry_CheckBox) == 0x0002F8, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Telemetry_CheckBox' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Text_Description) == 0x000300, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Text_Description' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, Text_Header) == 0x000308, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::Text_Header' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C, FocusedCheckbox) == 0x000310, "Member 'UWBP_UI_Onboarding_Intro_Choice_PopUpWidget_C::FocusedCheckbox' has a wrong offset!");

}

