#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Results_Reward_OverskillProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_Results_Reward_OverskillProgress.WBP_UI_Results_Reward_OverskillProgress_C
// 0x0088 (0x0318 - 0x0290)
class UWBP_UI_Results_Reward_OverskillProgress_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeIn;                                            // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Unlocked;                                          // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Research;                                          // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Frame;                                      // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        ExpPoints_T;                                       // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_403;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_Overskill_Level_C*              Overskill_Level;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_ProgressBarAnimate_C*           ProgressBar;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        SkillName_T;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Unlocked_T;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_NumberCounter_C*                   WBP_XpDiff;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ExperienceDiff;                                    // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USBZSkillData*                          SkillData;                                         // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class USBZOverskillData*                      OverskillData;                                     // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Experience;                                        // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         OverskillLevel;                                    // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_Results_Reward_OverskillProgress(int32 EntryPoint);
	void PlayLevelUpAnimation();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void OnLoaded_A4C630A2453669CD2C86869D10C5A8DF(class UObject* Loaded);
	void SetProgress();
	void SetSkillProgress(class USBZSkill* Skill, class USBZSkillData* SkillData_0);
	void PlayAppearAnim();
	void AnimateBarsAndText();
	void SequenceEvent__ENTRYPOINTWBP_UI_Results_Reward_OverskillProgress_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_Results_Reward_OverskillProgress_C">();
	}
	static class UWBP_UI_Results_Reward_OverskillProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_Results_Reward_OverskillProgress_C>();
	}
};
static_assert(alignof(UWBP_UI_Results_Reward_OverskillProgress_C) == 0x000008, "Wrong alignment on UWBP_UI_Results_Reward_OverskillProgress_C");
static_assert(sizeof(UWBP_UI_Results_Reward_OverskillProgress_C) == 0x000318, "Wrong size on UWBP_UI_Results_Reward_OverskillProgress_C");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, UberGraphFrame) == 0x000290, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, FadeIn) == 0x000298, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::FadeIn' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, Unlocked) == 0x0002A0, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::Unlocked' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, Research) == 0x0002A8, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::Research' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, Border_Frame) == 0x0002B0, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::Border_Frame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, ExpPoints_T) == 0x0002B8, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::ExpPoints_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, Icon) == 0x0002C0, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::Icon' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, Image_403) == 0x0002C8, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::Image_403' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, Overskill_Level) == 0x0002D0, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::Overskill_Level' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, ProgressBar) == 0x0002D8, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::ProgressBar' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, SkillName_T) == 0x0002E0, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::SkillName_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, Unlocked_T) == 0x0002E8, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::Unlocked_T' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, WBP_XpDiff) == 0x0002F0, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::WBP_XpDiff' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, ExperienceDiff) == 0x0002F8, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::ExperienceDiff' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, SkillData) == 0x000300, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::SkillData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, OverskillData) == 0x000308, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::OverskillData' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, Experience) == 0x000310, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::Experience' has a wrong offset!");
static_assert(offsetof(UWBP_UI_Results_Reward_OverskillProgress_C, OverskillLevel) == 0x000314, "Member 'UWBP_UI_Results_Reward_OverskillProgress_C::OverskillLevel' has a wrong offset!");

}

