#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_CrimeNet_Tutorial

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_UI_CrimeNet_Tutorial.WBP_UI_CrimeNet_Tutorial_C
// 0x0060 (0x0350 - 0x02F0)
class UWBP_UI_CrimeNet_Tutorial_C final : public USBZMainMenuCrimeNetTutorial
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ShowButtons;                                       // 0x02F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBackgroundBlur*                        Background_Blur;                                   // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_I;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TutorialSelectionButton_C*      CombatButton;                                      // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TutorialSelectionButton_C*      CrowdControlButton;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TutorialSelectionButton_C*      DetectionButton;                                   // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScreenTitle_C*                     ScreenTitle;                                       // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_UI_TutorialSelectionButton_C*      StealthButton;                                     // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         TutorialButtons_VB;                                // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZMenuButton*                         ActiveButton;                                      // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          ButtonShownAudioEvent;                             // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_UI_CrimeNet_Tutorial(int32 EntryPoint);
	void OnTutorialButtonSelected(class USBZMenuButton* Button);
	void Construct();
	void OnLostStackFocused();
	void OnHeistButtonFocused(class USBZMenuButton* MenuButton, bool bIsFocused);
	void OnControlsReferencePressed(class FName ActionName);
	void OnGainedStackFocused(const class FName& PreviousValue);
	void OnButtonFullyShown();
	void ResetButtonsVisuals();
	void SequenceEvent__ENTRYPOINTWBP_UI_CrimeNet_Tutorial_0();
	void SequenceEvent__ENTRYPOINTWBP_UI_CrimeNet_Tutorial_1();
	void SequenceEvent__ENTRYPOINTWBP_UI_CrimeNet_Tutorial_2();
	void SequenceEvent__ENTRYPOINTWBP_UI_CrimeNet_Tutorial_3();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_UI_CrimeNet_Tutorial_C">();
	}
	static class UWBP_UI_CrimeNet_Tutorial_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_UI_CrimeNet_Tutorial_C>();
	}
};
static_assert(alignof(UWBP_UI_CrimeNet_Tutorial_C) == 0x000008, "Wrong alignment on UWBP_UI_CrimeNet_Tutorial_C");
static_assert(sizeof(UWBP_UI_CrimeNet_Tutorial_C) == 0x000350, "Wrong size on UWBP_UI_CrimeNet_Tutorial_C");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, UberGraphFrame) == 0x0002F0, "Member 'UWBP_UI_CrimeNet_Tutorial_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, ShowButtons) == 0x0002F8, "Member 'UWBP_UI_CrimeNet_Tutorial_C::ShowButtons' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, Background_Blur) == 0x000300, "Member 'UWBP_UI_CrimeNet_Tutorial_C::Background_Blur' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, Background_I) == 0x000308, "Member 'UWBP_UI_CrimeNet_Tutorial_C::Background_I' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, CombatButton) == 0x000310, "Member 'UWBP_UI_CrimeNet_Tutorial_C::CombatButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, CrowdControlButton) == 0x000318, "Member 'UWBP_UI_CrimeNet_Tutorial_C::CrowdControlButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, DetectionButton) == 0x000320, "Member 'UWBP_UI_CrimeNet_Tutorial_C::DetectionButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, ScreenTitle) == 0x000328, "Member 'UWBP_UI_CrimeNet_Tutorial_C::ScreenTitle' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, StealthButton) == 0x000330, "Member 'UWBP_UI_CrimeNet_Tutorial_C::StealthButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, TutorialButtons_VB) == 0x000338, "Member 'UWBP_UI_CrimeNet_Tutorial_C::TutorialButtons_VB' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, ActiveButton) == 0x000340, "Member 'UWBP_UI_CrimeNet_Tutorial_C::ActiveButton' has a wrong offset!");
static_assert(offsetof(UWBP_UI_CrimeNet_Tutorial_C, ButtonShownAudioEvent) == 0x000348, "Member 'UWBP_UI_CrimeNet_Tutorial_C::ButtonShownAudioEvent' has a wrong offset!");

}

