#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_UI_Widget_ToolStatus

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_UI_Widget_ToolStatus.WBP_UI_Widget_ToolStatus_C.ExecuteUbergraph_WBP_UI_Widget_ToolStatus
// 0x0128 (0x0128 - 0x0000)
struct WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPaperSprite>            K2Node_Event_InIcon;                               // 0x0008(0x0030)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_InAmmoInventory;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0048(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0060(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0088(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00B0(0x0028)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable;                              // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPaperSprite*                           K2Node_DynamicCast_AsPaper_Sprite;                 // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ISlateTextureAtlasInterface> CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput; // 0x0100(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0110(0x0014)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus) == 0x000008, "Wrong alignment on WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus");
static_assert(sizeof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus) == 0x000128, "Wrong size on WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, EntryPoint) == 0x000000, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_Event_InIcon) == 0x000008, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_Event_InIcon' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000040, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_Event_InAmmoInventory) == 0x000044, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_Event_InAmmoInventory' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, CallFunc_Conv_IntToText_ReturnValue) == 0x000048, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_MakeStruct_SlateColor) == 0x000060, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_MakeStruct_SlateColor_1) == 0x000088, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_MakeStruct_SlateColor_2) == 0x0000B0, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_Event_IsDesignTime) == 0x0000D8, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, Temp_object_Variable) == 0x0000E0, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_CustomEvent_Loaded) == 0x0000E8, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_DynamicCast_AsPaper_Sprite) == 0x0000F0, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_DynamicCast_AsPaper_Sprite' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_DynamicCast_bSuccess) == 0x0000F8, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput) == 0x000100, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::CallFunc_SetBrushFromAtlasInterface_AtlasRegion_CastInput' has a wrong offset!");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus, K2Node_CreateDelegate_OutputDelegate) == 0x000110, "Member 'WBP_UI_Widget_ToolStatus_C_ExecuteUbergraph_WBP_UI_Widget_ToolStatus::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function WBP_UI_Widget_ToolStatus.WBP_UI_Widget_ToolStatus_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_UI_Widget_ToolStatus_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WBP_UI_Widget_ToolStatus_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_UI_Widget_ToolStatus_C_PreConstruct");
static_assert(sizeof(WBP_UI_Widget_ToolStatus_C_PreConstruct) == 0x000001, "Wrong size on WBP_UI_Widget_ToolStatus_C_PreConstruct");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_UI_Widget_ToolStatus_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WBP_UI_Widget_ToolStatus.WBP_UI_Widget_ToolStatus_C.OnAmmoInventoryChanged
// 0x0004 (0x0004 - 0x0000)
struct WBP_UI_Widget_ToolStatus_C_OnAmmoInventoryChanged final
{
public:
	int32                                         InAmmoInventory;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_ToolStatus_C_OnAmmoInventoryChanged) == 0x000004, "Wrong alignment on WBP_UI_Widget_ToolStatus_C_OnAmmoInventoryChanged");
static_assert(sizeof(WBP_UI_Widget_ToolStatus_C_OnAmmoInventoryChanged) == 0x000004, "Wrong size on WBP_UI_Widget_ToolStatus_C_OnAmmoInventoryChanged");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_OnAmmoInventoryChanged, InAmmoInventory) == 0x000000, "Member 'WBP_UI_Widget_ToolStatus_C_OnAmmoInventoryChanged::InAmmoInventory' has a wrong offset!");

// Function WBP_UI_Widget_ToolStatus.WBP_UI_Widget_ToolStatus_C.OnIconChanged
// 0x0030 (0x0030 - 0x0000)
struct WBP_UI_Widget_ToolStatus_C_OnIconChanged final
{
public:
	TSoftObjectPtr<class UPaperSprite>            InIcon;                                            // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_ToolStatus_C_OnIconChanged) == 0x000008, "Wrong alignment on WBP_UI_Widget_ToolStatus_C_OnIconChanged");
static_assert(sizeof(WBP_UI_Widget_ToolStatus_C_OnIconChanged) == 0x000030, "Wrong size on WBP_UI_Widget_ToolStatus_C_OnIconChanged");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_OnIconChanged, InIcon) == 0x000000, "Member 'WBP_UI_Widget_ToolStatus_C_OnIconChanged::InIcon' has a wrong offset!");

// Function WBP_UI_Widget_ToolStatus.WBP_UI_Widget_ToolStatus_C.OnLoaded_A0844DD742EC9339633A2895004DB1BB
// 0x0008 (0x0008 - 0x0000)
struct WBP_UI_Widget_ToolStatus_C_OnLoaded_A0844DD742EC9339633A2895004DB1BB final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_UI_Widget_ToolStatus_C_OnLoaded_A0844DD742EC9339633A2895004DB1BB) == 0x000008, "Wrong alignment on WBP_UI_Widget_ToolStatus_C_OnLoaded_A0844DD742EC9339633A2895004DB1BB");
static_assert(sizeof(WBP_UI_Widget_ToolStatus_C_OnLoaded_A0844DD742EC9339633A2895004DB1BB) == 0x000008, "Wrong size on WBP_UI_Widget_ToolStatus_C_OnLoaded_A0844DD742EC9339633A2895004DB1BB");
static_assert(offsetof(WBP_UI_Widget_ToolStatus_C_OnLoaded_A0844DD742EC9339633A2895004DB1BB, Loaded) == 0x000000, "Member 'WBP_UI_Widget_ToolStatus_C_OnLoaded_A0844DD742EC9339633A2895004DB1BB::Loaded' has a wrong offset!");

}

