#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_VoIPOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Starbreeze_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_VoIPOverlay.WBP_VoIPOverlay_C
// 0x0088 (0x0318 - 0x0290)
class UWBP_VoIPOverlay_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         HB_User1;                                          // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_User2;                                          // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_User3;                                          // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HB_User4;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 RightBar_I;                                        // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_User1;                                        // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_User2;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_User3;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USBZUITextBlock*                        Text_User4;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoIP_C*                            WBP_VoIP_1;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoIP_C*                            WBP_VoIP_2;                                        // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoIP_C*                            WBP_VoIP_3;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_VoIP_C*                            WBP_VoIP_4;                                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FSBZLobbyCharacterInfoUi>       ActiveTalkerInfo;                                  // 0x0300(0x0010)(Edit, BlueprintVisible)
	bool                                          Is_Design_Time;                                    // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WBP_VoIPOverlay(int32 EntryPoint);
	void PlayersUpdated(const class FString& EOSId, bool bJoined);
	void Destruct();
	void InitialVOIPSetup();
	void Update_VOIP_UI();
	void PlayerTalkingUpdated(const class FString& ChannelName, const class FString& PlayerName, bool bIsTalking);
	void PreConstruct(bool IsDesignTime);
	void UpdateTalkingPlayerList(const class FString& PlayerEOSID, bool IsTalking);
	void FindPlayerUIInfo(const class FString& InEOSID, struct FSBZLobbyCharacterInfoUi* OutCharacterInfo, bool* Found);
	void CleanActiveArray();
	void UpdateTalkingPlayerDisplay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_VoIPOverlay_C">();
	}
	static class UWBP_VoIPOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_VoIPOverlay_C>();
	}
};
static_assert(alignof(UWBP_VoIPOverlay_C) == 0x000008, "Wrong alignment on UWBP_VoIPOverlay_C");
static_assert(sizeof(UWBP_VoIPOverlay_C) == 0x000318, "Wrong size on UWBP_VoIPOverlay_C");
static_assert(offsetof(UWBP_VoIPOverlay_C, UberGraphFrame) == 0x000290, "Member 'UWBP_VoIPOverlay_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, HB_User1) == 0x000298, "Member 'UWBP_VoIPOverlay_C::HB_User1' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, HB_User2) == 0x0002A0, "Member 'UWBP_VoIPOverlay_C::HB_User2' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, HB_User3) == 0x0002A8, "Member 'UWBP_VoIPOverlay_C::HB_User3' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, HB_User4) == 0x0002B0, "Member 'UWBP_VoIPOverlay_C::HB_User4' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, RightBar_I) == 0x0002B8, "Member 'UWBP_VoIPOverlay_C::RightBar_I' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, Text_User1) == 0x0002C0, "Member 'UWBP_VoIPOverlay_C::Text_User1' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, Text_User2) == 0x0002C8, "Member 'UWBP_VoIPOverlay_C::Text_User2' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, Text_User3) == 0x0002D0, "Member 'UWBP_VoIPOverlay_C::Text_User3' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, Text_User4) == 0x0002D8, "Member 'UWBP_VoIPOverlay_C::Text_User4' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, WBP_VoIP_1) == 0x0002E0, "Member 'UWBP_VoIPOverlay_C::WBP_VoIP_1' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, WBP_VoIP_2) == 0x0002E8, "Member 'UWBP_VoIPOverlay_C::WBP_VoIP_2' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, WBP_VoIP_3) == 0x0002F0, "Member 'UWBP_VoIPOverlay_C::WBP_VoIP_3' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, WBP_VoIP_4) == 0x0002F8, "Member 'UWBP_VoIPOverlay_C::WBP_VoIP_4' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, ActiveTalkerInfo) == 0x000300, "Member 'UWBP_VoIPOverlay_C::ActiveTalkerInfo' has a wrong offset!");
static_assert(offsetof(UWBP_VoIPOverlay_C, Is_Design_Time) == 0x000310, "Member 'UWBP_VoIPOverlay_C::Is_Design_Time' has a wrong offset!");

}

