#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WidgetPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WidgetPanel.WidgetPanel_C
// 0x0048 (0x02D8 - 0x0290)
class UWidgetPanel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Blink;                                             // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CounterRot;                                        // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Rotate;                                            // 0x02A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_105;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Start_at_Time;                                     // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         End_at_Time;                                       // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndAngle;                                          // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C4[0x4];                                      // 0x02C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_TurnStuff_C*                       parentWidget;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         End_At_Time_0;                                     // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Playback_Speed;                                    // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WidgetPanel(int32 EntryPoint);
	void ResetRotation(float Angle);
	void StopBlink();
	void PlayBlink();
	void RotateRight(class UWBP_TurnStuff_C* NewParam);
	void RotateLeft(class UWBP_TurnStuff_C* NewParam);
	void Finished_86331D804645B60084E04BB6FBA2BB1D();
	void Finished_EE8205CE46CCF146B3BC2FA96BFAADC8();
	void Finished_56DA7E7C45AE0904DB1175BE7D4B46E4();
	void Finished_7B946C3149FA1BC9E44D33B46F1CB58B();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetPanel_C">();
	}
	static class UWidgetPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetPanel_C>();
	}
};
static_assert(alignof(UWidgetPanel_C) == 0x000008, "Wrong alignment on UWidgetPanel_C");
static_assert(sizeof(UWidgetPanel_C) == 0x0002D8, "Wrong size on UWidgetPanel_C");
static_assert(offsetof(UWidgetPanel_C, UberGraphFrame) == 0x000290, "Member 'UWidgetPanel_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, Blink) == 0x000298, "Member 'UWidgetPanel_C::Blink' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, CounterRot) == 0x0002A0, "Member 'UWidgetPanel_C::CounterRot' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, Rotate) == 0x0002A8, "Member 'UWidgetPanel_C::Rotate' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, Button_105) == 0x0002B0, "Member 'UWidgetPanel_C::Button_105' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, Start_at_Time) == 0x0002B8, "Member 'UWidgetPanel_C::Start_at_Time' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, End_at_Time) == 0x0002BC, "Member 'UWidgetPanel_C::End_at_Time' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, EndAngle) == 0x0002C0, "Member 'UWidgetPanel_C::EndAngle' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, parentWidget) == 0x0002C8, "Member 'UWidgetPanel_C::parentWidget' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, End_At_Time_0) == 0x0002D0, "Member 'UWidgetPanel_C::End_At_Time_0' has a wrong offset!");
static_assert(offsetof(UWidgetPanel_C, Playback_Speed) == 0x0002D4, "Member 'UWidgetPanel_C::Playback_Speed' has a wrong offset!");

}

