#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WidgetPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function WidgetPanel.WidgetPanel_C.ExecuteUbergraph_WidgetPanel
// 0x0148 (0x0148 - 0x0000)
struct WidgetPanel_C_ExecuteUbergraph_WidgetPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0014)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0014)(ZeroConstructor, NoDestructor)
	class UWBP_TurnStuff_C*                       K2Node_CustomEvent_NewParam_1;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_TurnStuff_C*                       K2Node_CustomEvent_NewParam;                       // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x2];                                       // 0x0072(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue;      // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_1;     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_2;     // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_3;     // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue_1;    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_4;     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_5;     // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_6;     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_7;     // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue;                  // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_1;                // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_2;                // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Play2DSound_ReturnValue_3;                // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Angle;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x00B4(0x0014)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue_2;    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue_3;    // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue_4;    // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_8;     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_9;     // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_10;    // 0x00E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_11;    // 0x00E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_12;    // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_13;    // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue_5;    // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_14;    // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_15;    // 0x00ED(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_16;    // 0x00EE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_17;    // 0x00EF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_2; // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_2; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRenderTransformAngle_ReturnValue_6;    // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_18;    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_19;    // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_20;    // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue_21;    // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_6;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_7;             // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_3; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_3; // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel) == 0x000008, "Wrong alignment on WidgetPanel_C_ExecuteUbergraph_WidgetPanel");
static_assert(sizeof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel) == 0x000148, "Wrong size on WidgetPanel_C_ExecuteUbergraph_WidgetPanel");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, EntryPoint) == 0x000000, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::EntryPoint' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, K2Node_CustomEvent_NewParam_1) == 0x000040, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::K2Node_CustomEvent_NewParam_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, K2Node_CustomEvent_NewParam) == 0x000048, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000050, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000058, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1) == 0x000060, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1) == 0x000068, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_IsValid_ReturnValue_1) == 0x000071, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_GetRenderTransformAngle_ReturnValue) == 0x000074, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_GetRenderTransformAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x000078, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_1) == 0x000079, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_2) == 0x00007A, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_3) == 0x00007B, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_GetRenderTransformAngle_ReturnValue_1) == 0x00007C, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_GetRenderTransformAngle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_4) == 0x000080, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_5) == 0x000081, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_6) == 0x000082, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_7) == 0x000083, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Conv_FloatToString_ReturnValue) == 0x000090, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Play2DSound_ReturnValue) == 0x0000A0, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Play2DSound_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Play2DSound_ReturnValue_1) == 0x0000A4, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Play2DSound_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Play2DSound_ReturnValue_2) == 0x0000A8, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Play2DSound_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Play2DSound_ReturnValue_3) == 0x0000AC, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Play2DSound_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, K2Node_CustomEvent_Angle) == 0x0000B0, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::K2Node_CustomEvent_Angle' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000B4, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_GetRenderTransformAngle_ReturnValue_2) == 0x0000C8, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_GetRenderTransformAngle_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x0000CC, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000CD, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_GetRenderTransformAngle_ReturnValue_3) == 0x0000D0, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_GetRenderTransformAngle_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_GetRenderTransformAngle_ReturnValue_4) == 0x0000D4, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_GetRenderTransformAngle_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000D8, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000DC, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_8) == 0x0000E0, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_9) == 0x0000E1, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_10) == 0x0000E2, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_11) == 0x0000E3, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_12) == 0x0000E4, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_13) == 0x0000E5, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_GetRenderTransformAngle_ReturnValue_5) == 0x0000E8, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_GetRenderTransformAngle_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_14) == 0x0000EC, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_15) == 0x0000ED, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_16) == 0x0000EE, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_16' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_17) == 0x0000EF, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_17' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000F0, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000F4, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x0000F8, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_2) == 0x000100, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_2) == 0x000108, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_IsValid_ReturnValue_2) == 0x000110, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_GetRenderTransformAngle_ReturnValue_6) == 0x000114, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_GetRenderTransformAngle_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_18) == 0x000118, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_18' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_19) == 0x000119, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_19' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_20) == 0x00011A, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_20' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_NearlyEqual_FloatFloat_ReturnValue_21) == 0x00011B, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_NearlyEqual_FloatFloat_ReturnValue_21' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Add_FloatFloat_ReturnValue_3) == 0x00011C, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Add_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Add_FloatFloat_ReturnValue_4) == 0x000120, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Add_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Add_FloatFloat_ReturnValue_5) == 0x000124, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Add_FloatFloat_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Add_FloatFloat_ReturnValue_6) == 0x000128, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Add_FloatFloat_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_Add_FloatFloat_ReturnValue_7) == 0x00012C, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_Add_FloatFloat_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_3) == 0x000130, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_3' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_3) == 0x000138, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WidgetPanel_C_ExecuteUbergraph_WidgetPanel, CallFunc_IsValid_ReturnValue_3) == 0x000140, "Member 'WidgetPanel_C_ExecuteUbergraph_WidgetPanel::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function WidgetPanel.WidgetPanel_C.ResetRotation
// 0x0004 (0x0004 - 0x0000)
struct WidgetPanel_C_ResetRotation final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WidgetPanel_C_ResetRotation) == 0x000004, "Wrong alignment on WidgetPanel_C_ResetRotation");
static_assert(sizeof(WidgetPanel_C_ResetRotation) == 0x000004, "Wrong size on WidgetPanel_C_ResetRotation");
static_assert(offsetof(WidgetPanel_C_ResetRotation, Angle) == 0x000000, "Member 'WidgetPanel_C_ResetRotation::Angle' has a wrong offset!");

// Function WidgetPanel.WidgetPanel_C.RotateRight
// 0x0008 (0x0008 - 0x0000)
struct WidgetPanel_C_RotateRight final
{
public:
	class UWBP_TurnStuff_C*                       NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WidgetPanel_C_RotateRight) == 0x000008, "Wrong alignment on WidgetPanel_C_RotateRight");
static_assert(sizeof(WidgetPanel_C_RotateRight) == 0x000008, "Wrong size on WidgetPanel_C_RotateRight");
static_assert(offsetof(WidgetPanel_C_RotateRight, NewParam) == 0x000000, "Member 'WidgetPanel_C_RotateRight::NewParam' has a wrong offset!");

// Function WidgetPanel.WidgetPanel_C.RotateLeft
// 0x0008 (0x0008 - 0x0000)
struct WidgetPanel_C_RotateLeft final
{
public:
	class UWBP_TurnStuff_C*                       NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WidgetPanel_C_RotateLeft) == 0x000008, "Wrong alignment on WidgetPanel_C_RotateLeft");
static_assert(sizeof(WidgetPanel_C_RotateLeft) == 0x000008, "Wrong size on WidgetPanel_C_RotateLeft");
static_assert(offsetof(WidgetPanel_C_RotateLeft, NewParam) == 0x000000, "Member 'WidgetPanel_C_RotateLeft::NewParam' has a wrong offset!");

}

