#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WP_VariationSelector

#include "Basic.hpp"

#include "TimeType_structs.hpp"
#include "TimeSettings_structs.hpp"
#include "WeatherType_structs.hpp"
#include "WeatherSettings_structs.hpp"


namespace SDK::Params
{

// Function WP_VariationSelector.WP_VariationSelector_C.ExecuteUbergraph_WP_VariationSelector
// 0x0700 (0x0700 - 0x0000)
struct WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeatherType                                  CallFunc_Array_Random_OutItem;                     // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0018(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0030(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeatherSettings                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0040(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x00A0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSettings                          CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x00C0(0x05B0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeatherSettings                       CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0678(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x06D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x06D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x06D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x06D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9[0x3];                                      // 0x06D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x06DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x06E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ETimeType                                     CallFunc_Get_Next_Available_Time_TimeType;         // 0x06E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2[0x2];                                      // 0x06E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x06E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x06E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimeType                                     CallFunc_Get_Next_Available_Time_TimeType_1;       // 0x06EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6ED[0x3];                                      // 0x06ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x06F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x06F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeatherType                                  CallFunc_Array_Get_Item_2;                         // 0x06FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x06FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x06FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector) == 0x000010, "Wrong alignment on WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector");
static_assert(sizeof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector) == 0x000700, "Wrong size on WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, EntryPoint) == 0x000000, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, Temp_int_Variable) == 0x000004, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Array_Random_OutItem) == 0x000008, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Array_Random_OutIndex) == 0x00000C, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_IsChecked_ReturnValue) == 0x000014, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000018, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, Temp_int_Array_Index_Variable) == 0x00002C, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Array_Get_Item) == 0x000030, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_GetDataTableRowFromName_OutRow) == 0x000040, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000098, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x0000A0, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Array_Get_Item_1) == 0x0000B0, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0000C0, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000670, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000678, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x0006D0, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, Temp_bool_True_if_break_was_hit_Variable) == 0x0006D1, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Not_PreBool_ReturnValue) == 0x0006D2, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Not_PreBool_ReturnValue_1) == 0x0006D3, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, Temp_int_Loop_Counter_Variable) == 0x0006D4, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Less_IntInt_ReturnValue) == 0x0006D8, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Add_IntInt_ReturnValue_1) == 0x0006DC, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_BooleanAND_ReturnValue) == 0x0006E0, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Get_Next_Available_Time_TimeType) == 0x0006E1, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Get_Next_Available_Time_TimeType' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Array_Length_ReturnValue_1) == 0x0006E4, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Array_Find_ReturnValue) == 0x0006E8, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Get_Next_Available_Time_TimeType_1) == 0x0006EC, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Get_Next_Available_Time_TimeType_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Add_IntInt_ReturnValue_2) == 0x0006F0, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Percent_IntInt_ReturnValue) == 0x0006F4, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_RandomInteger_ReturnValue) == 0x0006F8, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_RandomInteger_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_Array_Get_Item_2) == 0x0006FC, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0006FD, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0006FE, "Member 'WP_VariationSelector_C_ExecuteUbergraph_WP_VariationSelector::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WP_VariationSelector.WP_VariationSelector_C.Set Available Weather
// 0x00C8 (0x00C8 - 0x0000)
struct WP_VariationSelector_C_Set_Available_Weather final
{
public:
	TArray<EWeatherType>                          NotAllowed;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class FString                                 txt;                                               // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          ContainsAny;                                       // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeatherType                                  CallFunc_Array_Get_Item;                           // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0038(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeatherSettings                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x0060(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BA[0x2];                                       // 0x00BA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WP_VariationSelector_C_Set_Available_Weather) == 0x000008, "Wrong alignment on WP_VariationSelector_C_Set_Available_Weather");
static_assert(sizeof(WP_VariationSelector_C_Set_Available_Weather) == 0x0000C8, "Wrong size on WP_VariationSelector_C_Set_Available_Weather");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, NotAllowed) == 0x000000, "Member 'WP_VariationSelector_C_Set_Available_Weather::NotAllowed' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, txt) == 0x000010, "Member 'WP_VariationSelector_C_Set_Available_Weather::txt' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, ContainsAny) == 0x000020, "Member 'WP_VariationSelector_C_Set_Available_Weather::ContainsAny' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WP_VariationSelector_C_Set_Available_Weather::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WP_VariationSelector_C_Set_Available_Weather::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_Add_IntInt_ReturnValue) == 0x00002C, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_Array_Get_Item) == 0x000030, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_Array_Contains_ReturnValue) == 0x000031, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000038, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_Array_Get_Item_1) == 0x00004C, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_Less_IntInt_ReturnValue) == 0x000058, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_GetDataTableRowFromName_OutRow) == 0x000060, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_Array_Contains_ReturnValue_1) == 0x0000B9, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_Array_Add_ReturnValue) == 0x0000BC, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Set_Available_Weather, CallFunc_Not_PreBool_ReturnValue) == 0x0000C0, "Member 'WP_VariationSelector_C_Set_Available_Weather::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WP_VariationSelector.WP_VariationSelector_C.Initialize
// 0x06F0 (0x06F0 - 0x0000)
struct WP_VariationSelector_C_Initialize final
{
public:
	class FString                                 HeistName;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0048(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSettings                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x0070(0x05B0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0620(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0621(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0622(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_623[0x5];                                      // 0x0623(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0628(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0638(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_639[0x7];                                      // 0x0639(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDataTable*                             CallFunc_Map_Find_Value_1;                         // 0x0640(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x0648(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0650(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0660(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0664(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeatherSettings                       CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x0678(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x06D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x06D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D2[0x6];                                      // 0x06D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue_1;          // 0x06D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue_1;          // 0x06E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WP_VariationSelector_C_Initialize) == 0x000010, "Wrong alignment on WP_VariationSelector_C_Initialize");
static_assert(sizeof(WP_VariationSelector_C_Initialize) == 0x0006F0, "Wrong size on WP_VariationSelector_C_Initialize");
static_assert(offsetof(WP_VariationSelector_C_Initialize, HeistName) == 0x000000, "Member 'WP_VariationSelector_C_Initialize::HeistName' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, Temp_int_Loop_Counter_Variable) == 0x000010, "Member 'WP_VariationSelector_C_Initialize::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Add_IntInt_ReturnValue) == 0x000014, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, Temp_bool_True_if_break_was_hit_Variable) == 0x000018, "Member 'WP_VariationSelector_C_Initialize::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, Temp_int_Array_Index_Variable) == 0x00001C, "Member 'WP_VariationSelector_C_Initialize::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Not_PreBool_ReturnValue) == 0x000020, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000021, "Member 'WP_VariationSelector_C_Initialize::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, Temp_int_Array_Index_Variable_1) == 0x000024, "Member 'WP_VariationSelector_C_Initialize::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Not_PreBool_ReturnValue_1) == 0x000028, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, Temp_int_Loop_Counter_Variable_1) == 0x00002C, "Member 'WP_VariationSelector_C_Initialize::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Add_IntInt_ReturnValue_1) == 0x000030, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Map_Find_Value) == 0x000038, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Map_Find_ReturnValue) == 0x000040, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000048, "Member 'WP_VariationSelector_C_Initialize::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Array_Get_Item) == 0x000058, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_GetDataTableRowFromName_OutRow) == 0x000070, "Member 'WP_VariationSelector_C_Initialize::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x000620, "Member 'WP_VariationSelector_C_Initialize::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Less_IntInt_ReturnValue) == 0x000621, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_BooleanAND_ReturnValue) == 0x000622, "Member 'WP_VariationSelector_C_Initialize::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Conv_NameToString_ReturnValue) == 0x000628, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000638, "Member 'WP_VariationSelector_C_Initialize::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Map_Find_Value_1) == 0x000640, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Map_Find_ReturnValue_1) == 0x000648, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x000650, "Member 'WP_VariationSelector_C_Initialize::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Array_Length_ReturnValue_1) == 0x000660, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Array_Get_Item_1) == 0x000664, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Less_IntInt_ReturnValue_1) == 0x000670, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x000678, "Member 'WP_VariationSelector_C_Initialize::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0006D0, "Member 'WP_VariationSelector_C_Initialize::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_BooleanAND_ReturnValue_1) == 0x0006D1, "Member 'WP_VariationSelector_C_Initialize::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_Conv_NameToString_ReturnValue_1) == 0x0006D8, "Member 'WP_VariationSelector_C_Initialize::CallFunc_Conv_NameToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_Initialize, CallFunc_EqualEqual_StrStr_ReturnValue_1) == 0x0006E8, "Member 'WP_VariationSelector_C_Initialize::CallFunc_EqualEqual_StrStr_ReturnValue_1' has a wrong offset!");

// Function WP_VariationSelector.WP_VariationSelector_C.SetWeather
// 0x0120 (0x0120 - 0x0000)
struct WP_VariationSelector_C_SetWeather final
{
public:
	EWeatherType                                  Weather;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0060(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0080(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeatherSettings                       CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x0058)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x3];                                      // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WP_VariationSelector_C_SetWeather) == 0x000008, "Wrong alignment on WP_VariationSelector_C_SetWeather");
static_assert(sizeof(WP_VariationSelector_C_SetWeather) == 0x000120, "Wrong size on WP_VariationSelector_C_SetWeather");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, Weather) == 0x000000, "Member 'WP_VariationSelector_C_SetWeather::Weather' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, Temp_bool_True_if_break_was_hit_Variable) == 0x000001, "Member 'WP_VariationSelector_C_SetWeather::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000038, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, Temp_int_Array_Index_Variable) == 0x000048, "Member 'WP_VariationSelector_C_SetWeather::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000060, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, Temp_int_Loop_Counter_Variable) == 0x000078, "Member 'WP_VariationSelector_C_SetWeather::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_Add_IntInt_ReturnValue) == 0x00007C, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000080, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_Array_Get_Item) == 0x000090, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000A0, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000F8, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_Conv_NameToString_ReturnValue) == 0x000100, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000110, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_Array_Length_ReturnValue) == 0x000114, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000118, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_Less_IntInt_ReturnValue) == 0x000119, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_BooleanAND_ReturnValue) == 0x00011A, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetWeather, CallFunc_BooleanAND_ReturnValue_1) == 0x00011B, "Member 'WP_VariationSelector_C_SetWeather::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function WP_VariationSelector.WP_VariationSelector_C.SetTime
// 0x0C70 (0x0C70 - 0x0000)
struct WP_VariationSelector_C_SetTime final
{
public:
	ETimeType                                     Time;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0020(0x0018)()
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1; // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0060(0x0018)()
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0090(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A6[0x2];                                       // 0x00A6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSettings                          CallFunc_GetDataTableRowFromName_OutRow;           // 0x00C0(0x05B0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x0670(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0671(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_672[0x6];                                      // 0x0672(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x0678(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x0688(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0694(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimeSettings                          CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x06A0(0x05B0)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0C50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0C51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0C52(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0C53(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C54[0x4];                                      // 0x0C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0C58(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0C68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0C69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WP_VariationSelector_C_SetTime) == 0x000010, "Wrong alignment on WP_VariationSelector_C_SetTime");
static_assert(sizeof(WP_VariationSelector_C_SetTime) == 0x000C70, "Wrong size on WP_VariationSelector_C_SetTime");
static_assert(offsetof(WP_VariationSelector_C_SetTime, Time) == 0x000000, "Member 'WP_VariationSelector_C_SetTime::Time' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'WP_VariationSelector_C_SetTime::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000008, "Member 'WP_VariationSelector_C_SetTime::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'WP_VariationSelector_C_SetTime::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, CallFunc_Conv_StringToText_ReturnValue) == 0x000020, "Member 'WP_VariationSelector_C_SetTime::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1) == 0x000038, "Member 'WP_VariationSelector_C_SetTime::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, CallFunc_Concat_StrStr_ReturnValue) == 0x000048, "Member 'WP_VariationSelector_C_SetTime::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, Temp_bool_True_if_break_was_hit_Variable) == 0x000058, "Member 'WP_VariationSelector_C_SetTime::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000060, "Member 'WP_VariationSelector_C_SetTime::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, CallFunc_Not_PreBool_ReturnValue) == 0x000078, "Member 'WP_VariationSelector_C_SetTime::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, Temp_int_Array_Index_Variable) == 0x00007C, "Member 'WP_VariationSelector_C_SetTime::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WP_VariationSelector_C_SetTime, Temp_bool_True_if_break_was_hit_Variable_1) == 0x000080, "Member 'WP_VariationSelector_C_SetTime::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
